{
  "url": "http://ecode360.com/15524420",
  "paras": [
    {
      "paragraph": "§ 271-37",
      "title": "Applicability.",
      "content": [
        {
          "text": "The provisions of this article shall apply to an R-2 District."
        }
      ]
    },
    {
      "paragraph": "§ 271-38",
      "title": "Permitted uses.",
      "content": [
        {
          "content": [
            {
              "number": "A. ",
              "content": [
                {
                  "text": "No building or land shall hereafter be used or occupied and no building\nor part thereof shall be erected, used or altered unless in conformity\nwith the regulations herein specified and except for the purposes\nset forth in this article and for no other purpose."
                }
              ]
            },
            {
              "number": "B. ",
              "content": [
                {
                  "text": "Permitted uses shall be as follows:"
                },
                {
                  "content": [
                    {
                      "number": "(1) ",
                      "content": [
                        {
                          "text": "Any one of the uses and purposes set forth in Article III hereof."
                        }
                      ]
                    },
                    {
                      "number": "(2) ",
                      "content": [
                        {
                          "text": "Fences: See § 271-14."
                        }
                      ]
                    },
                    {
                      "number": "(3) ",
                      "content": [
                        {
                          "text": "Office of a doctor, dentist or lawyer residing on the premises, provided\nthat there is no display of advertising except a small professional\nnameplate; one nonresident employee shall be permitted in such office."
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "paragraph": "§ 271-39",
      "title": "Height restrictions.",
      "content": [
        {
          "content": [
            {
              "number": "A. ",
              "content": [
                {
                  "text": "The height of any principal building shall not exceed 30 feet.[Amended 9-19-2003 by L.L. No. 2-2003]"
                }
              ]
            },
            {
              "number": "B. ",
              "content": [
                {
                  "text": "The height of any accessory building shall not exceed 20 feet."
                }
              ]
            },
            {
              "number": "C. ",
              "content": [
                {
                  "text": "The height of any boundary line fence shall not exceed four feet."
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "paragraph": "§ 271-40",
      "title": "Required lot area.",
      "content": [
        {
          "content": [
            {
              "number": "A. ",
              "content": [
                {
                  "text": "The principal building, as herein defined, or any part thereof shall\nbe erected, constructed, reconstructed, altered, repaired or used\non a plot containing an area of not less than 10,000 square feet contained\nin one lot. Notwithstanding any other state or local law to the contrary,\nthe minimum lot area herein may not be met by combining two or more\ncontiguous plots of land each of which is less than such required\nminimum lot area.[Amended 8-16-1999 by L.L. No. 5-1999]"
                }
              ]
            },
            {
              "number": "B. ",
              "content": [
                {
                  "text": "There shall not be more than one principal building or portion thereof\nto each 10,000 square feet contained in a plot."
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "paragraph": "§ 271-41",
      "title": "Lot coverage.",
      "content": [
        {
          "text": "All buildings, including accessory buildings, shall not cover\n25% of the area of the plot."
        }
      ]
    },
    {
      "paragraph": "§ 271-42",
      "title": "Required floor area.",
      "content": [
        {
          "text": "No main dwelling shall be erected unless it has a habitable\nfloor area of at least 1,200 square feet to be completed prior to\noccupancy."
        }
      ]
    },
    {
      "paragraph": "§ 271-43",
      "title": "Yards.",
      "content": [
        {
          "text": "Each lot shall have front, side and rear yards not less than\nthe depths or widths following."
        },
        {
          "content": [
            {
              "number": "A. ",
              "content": [
                {
                  "text": "Front yard depth: 30 feet."
                }
              ]
            },
            {
              "number": "B. ",
              "content": [
                {
                  "text": "In the case of a single-family dwelling, there shall be two side\nyards, one on each side of the main building, the aggregate widths\nof which shall be at least 30 feet. Neither side yard shall be less\nthan 10 feet wide."
                }
              ]
            },
            {
              "number": "C. ",
              "content": [
                {
                  "text": "Rear yard depth: 25 feet."
                }
              ]
            },
            {
              "number": "D. ",
              "content": [
                {
                  "text": "Corner lot: A building shall not be required to comply with Subsection A, but the depth of yard from any street line shall not be less than 25 feet."
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "paragraph": "§ 271-44",
      "title": "Street frontage required.",
      "content": [
        {
          "text": "No lot shall have a street frontage of less than 100 feet."
        }
      ]
    },
    {
      "paragraph": "§ 271-45",
      "title": "Projection of buildings.",
      "content": [
        {
          "text": "No building or structure or part thereof shall project into\nany yard except as shall be specifically provided in this article."
        }
      ]
    },
    {
      "paragraph": "§ 271-46",
      "title": "Permitted accessory structures.",
      "content": [
        {
          "text": "Permitted accessory structures shall be as follows."
        },
        {
          "content": [
            {
              "number": "A. ",
              "content": [
                {
                  "text": "Stationary outdoor fireplaces: See § 271-22."
                }
              ]
            },
            {
              "number": "B. ",
              "content": [
                {
                  "text": "Outdoor pools: See § 271-35B."
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "paragraph": "§ 271-47",
      "title": "Accessory buildings and uses.",
      "content": [
        {
          "content": [
            {
              "number": "A. ",
              "content": [
                {
                  "text": "Accessory buildings or structures shall not occupy more than 15%\nof the rear yard. The yard area occupied by the accessory buildings\nor structures shall be included in computing the maximum percentage\nof the lot area which may be utilized for buildings."
                }
              ]
            },
            {
              "number": "B. ",
              "content": [
                {
                  "text": "Unless otherwise provided in this article, accessory buildings and\nstructures shall be located in the rear yard and shall be not less\nthan 15 feet distant from the main building, not less than five feet\ndistant from the rear lot line, and not less than 10 feet distant\nfrom any side line, with the exception of boundary line fences and\nwalls which may be located on the lot line."
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "paragraph": "§ 271-232",
      "title": "Front yard limitations.",
      "content": [
        {
          "text": "The limitations for the front yard are as follows: Height/Setback Ratio: 0.7"
        }
      ]
    },
    {
      "paragraph": "§ 271-233",
      "title": "Side yard limitations.",
      "content": [
        {
          "text": "The limitations for the side yard are as follows: Height/Setback Ratio: 1.8"
        }
      ]
    },
    {
      "paragraph": "§ 271-234",
      "title": "Rear yard limitations.",
      "content": [
        {
          "text": "The limitations for rear yard are as follows: Height/Setback Ratio: 0.85"
        }
      ]
    },
    {
      "paragraph": "§ 271-235",
      "title": "Floor area ratios and maximums.",
      "content": [
        {
          "text": "The maximum floor area ratios and allowable floor areas shall not exceed the following limits: Floor Area Ratio (F.A.R.): 0.36. Maximum Allowable Floor Area (square feet): 4,500"
        }
      ]
    }
  ]
}