{
  "url": "http://ecode360.com/15524388",
  "paras": [
    {
      "paragraph": "§ 271-26",
      "title": "Applicability.",
      "content": [
        {
          "text": "The provisions of this article shall apply to an R-1 District."
        }
      ]
    },
    {
      "paragraph": "§ 271-27",
      "title": "Permitted uses.",
      "content": [
        {
          "content": [
            {
              "number": "A. ",
              "content": [
                {
                  "text": "No building or land shall hereafter be used or occupied and no building\nor part thereof shall be erected, used or altered unless in conformity\nwith the regulations herein specified and except for the purposes\nset forth in this article and for no other purpose."
                }
              ]
            },
            {
              "number": "B. ",
              "content": [
                {
                  "text": "Permitted uses shall be as follows:"
                },
                {
                  "content": [
                    {
                      "number": "(1) ",
                      "content": [
                        {
                          "text": "Any one of the uses and purposes set forth in Article III hereof."
                        }
                      ]
                    },
                    {
                      "number": "(2) ",
                      "content": [
                        {
                          "text": "Fences: See § 271-14."
                        }
                      ]
                    },
                    {
                      "number": "(3) ",
                      "content": [
                        {
                          "text": "Parks."
                        }
                      ]
                    },
                    {
                      "number": "(4) ",
                      "content": [
                        {
                          "text": "Public library, public art gallery, public museum, municipal firehouse,\nmunicipal recreational use, Village hall and accessory garage, Courthouse,\nPolice Station and Roslyn Water District water pumping stations, booster\nstations, tanks and appurtenant facilities."
                        }
                      ]
                    },
                    {
                      "number": "(5) ",
                      "content": [
                        {
                          "text": "Office of a doctor, dentist or lawyer residing on the premises, provided\nthat there is no display of advertising except a small professional\nnameplate; one nonresident employee shall be permitted in such office."
                        }
                      ]
                    },
                    {
                      "number": "(6) ",
                      "content": [
                        {
                          "text": "Churches: See § 271-24."
                        }
                      ]
                    },
                    {
                      "number": "(7) ",
                      "content": [
                        {
                          "text": "Private swimming club as conditional use. A building or structure may be built, altered or used and a plot or parcel of land may be used for a swimming pool and accessory purposes by an association or membership corporation, all directors, officers and members of which shall be resident owners of real property within the Village, which use is not conducted for profit or gain, provided that the Board of Trustees of the Village shall determine that the public health, morals, safety, comfort and general welfare of the neighborhood will be secure and that such use will not be detrimental to the general character of the neighborhood or to the orderly development of the Village, and provided that the Board of Trustees shall authorize the issuance of a special permit for such conditional use. Such a permit shall be issued only to such a membership association or membership corporation which owns the land which is the subject matter of the application; however, the Board of Trustees, in its discretion, may grant such a permit to a membership association or membership corporation which is a contract vendee in a contract, absolute in its terms, with the sole exception that it is conditioned upon the granting of such use permit. No permit shall be issued for any such use nor shall any such use of said land be permitted or carried on until proof is submitted that the portion of the land whereon the pool structure is to be erected is free of mortgage and any other encumbrances and until the location and size of the plot, site plans and detailed building plans of such pool and any accessory buildings, showing dimensions, design, elevations, location and use of all structures, drainage, sewerage and sanitary facilities, parking areas, entrances, driveways, walks, screening, planting and such other information, including the manner of operation, use and maintenance of such swimming pool, as may be required by the Board of Trustees, has been submitted to and approved by said Board. All necessary permits and certificates of compliance with the requirements of any and all governmental authorities and agencies, including, but not limited to, the New York State Department of Health, New York State Department of Labor and Nassau County Department of Health shall also be submitted to the Board of Trustees. Such permit may prescribe reasonable rules and regulations for the operation, maintenance and use of such swimming pool and any accessory structures. Any violations of this section or of any rule or regulation prescribed by the Board of Trustees in the permit or otherwise shall be subject to the remedies and penalties prescribed in Article XIII, § 271-137, of this chapter, and in addition thereto, any permit issued hereunder may be revoked and canceled forthwith in the event of any such violation. Such permit, when granted, shall not be assignable by the person, association or membership corporation to which the permit has been granted. The permit shall further stipulate that the regular use of the swimming pool and facilities appurtenant thereto shall be limited to members of said club, their families and guests. In the event that a permittee hereunder shall fail to complete the necessary structures or the use and operations permitted and provided under such permit or shall fail to operate said swimming club or in the event that said permittee shall terminate its operation for any reason whatsoever, then, and in that event, any permit granted hereunder shall cease and determine, and the subject land shall ipso facto be available for only those uses permitted by this article of this chapter, and contemporaneously the title of said land and all of the structures, appurtenances erected thereon and/or used in connection therewith, including all property, real, personal and mixed, shall revert to the Village of East Hills at a date of not less than 30 days subsequent to the date said permittee shall discontinue its building operation or terminate its operation and use, as the case may be, and the Board of Trustees of the Village of East Hills, acting for and on behalf and in the interest of all of the residents and taxpayers of the said Village, shall sell subject land and any and all structures, appurtenances, fixtures or other property used in connection with said operation and shall use any and all sums realized thereby for clearing of said land and restoring the same to availability for residence use. Any balance remaining shall be divided among members of said permittee active and in good standing as of the date of reverter."
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "paragraph": "§ 271-28",
      "title": "Height restrictions.",
      "content": [
        {
          "content": [
            {
              "number": "A. ",
              "content": [
                {
                  "text": "The height of any principal building shall not exceed 31 feet.[Amended 9-19-2003 by L.L. No. 2-2003]"
                }
              ]
            },
            {
              "number": "B. ",
              "content": [
                {
                  "text": "The height of any accessory building shall not exceed 20 feet."
                }
              ]
            },
            {
              "number": "C. ",
              "content": [
                {
                  "text": "The height of any boundary line fence shall not exceed four feet."
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "paragraph": "§ 271-29",
      "title": "Required lot area.",
      "content": [
        {
          "content": [
            {
              "number": "A. ",
              "content": [
                {
                  "text": "The principal building, as herein defined, or any part thereof shall\nbe erected, constructed, reconstructed, altered, repaired or used\non a plot containing an area of not less than 15,000 square feet contained\nin one lot. Notwithstanding any other state or local law to the contrary,\nthe minimum lot area herein may not be met by combining two or more\ncontiguous plots of land each of which is less than such required\nminimum lot area.[Amended 8-16-1999 by L.L. No. 5-1999]"
                }
              ]
            },
            {
              "number": "B. ",
              "content": [
                {
                  "text": "There shall not be more than one principal building or portion thereof\nto each 15,000 square feet contained in a plot."
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "paragraph": "§ 271-30",
      "title": "Lot coverage.",
      "content": [
        {
          "text": "All buildings, including accessory buildings, shall not cover\nmore than 25% of the area of the plot."
        }
      ]
    },
    {
      "paragraph": "§ 271-31",
      "title": "Required floor area.",
      "content": [
        {
          "text": "No main dwelling shall be erected unless it has a habitable\nfloor area of at least 1,500 square feet to be completed prior to\noccupancy."
        }
      ]
    },
    {
      "paragraph": "§ 271-32",
      "title": "Yards.",
      "content": [
        {
          "text": "Each lot shall have front, side and rear yards not less than\nthe depths or widths following."
        },
        {
          "content": [
            {
              "number": "A. ",
              "content": [
                {
                  "text": "Front yard depth: 35 feet."
                }
              ]
            },
            {
              "number": "B. ",
              "content": [
                {
                  "text": "In the case of a single-family dwelling, there shall be two side\nyards, one on each side of the main building, the aggregate widths\nof which shall be at least 40 feet. Neither side yard shall be less\nthan 15 feet wide."
                }
              ]
            },
            {
              "number": "C. ",
              "content": [
                {
                  "text": "Rear yard depth: 30 feet."
                }
              ]
            },
            {
              "number": "D. ",
              "content": [
                {
                  "text": "Corner lot: A building shall not be required to comply with Subsection A, but the depth of a yard from any street line shall not be less than 30 feet."
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "paragraph": "§ 271-33",
      "title": "Street frontage required.",
      "content": [
        {
          "text": "No lot shall have a street frontage of less than 110 feet."
        }
      ]
    },
    {
      "paragraph": "§ 271-34",
      "title": "Projection of buildings.",
      "content": [
        {
          "text": "No building or structure or part thereof shall project into\nany yard except as shall be specifically provided in this article."
        }
      ]
    },
    {
      "paragraph": "§ 271-35",
      "title": "Permitted accessory structures.",
      "content": [
        {
          "text": "Permitted accessory structures shall be the following:"
        },
        {
          "content": [
            {
              "number": "A. ",
              "content": [
                {
                  "text": "Stationary outdoor fireplaces: See § 271-22."
                }
              ]
            },
            {
              "number": "B. ",
              "content": [
                {
                  "text": "No outdoor pools shall be constructed to exceed two feet in depth,\nand no such pool shall be constructed except in compliance with the\nregulations of the Nassau County Department of Health and unless provided\nwith a drain or outlet to permit same to be emptied."
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "paragraph": "§ 271-36",
      "title": "Accessory buildings and uses.",
      "content": [
        {
          "text": "Accessory buildings: See § 271-23."
        }
      ]
    }
  ]
}