{
	"url": "http://ecode360.com/11055921",
	"paras": [
		{
			"paragraph": "§ 345-27",
			"title": "Height.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "No building in any district shall be erected to a\nheight in excess of 30 feet.[Amended 7-28-1997 by L.L. No. 10-1997]"
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "In any residential district, no main building hereafter\nerected shall be of a height less than the equivalent of a one-and-a-half-story\nbuilding."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "A detached garage erected as an accessory structure\nor any other detached accessory structure shall not be higher than\na maximum of 15 feet, and the vertical walls of said garage or accessory\nstructure shall not exceed 10 feet in height. The garage or the accessory\nstructure shall not exceed 250 square feet for a one-car garage and\n500 square feet for a two-car garage.[Amended 4-9-1984 by L.L. No. 3-1984]"
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "The walking surface of all external stairways, decks,\npatios or similar structures erected or constructed or renovated in\nany business or residential area of the Incorporated Village of Massapequa\nPark shall not exceed five feet in height above the grade level of\nthe real property.[Added 5-21-1984 by L.L. No. 7-1984; amended 11-24-1986 by L.L. No. 8-1986]"
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "Exceptions."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "In any district, any portion of a building may be\nerected to a height in excess of the foregoing limits, provided that\nthe plans therefor have been approved by the Zoning Board of Appeals."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "The provisions of this section shall not apply to\nrestrict the height of a church tower, spire or belfry or of a flagpole,\nwireless tower, monument, chimney, water tank or elevator bulkheads\nor of a stage tower or scenery loft."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Nothing in these regulations shall apply to prevent\nthe erection above the height limit of a parapet wall or cornice for\nornament and without windows, extending such height limit not more\nthan five feet."
												}
											]
										}
									]
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 345-28",
			"title": "Lot and building area; windows and courts.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Areas of lots and buildings. For buildings hereafter\nerected, the minimum lot area for each dwelling house, exclusive of\naccessory buildings, garages, porches or other buildings appurtenant\nthereto, shall be as follows:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Residential districts. In Residential A Districts\nand except as otherwise provided in the Residential AA District, the\nminimum lot area shall be 8,000 square feet, and each lot shall have\nat least 80 feet in the front and rear and shall be at least 100 feet\nin depth on both sides.[Amended 12-27-1999 by L.L. No. 15-1999]"
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Residential AA District. In the Residential AA District,\nno building hereafter erected or altered shall have a depth of front\nyard less than 25 feet. If on the same side of the street between\nthe two nearest intersecting street lines there shall have been erected\na building with less than a thirty-foot setback, the front yard depth\nshall be in conformity with the setback established by the existing\nbuildings.[Amended 6-19-1967]"
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Business G District. In a Business G District, the\nmain building shall cover not less than 600 square feet of ground\nfloor space and shall not be less than 1 1/2 stories."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "(Reserved)[1]"
												},
												{
													"footnote": "[1]\nEditor's Note: Former Subsection A(4), regarding\nspecial permit uses, was repealed 12-27-1999 by L.L. No. 15-1999.\n"
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "Hospitals, hotels, etc. In any district, for a hospital,\nsanatorium, hotel or apartment house, the area of the lot shall not\nbe less than 400 square feet for each sleeping room for which such\nbuilding is arranged or designed, and the main building thereon shall\ncover not less than 800 square feet of ground floor space and shall\nbe not less than two stories."
												}
											]
										},
										{
											"number": "(6) ",
											"content": [
												{
													"text": "Buildings in residential districts. The minimum ground\nfloor area of buildings in residential districts shall be as follows:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "Residential A District."
																},
																{
																	"content": [
																		{
																			"number": "[1] ",
																			"content": [
																				{
																					"text": "Eight hundred fifty square feet for 1 1/2\nstories."
																				}
																			]
																		},
																		{
																			"number": "[2] ",
																			"content": [
																				{
																					"text": "Seven hundred fifty square feet for two stories."
																				}
																			]
																		},
																		{
																			"number": "[3] ",
																			"content": [
																				{
																					"text": "Nine hundred fifty square feet for one-story\nranch-type home."
																				}
																			]
																		},
																		{
																			"number": "[4] ",
																			"content": [
																				{
																					"text": "In Residential A District where buildings already\nexist of dimensions in excess of the foregoing, all building plots\non the opposite side of any street in this district from such buildings\nshall have a lot area of not less than 8,000 square feet and shall\nhave a ground floor space area of not less than 900 square feet and\nnot less than 2 1/2 stories and cellar."
																				}
																			]
																		}
																	]
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "Residential AA District."
																},
																{
																	"content": [
																		{
																			"number": "[1] ",
																			"content": [
																				{
																					"text": "Nine hundred fifty square feet for 1 1/2\nstories."
																				}
																			]
																		},
																		{
																			"number": "[2] ",
																			"content": [
																				{
																					"text": "Eight hundred square feet for two stories."
																				}
																			]
																		},
																		{
																			"number": "[3] ",
																			"content": [
																				{
																					"text": "One thousand fifty square feet for one-story\nranch-type home."
																				}
																			]
																		}
																	]
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(7) ",
											"content": [
												{
													"text": "Split-level homes."
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "The first level and second level of split-level\nhomes shall be considered as one for the purpose of compliance with\nground floor area. In all split-level homes, the minimum ground floor\narea shall be 950 square feet."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "All split-level homes shall be constructed with\na cellar under at least 50% of the building. A cellar shall be considered\nas a story partly underground and having more than 1/2 of its clear\nheight below the average level of the adjoining ground. A cellar shall\nnot be considered a story for the purpose of height measurement in\ndetermining the permissible number of stories."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "This Subsection A(7) with respect to split-level homes shall apply to construction in the Residential A District and shall not apply to the Residential AA District, where cellarless or basementless houses are permitted."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(8) ",
											"content": [
												{
													"text": "Slab or crawl-space houses."
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "In the Residence AA District, basementless (slab)\nor crawl-space houses shall be permitted, provided that the ground\nfloor area for one-story houses has a building area of 1,150 square\nfeet and the minimum ground floor area for more than one-story houses\nshall be 1,050 square feet. The portion of a Residence AA District\nto which this provision shall apply will be all that south of Nassau\nStreet."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "The construction of basementless (slab) or crawlspace\nhouses shall be in conformity with the building requirements as set\nforth in the Building Code.[2]"
																},
																{
																	"footnote": "[2]\nEditor's Note: See Ch. 154, Fire Prevention and Building Construction.\n"
																}
															]
														}
													]
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": " Width of lot. For buildings hereafter erected, the minimum average width of the lot for each building, together with the accessory buildings appurtenant thereto, excepting the provisions of § 345-11B, shall be as follows:[Amended 12-27-1999 by L.L. No. 15-1999]"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "In any residence district: 80 feet."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "In any Business G District: 20 feet."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "In a Business G District, every building used as a residence on the first floor shall have a lot of similar width as that prescribed in Subsection B(1)."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "In a residential district, the maximum lot coverage\npermitted shall be 30%.[Amended 3-14-2005 by L.L. No. 3-2005]"
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "Windows and courts. In any district, every living\nor sleeping room in a dwelling, apartment house, hotel, hospital or\nsanatorium shall have at least one window opening directly upon either\na street, a front yard, a rear yard, a side yard or a court. The least\ndimension of any such court shall be not less than four inches for\neach foot of the height of the highest wall of such court. Such court\nshall be open and unobstructed to the sky except for ordinary projections\nof windowsills, belt courses and other ornamental features to the\nextent of not more than four inches."
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "Certificate of occupancy.[Added 6-12-2000 by L.L. No. 10-2000]"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Up to and including December 29, 1999, all real properties\nlocated within the Village of Massapequa Park which had a valid certificate\nof occupancy for a one-family house for a lot of 6,000 square feet\nor more can have the house demolished and build a new house on said\npremises with a minimum plot of 6,000 square feet."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "A new certificate of occupancy shall be required for\nthe new structure or building on the real property that had a valid\ncertificate of occupancy up to and including December 29, 1999, which\nnew structure or building must meet the requirements of the Building\nDepartment of the Incorporated Village of Massapequa Park for a new\ncertificate of occupancy."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "F. ",
							"content": [
								{
									"text": "After December 29, 1999, the minimum lot area to be erected or altered shall, as stated in the existing law of § 345-28, have a minimum lot area of 8,000 square feet, and each lot shall have at least 80 feet in front and rear and shall be at least 100 feet in depth on both sides.[Added 6-12-2000 by L.L. No. 10-2000]"
								}
							]
						},
						{
							"number": "G. ",
							"content": [
								{
									"text": "Except as stated above, all the rest and remaining\nprovisions of the local law enacted on December 27, 1999, shall remain\nin full force and effect.[Added 6-12-2000 by L.L. No. 10-2000]"
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 345-29",
			"title": "Area standards in Residential A District.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Generally. Every building hereafter erected or structurally altered in Residential A District shall be on a lot having the area, frontage and depth on both sides provided in § 345-28A(1)."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Issuance of building permits. No building permit shall\nbe issued and no building shall be erected on a plot of less than\n8,000 square feet as set forth herein, nor when the issuance of the\nsame shall leave remaining a plot immediately adjacent less in size\nthan required by this chapter.[Amended 12-27-1999 by L.L. No. 15-1999]"
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 345-30",
			"title": "Front yards.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Generally."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Except as provided in Subsection A(2), every building hereafter erected shall have a front yard which shall be of the following minimum depth:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "In a Residential A District: 25 feet."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "In a Residential AA District: 25 feet.[Amended 6-19-1967]"
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "In a Business G District, the depth shall be\nfixed by the Board of Trustees."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Exception. In a block in any residence district in\nwhich 25% of the frontage on one side of the street is improved with\nbuildings, the front yard of a building hereafter erected shall extend\nat least to the alignment of existing buildings, provided that no\nbuilding hereafter erected in such residence district shall have a\nfront yard of less than 10 feet in depth nor need have a front yard\nof greater depth than 40 feet."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Corner lots."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "A corner lot shall have a front yard along its principal frontage of the depth required by Subsection A(1)(a), (b) and (c). A corner lot shall also have a front yard along its side street frontage of the following depth:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "In any Residential A District: 25 feet."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "In a Residential AA District: 25 feet."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "In a Business G District, the depth shall be\nfixed by the Board of Trustees."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Where corner plots of 80 feet by 100 feet exist, the\nsetback on each street shall be a minimum of 25 feet in a Residential\nA District and 25 feet in a Residential AA District. In a Business\nG District, such setback shall be fixed by the Board of Trustees.[Amended 6-19-1967; 12-27-1999 by L.L. No.\n15-1999]"
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Through lots. A through lot shall have a front yard\non each frontage."
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "Permitted structures in front yards.[Amended 1-10-2000 by L.L. No. 1-2000; 9-11-2000 by L.L. No. 18-2000]"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "The space in a front yard shall be opened and unobstructed,\nexcept that in a residence district an uncovered porch may extend\nnot more than eight feet, without columns or roof, into the front\nyard; the cornices or eaves on the main building may project into\nthe front yard for a distance and in a manner prescribed by the Building\nInspector."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "A front covered portico shall have a width not greater\nthan eight feet. The roofline only may extend an additional one foot\non each end. A front covered portico cannot extend more than six feet\nfrom the house line. A covered porch may encroach not more than five\nfeet into the twenty-five-foot front setback and shall not have a\nwidth greater than the width of the house to which it is attached.[Amended 9-26-2005 by L.L. No. 5-2005]"
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Temporary storage containers.[Added 2-28-2006 by L.L. No. 1-2006]"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "Definition. \"Storage container\" means any container\nintended for the purpose of storing or keeping household goods and\nother personal property that is intended to be filled, refilled, or\nemptied while located outdoors on a residential property."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "It shall be unlawful for any person, firm or\ncorporation to place, keep or maintain any storage container on any\nproperty improved with a single-family dwelling, without securing\na permit."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "Any person desiring a permit to place or maintain\na storage container shall file an application with the Building Department.\nThe form for this application is to be furnished by the Building Department\nand shall be sworn to and filed by the applicant with the Building\nDepartment, along with an application fee of $10."
																}
															]
														},
														{
															"number": "(d) ",
															"content": [
																{
																	"text": "A permit for a storage container may only be\ngranted if there is currently a building permit for improvement of\nthe single-family dwelling upon which the storage container is located."
																}
															]
														},
														{
															"number": "(e) ",
															"content": [
																{
																	"text": "A storage container may not be more than 160\nsquare feet and no more than 8.6 feet in height.[Amended 1-8-2007 by L.L. No. 1-2007]"
																}
															]
														},
														{
															"number": "(f) ",
															"content": [
																{
																	"text": "The storage container shall be set back from\nany side yard property line a minimum of five feet and from the front\nproperty line by a minimum of five feet and also be a minimum of five\nfeet away from any structures on the property. In granting the permit\nthe Building Inspector shall consider the rights of adjacent property\nowners so that there shall not be any unreasonable deprivation of\nlight, air or a reasonable use of adjoining property."
																}
															]
														},
														{
															"number": "(g) ",
															"content": [
																{
																	"text": "The Building Inspector is hereby authorized,\nin the exercise of reasonable discretion, to revoke any permit issued\nhereunder if, after due investigation, he deems that the holder thereof\nhas violated any provisions of this subsection, in that the storage\ncontainer is being maintained in an unsafe manner or is being maintained\nas a nuisance. Written notice of said revocation shall be given, either\nby personal service upon the person to be notified or by depositing\nsaid notice in the United States mail in a sealed envelope, postage\nprepaid, addressed to such person at the address which appears on\nthe records of the Building Department."
																}
															]
														},
														{
															"number": "(h) ",
															"content": [
																{
																	"text": "The length of time a storage container shall\nbe permitted to remain shall be 180 days. An extension beyond 180\ndays will be considered upon application to the Board of Trustees.\nIt shall be mandatory that the storage container be removed at the\nend of the permitted period of time."
																}
															]
														}
													]
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "Vision clearance. On any corner lot on which a front\nyard is required by this chapter, it shall be unlawful to construct\nor maintain or permit to remain any fence or any other structure,\nwhether temporary or permanent, within 35 feet of the curbline which\nobstructs a view of more than 30 inches above the level of the sidewalk\nof the adjacent street pavement.[Amended 9-18-2006 by L.L. No. 4-2006]"
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 345-31",
			"title": "Rear and side yards.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Rear yards. Except as provided in Subsection E, every building hereafter erected shall have a rear yard which shall be of the following minimum depth:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "In Residential A District: 15 feet."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "In a Residential AA District: 15 feet."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "In a Business G District: 10 feet."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Rear yards of corner lots. Except as provided in Subsection E, the rear yard of a corner lot shall be of the following minimum depth:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "In a Residential A District: 15 feet."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "In a Residential AA District: 15 feet."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "In a Business G District, the depth of rear yard in\na corner lot shall be fixed by the Board of Trustees."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Side yards. Except as provided in Subsection E, every building erected hereafter shall have a side yard along each lot line, other than a street or a rear line, the minimum depth of which shall be as follows:[Amended 10-30-1967; 2-5-2007 by L.L. No. 2-2007]"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "In a Residential A District: five feet for a house\nand five feet for a garage."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "In a Residential AA District: a minimum of five feet\nto a garage and five feet to a building, with a minimum of 30 feet\nbetween structures of the adjacent properties."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "Side yards in corner lots. Except as provided in Subsection E, the minimum depth of side yards in corner lots shall be as follows:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "In a Residential A District: five feet."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "In Residential AA District, where irregular and regular plots exist side by side, the side yards as specified in Subsection C(2) shall be determined as measured from the front building line, and in no event shall any structure be less than five feet from the property line.[Amended 10-30-1967]"
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "In a Business G District, the depth of side yard in\na corner lot shall be fixed by the Board of Trustees."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "Exceptions."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Except as otherwise provided in § 345-32, a side or rear yard shall be open and unobstructed except for the ordinary projections of windowsills, belt courses, cornices and other ornamental features to the extent of not more than four inches, except that if the building is not over 2 1/2 stories in height, the cornices or eaves may project not more than 18 inches into such yard."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "A building and any accessory buildings erected on\nthe same lot shall, for the purpose of side and rear yard requirements,\nbe considered as a single building, except that a garage or other\naccessory building in a residence district may occupy not more than\n40% of the rear yard area and shall have a side yard and a rear yard\nof not less than one foot.[Amended 2-5-2007 by L.L. No. 2-2007]"
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "In any district, for a hospital, sanatorium, hotel,\napartment house or philanthropic institution, the Zoning Board of\nAppeals may make special individual requirements as to the minimum\ndepth of the side yard and rear yard of each such building."
												}
											]
										}
									]
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 345-32",
			"title": "Modification of yard requirements for garages.",
			"content": [
				{
					"text": "Where garage space for one or more motor vehicles\nis provided, the yard requirements shall be modified as follows:"
				},
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "The depth of front yard shall be a minimum of 25 feet\nin a Residential A District and 25 feet in a Residential AA District.\nIn a Business G District, the depth shall be fixed by the Board of\nTrustees.[Amended 10-30-1967]"
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "The depth of rear yard shall be a minimum of 15 feet\nin a Residential A or AA District; and in a Business G District, it\nshall be fixed by the Board of Trustees."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "All garages attached to residential buildings in Residential\nA and AA Districts shall extend not more than five feet beyond the\nrear of the building and shall be at least five feet from the side\nline of the property."
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "All garages detached from the building shall be erected\nat least five feet from the property line of the subject premises,\nexcept that any garage constructed in the rear corner of the property\ncan be a minimum of two feet from the property line, provided that\nthe garage is equally distant from the side and rear property lines.\nAny part of a garage, be it the base or the overhang or any part thereof,\nshall be a minimum of two feet from the side and rear property lines.[Amended 10-25-1993 by L.L. No. 10-1993]"
								}
							]
						}
					]
				}
			]
		},
		
	]
}