{
	"url": "http://ecode360.com/11055626",
	"paras": [
		{
			"paragraph": "§ 345-27",
			"title": "Height.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "No building in any district shall be erected to a\nheight in excess of 30 feet.[Amended 7-28-1997 by L.L. No. 10-1997]"
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "In any residential district, no main building hereafter\nerected shall be of a height less than the equivalent of a one-and-a-half-story\nbuilding."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "A detached garage erected as an accessory structure\nor any other detached accessory structure shall not be higher than\na maximum of 15 feet, and the vertical walls of said garage or accessory\nstructure shall not exceed 10 feet in height. The garage or the accessory\nstructure shall not exceed 250 square feet for a one-car garage and\n500 square feet for a two-car garage.[Amended 4-9-1984 by L.L. No. 3-1984]"
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "The walking surface of all external stairways, decks,\npatios or similar structures erected or constructed or renovated in\nany business or residential area of the Incorporated Village of Massapequa\nPark shall not exceed five feet in height above the grade level of\nthe real property.[Added 5-21-1984 by L.L. No. 7-1984; amended 11-24-1986 by L.L. No. 8-1986]"
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "Exceptions."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "In any district, any portion of a building may be\nerected to a height in excess of the foregoing limits, provided that\nthe plans therefor have been approved by the Zoning Board of Appeals."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "The provisions of this section shall not apply to\nrestrict the height of a church tower, spire or belfry or of a flagpole,\nwireless tower, monument, chimney, water tank or elevator bulkheads\nor of a stage tower or scenery loft."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Nothing in these regulations shall apply to prevent\nthe erection above the height limit of a parapet wall or cornice for\nornament and without windows, extending such height limit not more\nthan five feet."
												}
											]
										}
									]
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 345-28",
			"title": "Lot and building area; windows and courts.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Areas of lots and buildings. For buildings hereafter\nerected, the minimum lot area for each dwelling house, exclusive of\naccessory buildings, garages, porches or other buildings appurtenant\nthereto, shall be as follows:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Residential districts. In Residential A Districts\nand except as otherwise provided in the Residential AA District, the\nminimum lot area shall be 8,000 square feet, and each lot shall have\nat least 80 feet in the front and rear and shall be at least 100 feet\nin depth on both sides.[Amended 12-27-1999 by L.L. No. 15-1999]"
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Residential AA District. In the Residential AA District,\nno building hereafter erected or altered shall have a depth of front\nyard less than 25 feet. If on the same side of the street between\nthe two nearest intersecting street lines there shall have been erected\na building with less than a thirty-foot setback, the front yard depth\nshall be in conformity with the setback established by the existing\nbuildings.[Amended 6-19-1967]"
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Business G District. In a Business G District, the\nmain building shall cover not less than 600 square feet of ground\nfloor space and shall not be less than 1 1/2 stories."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "(Reserved)[1]"
												},
												{
													"footnote": "[1]\nEditor's Note: Former Subsection A(4), regarding\nspecial permit uses, was repealed 12-27-1999 by L.L. No. 15-1999.\n"
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "Hospitals, hotels, etc. In any district, for a hospital,\nsanatorium, hotel or apartment house, the area of the lot shall not\nbe less than 400 square feet for each sleeping room for which such\nbuilding is arranged or designed, and the main building thereon shall\ncover not less than 800 square feet of ground floor space and shall\nbe not less than two stories."
												}
											]
										},
										{
											"number": "(6) ",
											"content": [
												{
													"text": "Buildings in residential districts. The minimum ground\nfloor area of buildings in residential districts shall be as follows:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "Residential A District."
																},
																{
																	"content": [
																		{
																			"number": "[1] ",
																			"content": [
																				{
																					"text": "Eight hundred fifty square feet for 1 1/2\nstories."
																				}
																			]
																		},
																		{
																			"number": "[2] ",
																			"content": [
																				{
																					"text": "Seven hundred fifty square feet for two stories."
																				}
																			]
																		},
																		{
																			"number": "[3] ",
																			"content": [
																				{
																					"text": "Nine hundred fifty square feet for one-story\nranch-type home."
																				}
																			]
																		},
																		{
																			"number": "[4] ",
																			"content": [
																				{
																					"text": "In Residential A District where buildings already\nexist of dimensions in excess of the foregoing, all building plots\non the opposite side of any street in this district from such buildings\nshall have a lot area of not less than 8,000 square feet and shall\nhave a ground floor space area of not less than 900 square feet and\nnot less than 2 1/2 stories and cellar."
																				}
																			]
																		}
																	]
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "Residential AA District."
																},
																{
																	"content": [
																		{
																			"number": "[1] ",
																			"content": [
																				{
																					"text": "Nine hundred fifty square feet for 1 1/2\nstories."
																				}
																			]
																		},
																		{
																			"number": "[2] ",
																			"content": [
																				{
																					"text": "Eight hundred square feet for two stories."
																				}
																			]
																		},
																		{
																			"number": "[3] ",
																			"content": [
																				{
																					"text": "One thousand fifty square feet for one-story\nranch-type home."
																				}
																			]
																		}
																	]
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(7) ",
											"content": [
												{
													"text": "Split-level homes."
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "The first level and second level of split-level\nhomes shall be considered as one for the purpose of compliance with\nground floor area. In all split-level homes, the minimum ground floor\narea shall be 950 square feet."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "All split-level homes shall be constructed with\na cellar under at least 50% of the building. A cellar shall be considered\nas a story partly underground and having more than 1/2 of its clear\nheight below the average level of the adjoining ground. A cellar shall\nnot be considered a story for the purpose of height measurement in\ndetermining the permissible number of stories."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "This Subsection A(7) with respect to split-level homes shall apply to construction in the Residential A District and shall not apply to the Residential AA District, where cellarless or basementless houses are permitted."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(8) ",
											"content": [
												{
													"text": "Slab or crawl-space houses."
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "In the Residence AA District, basementless (slab)\nor crawl-space houses shall be permitted, provided that the ground\nfloor area for one-story houses has a building area of 1,150 square\nfeet and the minimum ground floor area for more than one-story houses\nshall be 1,050 square feet. The portion of a Residence AA District\nto which this provision shall apply will be all that south of Nassau\nStreet."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "The construction of basementless (slab) or crawlspace\nhouses shall be in conformity with the building requirements as set\nforth in the Building Code.[2]"
																},
																{
																	"footnote": "[2]\nEditor's Note: See Ch. 154, Fire Prevention and Building Construction.\n"
																}
															]
														}
													]
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": " Width of lot. For buildings hereafter erected, the minimum average width of the lot for each building, together with the accessory buildings appurtenant thereto, excepting the provisions of § 345-11B, shall be as follows:[Amended 12-27-1999 by L.L. No. 15-1999]"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "In any residence district: 80 feet."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "In any Business G District: 20 feet."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "In a Business G District, every building used as a residence on the first floor shall have a lot of similar width as that prescribed in Subsection B(1)."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "In a residential district, the maximum lot coverage\npermitted shall be 30%.[Amended 3-14-2005 by L.L. No. 3-2005]"
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "Windows and courts. In any district, every living\nor sleeping room in a dwelling, apartment house, hotel, hospital or\nsanatorium shall have at least one window opening directly upon either\na street, a front yard, a rear yard, a side yard or a court. The least\ndimension of any such court shall be not less than four inches for\neach foot of the height of the highest wall of such court. Such court\nshall be open and unobstructed to the sky except for ordinary projections\nof windowsills, belt courses and other ornamental features to the\nextent of not more than four inches."
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "Certificate of occupancy.[Added 6-12-2000 by L.L. No. 10-2000]"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Up to and including December 29, 1999, all real properties\nlocated within the Village of Massapequa Park which had a valid certificate\nof occupancy for a one-family house for a lot of 6,000 square feet\nor more can have the house demolished and build a new house on said\npremises with a minimum plot of 6,000 square feet."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "A new certificate of occupancy shall be required for\nthe new structure or building on the real property that had a valid\ncertificate of occupancy up to and including December 29, 1999, which\nnew structure or building must meet the requirements of the Building\nDepartment of the Incorporated Village of Massapequa Park for a new\ncertificate of occupancy."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "F. ",
							"content": [
								{
									"text": "After December 29, 1999, the minimum lot area to be erected or altered shall, as stated in the existing law of § 345-28, have a minimum lot area of 8,000 square feet, and each lot shall have at least 80 feet in front and rear and shall be at least 100 feet in depth on both sides.[Added 6-12-2000 by L.L. No. 10-2000]"
								}
							]
						},
						{
							"number": "G. ",
							"content": [
								{
									"text": "Except as stated above, all the rest and remaining\nprovisions of the local law enacted on December 27, 1999, shall remain\nin full force and effect.[Added 6-12-2000 by L.L. No. 10-2000]"
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 345-29",
			"title": "Area standards in Residential A District.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Generally. Every building hereafter erected or structurally altered in Residential A District shall be on a lot having the area, frontage and depth on both sides provided in § 345-28A(1)."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Issuance of building permits. No building permit shall\nbe issued and no building shall be erected on a plot of less than\n8,000 square feet as set forth herein, nor when the issuance of the\nsame shall leave remaining a plot immediately adjacent less in size\nthan required by this chapter.[Amended 12-27-1999 by L.L. No. 15-1999]"
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 345-30",
			"title": "Front yards.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Generally."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Except as provided in Subsection A(2), every building hereafter erected shall have a front yard which shall be of the following minimum depth:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "In a Residential A District: 25 feet."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "In a Residential AA District: 25 feet.[Amended 6-19-1967]"
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "In a Business G District, the depth shall be\nfixed by the Board of Trustees."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Exception. In a block in any residence district in\nwhich 25% of the frontage on one side of the street is improved with\nbuildings, the front yard of a building hereafter erected shall extend\nat least to the alignment of existing buildings, provided that no\nbuilding hereafter erected in such residence district shall have a\nfront yard of less than 10 feet in depth nor need have a front yard\nof greater depth than 40 feet."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Corner lots."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "A corner lot shall have a front yard along its principal frontage of the depth required by Subsection A(1)(a), (b) and (c). A corner lot shall also have a front yard along its side street frontage of the following depth:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "In any Residential A District: 25 feet."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "In a Residential AA District: 25 feet."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "In a Business G District, the depth shall be\nfixed by the Board of Trustees."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Where corner plots of 80 feet by 100 feet exist, the\nsetback on each street shall be a minimum of 25 feet in a Residential\nA District and 25 feet in a Residential AA District. In a Business\nG District, such setback shall be fixed by the Board of Trustees.[Amended 6-19-1967; 12-27-1999 by L.L. No.\n15-1999]"
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Through lots. A through lot shall have a front yard\non each frontage."
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "Permitted structures in front yards.[Amended 1-10-2000 by L.L. No. 1-2000; 9-11-2000 by L.L. No. 18-2000]"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "The space in a front yard shall be opened and unobstructed,\nexcept that in a residence district an uncovered porch may extend\nnot more than eight feet, without columns or roof, into the front\nyard; the cornices or eaves on the main building may project into\nthe front yard for a distance and in a manner prescribed by the Building\nInspector."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "A front covered portico shall have a width not greater\nthan eight feet. The roofline only may extend an additional one foot\non each end. A front covered portico cannot extend more than six feet\nfrom the house line. A covered porch may encroach not more than five\nfeet into the twenty-five-foot front setback and shall not have a\nwidth greater than the width of the house to which it is attached.[Amended 9-26-2005 by L.L. No. 5-2005]"
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Temporary storage containers.[Added 2-28-2006 by L.L. No. 1-2006]"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "Definition. \"Storage container\" means any container\nintended for the purpose of storing or keeping household goods and\nother personal property that is intended to be filled, refilled, or\nemptied while located outdoors on a residential property."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "It shall be unlawful for any person, firm or\ncorporation to place, keep or maintain any storage container on any\nproperty improved with a single-family dwelling, without securing\na permit."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "Any person desiring a permit to place or maintain\na storage container shall file an application with the Building Department.\nThe form for this application is to be furnished by the Building Department\nand shall be sworn to and filed by the applicant with the Building\nDepartment, along with an application fee of $10."
																}
															]
														},
														{
															"number": "(d) ",
															"content": [
																{
																	"text": "A permit for a storage container may only be\ngranted if there is currently a building permit for improvement of\nthe single-family dwelling upon which the storage container is located."
																}
															]
														},
														{
															"number": "(e) ",
															"content": [
																{
																	"text": "A storage container may not be more than 160\nsquare feet and no more than 8.6 feet in height.[Amended 1-8-2007 by L.L. No. 1-2007]"
																}
															]
														},
														{
															"number": "(f) ",
															"content": [
																{
																	"text": "The storage container shall be set back from\nany side yard property line a minimum of five feet and from the front\nproperty line by a minimum of five feet and also be a minimum of five\nfeet away from any structures on the property. In granting the permit\nthe Building Inspector shall consider the rights of adjacent property\nowners so that there shall not be any unreasonable deprivation of\nlight, air or a reasonable use of adjoining property."
																}
															]
														},
														{
															"number": "(g) ",
															"content": [
																{
																	"text": "The Building Inspector is hereby authorized,\nin the exercise of reasonable discretion, to revoke any permit issued\nhereunder if, after due investigation, he deems that the holder thereof\nhas violated any provisions of this subsection, in that the storage\ncontainer is being maintained in an unsafe manner or is being maintained\nas a nuisance. Written notice of said revocation shall be given, either\nby personal service upon the person to be notified or by depositing\nsaid notice in the United States mail in a sealed envelope, postage\nprepaid, addressed to such person at the address which appears on\nthe records of the Building Department."
																}
															]
														},
														{
															"number": "(h) ",
															"content": [
																{
																	"text": "The length of time a storage container shall\nbe permitted to remain shall be 180 days. An extension beyond 180\ndays will be considered upon application to the Board of Trustees.\nIt shall be mandatory that the storage container be removed at the\nend of the permitted period of time."
																}
															]
														}
													]
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "Vision clearance. On any corner lot on which a front\nyard is required by this chapter, it shall be unlawful to construct\nor maintain or permit to remain any fence or any other structure,\nwhether temporary or permanent, within 35 feet of the curbline which\nobstructs a view of more than 30 inches above the level of the sidewalk\nof the adjacent street pavement.[Amended 9-18-2006 by L.L. No. 4-2006]"
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 345-31",
			"title": "Rear and side yards.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Rear yards. Except as provided in Subsection E, every building hereafter erected shall have a rear yard which shall be of the following minimum depth:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "In Residential A District: 15 feet."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "In a Residential AA District: 15 feet."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "In a Business G District: 10 feet."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Rear yards of corner lots. Except as provided in Subsection E, the rear yard of a corner lot shall be of the following minimum depth:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "In a Residential A District: 15 feet."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "In a Residential AA District: 15 feet."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "In a Business G District, the depth of rear yard in\na corner lot shall be fixed by the Board of Trustees."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Side yards. Except as provided in Subsection E, every building erected hereafter shall have a side yard along each lot line, other than a street or a rear line, the minimum depth of which shall be as follows:[Amended 10-30-1967; 2-5-2007 by L.L. No. 2-2007]"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "In a Residential A District: five feet for a house\nand five feet for a garage."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "In a Residential AA District: a minimum of five feet\nto a garage and five feet to a building, with a minimum of 30 feet\nbetween structures of the adjacent properties."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "Side yards in corner lots. Except as provided in Subsection E, the minimum depth of side yards in corner lots shall be as follows:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "In a Residential A District: five feet."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "In Residential AA District, where irregular and regular plots exist side by side, the side yards as specified in Subsection C(2) shall be determined as measured from the front building line, and in no event shall any structure be less than five feet from the property line.[Amended 10-30-1967]"
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "In a Business G District, the depth of side yard in\na corner lot shall be fixed by the Board of Trustees."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "Exceptions."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Except as otherwise provided in § 345-32, a side or rear yard shall be open and unobstructed except for the ordinary projections of windowsills, belt courses, cornices and other ornamental features to the extent of not more than four inches, except that if the building is not over 2 1/2 stories in height, the cornices or eaves may project not more than 18 inches into such yard."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "A building and any accessory buildings erected on\nthe same lot shall, for the purpose of side and rear yard requirements,\nbe considered as a single building, except that a garage or other\naccessory building in a residence district may occupy not more than\n40% of the rear yard area and shall have a side yard and a rear yard\nof not less than one foot.[Amended 2-5-2007 by L.L. No. 2-2007]"
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "In any district, for a hospital, sanatorium, hotel,\napartment house or philanthropic institution, the Zoning Board of\nAppeals may make special individual requirements as to the minimum\ndepth of the side yard and rear yard of each such building."
												}
											]
										}
									]
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 345-32",
			"title": "Modification of yard requirements for garages.",
			"content": [
				{
					"text": "Where garage space for one or more motor vehicles\nis provided, the yard requirements shall be modified as follows:"
				},
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "The depth of front yard shall be a minimum of 25 feet\nin a Residential A District and 25 feet in a Residential AA District.\nIn a Business G District, the depth shall be fixed by the Board of\nTrustees.[Amended 10-30-1967]"
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "The depth of rear yard shall be a minimum of 15 feet\nin a Residential A or AA District; and in a Business G District, it\nshall be fixed by the Board of Trustees."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "All garages attached to residential buildings in Residential\nA and AA Districts shall extend not more than five feet beyond the\nrear of the building and shall be at least five feet from the side\nline of the property."
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "All garages detached from the building shall be erected\nat least five feet from the property line of the subject premises,\nexcept that any garage constructed in the rear corner of the property\ncan be a minimum of two feet from the property line, provided that\nthe garage is equally distant from the side and rear property lines.\nAny part of a garage, be it the base or the overhang or any part thereof,\nshall be a minimum of two feet from the side and rear property lines.[Amended 10-25-1993 by L.L. No. 10-1993]"
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 345-16",
			"title": "Uses permitted in residential districts.",
			"content": [
				{
					"text": "In any residence district, no building or premises\nshall be used and no building shall be erected or structurally altered\nwhich is arranged, intended or designed to be used for other than\none or more of the following uses:"
				},
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Single-family dwelling."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Church or school."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Philanthropic institution, other than a penal or corrective\ninstitution, or hospital."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 345-17",
			"title": "Accessory uses in residential districts.",
			"content": [
				{
					"text": "In any residential district, the following uses\nshall be permitted, provided that they are accessory to an authorized\nuse:"
				},
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Garage, subject to the limitations of § 345-33."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": " An announcement sign as accessory to the following\nuses only and subject to the following limitations:[Amended 1-7-1991 by L.L. No. 1-1991]"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "In connection with an authorized professional or customary\nhome occupation carried on by a person residing on the premises, there\nmay be displayed a small nameplate with a simple statement of the\nprofession or of the nature of the occupation."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "A temporary sales office as an accessory to a real\nestate subdivision or development."
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "Office of a physician, surgeon, dentist or other professional\nperson, provided that such office is located in the dwelling or apartment\nused by such professional person as a private residence."
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "Any customary home occupation, provided that the same\nis carried on in the dwelling or apartment occupied as a private residence\nby the person carrying on such home occupation, and provided further\nthat approval therefor is obtained from the Zoning Board of Appeals\nat a public hearing."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 345-18",
			"title": "Use of part of dwelling as place of business.",
			"content": [
				{
					"text": "It shall be unlawful to erect, alter or use any part or portion of a one-family dwelling as a store or place of business, and such use therein is hereby prohibited, except that a legally recognized professional occupation may be pursued therein by a person residing on the premises, as provided in § 345-17."
				}
			]
		},
		{
			"paragraph": "§ 345-19",
			"title": "Toilet room required on business premises.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Any premises or any portion thereof that is used for\nbusiness of any nature whatsoever requires that a toilet room be made\naccessible, available and operable on said premises or in any portion\nthereof for any person or persons occupying said premises or any portion\nthereof as set forth in this section."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "The supplying and furnishing of a toilet room must\nbe made accessible, available and operable at all times to any person\nor persons occupying said premises, with the expressed or implied\nconsent of the owner, landlord or tenant thereof, only when said person\nor persons occupying said premises or any portion thereof are not\nthe owner, landlord or tenant of said business premises or any portion\nthereof."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "The violation of this section shall be punishable\nby a fine of up to $250, with a minimum mandatory fine of $100, and/or\nimprisonment for up to 15 days of the owner, landlord or tenant thereof,\nand the violation of this section may result in the suspension or\ntermination of the business certificate of occupancy for said premises."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 345-20",
			"title": "Uses permitted in business districts.",
			"content": [
				{
					"text": "In any business district, no building or premises\nshall be used and no building shall be erected or structurally altered\nwhich is arranged, intended or designed to be used for other than\none or more of the uses permitted in the district in which said building\nor premises is located. The uses permitted in each business district\nshall be as follows:"
				},
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Store for retail trade."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Bank, office or studio."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Restaurant."
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "Railway or bus passenger station, post office, telegraph\noffice or express office."
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "Theater, moving-picture house, assembly hall, billiard\nor pool room, bowling alley or athletic field."
								}
							]
						},
						{
							"number": "F. ",
							"content": [
								{
									"text": "Motor vehicle salesroom."
								}
							]
						},
						{
							"number": "G. ",
							"content": [
								{
									"text": "Printing plant."
								}
							]
						},
						{
							"number": "H. ",
							"content": [
								{
									"text": "Mortuary."
								}
							]
						},
						{
							"number": "I. ",
							"content": [
								{
									"text": "Hand laundry."
								}
							]
						},
						{
							"number": "J. ",
							"content": [
								{
									"text": "Wholesale business, storage in bulk or warehouse for\nsuch material as building material, contractor's equipment, clothing,\ncotton, drugs, dry goods, feed, food, furniture, hardware, ice, machinery,\nmetals, paint and paint materials, pipe, rubber, shop supplies, tobacco\nand wool."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 345-21",
			"title": "Accessory uses in Business G Districts.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Permitted. In Business G District, a use accessory\nto an authorized use shall be permitted."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Prohibited. A use specified in § 345-22 shall not be permitted as an accessory use."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 345-22",
			"title": "Special permit uses in Business G Districts.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "In Business G District, no building or premises shall be used and no building shall be erected or structurally altered which is arranged, intended or designed to be used for any of the following uses except on special permit as provided in § 345-11B(3):"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Fairgrounds or circus grounds."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Penal correctional institution, hospital or sanatorium\nfor the insane or feebleminded or for liquor or drug addicts."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Commercial billboards or large business or advertising\nsigns."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "Cold storage plant, ice manufacture, creamery, ice\ncream manufacture, bottling works, milk bottling or central distributing\nstation or baking plant."
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "Dyeing or cleaning plant or power laundry."
												}
											]
										},
										{
											"number": "(6) ",
											"content": [
												{
													"text": "Stable or wagon shed, veterinary hospital or blacksmith\nor horseshoeing shop."
												}
											]
										},
										{
											"number": "(7) ",
											"content": [
												{
													"text": "Streetcar barn, streetcar repair shop, freight terminal,\ngrain elevator or railroad yard."
												}
											]
										},
										{
											"number": "(8) ",
											"content": [
												{
													"text": "Coal, coke or wood yard or lumber yard."
												}
											]
										},
										{
											"number": "(9) ",
											"content": [
												{
													"text": "Storage of live poultry or poultry killing or dressing\nfor sale at retail on the premises."
												}
											]
										},
										{
											"number": "(10) ",
											"content": [
												{
													"text": "Commercial greenhouse or dairy."
												}
											]
										},
										{
											"number": "(11) ",
											"content": [
												{
													"text": "Foundry."
												}
											]
										},
										{
											"number": "(12) ",
											"content": [
												{
													"text": "Stonecutting or monument works."
												}
											]
										},
										{
											"number": "(13) ",
											"content": [
												{
													"text": "Central electric light or power generating plant\nor central steam plant."
												}
											]
										},
										{
											"number": "(14) ",
											"content": [
												{
													"text": "Bag cleaning or carpet cleaning."
												}
											]
										},
										{
											"number": "(15) ",
											"content": [
												{
													"text": "Brewing or distilling of beverages."
												}
											]
										},
										{
											"number": "(16) ",
											"content": [
												{
													"text": "Dextrine, glucose or starch manufacture."
												}
											]
										},
										{
											"number": "(17) ",
											"content": [
												{
													"text": "Grain drying, poultry feed manufacture from\nrefuse mash or refuse grain or flour or feed mill."
												}
											]
										},
										{
											"number": "(18) ",
											"content": [
												{
													"text": "Poultry slaughterhouse."
												}
											]
										},
										{
											"number": "(19) ",
											"content": [
												{
													"text": "Gas manufacture from coal, coke or petroleum\nor the storage thereof, carbon or lampblack manufacture or petroleum\nstorage in quantities other than tank car lots."
												}
											]
										},
										{
											"number": "(20) ",
											"content": [
												{
													"text": "Power forge structural iron or pipe works, rock\ncrusher or railroad roundhouse or shop."
												}
											]
										},
										{
											"number": "(21) ",
											"content": [
												{
													"text": "Acetylene gas manufacture or oxygen manufacture."
												}
											]
										},
										{
											"number": "(22) ",
											"content": [
												{
													"text": "Celluloid manufacture."
												}
											]
										},
										{
											"number": "(23) ",
											"content": [
												{
													"text": "Paper manufacture or plaster manufacture."
												}
											]
										},
										{
											"number": "(24) ",
											"content": [
												{
													"text": "Disinfectant or insecticide manufacture."
												}
											]
										},
										{
											"number": "(25) ",
											"content": [
												{
													"text": "Asphalt manufacture or refining, coal distillation\nor tar distillation."
												}
											]
										},
										{
											"number": "(26) ",
											"content": [
												{
													"text": "Pickle, sauerkraut or vinegar manufacture or\nsoap manufacture."
												}
											]
										},
										{
											"number": "(27) ",
											"content": [
												{
													"text": "Rawhides or skins, curing or tanning or wood\nscouring."
												}
											]
										},
										{
											"number": "(28) ",
											"content": [
												{
													"text": "Small arms ammunition or fireworks manufacture."
												}
											]
										},
										{
											"number": "(29) ",
											"content": [
												{
													"text": "Abattoir or meat-packing."
												}
											]
										},
										{
											"number": "(30) ",
											"content": [
												{
													"text": "Scrap iron or junk storage, automobile wrecking\nyard, scrap paper or rag storage, sorting or baling."
												}
											]
										},
										{
											"number": "(31) ",
											"content": [
												{
													"text": "Brick, tile or terra-cotta manufacture or sand\nor gravel pit."
												}
											]
										},
										{
											"number": "(32) ",
											"content": [
												{
													"text": "Any process or business emitting dust, odor, gas fumes, noise or vibration comparable in character or in aggregate amount to that of any use specified in Subsection A(1) through (31) inclusive."
												}
											]
										},
										{
											"number": "(33) ",
											"content": [
												{
													"text": "The reclaiming, distilling or refining of hydrocarbon\nmaterial collected from oil separators."
												}
											]
										},
										{
											"number": "(34) ",
											"content": [
												{
													"text": "Manufacturing or industrial operation of any kind not heretofore listed in this section and exclusive of prohibited uses listed in § 345-25."
												}
											]
										},
										{
											"number": "(35) ",
											"content": [
												{
													"text": "Wholesale business, storage in bulk or warehouse\nfor such material as building material, contractor's equipment, clothing,\ncotton, drugs, dry goods, feed, food, furniture, hardware, ice, machinery,\nmetals, paint and paint materials, pipe, rubber, shop supplies, tobacco\nor wool.[Added 1-7-1991 by L.L. No. 1-1991]"
												}
											]
										}
									]
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 345-23",
			"title": "Business GG Districts.",
			"content": [
				{
					"text": "The provisions and limitations applying to the\nBusiness GG District shall be the same as for the Business G District,\nexcept that permits for construction in the Business GG District shall\nbe issued pursuant to the following conditions:"
				},
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Roofs. Flat-roof buildings shall be permitted."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Storage of trash. Any and all buildings erected or\nconstructed shall make provisions for the storing of rubbish, wastepaper,\ngarbage, etc., within the building."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Merchandise delivery. No front door delivery of merchandise\nshall be permitted."
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "Parking: to be in conformance with § 345-35.[Amended 1-7-1991 by L.L. No. 1-1991]"
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "Drainage of parking facilities. At the time of construction\nor installation of parking facilities, the owner and/or builder shall\nerect same pursuant to specifications submitted by the Village Engineer\nin order to ensure adequate drainage."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 345-24",
			"title": "Cluster development in Business GG Districts.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Purpose."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "It is the intent of the Board of Trustees to establish\na conditionally permitted use in the Business GG District."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "It is the intendment of this section that a viable\ncluster development, constructed and maintained pursuant to the requirements\nof this section, will promote the health, safety, morals and general\nwelfare of the community."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "General regulations and conditions for cluster development.\nNotwithstanding any provisions to the contrary contained in this chapter\nof the Code of the Village of Massapequa Park, the following regulations\nshall pertain to cluster development:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Cluster development of single-family dwellings in\ndetached, semidetached or attached structures in a Business GG District\nshall be conditionally permitted on any site containing at least 15\nacres of contiguous property not divided by an existing public or\nprivate street or right-of-way."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Notwithstanding anything set forth in § 345-17 to the contrary, no professional or customary home occupation or school shall be permitted in such cluster development."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Density and building area."
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "The density of occupancy of said site shall\nnot exceed 10 single-family dwelling units per acre, and the total\nbuilding area of all buildings on the site shall not exceed more than\n25% of the total area of the site."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "For the purposes of this Subsection B(3), \"building area\" shall be defined as the area of the maximum horizontal cross section of the buildings on the site, excluding cornices, eaves, gutters or chimneys projecting not more than 24 inches."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "Height. No building shall exceed 2 1/2 stories\nor 30 feet. No more than 60% of the dwelling units constructed on\nthe site shall exceed one story or 25 feet."
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "Habitable floor area."
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "No single-family dwelling unit shall be erected\nunless it has a habitable floor area of at least 800 square feet."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "For the purposes of this subsection, \"habitable\nfloor area\" shall be defined as the rooms occupied by one or more\npersons for living, eating and/or sleeping, but does not include attached\nor built-in garages, open porches or open terraces or rooms below\ngrade. On the first floor, it shall be construed to mean all finished\nfloor area having a clear headroom of 7 1/2 feet or over, including\nstairwells; on the second floor, all finished or unfinished floor\narea having a clear headroom of 7 1/2 feet or over for a minimum\nhorizontal measurement of six feet, with side walls not less than\n5 1/2 feet in height."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(6) ",
											"content": [
												{
													"text": "Front yards."
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "Each building shall have a minimum front yard\ndepth of 22 feet on all interior streets. On a corner lot, a front\nyard shall be required on each interior street. The front yard on\nthe narrower street frontage shall be a minimum of 15 feet; the other\nstreet frontage shall be a minimum of 22 feet. Such front yards shall\nbe measured to the face of the curb. No building shall front on an\nexterior street."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "Notwithstanding anything herein to the contrary,\nif no driveway or other parking area is provided in front of a unit\nor if a driveway of no more than 28 feet in length and no less than\n22 feet in length is provided in conjunction with a carport, the minimum\nfront yard depth for such unit shall be 15 feet. However, no more\nthan two units on the same street, each having a front yard depth\nof less than 22 feet, including units on corner lots with permissible\nfifteen-foot front yards, may be situated within 100 feet of each\nother, and both of such units shall be situated at least 100 feet\nfrom any other unit on the same street having a front yard depth of\nless than 22 feet. Said one-hundred-foot distance shall be measured\nalong the center line of such street between two perpendicular lines,\none each drawn from such street to the point on the perimeter wall\nof each such unit closest to the other unit from which the hundred-foot\ndistance must be maintained."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(7) ",
											"content": [
												{
													"text": "Rear yards and side yards. Each building shall have\na minimum rear yard of 15 feet and a minimum side yard of 12 1/2\nfeet. The rear and side yards for buildings abutting exterior streets\nshall be measured from the building to the property line and shall\nnot include the Village right-of-way. Notwithstanding anything herein\nto the contrary, when any such rear or side yard adjoins land in a\nbusiness district not used for cluster development as provided herein,\nsuch rear or side yard shall be a minimum of 25 feet, and when any\nsuch rear or side yard adjoins a structure, including a fence, used\nfor recreational purposes in a cluster development, such rear or side\nyard shall have a minimum distance of 50 feet."
												}
											]
										},
										{
											"number": "(8) ",
											"content": [
												{
													"text": "Minimum distance to business buildings. Each building shall have a minimum distance of 60 feet from business buildings; for the purpose of this Subsection B(8), a loading platform shall not be deemed a part of a business building."
												}
											]
										},
										{
											"number": "(9) ",
											"content": [
												{
													"text": "Minimum distance to commercial lots and roadways.\nEach building shall have a minimum distance of 30 feet from commercial\nparking lots and commercial roadways. Landscaped buffer areas in commercial\nparking lots and along commercial roadways may be included in said\n30 feet."
												}
											]
										},
										{
											"number": "(10) ",
											"content": [
												{
													"text": "Maximum length. No building shall exceed 300\nfeet in length unless the rear yard of such building abuts an exterior\nstreet, in which case such building may exceed 300 feet in length,\nbut in no event shall it exceed 335 feet in length. However, there\nshall be no more than one such building in excess of 300 feet in length\nfor the first 15 acres of site area and one additional such building\nfor each additional 15 acres of site area or any lesser portion thereof.\nNo more than four contiguous units shall be placed so that the foundation\nline is in a straight-line extension."
												}
											]
										},
										{
											"number": "(11) ",
											"content": [
												{
													"text": "Walkways. No common area or public passageway\nthrough a building shall be less than 25 feet in width."
												}
											]
										},
										{
											"number": "(12) ",
											"content": [
												{
													"text": "Minimum distance. There shall be a minimum distance\nof 25 feet between buildings."
												}
											]
										},
										{
											"number": "(13) ",
											"content": [
												{
													"text": "Access. Every dwelling unit shall have access\nto a street, court or walkway."
												}
											]
										},
										{
											"number": "(14) ",
											"content": [
												{
													"text": "Parking. There shall be provided on the site\nat least 2.25 off-street parking spaces for each dwelling unit on\nthe site. All such parking spaces shall be restricted to the parking\nof private passenger cars. No parking area for the parking of four\nor more vehicles shall be constructed within 15 feet of the closest\nwall of any dwelling unit unless such wall contains no doors or windows\non the first floor, in which case such distance may be less than 15\nfeet, but in no event shall such distance be less than 10 feet."
												}
											]
										},
										{
											"number": "(15) ",
											"content": [
												{
													"text": "Streets, curbs and sidewalks."
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "All streets, curbs and sidewalks provided on the site plan shall be constructed at the cost of the applicant, pursuant to the minimum standards set forth in Chapter 300, Articles II and III. Street width shall be a minimum of 30 feet between the curblines. Simultaneously with the approval of the conditional use permit, the applicant and owner shall execute, in form satisfactory to the Village Attorney, an irrevocable offer of dedication to all streets, together with a ten-foot right-of-way along each side of such street."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "In the alternative, in the event that the applicant\ndesires to maintain all interior streets as private streets, the applicant\nshall submit to the Board of Trustees covenants and restrictions,\nin such recordable form as shall be approved by the Village Attorney,\nproviding that:"
																},
																{
																	"content": [
																		{
																			"number": "[1] ",
																			"content": [
																				{
																					"text": "The owners of the site shall maintain, repair,\nclean and remove snow from such private streets and perform such other\nwork as shall be required, including the erection and maintenance\nof street and safety signs and lighting."
																				}
																			]
																		},
																		{
																			"number": "[2] ",
																			"content": [
																				{
																					"text": "In the event of a breach of such covenants and\nrestrictions, the Village shall have the right to enter upon such\nprivate roads and to perform such maintenance and repair as may be\nnecessary and proper to ensure the safe passage thereover and to levy\na special assessment against all of the land served by such private\nroads for reimbursement of all of the costs incurred therein."
																				}
																			]
																		},
																		{
																			"number": "[3] ",
																			"content": [
																				{
																					"text": "There shall be no parking allowed on either\nside of any such street; parking may be allowed on one side of any\nstreet which shall have a minimum width of at least 30 feet, subject\nto the approval of the Board of Trustees; and no parking shall be\nallowed on any street less than 30 feet in width. The Village shall\nhave the right to enforce such traffic regulation in order to protect\nthe safety and welfare of the residents of the site."
																				}
																			]
																		},
																		{
																			"number": "[4] ",
																			"content": [
																				{
																					"text": "Said covenants and restrictions shall run to\nand inure to the benefit of the Village and shall not be amended,\nmodified or extinguished except with the consent of the Board of Trustees."
																				}
																			]
																		}
																	]
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "Upon the filing of such covenants and restrictions,\nthe width of such said private streets which are dead ends and which\ndo not exceed 300 feet in length, measured from the intersecting street\nnearest the dead end, may be reduced from 30 feet to a width which\nis not less than 24 feet between the dead end and such intersecting\nstreet. Notwithstanding the foregoing, if two such private streets\nwould be dead ends except for the fact that they are connected by\na third street and such third street is less than 200 feet in length,\ndoes not intersect with any other street and intersects with both\nof such streets within 100 feet from their dead end, then and in that\nevent all three of said streets may be reduced from 30 feet to a width\nwhich is not less than 24 feet. In no event, however, shall any dwelling\nunit be more than 300 feet along the roadway from an interior street\nat least 30 feet in width; and in no event shall more than 30% of\nthe total roadbeds of all the interior streets have a width of less\nthan 30 feet."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(16) ",
											"content": [
												{
													"text": "Recreation and parks."
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "Adequate and suitable area shall be provided\nfor public recreation and parks. The minimum area to be dedicated\nto the Village for such purposes shall not be less than 5% of the\nentire area as shown on the site plan for which the conditional use\npermit is sought. The minimum area to be dedicated to the Village\nshall not include any recreation or park area not open to the public."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "If the Board of Trustees determines that a suitable\npark or parks of adequate size cannot be properly located within the\nsubject area or is otherwise not practical, the Board of Trustees\nmay require as a condition to approval of any conditional use permit\na payment to the Village of a sum to be determined by the Board of\nTrustees after consultation with an appraiser appointed to determine\nsuch sum by the Board of Trustees, which sum shall constitute a trust\nfund to be used by the Board of Trustees exclusively for neighborhood\npark, playground or recreation purposes, including the acquisition\nof land."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "At the option of the applicant, the applicant\nmay, in lieu of paying said sum, simultaneously with the approval\nof a conditional use permit, post a bond in a form approved by the\nVillage Attorney to ensure the payment of said sum or such lesser\nsum as may be finally determined by a court of competent jurisdiction\nif the sum determined by the Board of Trustees is challenged in a\nNew York State court of competent jurisdiction within 30 days from\nthe date the conditional use permit is granted."
																}
															]
														}
													]
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Accessory structures and uses."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "All outdoor pools shall comply with the following:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "There shall be no more than one swimming pool and one wading pool, which shall be of below-ground type and constructed in accordance with § 345-41 of the Code of the Village; such pools shall comply with all rules and regulations of the Department of Health of the County of Nassau for public pools."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "Such swimming pools or wading pools and any\nand all decorative pools, including drainage pools, shall be shown\non the site plan and shall be permitted by the Board of Trustees upon\na finding that such pools and ancillary equipment facilities will:"
																},
																{
																	"content": [
																		{
																			"number": "[1] ",
																			"content": [
																				{
																					"text": "Not adversely affect the public health, safety\nand general welfare."
																				}
																			]
																		},
																		{
																			"number": "[2] ",
																			"content": [
																				{
																					"text": "Be limited to use by members and guests of the\ncluster development."
																				}
																			]
																		},
																		{
																			"number": "[3] ",
																			"content": [
																				{
																					"text": "Not depreciate the value of the property in\nthe area immediately adjoining the land being so used."
																				}
																			]
																		},
																		{
																			"number": "[4] ",
																			"content": [
																				{
																					"text": "Not alter the essential character of the neighborhood."
																				}
																			]
																		},
																		{
																			"number": "[5] ",
																			"content": [
																				{
																					"text": "Not be located so as to be visible from adjoining\nresidential properties nor interfere with the use and enjoyment of\nadjoining properties."
																				}
																			]
																		}
																	]
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "For the purposes of this Subsection C, lakes, ponds and sumps shall not be considered \"outdoor pools.\""
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Outdoor tennis courts shall be considered accessory\nstructures and subject to the following requirements:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "There shall be no more than one tennis court\nprovided for the first 100 dwelling units and one additional tennis\ncourt for each additional 100 dwelling units or any lesser portion\nthereof."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "No lighting shall be installed in connection\ntherewith which shall direct any rays beyond the tennis court or any\nsurrounding recreational or parking area."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "All tennis courts shall be completely enclosed\nwith a chain link fence which shall be constructed and maintained\nin accordance with the following specifications so long as the tennis\ncourts remain in existence:"
																},
																{
																	"content": [
																		{
																			"number": "[1] ",
																			"content": [
																				{
																					"text": "Height shall be not less than 10 feet nor more\nthan 12 feet above the playing surface."
																				}
																			]
																		},
																		{
																			"number": "[2] ",
																			"content": [
																				{
																					"text": "Fabric shall be not less than No. 9 gauge steel,\nhaving a uniform square mesh with two inches between parallel sides,\nand the mesh shall have a green plastic coating."
																				}
																			]
																		},
																		{
																			"number": "[3] ",
																			"content": [
																				{
																					"text": "End and corner posts shall be two-and-one-half-inch\n1D galvanized pipe with a wall of thickness of 0.203 of an inch."
																				}
																			]
																		},
																		{
																			"number": "[4] ",
																			"content": [
																				{
																					"text": "Line posts shall be two-inch 1D galvanized pipe\nwith a wall thickness of 0.154 of an inch."
																				}
																			]
																		},
																		{
																			"number": "[5] ",
																			"content": [
																				{
																					"text": "Horizontal lines. There shall be three horizontal\nrails running between the vertical posts, situated at the top, center\nand bottom of the chain link fabric. These rails shall be one-and-one-fourth-inch\n1D galvanized pipe having a wall thickness of 0.14 of an inch."
																				}
																			]
																		},
																		{
																			"number": "[6] ",
																			"content": [
																				{
																					"text": "Distance between posts shall be not more than\n10 feet."
																				}
																			]
																		}
																	]
																}
															]
														},
														{
															"number": "(d) ",
															"content": [
																{
																	"text": "All tennis courts and the fencing surrounding\nthe same shall be completely screened from adjoining properties by\na living screen of coniferous trees. Said trees shall be at least\neight feet in height when planted and shall be planted five feet on\ncenter along and four feet from the fence surrounding the court on\nall sides of the court not immediately adjoining other tennis courts\non the same lot. Said coniferous screening shall consist of Canadian\nhemlock on or alternate approved by the Board of Trustees and shall\nbe maintained so long as the tennis court remains in existence."
																}
															]
														},
														{
															"number": "(e) ",
															"content": [
																{
																	"text": "The height of the playing surface of the tennis\ncourt shall not be above the existing mean level of the ground immediately\nsurrounding the court area prior to construction of the court."
																}
															]
														},
														{
															"number": "(f) ",
															"content": [
																{
																	"text": "No tennis court shall be constructed or maintained\nso as to permit any drainage water to flow onto adjacent properties\nor public streets."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Swimming pools, wading pools and tennis courts shall\nbe used only at such hours as will not interfere by reason of lighting\nor noise with the neighbors' reasonable use of their premises."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "Application requirements."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "An application (10 copies) for a conditional use permit\nfor a cluster development in the Business GG District shall be in\nwriting and filed with the Village Administrator and shall be accompanied\nby a plan (10 copies) which shall conform to the regulations and procedures\nof this section. In addition to any other requirements, the application\nshall be made and verified by either all of the fee owners, all of\nthe contract vendees or all of the lessees of all premises described\nin the application. If made by all of the contract vendees or lessees,\nthe consent of the owners of the fee shall accompany the application,\nall of which shall be duly acknowledged before a notary public, consenting\nto and adjoining in the request for approval of the application. An\naffidavit of title to all the property included in the application\nshall be submitted, showing the owners, lessees, mortgagees and vendees\nand any encumbrances or limitations thereon. The application shall\nalso contain a written statement which sets forth the proposed treatment\nof any open land section of the site, the proposed method or type\nof ownership thereof and the designation of responsibility for its\nmaintenance."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "The application shall also contain the projected initiation\nand completion dates for the proposed construction, as well as information\ndescribing the applicant's past performance and financial ability\nto complete said construction within such period of time."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "The application shall fully set forth a complete plan\nand schedule for developing the overall project."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "Upon the filing of an application, there shall be\ndeposited with the Village Administrator a sum of not less than 1/10\nof 1% of the estimated cost of the buildings, improvements and facilities\nshown on the site plan, to be applied by the Village to the expense\nincurred by the Village in connection with the processing and review\nof the application, including prior informal submissions and reviews,\nwhich shall include items such as but not necessarily limited to:\nplanning, legal, advertising and public notices (by both publication\nand mail), architectural costs, engineering costs, stenographer minutes,\ninspection fees and recording fees, changes in maps and other similar\nexpenses of the Village or any of its commissions, boards, agencies\nor employees. The fee may be used in part to cover the cost of planning\nand environmental reviews under local, county or state law. Any excess\nafter payment of such expenses by the Village shall be refunded to\nthe applicant. In the event that such sum is insufficient to cover\nsaid expenses, the additional sum required shall be paid by the applicant\nto the Village Administrator before authorization is given for the\npublic hearing. In no event, however, shall the applicant be required\nto deposit with the Village a sum in excess of 1/2 of 1% of the estimated\ncost of the buildings, improvements and facilities shown on the site\nplan."
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "The application shall be accompanied by a general\nsite plan, in triplicate, providing sufficient information to allow\nthe Board of Trustees to meet the review requirements of this section.\nSaid site plan shall be prepared at a scale of not less than one inch\nequals 100 feet, with supporting maps at such scales as necessary\nto clearly indicate the following:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "The topography of the site, existing major trees\nand landscape and environmental features and any existing structures."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "Existing property boundary lines, setbacks and\nlocation of proposed structures."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "The outline of typical unit perimeters, including\nelevation of basement and cellar areas at doorway openings, first\nfloor elevations and roof elevations."
																}
															]
														},
														{
															"number": "(d) ",
															"content": [
																{
																	"text": "The proposed topography, including elevations\nat corners of buildings, parking areas and grades of other significant\nconstruction areas."
																}
															]
														},
														{
															"number": "(e) ",
															"content": [
																{
																	"text": "The height of typical buildings and structures."
																}
															]
														},
														{
															"number": "(f) ",
															"content": [
																{
																	"text": "The location, nature and ownership of all proposed\nstreets and parking areas."
																}
															]
														},
														{
															"number": "(g) ",
															"content": [
																{
																	"text": "Designated parking spaces."
																}
															]
														},
														{
															"number": "(h) ",
															"content": [
																{
																	"text": "Adjoining streets, access roads and walkways."
																}
															]
														},
														{
															"number": "(i) ",
															"content": [
																{
																	"text": "The method of vehicular and pedestrian ingress\nand egress, including necessary off-site improvements and emergency\naccess."
																}
															]
														},
														{
															"number": "(j) ",
															"content": [
																{
																	"text": "Proposed landscaping, including type and size\nof trees, recreation facilities, fencing and exterior lighting."
																}
															]
														},
														{
															"number": "(k) ",
															"content": [
																{
																	"text": "The proposed grading of the plot, to include\nthe disposal of surface water drainage and to indicate by report or\nmap the effect of development on surrounding area drainage patterns."
																}
															]
														},
														{
															"number": "(l) ",
															"content": [
																{
																	"text": "Specifications of pavement, including the subbase\nand curbing."
																}
															]
														},
														{
															"number": "(m) ",
															"content": [
																{
																	"text": "A table showing the following data, both required\nand proposed: site size, number of units, land area, parking spaces,\narea coverage, height and common facilities."
																}
															]
														},
														{
															"number": "(n) ",
															"content": [
																{
																	"text": "General methods of providing for collection\nand disposal of stormwater runoff and for handling sanitary sewage,\nrefuse and other waste."
																}
															]
														},
														{
															"number": "(o) ",
															"content": [
																{
																	"text": "Locations and plans for individual unit retention and storage of garbage, waste and refuse in conformity with Chapter 174, Article III."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(6) ",
											"content": [
												{
													"text": "If the applicant determines to construct the proposed units in two or more sections, the applicant shall submit detailed site plans for each section, including on such site plans the information set forth in Subsection D(5) hereinabove, as well as temporary traffic routes and culs-de-sac, if necessary, and such other information as the Planning Commission or Board of Trustees may require."
												}
											]
										},
										{
											"number": "(7) ",
											"content": [
												{
													"text": "In addition, the general site plan shall be accompanied\nby sketches showing proposed architectural treatment, single-line\nfloor plans showing layout of all typical units and the substance\nof all proposed restrictions and the text of all filed restrictions\non the use of the land and buildings."
												}
											]
										},
										{
											"number": "(8) ",
											"content": [
												{
													"text": "If a cooperative, condominium or other form of development\nis proposed which would entail any form of common association or corporate\nownership of common areas, the applicant shall submit a detailed statement\noutlining the structure of the proposed corporation or association,\nincluding a description of the proposed management and ownership of\nthe various elements, including dwelling units, common areas, recreational\nfacilities, parking facilities, streets, sanitary sewers, stormwater\nsewers, street, recreational and common area lighting; ground, building\nand facility maintenance; and recharge basin, sump or other water-holding\narea, as well as copies of all proposed and actual prospectuses offering\nstatements, declarations, bylaws and other papers prepared pursuant\nto Real Property Law Article 9-B or any successor statute thereto."
												}
											]
										},
										{
											"number": "(9) ",
											"content": [
												{
													"text": "The applicant shall submit any other information deemed\nby the Board of Trustees or the Planning Commission in its discretion\nto be necessary to a reasonable determination of the application or\nverification by independent professionals, such as but not limited\nto planners, engineers or architects, including plans for the location,\nmaintenance and repair of all common facilities. The provision of\nsuch information shall be at the cost of the applicant."
												}
											]
										},
										{
											"number": "(10) ",
											"content": [
												{
													"text": "The applicant shall also submit a radius map\nextending a distance of 300 feet from the site, showing all buildings\nwithin said radius, present owners, present uses and present zoning."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "Application procedure."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Upon receipt of the application for the conditional\nuse permit, the Board of Trustees shall refer such application to\nthe Planning Commission of the Village for its consideration. The\nPlanning Commission shall consider all the requirements hereinabove\nprovided for by this section and, in addition thereto, the following:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "Whether the proposed development is of such\ncharacter, size, shape, location, design and site layout:"
																},
																{
																	"content": [
																		{
																			"number": "[1] ",
																			"content": [
																				{
																					"text": "To be appropriate to and in harmony with the\nsurrounding properties;"
																				}
																			]
																		},
																		{
																			"number": "[2] ",
																			"content": [
																				{
																					"text": "Will provide, to the maximum extent practicable,\nconsistent with economic and other essential considerations of Village\npolicy, the most desirable residential environment; and"
																				}
																			]
																		},
																		{
																			"number": "[3] ",
																			"content": [
																				{
																					"text": "Will ensure, to the extent practicable, by street\ndesign, on-street parking and sidewalk construction and the size,\ntype and location of off-street parking facilities, fences, walls,\nlandscaping and other screening, lights and mechanical equipment,\nthe safety, health and welfare of the residents of the district, the\nresidents of the Village and the public at large."
																				}
																			]
																		}
																	]
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "Whether the proposed development will be hazardous\nto or in conflict with the immediate neighborhood by reason of traffic,\ncongregation of people, noise, lights, vibration or other factors\nof impact, inadequate off-street parking facilities or overburdening\nof existing sanitary or stormwater sewers or other utilities."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "Whether the proposed development, to the maximum\nextent practicable, consistent with social, economic and other essential\nconsideration of state policy, minimizes or avoids adverse environmental\neffects."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "The Planning Commission, within 14 days after the date the application is referred to it by the Board of Trustees, shall notify the applicant by certified mail, return receipt requested, that it is in receipt of the application and that either the application is complete or the application is incomplete, specifying the additional information needed in order for the application to be deemed complete. If the application is deemed incomplete and the submission of further information is thereby required, the Planning Commission, within 14 days after the date each further submission is filed with the Village Administrator, shall notify the applicant by certified mail, return receipt requested, that it is in receipt of such submission and whether or not such submission completes the application, and if not, specifying the additional information needed. In the event that the Planning Commission fails to notify the applicant within 14 days after the application is referred to it or within 14 days after any further submission is filed with the Village Administrator that the application is or still is incomplete, then and in the event the application shall be deemed complete as of the date of the referral or the last submission, as the case may be. Within 60 days after the date the Planning Commission receives a complete application, including a complete general site plan and any and all other information required pursuant to Subsection D(6) through (9) for site plan review, in writing, it shall report to the Board of Trustees, making recommendations for the approval, approval with modification or disapproval of the site plan. The time within which the Planning Commission must render its report may be modified by the Board of Trustees."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Upon receipt of the recommendations of the Planning\nCommission, the Board of Trustees shall fix a time within 20 days\nafter its receipt of such recommendations for a public hearing on\nthe application and shall deny or grant said application with such\nfurther modification as the Board of Trustees shall deem necessary\nand proper within 10 days after the closing of the public hearing.\nUpon the granting of such application, the Building Inspector shall\naccept and pass upon an application for building permits in conformity\ntherewith. However, no building permits shall be issued for any residential\nbuilding, except models, until all recreational areas (swimming pools,\ntennis courts, clubhouses and other recreational structures), parks\nand other amenities as shown on the site plan have been completed\nand until all utilities for such building have been installed and\nuntil a base of a road and curbs leading from the proposed building\nto an exterior street shall have been completed."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "F. ",
							"content": [
								{
									"text": "Bonding. Prior to the commencement of any work pursuant\nto a conditional use permit granted under this section, the applicant\nshall file with the Village Administrator a labor, material and performance\nbond in such amount and in such form as shall be approved by the Village\nAttorney to ensure the completion of all roads, sidewalks, stormwater\ndrainage, sanitary sewage transmission and disposal, electricity,\ngas, lights and telephone services and equipment and other utilities\nand all recreation areas, parks and other amenities as set forth in\nthe site plan, within three years from the issuance of said bond,\ntogether with an easement in such form as shall be approved by the\nVillage Attorney, granting permission to the Village to enter upon\nthe subject property to complete such work. Said three-year period\nmay be extended by resolution of the Board of Trustees with the consent\nof the bonding company."
								}
							]
						},
						{
							"number": "G. ",
							"content": [
								{
									"text": "Certificates of occupancy."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "No final certificate of occupancy shall be issued\nfor any unit authorized pursuant to this section until all roads,\nsidewalks, stormwater drainage, sanitary sewage transmission and disposal,\nelectricity, gas, lighting and telephone services and equipment and\nother utilities to that entire building have been installed, completed\nand operative and all Health Department and other municipal agency\nand district approvals have been submitted to the Village, in writing,\nand all recreation areas, parks and other amenities have been completed\nas set forth in the site plan."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Notwithstanding the provisions of § 154-30, no temporary certificate of occupancy shall be issued by the Building Inspector unless the developer deposits 5% of the selling price of the unit with an attorney or lending institution designated by the purchaser and approved by the developer as security that a final certificate of occupancy shall be obtained by the developer within six months from the date of issuance of the temporary certificate of occupancy. If within six months from the date of issuance of the temporary certificate of occupancy the final certificate of occupancy is not issued, said escrow shall be used for the benefit of the purchaser to obtain a final certificate of occupancy. The balance of such escrow, if any, after obtaining the final certificate of occupancy, shall be returned to the developer. No temporary certificate of occupancy shall be valid for a period in excess of six months, and no temporary certificate of occupancy shall be renewed without the approval of the Board of Trustees."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "H. ",
							"content": [
								{
									"text": "Conditions. In approving any application for a conditional\nuse permit under this section, the Board of Trustees shall impose\nsuch reasonable conditions as it deems necessary to ensure that the\ncluster development approved by it is completed expeditiously and\nin accordance with the approved site plan and in such manner as will\nnot cause an undue burden on Village facilities or a nuisance to Village\nresidents."
								}
							]
						},
						{
							"number": "I. ",
							"content": [
								{
									"text": "Reservation of power. In order to protect the interests\nof the Village in implementing a cluster development, the Board of\nTrustees reserves to itself the power to modify specific requirements\nof this section or any other provisions of the Village ordinances\nto promote the viability or aesthetic appearance of the development\nin furtherance of the purpose of this action."
								}
							]
						},
						{
							"number": "J. ",
							"content": [
								{
									"text": "Public hearing."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "The Board of Trustees shall hold a public hearing\nprior to its grant, denial or modification of any application for\na conditional use permit under this section or of any request for\na modification of the specific requirements of this section or of\nany other provisions of the Village ordinances with regard to a past,\npresent or future application under this section."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "At least 10 days prior to such hearing, the Village\nAdministrator shall, at the applicant's expense:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "Give public notice of the hearing in the official\nnewspaper of the Village, if any, or if none, in a newspaper having\ngeneral circulation within the Village."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "Supply public notices of the hearing to the\nHighway Department for posting in designated places within the Village."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "Mail a notice of the hearing to each of the\nowners of property within a radius of 300 feet of the site. A list\nof the names and mailing addresses of such property owners, together\nwith a designation, by reference to the section, block and lot on\nthe Nassau County Land and Tax Map, of the property owned by such\npersons, shall be provided by the applicant to the Village Administrator\nat least four business days prior to the required date for mailing."
																}
															]
														}
													]
												}
											]
										}
									]
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 345-25",
			"title": "Prohibited uses.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "In any district, no building or premises shall be\nused and no building shall be erected or structurally altered which\nis arranged, intended or designed to be used for any of the following\nuses:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Manufacture of explosives, storage of explosives in\nbulk."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Chlorine or hydrochloric acid, nitric, picric or sulfuric\nacid manufacture; smelting of copper, tin, zinc, lead or iron ore."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Ammonia, bleaching powder or other chemical plants\nemitting corrosive or toxic fumes carrying beyond the limits of the\npremises."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "Petroleum or kerosene refining or distillation or\nderivation of by-products."
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "Distillation of bones; fat rendering and manufacturing\nof tallow, grease or oils; offal or dead animal reduction; stockyards;\nfertilizer manufacture; or hair manufacture."
												}
											]
										},
										{
											"number": "(6) ",
											"content": [
												{
													"text": "Glue, size or gelatin manufacture where the process\nincludes the refining or recovering of products from fish, animal\nrefuse or offal."
												}
											]
										},
										{
											"number": "(7) ",
											"content": [
												{
													"text": "Boilermaking; locomotive manufacture; railway car\nmanufacture; steel furnace, blooming or rolling mill."
												}
											]
										},
										{
											"number": "(8) ",
											"content": [
												{
													"text": "Cement, lime, gypsum or plaster of paris manufacture."
												}
											]
										},
										{
											"number": "(9) ",
											"content": [
												{
													"text": "Garages (other than residential use), gasoline or\nfilling stations and motor vehicle repair shops in residential districts."
												}
											]
										},
										{
											"number": "(10) ",
											"content": [
												{
													"text": "Any manufacturing or industrial process emitting dust, odor, gas fumes, noise or vibration comparable in character or in aggregate amount to that of any use specified in Subsection A(1) through (8)."
												}
											]
										},
										{
											"number": "(11) ",
											"content": [
												{
													"text": "Coin-operated dry-cleaning establishment, meaning\nthe cleaning of textiles, fabrics, garments or other articles by the\nuse of any solvent other than water in a dry-cleaning machine designed\nto be used or used by the general public. For the purpose of this\ndefinition, the term \"used by the general public\" shall be deemed\nto refer to the insertion of such textiles, fabrics, garments or other\narticles into a dry-cleaning machine or the removal of the same from\nsuch unit by a person other than an employee of the business or person\nowning and operating such establishment."
												}
											]
										},
										{
											"number": "(12) ",
											"content": [
												{
													"text": "Coin-operated dry-cleaning machine, meaning\nthe machinery, unit or equipment in which the business of coin-operated\ndry cleaning shall be conducted."
												}
											]
										},
										{
											"number": "(13) ",
											"content": [
												{
													"text": "The sale of marijuana is expressly prohibited in any business\nestablishments in the Village. This prohibition shall include medical\nmarijuana distribution facilities licensed through the New York State\nDepartment of Health.[Added 2-8-2016 by L.L.\nNo. 1-2016]"
												}
											]
										},
										{
											"number": "(14) ",
											"content": [
												{
													"text": "Establishment, facility, shop, office, parlor, business or other\nnonresidential premises, the primary or ancillary use of which includes\nor is intended to include smoking of substances through one or more\nhookah pipes (also commonly referred to as \"hookah,\" \"water pipe,\"\n\"shisha,\" \"narghile,\" or \"bong\") or any other similar equipment or\ndevice.[Added 2-8-2016 by L.L.\nNo. 1-2016]"
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "The erection of playhouses or similar structures shall\nbe prohibited in residential districts."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 345-26",
			"title": "Nonconforming uses.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Scope of term. Any use of property existing on June\n29, 1937, that does not conform to the regulations prescribed in the\npreceding sections of this article shall be deemed a nonconforming\nuse."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Continuance. A nonconforming use may be continued,\nsubject to such regulations as to the maintenance of premises and\nconditions of operation as may in the judgment of the Zoning Board\nof Appeals be reasonably required for the protection of adjacent property."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Extension. A nonconforming use shall not be extended\nby the extension of a use to any portion of a building, which portion\nwas not arranged or designed for such nonconforming use on June 29,\n1937."
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "Reconstruction or alteration of building. A building\narranged, designed or devoted to a nonconforming use on June 29, 1937,\nmay not be reconstructed or structurally altered to an extent exceeding\nin cost 25% of the fair value of the building unless the building\nis changed to a conforming use."
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "Nonconforming billboard. A nonconforming billboard\nwhich is damaged by the elements to such an extent that its supporting\nmembers are broken shall be deemed to have been destroyed and shall\nnot be reconstructed."
								}
							]
						},
						{
							"number": "F. ",
							"content": [
								{
									"text": "Nonconforming filling station. A nonconforming filling\nstation shall not be extended by the installation of additional pumps\nor other devices for dispensing fuel."
								}
							]
						},
						{
							"number": "G. ",
							"content": [
								{
									"text": "Change of nonconforming use. A nonconforming use shall\nnot be changed except to a conforming use. A nonconforming use, if\nchanged to a conforming use, may not thereafter be changed back to\na nonconforming use."
								}
							]
						}
					]
				}
			]
		}
	]
}