{
	"url": "http://ecode360.com/9148563",
	"paras": [
	    {
			"paragraph": "§ 200-17",
			"title": "Residence R-M Districts.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Uses. In R-M Districts, no land, building or structure\nshall be used and no building or structure shall be erected or altered\nto be used for any purpose other than:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Any use permitted in R-40, R-20, R-12, R-8 and R-6\nDistricts.[Amended 10-16-1989 by L.L. No. 6-1989]"
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "A group of multifamily dwellings on a single plot, subject to Subsection B hereof, and accessory uses customarily incidental thereto, of the character and subject to the limitations set forth in § 200-16A(11)."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Other use regulations. In R-M Districts, the other\nuse regulations shall be the same as those provided for R-40, R-20,\nR-12, R-8 and R-6 Districts and as follows:[Amended 10-16-1989 by L.L. No. 6-1989]"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Multifamily dwellings shall be subject to the following:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "Buildings shall be so grouped that each building\nshall face for the full length of its front facade either upon an\nexisting street or upon an open space which in its least dimension\nshall be not less than 75 feet. Where the rear elevations of the principal\nbuildings are built parallel to each other or within 30° of parallel,\nthe average distance between their long dimensions shall be not less\nthan 60 feet. Each building, whether principal or accessory, shall\nbe at least 30 feet distant from any other building in the group,\nwhich distance shall be measured in a straight line between the points\nof the buildings which are nearest each other."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "No basement or cellar shall be occupied as living\nor sleeping quarters, except for a janitor's apartment in the basement."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "Not more than 50% of the total floor area of\nany dwelling unit shall be located above the second-floor level."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Minimum floor area for multifamily. Each dwelling\nunit shall contain a minimum of 500 square feet of floor area, exclusive\nof public halls, stairs or other public space, for any dwelling unit\nhaving 2 1/2 rooms or less. The minimum floor area shall be increased\n200 square feet for each additional half room or full room. For the\npurpose of this subsection, a \"half room\" shall be any space occupied\nas a kitchen, kitchenette, dining alcove, dining foyer or combination\nthereof, or for a similar purpose, having a floor area less than 120\nsquare feet; a \"room\" shall be any space used for any purpose or combination\nof purposes, other than a bathroom, having a floor area of 120 square\nfeet or more, except that where a space in excess of 200 square feet\nis partially divided by a partition for combination use thereof, such\nspace shall be counted as 1 1/2 rooms."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Assisted-living residence, subject to approval by\nthe Board of Trustees, except that the minimum floor area for each\nassisted-living unit shall be 400 square feet and that the minimum\nplot area shall be not less than 2,000 square feet per assisted-living\nunit.[Amended 6-1-2006 by L.L. No. 1-2006[1]]"
												},
												{
													"footnote": "[1]\nEditor's Note: This local law also renumbered\nformer Subsection B(3) as B(4).\n"
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "Any use not permitted hereinabove shall be prohibited.[2]"
												},
												{
													"footnote": "[2]\nEditor's Note: Former Subsection C, Off-street\nregulations, which immediately followed this subsection, was repealed\n10-16-1989 by L.L. No. 6-1989.\n"
												}
											]
										}
									]
								}
							]
						}
					]
				}
			]
		}
	]	
}		