{
	"url": "http://ecode360.com/9148416",
	"paras": [
		{
			"paragraph": "§ 200a",
			"title": "Schedule of Regulations.",
			"content": [
				{
					"text": "The following regulations shall apply in an R-M District:"
				},
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Minimum Plot Area: 6000 square feet"
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Minimum Plot Width: 1-family: 60 feet Multifamily: 100 feet"
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Maximum Building Coverage of Plot: 25%"
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "Maximum Height of Building: 2.5 stories, 35 feet"
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "Rear Yard Setback: 1-Family: 25, but need not exceed 25% of depth of plot, providedthat on a corner plot not exceeding 110 feet in depth, the rear yard need not exceed 15 feet in depth. Multifamily: 25 but not more than 25% of plot depth"
								}
							]
						},
						{
							"number": "F. ",
							"content": [
								{
									"text": "Minimum Floor Area: 1-family: 1400 square feet. Multifamily: subject to § 200-17B "
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 200-7",
			"title": "Uses.",
			"content": [
				{
					"text": "No building or structure shall hereafter be erected and no existing building or structure shall be altered or enlarged, nor shall any land, building or structure be used, for any purpose other than one which is included among the uses listed in Article V as permitted in the district in which such building, structure or land is located, nor in any manner contrary to any of the requirements specified in Article V."
				}
			]
		},
		{
			"paragraph": "§ 200-8",
			"title": "Height and bulk.",
			"content": [
				{
					"text": "No building or structure shall hereafter be erected, reconstructed or altered to exceed the maximum FAR or the height limit designated in the Schedule of Regulations contained in Article V for the district in which such building is located."
				}
			]
		},
		{
			"paragraph": "§ 200-9",
			"title": "Area and open space.",
			"content": [
				{
					"text": "No building or structure shall hereafter be erected, nor shall any existing building or structure be altered, nor shall any open space contiguous to any building be encroached upon or reduced in any manner, except in conformity with the yard, plot width and area, percentage of plot coverage by building area, off-street parking space, off-street loading space and other space and area regulations designated in Articles V and VIII and in said schedule for the district in which such building or space is located and designated on the Setback Map which is a part of this chapter,[1] provided that the minimum plot width and plot area regulations\nshall not apply to any plot having less than the required width or\narea at the time of the adoption of this chapter or of any amendment\nthereof increasing the width or area required for such plot and held\nat that time and continuously thereafter in separate ownership from\nthat of adjoining land, but such plot shall not be reduced in width\nor area and all other regulations prescribed in this chapter for the\ndistrict in which such plot is situated shall apply thereto."
				},
				{
					"footnote": "[1]\nEditor's Note: The Setback Map is included at the end of this chapter.\n"
				}
			]
		},
		{
			"paragraph": "§ 200-10",
			"title": "Off-street parking and loading.",
			"content": [
				{
					"text": "Off-street parking space and off-street loading space shall be provided as specified in Articles V through X, and such spaces shall be provided with necessary passageways and driveways appurtenant thereto and giving access thereto, and all such space, together with such passageways and driveways, shall be deemed to be required space on the plot on which the same is situated and shall not thereafter be encroached upon or reduced in any manner except as otherwise provided in § 200-61."
				}
			]
		},
		{
			"paragraph": "§ 200-11",
			"title": "Reduction of plot area.",
			"content": [
				{
					"text": "No plot area shall be reduced or diminished\nso that the FAR prescribed in this chapter shall be exceeded or the\nminimum land area per dwelling unit, yards or other open spaces thereon\nshall be smaller than as prescribed by this chapter."
				}
			]
		},
		{
			"paragraph": "§ 200-12",
			"title": "Determination of plot area in C-R District.",
			"content": [
				{
					"text": "In computing the plot area to determine the\nFAR in the C-R District, no private street or roadway which gives\naccess to the plot or over which other property owners in the general\narea have rights-of-way shall be included in the plot area."
				}
			]
		},
		{
			"paragraph": "§ 200-13",
			"title": "Yard limitations.",
			"content": [
				{
					"text": "No yard or other open space provided on one\nplot for the purpose of complying with the provisions of this chapter\nshall be considered as providing a yard or open space required on\nany other plot."
				}
			]
		},
		{
			"paragraph": "§ 200-14",
			"title": "Prior construction.",
			"content": [
				{
					"text": "Nothing contained in this chapter shall require\nany change in the plans, construction or designated use of a building\nor structure, a substantial portion of which was lawfully constructed\nat the date this chapter or any amendment thereof affecting the same\ntakes effect and which construction is completed within one year after\nsuch date."
				}
			]
		},
	    {
			"paragraph": "§ 200-17",
			"title": "Residence R-M Districts.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Uses. In R-M Districts, no land, building or structure\nshall be used and no building or structure shall be erected or altered\nto be used for any purpose other than:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Any use permitted in R-40, R-20, R-12, R-8 and R-6\nDistricts.[Amended 10-16-1989 by L.L. No. 6-1989]"
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "A group of multifamily dwellings on a single plot, subject to Subsection B hereof, and accessory uses customarily incidental thereto, of the character and subject to the limitations set forth in § 200-16A(11)."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Other use regulations. In R-M Districts, the other\nuse regulations shall be the same as those provided for R-40, R-20,\nR-12, R-8 and R-6 Districts and as follows:[Amended 10-16-1989 by L.L. No. 6-1989]"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Multifamily dwellings shall be subject to the following:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "Buildings shall be so grouped that each building\nshall face for the full length of its front facade either upon an\nexisting street or upon an open space which in its least dimension\nshall be not less than 75 feet. Where the rear elevations of the principal\nbuildings are built parallel to each other or within 30° of parallel,\nthe average distance between their long dimensions shall be not less\nthan 60 feet. Each building, whether principal or accessory, shall\nbe at least 30 feet distant from any other building in the group,\nwhich distance shall be measured in a straight line between the points\nof the buildings which are nearest each other."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "No basement or cellar shall be occupied as living\nor sleeping quarters, except for a janitor's apartment in the basement."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "Not more than 50% of the total floor area of\nany dwelling unit shall be located above the second-floor level."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Minimum floor area for multifamily. Each dwelling\nunit shall contain a minimum of 500 square feet of floor area, exclusive\nof public halls, stairs or other public space, for any dwelling unit\nhaving 2 1/2 rooms or less. The minimum floor area shall be increased\n200 square feet for each additional half room or full room. For the\npurpose of this subsection, a \"half room\" shall be any space occupied\nas a kitchen, kitchenette, dining alcove, dining foyer or combination\nthereof, or for a similar purpose, having a floor area less than 120\nsquare feet; a \"room\" shall be any space used for any purpose or combination\nof purposes, other than a bathroom, having a floor area of 120 square\nfeet or more, except that where a space in excess of 200 square feet\nis partially divided by a partition for combination use thereof, such\nspace shall be counted as 1 1/2 rooms."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Assisted-living residence, subject to approval by\nthe Board of Trustees, except that the minimum floor area for each\nassisted-living unit shall be 400 square feet and that the minimum\nplot area shall be not less than 2,000 square feet per assisted-living\nunit.[Amended 6-1-2006 by L.L. No. 1-2006[1]]"
												},
												{
													"footnote": "[1]\nEditor's Note: This local law also renumbered\nformer Subsection B(3) as B(4).\n"
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "Any use not permitted hereinabove shall be prohibited.[2]"
												},
												{
													"footnote": "[2]\nEditor's Note: Former Subsection C, Off-street\nregulations, which immediately followed this subsection, was repealed\n10-16-1989 by L.L. No. 6-1989.\n"
												}
											]
										}
									]
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 200-31",
			"title": "Setback Map.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "In order to establish regulations as to the distances that buildings hereafter erected or altered shall be set back from street lines, which regulations are uniform for each district in that they are generally consistent with respect to the setbacks of existing buildings, the width of streets and the depths of plots, the setback distances required along each street and part thereof in the Village are indicated on a map entitled \"Setback Map,\" which map, properly identified, is on file in the office of the Village Clerk and is hereby adopted as a part of this chapter insofar as it indicates the aforesaid setback distances.[1] No part of any building hereafter erected or altered shall be nearer to any street line than the setback distance specified for the street or part thereof on which the plot whereon such building is situated abuts unless a permit therefor has been issued pursuant to § 200-66C."
								},
								{
									"footnote": "[1]\nEditor's Note: The Setback Map is included at the end of this chapter.\n"
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "The front yard setback in the R-40 and R-20 Districts shall be 50 feet, except where a greater setback has been established by the Setback Map."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 200-32",
			"title": "Performance standards.",
			"content": [
				{
					"text": "No use shall be permitted in any district, the\noperation of which would normally cause or result in:"
				},
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Dissemination of dust, smoke, gas, fumes or other\natmospheric pollutant beyond the boundaries of the parcel of land\non which the building in which such use is conducted is situated."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Dissemination of any noise, vibration, radiation or\nodor beyond the boundaries of the parcel of land on which such use\nis located."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Glare or flashing of lights in any manner that will\ncause hazard or annoyance to the public generally or to the occupants\nof neighboring property."
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "Hazard of fire or explosion."
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "Hauling of materials, goods or products to or from\nthe site of such use in a volume or manner materially incongruous\nwith the normal traffic on streets in the neighborhood."
								}
							]
						},
						{
							"number": "F. ",
							"content": [
								{
									"text": "Danger or hazard to the health, safety or comfort\nof the community or unreasonable disturbance or annoyance to the occupants\nof neighboring property."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 200-33",
			"title": "Uses to be enclosed.",
			"content": [
				{
					"text": "No use permitted in any H, P or C District, other than off-street parking facilities, shall be conducted in any open-front store, and there shall be no outdoor display or service of food or merchandise, unless otherwise authorized by the Board of Appeals pursuant to § 200-28A."
				}
			]
		},
		{
			"paragraph": "§ 200-34",
			"title": "Entrances.",
			"content": [
				{
					"text": "Every business or industrial establishment shall\nhave its main entrance on a public street or highway at least 35 feet\nin width, except as may otherwise be approved pursuant to § 200-25D\nor 200-29D. A municipal parking field or entrance thereto or exit\ntherefrom shall not be considered to be a public street or highway\nfor such purpose."
				}
			]
		},
		{
			"paragraph": "§ 200-35",
			"title": "Drive-in and vending uses.",
			"content": [
				{
					"text": "Unless authorized by the Board of Appeals, no\ndrive-in or walk-up window, vending machine or device for dispensing\ngoods or services, including without limitation laundromats and automatic\ncleaners and driers (other than mailboxes, night depositories or vending\nmachines within a building and customarily incidental to the permitted\nprincipal use), shall be constructed, installed or maintained in any\ndistrict."
				}
			]
		},
		{
			"paragraph": "§ 200-36",
			"title": "Dwelling frontage.",
			"content": [
				{
					"text": "No dwelling shall be erected to the rear of\nany building on the same plot except as permitted in R-M and R-A Districts."
				}
			]
		},
		{
			"paragraph": "§ 200-37",
			"title": "Parking and storage of vehicles and boats in residential districts.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Parking and storage of mobile residential vehicles."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "No automobile trailer, camper, mobile home, house\ntrailer, recreational vehicle, or other vehicle designed or outfitted\nwith sleeping accommodations and that has an overall length in excess\nof 20 feet, or an overall height in excess of 12 feet as measured\nfrom the ground to its highest point of vertical rise as situated\non the property, shall be parked or stored in an R District in the\nVillage."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "An automobile trailer, camper, mobile home, house trailer, recreational vehicle, or other vehicle designed or outfitted with sleeping accommodations and having an overall length of 20 feet or less, and an overall height of 12 feet or less as measured from the ground to its highest point of vertical rise as situated on the property, may be parked or stored as provided in § 200-61 and further subject to the following regulations:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "Only one such vehicle may be parked or stored\non any plot."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "Such vehicle must be owned, leased or rented\nby the owner or occupant of the premises upon which it is parked or\nstored."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "In no case shall such vehicle be used for sleeping,\nhabitation or any other purpose while parked or stored on such lot."
																}
															]
														}
													]
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Parking and storage of boats."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "No boat or boat trailer that has an overall length\nin excess of 20 feet, or that has an overall height in excess of 12\nfeet as measured from the ground to its highest point of vertical\nrise as situated on the property, shall be parked or stored in an\nR District in the Village."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "A boat or boat trailer that has an overall length of 20 feet or less, and an overall height of 12 feet or less as measured from the ground to its highest point of vertical rise as situated on the property, may be parked or stored as provided in § 200-61 and further subject to the following regulation:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "Only one such boat, boat trailer, or combination\nthereof may be parked or stored on any plot."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "Such boat or boat trailer must be owned, leased\nor rented by the owner or occupant of the premises upon which it is\nbeing parked or stored."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "In no case shall such boat or boat trailer be\nused for sleeping, habitation or any other purpose while parked or\nstored on such plot."
																}
															]
														}
													]
												}
											]
										}
									]
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 200-38",
			"title": "Soil and mineral deposits; mining.",
			"content": [
				{
					"text": "No soil, sand or gravel shall be stripped, excavated\nor mined in any district, except excess soil, sand or gravel resulting\nfrom excavation or grading in connection with the construction or\nalteration of a building for which a building permit has been obtained."
				}
			]
		},
		{
			"paragraph": "§ 200-39",
			"title": "Minimum distances between certain uses.",
			"content": [
				{
					"text": "The following uses shall comply with the following\ndistance requirements:"
				},
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "No theater shall be located on any plot any part of\nwhich is situated within a distance of 300 feet as measured along\nthe shortest line from any existing school, church or dwelling."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "No mortuary, undertaking or embalming parlor or chapel\nor similar establishment shall be located on any plot any part of\nwhich is situated within a distance of 500 feet as measured along\nthe shortest line from any existing school, church or dwelling."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "No garage for more than three motor vehicles, motor\nvehicle repair shop or automobile service station shall be located\non any plot any part of which is situated within a distance of 200\nfeet as measured along the nearest boundary of a public street from\nany existing school or church, or within any portion of a block between\ntwo intersecting streets in which portion there exists a school or\nchurch."
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "No used car sales lot shall be located on any plot\nany part of which is situated within a distance of 300 feet as measured\nalong the shortest line from any existing school or church."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 200-40",
			"title": "Parking lots.",
			"content": [
				{
					"text": "Notwithstanding any other provisions of this chapter, no parking place for more than five motor vehicles shall be established or maintained in any district, except when owned by the Village or when owned by the County of Nassau and appurtenant to a county administrative building, unless a permit therefor is authorized by the Board of Appeals, in accordance with § 200-68, or unless such space is required by the Board of Trustees as provided in Article V."
				}
			]
		},
		{
			"paragraph": "§ 200-41",
			"title": "Accessory uses.",
			"content": [
				{
					"text": "The uses permitted in each district shall be\ndeemed to include uses and buildings or structures therefor that are\ncustomarily accessory and incidental to such permitted uses and located\non the same plot therewith, except as follows:"
				},
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "A garage, group of garages or outdoor storage for\nmore than three motor vehicles shall not be deemed to be an accessory\nuse in any R-40, R-20, R-12, R-8 or R-6 District.[Amended 10-16-1989 by L.L. No. 6-1989]"
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "No garage or any portion of a plot in any R District shall be occupied by a commercial vehicle or truck unless a permit therefor is authorized by the Board of Appeals as provided in § 200-65C."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "A driveway or a walk to and from a business or industrial\nuse shall not be deemed to be an accessory use in any R District."
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "Automobile or truck wrecking and the disassembly of\nany automotive vehicle shall not be deemed to be an accessory use\nin any district."
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "No accessory use shall be operated and no accessory\nbuilding or structure shall be maintained or erected on any plot prior\nto the time of the operation of the principal use or of the construction\nof the main building to which it is or is intended to be accessory."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 200-42",
			"title": "Signs in R Districts.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Purpose. The purpose of this section is to establish\nreasonable regulations for all signs in Residence Districts in the\nVillage of Garden City in order to:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Further the objectives of the Village comprehensive\nplan;"
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Protect the value of property in the Village;"
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Protect the health, safety and general welfare;"
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "Protect the essential character of residential neighborhoods;"
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "Facilitate the creation of an attractive and harmonious\ncommunity; and"
												}
											]
										},
										{
											"number": "(6) ",
											"content": [
												{
													"text": "Reduce traffic hazards."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Definitions. As used in this section, the following\nterms shall have the meanings indicated, unless the context otherwise\nindicates:"
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "No sign shall be displayed in any R District, other\nthan by a governmental authority, except as follows:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Temporary signs as permitted in this section."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Garage sale signs as permitted in § 114-6 of this Code."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "One sign, which shall not exceed two square feet in\narea, displaying not more than the name and street number of the occupant\nof the premises and, in the case of a permitted office, studio or\noccupational room, the identification thereof. Such sign shall not\nbe placed within a distance of three feet from any street or property\nline, and all freestanding signs shall not exceed four feet in height\nabove ground level."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "One sign or bulletin board, not exceeding 16 square\nfeet in area, on church, institutional or school property, giving\nthe identification thereof or advertising the activities thereof,\nor both. Such sign shall not be placed within a distance of 10 feet\nfrom any street or property line and shall not exceed six feet in\nheight above ground level."
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "One sign, which shall not exceed one square foot in\narea, indicating that the premises are protected by a security company.\nSuch sign shall not be placed within a distance of 10 feet from any\nproperty line nor nearer to any street line than the minimum setback\ntherefrom as prescribed by this chapter and shall not exceed two feet\nin height above ground level. Signs on windows, not exceeding 36 square\ninches, indicating that the premises are protected by security company,\nshall be exempt from the provisions of this section."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "Temporary signs; permit required."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "No person shall erect or maintain a temporary sign\nwithin an R District without a permit duly issued therefor by the\nVillage Clerk."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "The Village Clerk shall require that an application\nfor a permit be made to him, which shall include the name, address\nand telephone number of the applicant, the size of the sign, the proposed\nwording on the sign and the proposed location of the sign."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "The Village Clerk shall require that any real estate\nsign contain only the words \"for sale,\" \"for lease,\" \"for rent\" or\n\"open house\" and, at the option of the applicant, the word \"owner\"\nor \"broker\" and a telephone number."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "No more than one temporary sign may be in effect at\nany one time for a single piece of property."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "Temporary signs; fees. The fee for a permit for the\nerection of a special event or real estate sign or renewal of a permit\nshall be as fixed from time to time by resolution of the Board of\nTrustees. Said fee shall be submitted by the applicant at the time\nthe application is presented to the Village Clerk."
								}
							]
						},
						{
							"number": "F. ",
							"content": [
								{
									"text": "Size of temporary signs."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "No real estate sign shall be larger than three square\nfeet in area."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "No special event sign shall exceed 16 square feet\nin area."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "G. ",
							"content": [
								{
									"text": "Placement and height of temporary signs.[Amended 7-16-1992 by L.L. No. 3-1992]"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "No real estate sign shall be posted, erected or maintained\nwithin a distance of 10 feet from any property line, nor nearer to\nany street line than the minimum setback therefrom as prescribed by\nthis chapter and shall not exceed six feet in height above ground\nlevel."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "No special event sign shall be posted, erected or\nmaintained within a distance of 10 feet from any property or street\nline and shall not exceed eight feet in height above ground level."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "H. ",
							"content": [
								{
									"text": "Expiration and removal of temporary signs."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Real estate signs must be removed within 24 hours\nof the transfer of the title to the property or the giving of possession\nof the property, whichever event first occurs, except that \"open house\"\nsigns shall be removed within 24 hours after the conclusion of the\nopen house."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Permits for real estate signs shall expire 60 days\nfollowing the date of the issuance, but may be renewed by the Village\nClerk, upon the payment of an additional fee, for successive sixty-day\nperiods."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Special event signs shall be erected no more than\n10 days prior to the event or activity and shall be removed within\n24 hours of the conclusion of the event or activity."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "I. ",
							"content": [
								{
									"text": "Conditions for all signs in R Districts."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "No signs erected subsequent to the enactment of this\nsection shall have characters, letters, figures, designs or outline\nilluminated by electric lights or luminous tubes or use reflective\nor fluorescent paint or material."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "All signs permitted pursuant to this section shall\nhave lettering only on one side and shall be attached to the premises\nor shall be displayed on a stationary rod or post. No sign shall be\nattached to a tree or bush. No sign shall be placed so as to obstruct\na clear view of a street from any intersecting street."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "J. ",
							"content": [
								{
									"text": "Appeals. Any person seeking review of the action of\nthe Village Clerk may appeal to the Board of Trustees of the Village.\nThe Board of Trustees may modify or waive the requirements of this\nchapter only upon a showing that to do so would not be detrimental\nto the neighborhood or to the residents thereof."
								}
							]
						},
						{
							"number": "K. ",
							"content": [
								{
									"text": "Penalties for offenses. For each and every failure\nto comply with the provisions of this section, the owner of the premises\non which the sign is placed and the person or persons who placed or\nassisted in the placement of the sign on such premises in a manner\nthat is not in compliance with this section shall be guilty of a violation\nagainst this section, which violation shall be punishable by a fine\nnot to exceed $250 or imprisonment for a period not to exceed 15 days,\nor both. Each day's continued violation shall constitute a separate\nand distinct additional violation."
								}
							]
						},
						{
							"number": "L. ",
							"content": [
								{
									"text": "Enforcement. It shall be the duty of the Building\nOfficial and he is hereby given the power and authority to enforce\nthe provisions of this section, and he may remove any sign not in\nconformity with this section without notice to the property owner\nor the owner of the sign."
								}
							]
						},
						{
							"number": "M. ",
							"content": [
								{
									"text": "Severability. If any part or parts of this section\nare for any reason held to be invalid, such decision shall not affect\nthe validity of the remaining portions of this section. The Board\nof Trustees hereby declares that it would have passed the local law\nenacting this section and each subsection, sentence, clause and phrase\nthereof, irrespective of the fact that any one or more subsections,\nsentences, clauses or phrases might be declared invalid."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 200-43",
			"title": "Signs in nonresidential districts.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Purpose. The purpose of this section is to provide\nminimum standards for all signs in nonresidential districts in the\nVillage of Garden City in order to:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Safeguard life, health, property and public welfare\nby regulating and controlling the design, quality of materials, construction,\nlocation, illumination, electrification and maintenance of all signs\nand their supports which are located outside a building or structure\nor within one foot of any glass surface inside a building or structure;"
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Further the objectives of the Village Comprehensive\nPlan;"
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Protect the value of property in the Village;"
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "Facilitate the continuity of an attractive and harmonious community. Pursuant to the provisions of Chapter 57, Architectural Review and Chapter 200, Zoning, of the Village Code, all signs must be reviewed and approved by the Architectural Design Review Board (ADRB). Subsequent to such approval and prior to any installation it is also required that a permit be issued."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Definitions. As used in this section, the following\nterms shall have the meaning indicated unless the context otherwise\nindicates:"
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Submission requirements. Eight copies of an application\nwith accompanying drawings and documents, folded and collated into\nsets no larger than 10 inches by 15 inches, are required to be submitted\nand shall contain, at a minimum, the following information:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "The name, address and telephone number of the applicant."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "The name, address, telephone number and written consent\nof the property and/or building owner."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "A description of the proposed installation(s)."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "A plot plan and/or survey indicating the location\nof the subject building or structure."
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "Scaled and dimensioned drawings and/or photographs\nof the subject building or property and all adjacent buildings or\nproperties within 75 feet on either side."
												}
											]
										},
										{
											"number": "(6) ",
											"content": [
												{
													"text": "Scaled elevation drawings of the subject building\nwith the proposed sign indicated and containing all pertinent dimensions\nsuch as total width of building or storefront, height above grade,\nhorizontal location of sign(s), overall height and length of sign(s)\nand distance to adjacent doors and windows."
												}
											]
										},
										{
											"number": "(7) ",
											"content": [
												{
													"text": "Drawings and specifications of individual sign(s)\nof sufficient scale to depict every detail of the proposed sign(s),\nincluding overall height and length, letter type and size, materials,\ncolors, total weight, support and anchorage method, illumination and/or\nelectrification. Material samples to be presented at ADRB meeting\nfor review and approval."
												}
											]
										},
										{
											"number": "(8) ",
											"content": [
												{
													"text": "Location and specifications of proposed illumination,\nincluding fixture catalog cuts and intensity levels."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "To avoid delays in the final review and approval process,\nit is recommended that applicants first apply for a preliminary conference,\nespecially with regard to projecting signs or awnings. A preliminary\nconference may be held with the ADRB and the applicant prior to the\npreparation and submission of a final design submission. The purpose\nof such a conference is to enable the applicant to inform the ADRB\nof his/her proposal prior to the preparation of a detailed design\nsubmission and to provide the ADRB with an opportunity to review the\nbasic design concept, to advise the applicant as to potential problems\nand concerns and to generally determine the information to be required\nin the final submission to the ADRB for approval. Preliminary conferences\nwith the ADRB are available to all applicants, providing applicants\ncomply with the procedures indicated above."
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "Regulations."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "General."
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "No sign shall be erected, installed or displayed\nwithout first obtaining approval from the ADRB and a permit from the\nBuilding Department."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "All signs must be designed, supported and secured\nin accordance with all applicable codes and standards."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "All sign content is limited to the name and/or\nlogo of the establishment."
																}
															]
														},
														{
															"number": "(d) ",
															"content": [
																{
																	"text": "All signs are subject to ADRB approval based\non aesthetic appearance and relationship to neighboring signs and\nbuildings."
																}
															]
														},
														{
															"number": "(e) ",
															"content": [
																{
																	"text": "All signs shall be removed by the tenant or\nowner and the facade of the building shall be restored no later than\n60 days after the premises has been vacated."
																}
															]
														},
														{
															"number": "(f) ",
															"content": [
																{
																	"text": "Illuminated signs on the wall of a building or store which faces a street where the property on the opposite side is in a C or I District or those approved by the ADRB as provided in § 57-8C are permitted."
																}
															]
														},
														{
															"number": "(g) ",
															"content": [
																{
																	"text": "All window signs or window displays, excluding\nsigns not exceeding two inches in vertical measurement, shall not\nbe placed or maintained on or within one foot of any adjoining exterior\nglass surface and shall only be illuminated indirectly."
																}
															]
														},
														{
															"number": "(h) ",
															"content": [
																{
																	"text": "Signs equipped or displayed with moving, flashing\nor intermittent illumination are prohibited."
																}
															]
														},
														{
															"number": "(i) ",
															"content": [
																{
																	"text": "Signs or window displays placed or illuminated\nso as to be hazardous to traffic or disturbing or annoying to the\noccupants of any other building are prohibited."
																}
															]
														},
														{
															"number": "(j) ",
															"content": [
																{
																	"text": "Exposed neon tubing is prohibited."
																}
															]
														},
														{
															"number": "(k) ",
															"content": [
																{
																	"text": "Signs with exposed raceways are prohibited."
																}
															]
														},
														{
															"number": "(l) ",
															"content": [
																{
																	"text": "Internally illuminated wall-mounted or projecting\nlight box signs with translucent faces are prohibited."
																}
															]
														},
														{
															"number": "(m) ",
															"content": [
																{
																	"text": "No sign shall be erected in such a manner so\nas to confuse or obstruct the visibility or interpretation of any\nofficial traffic sign, signal, marking or device."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Wall signs."
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "The maximum overall dimensions or maximum area\nof each exterior sign displayed or painted on or applied or attached\nto the wall of a building, including doors and windows, facing on\na public street, shall not project more than one foot from the wall\nsurface nor exceed the following:"
																},
																{
																	"content": [
																		{
																			"number": "[1] ",
																			"content": [
																				{
																					"text": "On a building, including doors and windows, having a street frontage of 25 feet or less: a vertical measurement of two feet and a horizontal measurement of 80% of the street frontage of such building, excepting that, when approved by the ADRB as provided in § 57-8C, the dimensions or location of such a sign may be revised and an additional sign or signs may be erected, provided that the total area of all such signs shall not exceed 40 square feet."
																				}
																			]
																		},
																		{
																			"number": "[2] ",
																			"content": [
																				{
																					"text": "On a building, including doors and windows, having a street frontage of more than 25 feet and not more than 75 feet: a vertical measurement of two feet and a horizontal measurement of 20 feet, excepting that, when approved by the ADRB as provided in § 57-8C, the dimensions or location of such a sign may be revised and an additional sign or signs may be erected, provided that the total area of all such signs shall not exceed 40 square feet or two feet multiplied by 70% of the street frontage of such building, whichever is the greater."
																				}
																			]
																		},
																		{
																			"number": "[3] ",
																			"content": [
																				{
																					"text": "On a building, including doors and windows, having street frontage in excess of 75 feet: a vertical measurement of two feet and a horizontal measurement of 20 feet, excepting that, when approved by the ADRB as provided in § 57-8C, the dimensions or location of such a sign may be varied and an additional sign or signs may be erected, provided that the total area of all such signs shall not exceed 110 square feet or two feet multiplied by 50% of the street frontage of such building, whichever is greater."
																				}
																			]
																		},
																		{
																			"number": "[4] ",
																			"content": [
																				{
																					"text": "On the rear or side wall of any building on a plot abutting on a parking field or another street, there may be one additional exterior sign with a maximum horizontal measurement which shall not exceed 10 feet or 40% of the width of such wall of the building and with a maximum vertical measurement which shall not exceed two feet, provided that no such sign shall be placed so that any part thereof extends more than 15 feet above curb level. As provided in § 57-8C, the ADRB, however, may permit these dimensions to be increased, but in no ease shall the area of the sign exceed 50% of the total permissible area for an exterior sign on the front of said building."
																				}
																			]
																		}
																	]
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Freestanding signs."
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "In lieu of a wall sign one ground sign per building\nmay be erected subject to the approval of the ADRB."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "Ground signs may not exceed 12 square feet in\narea or six feet in height above ground level."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "The content of a ground sign is limited to the\nbuilding address and the name of the building or the name of one of\nits occupants."
																}
															]
														},
														{
															"number": "(d) ",
															"content": [
																{
																	"text": "Ground signs may only be illuminated by concealed\nlight sources."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "Projecting signs."
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "In lieu of a wall sign or a ground sign and\nsubject to the approval of the ADRB, a projecting sign may be erected."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "The size of a projecting sign shall not exceed\nsix square feet. The maximum height shall be three feet and maximum\nwidth shall be three feet."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "The minimum height from ground level to the\nbottom of the sign shall be not less than nine feet, and the sign\nshall not project more than four feet from the building."
																}
															]
														},
														{
															"number": "(d) ",
															"content": [
																{
																	"text": "No projecting sign shall extend above the roofline\nor the parapet wall."
																}
															]
														},
														{
															"number": "(e) ",
															"content": [
																{
																	"text": "Projecting signs may be illuminated or lighted,\nprovided that the light source is not visible and electrical wiring\nis concealed or as otherwise approved by the ADRB."
																}
															]
														},
														{
															"number": "(f) ",
															"content": [
																{
																	"text": "All projecting signs shall be double-faced."
																}
															]
														},
														{
															"number": "(g) ",
															"content": [
																{
																	"text": "The content of a projecting sign shall be limited\nto the name and/or logo of the establishment."
																}
															]
														},
														{
															"number": "(h) ",
															"content": [
																{
																	"text": "Projecting sign supports and bracket design\nare to comply with all applicable codes and standards."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "Awning signs."
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "In lieu of a wall sign, a sign may be applied\nto an awning; subject, however, to the same proportional size restrictions\nas apply to wall signs."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "In addition, the building address may be applied\nto the front valance of an awning not to exceed six inches in height."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(6) ",
											"content": [
												{
													"text": "Temporary signs."
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "For sale, lease or rent signs. One sign, which\nshall not exceed four square feet in area or be more than six feet\nin height above ground level, may be displayed, applied or attached\nto any exterior wall of a building, including doors and windows, facing\non a public street, when used for advertising the sale, leasing or\nrental of the premises, or part thereof, upon which it is erected\nand containing no more than a description of the available space and\nthe name, address and telephone number of the owner, broker or other\nperson making the offering. Said sign shall be removed within 10 days\nof full occupancy or sale of premises."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "Pre-permanent signs. A temporary sign conforming\nto all sign regulations may be installed prior to the erection of\na permanent sign when approved by the ADRB for a period to be determined\nby the ADRB."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(7) ",
											"content": [
												{
													"text": "Public utility signs. An exterior sign, the area of\nwhich shall not exceed one square foot, maybe displayed by a public\nutility when such sign is necessary or convenient for the direction,\ninformation or safety of the public."
												}
											]
										},
										{
											"number": "(8) ",
											"content": [
												{
													"text": "Address signs. Address signs may be installed on or\nadjacent to entry doors and shall not be less than four inches nor\nmore than eight inches in height."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "F. ",
							"content": [
								{
									"text": "Nonconforming signs. Any light box sign erected and\nlegally existing at the time of the adopting of this section or any\namendment thereof shall be removed not later than three years from\nthe effective date of this section of any amendment thereof."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 200-44",
			"title": "Antennas or towers.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "No parabolic dish or other type of satellite-signal-receiving antenna or device, the purpose of which is to receive television, radio and/or microwave or other electrical signals from space satellites, shall be erected, altered or maintained unless a permit therefor has been authorized by the Board of Appeals as provided in § 200-65F."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "No other type of outside radio or television antenna or tower (other than one located on any building in an R-40, R-20, R-12, R-8 or R-6 District, the total height of which, including the building, shall not exceed 40 feet) shall be erected or altered unless a permit therefor has been authorized by the Board of Appeals as provided in § 200-65F.[Amended 10-16-1989 by L.L. No. 6-1989]"
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 200-45",
			"title": "Outdoor pools.",
			"content": [
				{
					"text": "No outdoor pool, whether permanent or portable,\nexceeding two feet in depth or 120 square feet in area shall hereafter\nbe erected, altered or installed unless a permit therefor has been\nissued in accordance with the following:"
				},
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Permits. A permit for a pool shall be issued only upon approval of the Board of Appeals pursuant to Article XI."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Area and height. All outdoor pools shall comply with the accessory use, area, height and location provisions of Articles VII through X, except when the Board of Appeals otherwise authorizes pursuant to Article XI."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 200-45.1",
			"title": "Freestanding basketball backboards.",
			"content": [
				{
					"text": "No freestanding basketball backboards, except those conforming to the requirements of § 200-52, shall be erected, altered or maintained unless a permit therefor has been issued by the Board of Appeals as provided in § 200-65I."
				}
			]
		},
		{
			"paragraph": "§ 200-45.2",
			"title": "Awnings.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "No awning, whether fixed or retractable, shall be\nerected or installed, except in a one-family residential district,\nunless approved by the Architectural Design Review Board (ADRB) and\na permit has been issued."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Submission requirements. The submission requirements for awnings shall be the same as those for signs as provided in § 200-43C."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Regulations."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "The minimum height from ground level to the\nbottom of an awning shall be not less than seven feet."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "The maximum overall vertical height of an awning\nshall not exceed four feet and the maximum horizontal projection from\nthe face of the building shall not exceed four feet, unless otherwise\napproved by the ADRB."
												}
											]
										}
									]
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 200-45.3",
			"title": "Solar energy systems.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Purpose. No solar energy system shall be erected or\ninstalled unless the system is designed to be aesthetically appropriate\nfor the intended location as determined and approved by the Architectural\nDesign Review Board (ADRB) and a permit has been issued."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Definitions. As used in this section, the following\nterms shall have the meanings indicated, unless the context otherwise\nindicates:"
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Submission requirements. Prior to the installation\nof any solar energy equipment on a property, building or structure,\nthe applicant shall submit eight copies of an application and drawings,\nphotographs and documents to the ADRB, folded and collated into sets\nno larger than 10 inches by 15 inches containing, at a minimum, the\nfollowing information:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "The name, address and telephone number of the\napplicant."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "The name, address, telephone number and written\nconsent of the property and/or building owner."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "A description of the proposed installation(s)."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "A plot plan and/or survey indicating the dimensioned\nlocation of the subject building or structure and all proposed equipment."
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "Sealed and dimensioned drawings and/or photographs\nof the subject building or property and all adjacent buildings or\nproperties within 75 feet on either side."
												}
											]
										},
										{
											"number": "(6) ",
											"content": [
												{
													"text": "Scaled and dimensioned drawings, photographs,\ndocuments and materials, including hut not limited to, layout plans,\nelevations, sections, details, manufacturers specifications and catalogue\ncuts indicating the intended location, material types, colors, finishes\nand structural support methods."
												}
											]
										},
										{
											"number": "(7) ",
											"content": [
												{
													"text": "Material samples are to be presented at the\nADRB meeting."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "To avoid delays in the final review and approval process,\nit is recommended that applicants first apply for a preliminary conference.\nA preliminary conference may be held with the ADRB and the applicant\nprior to the preparation and submission of a final design submission.\nThe purpose of such a conference is to enable the applicant to inform\nthe ADRB of his/her proposal prior to the preparation of a detailed\ndesign submission and to provide the ADRB with an opportunity to review\nthe basic design concept, to advise the applicant as to potential\nproblems and concerns and to generally determine the information to\nbe required in the final submission to the ADRB for approval. Preliminary\nconferences with the ADRB are available to all applicants, providing\napplicants comply with the procedures indicated above."
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "Regulations."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "General. All solar energy systems shall be designed,\nerected and installed in accordance with all applicable codes and\nstandards."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Commercial C Districts."
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "As much as possible, all panels, tiles or slates\nare to appear like and are to match the color of the roof or wall\nto which they are attached."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "Any equipment proposed as part of any new building\nor alteration to a building shall be installed as integrated equipment."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "On existing buildings with flat roofs where\ntilted frames are necessary to install primary equipment, such equipment\nshall not be visible from an abutting street or property. If necessary,\nthe equipment shall be screened with appropriate material as approved\nby the ADRB."
																}
															]
														},
														{
															"number": "(d) ",
															"content": [
																{
																	"text": "On existing buildings with visible sloped roofs\nwhere all surrounding buildings are commercial, nonintegrated equipment\nor integrated equipment may be installed, but they shall be installed\nparallel to and directly against the existing sloping roof."
																}
															]
														},
														{
															"number": "(e) ",
															"content": [
																{
																	"text": "Primary equipment mounted to an approved accessory structure shall be considered part of that structure and is subject to all the requirements of §§ 200-52 and 200-55. Such equipment is also subject to approval by the ADRB."
																}
															]
														},
														{
															"number": "(f) ",
															"content": [
																{
																	"text": "All secondary equipment associated with any\nsolar energy system installation shall not be exposed on the outside\nof any structure unless required by an applicable codes and standards."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Residential R Districts."
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "As much as possible, all panels, tiles or slates\nare to appear like and are to match the color of the roof or wall\nto which they are attached."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "Nonintegrated equipment added to an existing\nstructure shall be installed parallel to and directly against the\nexisting sloping roof and shall be located in an area of the roof\nthat is not visible from an abutting or nearby street."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "Any primary equipment proposed as part of any\nnew building or alteration to a building shall be installed as integrated\nprimary equipment."
																}
															]
														},
														{
															"number": "(d) ",
															"content": [
																{
																	"text": "Primary equipment mounted to an approved accessory structure shall be considered part of that structure and is subject to the requirements of §§ 200-52 and 200-55. Such equipment is also subject to approval by the ADRB."
																}
															]
														},
														{
															"number": "(e) ",
															"content": [
																{
																	"text": "All secondary equipment associated with any\nsolar energy system installation shall not be exposed on the outside\nof any structure unless required by an applicable codes and standards."
																}
															]
														}
													]
												}
											]
										}
									]
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 200-46",
			"title": "Unobstructed yards.",
			"content": [
				{
					"text": "Every prescribed yard shall be open and unobstructed\nfrom the ground upward except for:"
				},
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Accessory uses, buildings or structures, subject to § 200-52."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "The ordinary projections of windowsills, belt courses,\ncornices and other ornamental features to an extent of not more than\nfour inches, provided that not to exceed two feet of any roof overhang\nof any one-family dwelling may extend into any yard, but such roof\noverhang shall not be nearer than five feet to any plot line, and\nsuch two feet of any such roof overhang shall not be included in computing\nbuilding areas or yard dimensions."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "On any plot improved with a one-family dwelling, the minimum and\ntotal side yards shall be in accordance with the following:[Added 7-21-2011 by L.L. No. 2-2011]"
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 200-47",
			"title": "Projections into yards.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "R Districts.[Amended 10-16-1989 by L.L. No. 6-1989; 4-19-2001 by L.L. No. 1-2001]"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "For the purpose of computing the front yard, the rear\nyard or the aggregate width of the two side yards required in an R-40,\nR-20, R-12, R-8, R-6 and R-M District, but not for computing the minimum\nwidth of any such side yard, the projection by a chimney of not more\nthan 2.5 feet into such yard, measured at right angles to the nearest\nplot line, shall be excluded, provided that the width of such chimney\nshall not exceed six feet."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "For the purpose of computing the front yard, the rear\nyard, the side yards or the minimum aggregate width of the two side\nyards required in an R-40, R-20, R-12, R-8, R-6 and R-M District,\nthe projection of a first or ground floor landing platform and steps\nnot more than three feet into such yard, measured at right angles\nto the nearest plot line, shall be excluded, provided that the width\nof said landing platform shall not extend more than one foot beyond\neach side of the door opening which it serves and further provided\nthat no part of the landing platform or steps shall be nearer than\nfive feet to any plot line."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "C Districts. When approved by the Board of Appeals pursuant to § 200-66F, open canopies of a permanent nature may be erected over the rear entrances of buildings in C Districts."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 200-48",
			"title": "Plots abutting parking fields or R District.",
			"content": [
				{
					"text": "If a plot in a C District abuts a municipal\nparking field, the same shall have a side or rear yard, as the case\nmay be, abutting such field, of a width or depth of not less than\n15 feet. If such a plot abuts property in an R District, other than\na municipal parking field, the same shall have a side or rear yard,\nas the case may be, abutting such property in an R District, of a\nwidth or depth of not less than 25 feet."
				}
			]
		},
		{
			"paragraph": "§ 200-49",
			"title": "Nondwelling use in R Districts.",
			"content": [
				{
					"text": "A plot in an R District on which is located a principal building other than a dwelling shall have side and rear yards of widths and depth, respectively, at least equal to the minimum setback specified on the Setback Map for such plot.[1] If such plot is bounded by two or more streets, the street\nwith the least setback shall be used in determining such dimensions,\nbut no such yard shall be less than 25 feet in width or depth."
				},
				{
					"footnote": "[1]\nEditor's Note: The Setback Map is included at the end of this chapter.\n"
				}
			]
		},
		{
			"paragraph": "§ 200-50",
			"title": "Side yard in C and I Districts.",
			"content": [
				{
					"text": "If a side yard is provided in a C or I District,\nit shall have a width of not less than six feet and, in addition thereto,\nnot less than two inches for each one foot of building height."
				}
			]
		},
		{
			"paragraph": "§ 200-51",
			"title": "Corner plots.",
			"content": [
				{
					"text": "A building erected on a corner plot shall comply with the minimum setback from each street on which the plot abuts, as indicated on the Setback Map.[1] On a corner plot one of the interior yards shall have\na width of not less than the minimum width prescribed for side yards\nin the district and the other shall have a depth of not less than\nthe minimum depth prescribed for rear yards in the district."
				},
				{
					"footnote": "[1]\nEditor's Note: The Setback Map is included at the end of this chapter.\n"
				}
			]
		},
		{
			"paragraph": "§ 200-52",
			"title": "Accessory buildings or structures.",
			"content": [
				{
					"text": "Accessory buildings or structures shall conform\nto the following regulations as to their locations on the plot:"
				},
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "On an interior plot abutting on only one street, no\naccessory building or structure shall be erected or altered so as\nto encroach upon that half of the plot depth nearest the street, except\nthat an accessory building or structure on a plot of more than the\nrequired depth need not be set back from the street line a distance\ngreater than would be required in the case of an accessory building\nor structure on a plot of the minimum depth prescribed for the district\nin which such plot is located.[Amended 7-16-1992 by L.L. No. 3-1992]"
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "On an interior plot abutting on two or more streets,\nno accessory building or structure shall be erected or altered so\nas to encroach upon that 1/4 of the plot nearest each and every street."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "On a corner plot abutting on two streets, no accessory\nbuilding or structure shall be erected or altered so as to encroach\nupon the area between each respective street and a line drawn parallel\nto such street in a manner to divide the plot into two equal parts,\nexcept that an accessory building or structure on a corner plot of\nmore than the required width and area need not be set back from the\nstreet line a distance greater than would be required in the case\nof an accessory building or structure on a corner plot of the minimum\nwidth and area prescribed for the district in which such plot is located."
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "On a corner plot abutting on three or more streets,\nno accessory building or structure shall be erected or altered so\nas to encroach upon that 1/4 of the plot nearest each and every street."
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "Accessory buildings and structures shall occupy not\nmore than 30% of the required area of the rear yard."
								}
							]
						},
						{
							"number": "F. ",
							"content": [
								{
									"text": "No part of an accessory building or structure, other\nthan fences or retaining walls, shall be nearer to any rear or side\nplot line than a distance of three feet, and no clothesyard enclosure\nshall be located less than seven feet from any side or rear plot line."
								}
							]
						},
						{
							"number": "G. ",
							"content": [
								{
									"text": "No wall of a detached accessory building or of any\nbuilding connected to the principal building by a breezeway shall\nbe located nearer than 10 feet to any wall of the principal building."
								}
							]
						},
						{
							"number": "H. ",
							"content": [
								{
									"text": "No part of any freestanding heating, cooling, pumping,\nfiltering, generating or other type of equipment or device shall be\nlocated nearer than 10 feet to any plot line.[Added 4-19-2001 by L.L. No. 1-2001]"
								}
							]
						},
						{
							"number": "I. ",
							"content": [
								{
									"text": "Nothing in this chapter shall prevent the erection on properties\nhaving street lines of 100 feet or more in length of no more than\ntwo driveway entrance piers or posts not exceeding six feet in height\n(including any fixture or decorative element) or four square feet\nin area.[Added 7-21-2011 by L.L. No. 2-2011]"
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 200-53",
			"title": "Exceptions to height limitations.",
			"content": [
				{
					"text": "The height limitations of this chapter shall\nnot apply to:"
				},
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Spires or towers of churches or of schools or Village\nor county buildings when such features are designed primarily for\nornamental purposes."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Flagpoles on buildings, not extending more than 20\nfeet above the roof thereof."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Bulkheads, elevator enclosures, water tanks or radio\nor television antennas in any district other than R-40, R-20, R-12,\nR-8 or R-6 District, provided that the same shall not occupy more\nthan 10% of the area of the roof on which they are located or exceed\n20 feet in height above such roof and that the same shall be adequately\nscreened or enclosed; and provided further that in no event shall\nthe total maximum overall height of a building and its superstructures\nexceed a total of 72 feet in any district other than an H or P District.[Amended 10-16-1989 by L.L. No. 6-1989]"
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "In H and P Districts the height limitations shall be those set forth in the Schedule of Regulations which is a part of Article V hereof,[1] provided that in H Districts the total height shall be\nexclusive of towers, cupolas and similar features not exceeding in\ntotal area 25% of the horizontal projection of the roof of the building."
								},
								{
									"footnote": "[1]\nEditor's Note: The Schedule of Regulations is included at the end of this chapter.\n"
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "Buildings for any use in an R District for which a permit from the Board of Appeals is required, when the maximum height thereof shall be specified by said Board pursuant to § 200-67A, and buildings for those uses for which a permit from the Board of Trustees is required. The maximum height of a building may be determined and specified by the Board of Trustees where the applicant can show that it will result in less total building coverage and more open space; and only to the extent that it does not increase the total floor area otherwise permitted by the building coverage and height provisions contained in the Schedule of Regulations of this Code;[2] but in no event shall it exceed four stories or a total\nof 60 feet.[Amended 7-16-1992 by L.L. No. 3-1992]"
								},
								{
									"footnote": "[2]\nEditor's Note: The Schedule of Regulations is included at the end of this chapter.\n"
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 200-54",
			"title": "Parapets or cornices.",
			"content": [
				{
					"text": "A parapet wall or cornice may exceed the height\nlimit established for the district, provided that such excess height\nshall not exceed three feet."
				}
			]
		},
		{
			"paragraph": "§ 200-55",
			"title": "Accessory buildings and structures.",
			"content": [
				{
					"text": "An accessory building shall not exceed 15 feet\nin height. A trellis or pergola shall not exceed 10 feet in height;\na clothesyard or an outdoor fireplace shall not exceed seven feet\nin height, nor a fence, wall, gate or play yard four feet in height."
				}
			]
		},
		{
			"paragraph": "§ 200-56",
			"title": "Flagpoles.",
			"content": [
				{
					"text": "A flagpole shall not be nearer to any street\nline than a distance at least equal to its height."
				}
			]
		},
		{
			"paragraph": "§ 200-57",
			"title": "Fence on property line of corner lot.",
			"content": [
				{
					"text": "Nothing in this chapter shall prevent the erection\nalong or adjacent to the street lines of a corner plot of a fence\nor fence-type structure intended as a deterrent to shortcutting the\ncorner by pedestrians, provided that:"
				},
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "No part of the structure shall extend more than six\nfeet from the point of intersection of said street lines."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "The average height of the structure shall not exceed\n24 inches."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "The maximum height thereof shall not exceed 30 inches."
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "Said structure shall not violate the provisions of § 200-58."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 200-58",
			"title": "Sight obstructions.",
			"content": [
				{
					"text": "On any plot in any district no wall, fence or\nother structure shall be erected or altered, and no hedge, tree, shrub\nor other growth shall be maintained, which may cause danger to traffic\non a street by obstructing or obscuring the view."
				}
			]
		}
	]	
}		