{
	"url": "http://ecode360.com/9148502",
	"paras": [
	    {
			"paragraph": "§ 200-16",
			"title": "Residence R-40, R-20, R-12, R-8 and R-6 Districts.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Uses. In R-40, R-20, R-12, R-8 and R-6 Districts,\nno land, building or structure shall be used and no building or structure\nshall be erected or altered to be used for any purpose other than:[Amended 10-17-1991 by L.L. No. 7-1991]"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "One-family dwelling."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Public school."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Railroad passenger station."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "Nursery and greenhouse, provided that they are not\nused for the growing of vegetables, plants or flowers for sale and\nthat there is no display of products and no advertising, and provided\nthat any greenhouse heating plant is at least 20 feet distant from\nthe side and rear lines of the lot."
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "Golf course and accessory uses and buildings customarily\nincidental thereto."
												}
											]
										},
										{
											"number": "(6) ",
											"content": [
												{
													"text": "By the Village or County of Nassau for administrative\npurposes, water supply, sewerage facilities, fire or police station,\npublic park, playground or automobile parking field."
												}
											]
										},
										{
											"number": "(7) ",
											"content": [
												{
													"text": "Privately owned automobile parking space, when required\nby the Board of Appeals or the Board of Trustees, in accordance with\nthe provisions of this chapter, when such space is contiguous to land\nin a C or I District and is accessory to the use of such land and\nis separated from other privately owned land in any R District by\nland which is owned by the Village, other than a street, and which\nhas a width of at least 20 feet."
												}
											]
										},
										{
											"number": "(8) ",
											"content": [
												{
													"text": "Uses subject to approval of the Board of Trustees.[Amended 7-14-2005 by L.L. No. 2-2005]"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "Subject to approval of the Board of Trustees,\nafter public hearing and notice:"
																},
																{
																	"content": [
																		{
																			"number": "[1] ",
																			"content": [
																				{
																					"text": "Outdoor electric substation with transformers,\nregulators, switchgear, usual accessories and protective fencing,\nprovided that:"
																				},
																				{
																					"content": [
																						{
																							"number": "[a] ",
																							"content": [
																								{
																									"text": "Single transformer capacity does\nnot exceed 5,000 kilovolt-amperes."
																								}
																							]
																						},
																						{
																							"number": "[b] ",
																							"content": [
																								{
																									"text": "Total transformer capacity does\nnot exceed 10,000 kilovolt-amperes."
																								}
																							]
																						},
																						{
																							"number": "[c] ",
																							"content": [
																								{
																									"text": "The maximum voltage of any connecting\ntransmission line does not exceed 66,000 volts."
																								}
																							]
																						}
																					]
																				}
																			]
																		},
																		{
																			"number": "[2] ",
																			"content": [
																				{
																					"text": "College and any use, building or structure accessory\nto a college, excluding a building or structure of less than 5,000\nsquare feet."
																				}
																			]
																		},
																		{
																			"number": "[3] ",
																			"content": [
																				{
																					"text": "Professional school."
																				}
																			]
																		},
																		{
																			"number": "[4] ",
																			"content": [
																				{
																					"text": "Convent, dormitory and recreation building customarily\nincidental to a school or college."
																				}
																			]
																		}
																	]
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "With regard to applications under this Subsection A(8), notwithstanding anything to the contrary, the Board of Trustees shall determine whether variances from this Code shall be heard and decided by the Board of Trustees or the Board of Appeals."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(9) ",
											"content": [
												{
													"text": "The following uses, subject to approval by the Board of Appeals, pursuant to Articles VIII through XI:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "Church."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "Library."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "School."
																}
															]
														},
														{
															"number": "(d) ",
															"content": [
																{
																	"text": "Outdoor pool."
																}
															]
														},
														{
															"number": "(e) ",
															"content": [
																{
																	"text": "College use excluded in Subsection A(8)(b) above."
																}
															]
														},
														{
															"number": "(f) ",
															"content": [
																{
																	"text": "The accessory use of a dwelling for the location\nof an office, studio or occupational room of an attorney, physician,\ndentist, chiropractor, psychologist, architect, engineer, or public\naccountant, or of an artist or musician, but not for the purpose of\noperating a school of or pertaining to any such professional activity.[Added 4-19-2001 by L.L. No. 1-2001]"
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(10) ",
											"content": [
												{
													"text": "Accessory use, building or structure, subject to Articles VII through XI, including:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "In a dwelling, either:"
																},
																{
																	"content": [
																		{
																			"number": "[1] ",
																			"content": [
																				{
																					"text": "Accommodations for not more than two lodgers\nor boarders; or"
																				}
																			]
																		},
																		{
																			"number": "[2] ",
																			"content": [
																				{
																					"text": "An office, studio or occupational room (excluding a professional school) of an attorney, physician, dentist, chiropractor, psychologist, architect, engineer, or public accountant, or of an artist or musician (hereinafter, referred to collectively in this Subsection A(10)(a)[2] as the \"professional activity\"), subject to the following and to other reasonable conditions as the Board of Appeals may prescribe:[Amended 4-19-2001 by L.L. No. 1-2001]"
																				},
																				{
																					"content": [
																						{
																							"number": "[a] ",
																							"content": [
																								{
																									"text": "The practitioner of the professional\nactivity shall reside in the same dwelling unit in which such professional\nactivity is practiced, and such accessory use shall be incidental\nand subordinate to the use of such dwelling for residential purposes."
																								}
																							]
																						},
																						{
																							"number": "[b] ",
																							"content": [
																								{
																									"text": "The space dedicated to carrying\non such professional activity shall be confined to the ground floor\nof the building and shall occupy not more than 20% of the total livable\nfloor area of the dwelling unit, provided that no such professional\narea shall exceed 400 square feet."
																								}
																							]
																						},
																						{
																							"number": "[c] ",
																							"content": [
																								{
																									"text": "The number of persons, including\nthe practitioner and associates, assistants and employees engaged\nin such activities on the premises, shall not exceed three persons."
																								}
																							]
																						},
																						{
																							"number": "[d] ",
																							"content": [
																								{
																									"text": "No display or advertising shall be permitted on the premises in connection with such accessory use except for one sign subject to § 200-42."
																								}
																							]
																						},
																						{
																							"number": "[e] ",
																							"content": [
																								{
																									"text": "No overnight accommodations shall\nbe provided or maintained on the premises for the recipients of care,\ntreatment or other services."
																								}
																							]
																						},
																						{
																							"number": "[f] ",
																							"content": [
																								{
																									"text": "Notwithstanding anything to the contrary in § 200-81 herein, any permit granted by the Board of Appeals for such accessory use of a dwelling shall apply only to the use described in the permit and to the named permittee, and such permit may not be transferred and shall expire upon the termination or modification of the permitted use."
																								}
																							]
																						}
																					]
																				}
																			]
																		}
																	]
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "Fence, wall or structure, subject to §§ 200-55 to 200-58, inclusive."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "Signs, subject to § 200-42."
																}
															]
														},
														{
															"number": "(d) ",
															"content": [
																{
																	"text": "Off-street parking and loading spaces, subject to Subsection C hereof."
																}
															]
														},
														{
															"number": "(e) ",
															"content": [
																{
																	"text": "Radio or television antenna or tower, subject to § 200-44."
																}
															]
														}
													]
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Other use regulations. The use provisions of Articles VII through XI shall apply in R-40, R-20, R-12, R-8 and R-6 Districts, and any other use not permitted hereinabove shall be prohibited.[Amended 4-19-2001 by L.L. No. 1-2001]"
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Off-street regulations. Pursuant to § 200-59 et seq., the following minimum requirements for off-street parking and loading spaces shall apply in R-40, R-20, R-12, R-8 and R-6 Districts:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "For an existing one-family dwelling: parking space for one automobile per dwelling, subject to § 200-61."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "For a new one-family dwelling: parking space for two automobiles per dwelling, subject to § 200-61."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "For any use for which a permit from the Board of Appeals is required and for any other use involving the assembly of persons or public patronage: such spaces as said Board may determine to be adequate in each case, subject to § 200-68."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "No lot, plot or structure in the R-40, R-20, R-12,\nR-8 or R-6 District shall be used for or occupied by more than one\nprincipal use."
								}
							]
						}
					]
				}
			]
		}
	]	
}		