{
	"url": "http://ecode360.com/10919268",
	"paras": [
		{
			"paragraph": "§ 176-16",
			"title": "Applicability.",
			"content": [
				{
					"text": "In a Residence B District the following regulations\nshall apply."
				}
			]
		},
		{
			"paragraph": "§ 176-17",
			"title": "Permitted uses.",
			"content": [
				{
					"text": "No building may be erected, altered or used\nand no lot or premises may be used except for one or more of the purposes\nset forth in § 176-6 of Article III of this chapter."
				}
			]
		},
		{
			"paragraph": "§ 176-18",
			"title": "Lot area requirements.",
			"content": [
				{
					"text": "No building shall be constructed on a lot of\nan area less than 5,000 square feet, unless authorized by the Board\nof Appeals pursuant to Article XIII, § 176-147A."
				}
			]
		},
		{
			"paragraph": "§ 176-19",
			"title": "Building area requirements.",
			"content": [
				{
					"text": "The building area shall not exceed 35% of the\nlot area."
				}
			]
		},
		{
			"paragraph": "§ 176-20",
			"title": "Front yard requirements.",
			"content": [
				{
					"text": "There shall be a front yard the depth of which\nshall not be less than 20 feet."
				}
			]
		},
		{
			"paragraph": "§ 176-21",
			"title": "Rear yard requirements.",
			"content": [
				{
					"text": "There shall be a rear yard the depth of which\nshall not be less than 25 feet."
				}
			]
		},
		{
			"paragraph": "§ 176-22",
			"title": "Side and rear yard requirements for single-family dwellings.",
			"content": [
				{
					"text": "In case of a single-family dwelling there shall\nbe side yards of at least 12 feet. Neither side yard shall be less\nthan five feet; provided, however, that in case of a lot held in single\nand separate ownership at the effective date of this chapter and of\na width less than 50 feet or a depth less than 100 feet, six inches\nmay be deducted from the aggregate width of the side yards for each\nfoot in width such lot shall lack of the said 50 feet, but no side\nyard shall be less than four feet wide; six inches may be deducted\nfrom the required depth of the rear yard for each foot in depth such\nlot shall lack of the said 100 feet, but the depth of such rear yard\nshall in no case be reduced thereby to less than 15 feet."
				}
			]
		},
		{
			"paragraph": "§ 176-23",
			"title": "Building height.",
			"content": [
				{
					"text": "No building shall exceed 2 1/2 stories or 31\nfeet in height."
				}
			]
		},
		{
			"paragraph": "§ 176-24",
			"title": "General requirements for side yards.",
			"content": [
				{
					"text": "All buildings, other than buildings being used\nas detached one-family or detached two-family dwellings, shall have\nside yards of at least 15 feet. Notwithstanding the foregoing, any\nexisting nonconforming building in excess of 31 feet in height shall\nhave side yards of at least 20 feet."
				}
			]
		},
		{
			"paragraph": "§ 176-25",
			"title": "Corner lots.",
			"content": [
				{
					"text": "In case of a corner lot, a building shall be\nrequired to comply with the front yard restrictions only on the narrower\nstreet front. The depth of yard from the other street lines shall\nbe 20% of the width of the lot, but need not be more than 20 feet."
				}
			]
		},
		{
			"paragraph": "§ 176-26",
			"title": "Street frontage and front yard width.",
			"content": [
				{
					"text": "The minimum street frontage and front yard width\nshall be 50 feet."
				}
			]
		},
		{
			"paragraph": "§ 176-27",
			"title": "Additional restrictions.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "For the purpose of preserving the comprehensive zoning\nplan set forth in this chapter and the character of the residential\nneighborhood which has developed in accordance with that plan and\nfor the purpose of protecting the lives and property of residents\nliving in that area of the Village's Residence B District and Residence\nA-1 District where there are extreme changes in the elevation of the\nterrain, the additional restrictions are imposed on certain lands\nin the Residence B District and Residence A-1 District."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Not more than one detached single-family dwelling\nmay be built on any one of the lots hereinafter listed in Subsection\nC hereof and the sole vehicular access to said lots shall be from\nSoundview Drive."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "The lots which are subject to the limitations set\nforth in Subsection B of this section are known and designated as:"
								}
							]
						}
					]
				}
			]
		}
	]
}