{
	"url": "http://ecode360.com/10919237",
	"paras": [
		{
			"paragraph": "§ 176-5",
			"title": "Applicability.",
			"content": [
				{
					"text": "In a Residence A-1 District the following regulations\nshall apply."
				}
			]
		},
		{
			"paragraph": "§ 176-6",
			"title": "Permitted uses; special exceptions.",
			"content": [
				{
					"text": "No building may be erected, altered or used\nand no lot or premises may be used except for one or more of the following\npurposes:"
				},
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Detached single-family dwelling."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "House of worship, a public or nonprofit school, and\nmunicipal recreational use, when permitted as a special exception\nby the Board of Trustees upon proper written application therefor\nand after a public hearing on published notice, in accordance with\nthe following provisions:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Such application shall show and be accompanied by\nappropriate documents and plans sufficient to indicate the size, location\nand use of all buildings, facilities and open areas, including the\nprovisions to be made for screening, traffic flow, fencing, parking\nand lighting."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "The Board of Trustees shall approve said application\nonly upon finding that the proposed layout and improvements will be\nfree of health, safety and fire hazards; will limit the height of\nbuilding and provide adequate and sufficient setbacks, screening,\nfencing, off-street parking, safe traffic flow and adequate and sufficient\nsafeguards to insure, protect, and secure the use and enjoyment of\nneighboring properties and the general area in which the subject premises\nare located, without unreasonable interference."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "The Board of Trustees in approving said application\nmay impose such additional regulations and restrictions as it feels\nproper in the particular circumstances to assure the safeguards hereinabove\ndescribed, and in any event, shall require and provide the following\nminimum restrictions:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "A minimum lot of not less than one acre in area;"
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "Minimum street frontage and front yard width\nof 150 feet;"
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "Front yard setback of 50 feet;"
																}
															]
														},
														{
															"number": "(d) ",
															"content": [
																{
																	"text": "Side yard setback of 25 feet;"
																}
															]
														},
														{
															"number": "(e) ",
															"content": [
																{
																	"text": "Rear yard setback of 50 feet;"
																}
															]
														},
														{
															"number": "(f) ",
															"content": [
																{
																	"text": "Thick screening area of 10 feet in depth along\nall boundaries of the subject premises adjoining property located\nin any residence district;"
																}
															]
														},
														{
															"number": "(g) ",
															"content": [
																{
																	"text": "Off-street parking providing one parking space\nfor every two persons in the total capacity of persons whom the premises\nare designed to legally and safely accommodate."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "Such conditions and requirements shall in all cases\ninclude limitation of the number of persons who may safely occupy\nthe premises and any part or parts thereof at one time, ways and means\nof reducing noise and disturbance to the neighborhood, including limitations\nof hours and days during which social or nonreligious and/or noneducation\nfunctions may be conducted, and use of such structural materials and\nprocedures and implements, equipment and appliances as shall be necessary\nor appropriate to safeguard against fire, health and safety, hazards\nand panic and shall prescribe the height, location and type of fencing."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "The office of a doctor, dentist, teacher, musician\nor other professional person residing on the premises provided there\nis no display of advertising except a small professional nameplate."
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "Signboard for renting or sale of the real estate on\nwhich same is located, not exceeding eight feet high by 10 feet long\nfor real estate subdivision, or nine square feet in area for a single\nlot, with a space of three feet between the bottom of the sign and\nground, and so placed as to conform with the front and side yard restrictions."
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "Accessory use on the same lot with and customarily\nincidental to any of the above permitted uses, including a private\ngarage, greenhouse, small announcements or professional sign. Except\nas above permitted, accessory uses shall not include any use customarily\ncarried on as a business industry on any driveway or walk giving access\nthereto, nor any display visible from the street, nor any billboard\nor advertising signboard or sign. Accessory buildings shall not be\nused for residence purposes where located on a lot containing less\nthan 7,500 square feet, and in no case for other than guests or employees\nof the owner or tenant of the principal building. The placing of a\n\"for sale\" or \"for rent\" sign not exceeding nine square feet in area\nshall, however, be deemed an accessory use. A fence or other structure\ndeemed by the Superintendent of Buildings to be designed primarily\nto cause annoyance or damage to an adjoining owner, shall in no case\nbe permitted as an accessory use."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 176-7",
			"title": "Lot area requirements.",
			"content": [
				{
					"text": "No building shall be constructed on a lot of\nan area less than 6,000 square feet, unless authorized by the Board\nof Appeals pursuant to Article XIII § 176-147A."
				}
			]
		},
		{
			"paragraph": "§ 176-8",
			"title": "Building area requirements.",
			"content": [
				{
					"text": "The building area shall not exceed 30% of the\nlot area."
				}
			]
		},
		{
			"paragraph": "§ 176-9",
			"title": "Front yard requirements.",
			"content": [
				{
					"text": "There shall be a front yard the depth of which\nshall not be less than 25 feet."
				}
			]
		},
		{
			"paragraph": "§ 176-10",
			"title": "Rear yard requirements.",
			"content": [
				{
					"text": "There shall be a rear yard the depth of which\nshall not be less than 25 feet."
				}
			]
		},
		{
			"paragraph": "§ 176-11",
			"title": "Side and rear yard requirements for single-family dwellings.",
			"content": [
				{
					"text": "In the case of a single-family dwelling there\nshall be two side yards, one on each side of the main dwelling, the\naggregate width of which shall be as least 15 feet. Neither side yard\nshall be less than seven feet; provided, however, that in the case\nof a lot held in single and separate ownership at the effective date\nof this chapter and of a width of less than 50 feet or a depth of\nless than 100 feet, six inches may be deducted from the aggregate\nwidth of the side yards for each foot in width such lot shall lack\nof the said 50 feet but no side yard shall be less than five feet\nwide; six inches may be deducted from the required depth of the rear\nyard for each foot in depth such lot shall lack of the said 100 feet,\nbut the depth of such rear yard shall in no case be reduced thereby\nto less than 15 feet."
				}
			]
		},
		{
			"paragraph": "§ 176-12",
			"title": "Building height.",
			"content": [
				{
					"text": "No building shall exceed 2 1/2 stories or 31\nfeet in height."
				}
			]
		},
		{
			"paragraph": "§ 176-13",
			"title": "Corner lots.",
			"content": [
				{
					"text": "In the case of a corner lot, a building shall\nbe required to comply with the front yard restrictions only on the\nnarrower street front. The depth of yard from the other street lines\nshall be 20% of the width of the lot, but need not be more than 20\nfeet."
				}
			]
		},
		{
			"paragraph": "§ 176-14",
			"title": "Minimum street frontage and yard width.",
			"content": [
				{
					"text": "The minimum street frontage and front yard width\nshall be 60 feet."
				}
			]
		},
		{
			"paragraph": "§ 176-15",
			"title": "Additional restrictions.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "For the purposes of preserving the comprehensive zoning\nplan set forth in this chapter and the character of the residential\nneighborhood which has developed in accordance with that plan and\nfor the purpose of protecting the lives and property of residents\nliving in that area of the Village's Residence B District and Residence\nA-1 District where there are extreme changes in the elevation of the\nterrain, the additional restrictions are imposed on certain lands\nin the Residence B District and Residence A-1 District."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Not more than one detached single-family dwelling\nmay be built on any one of the lots hereinafter listed in Subsection\nC hereof and the sole vehicular access to said lots shall be from\nSoundview Drive."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "The lots which are subject to the limitations set\nforth in Subsection B of this section are known and designated as:"
								}
							]
						}
					]
				}
			]
		}
	]
}