{
	"url": "http://ecode360.com/10919163",
	"paras": [
		{
			"paragraph": "§ 176-28",
			"title": "Applicability.",
			"content": [
				{
					"text": "In a Residence C District the following regulations\nshall apply."
				}
			]
		},
		{
			"paragraph": "§ 176-29",
			"title": "Permitted uses.",
			"content": [
				{
					"text": "No building may be erected, altered or used\nand no lot or premises may be used except for:"
				},
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "One or more of the purposes set forth in § 176-6\nof Article III of this chapter."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "(Reserved)\nEditor's Note: Former Subsection B, Detached\ntwo-family dwelling, was repealed 4-26-2005 by L.L. No. 2-2005.\n"
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Hospital or sanitarium, other than those for infectious\nor contagious diseases or for the care of the mentally ill or mentally\ndisabled or persons with alcohol and substance abuse problems.[Amended 4-14-2003 by L.L. No. 1-2003]"
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "Telephone exchange.\nEditor's Note: Original Subsection E, which\nimmediately followed this subsection, was repealed 6-12-1967.\n"
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 176-30",
			"title": "Lot area requirements.",
			"content": [
				{
					"text": "No single-family dwelling shall be constructed\non a lot with an area less than 4,000 square feet. No lot upon which\na legal preexisting nonconforming two-family dwelling exists shall\nbe reduced to an area of less than 8,000 square feet."
				}
			]
		},
		{
			"paragraph": "§ 176-31",
			"title": "Building area requirements.",
			"content": [
				{
					"text": "The building area shall not exceed 45% of the\nlot area."
				}
			]
		},
		{
			"paragraph": "§ 176-32",
			"title": "Front yard requirements.",
			"content": [
				{
					"text": "There shall be a front yard the depth of which\nshall not be less than 15 feet."
				}
			]
		},
		{
			"paragraph": "§ 176-33",
			"title": "Rear yard requirements.",
			"content": [
				{
					"text": "There shall be a rear yard the depth of which\nshall not be less than 25 feet."
				}
			]
		},
		{
			"paragraph": "§ 176-34",
			"title": "General requirements for side yards.",
			"content": [
				{
					"text": "There shall be two side yards, one on each side\nof the main building, the aggregate width of which shall be at least\n13 feet. Neither side yard shall be less than five feet wide; provided,\nhowever, that in case of a lot held in single and separate ownership\nat the effective date of this chapter and of a width less than 40\nfeet or of a depth less than 100 feet, variance or variances from\nthe provisions of §§ 176-32 and 176-33 of this article\nare permitted when authorized by the Board of Appeals."
				}
			]
		},
		{
			"paragraph": "§ 176-35",
			"title": "Building height.",
			"content": [
				{
					"text": "No building shall exceed 2 1/2 stories or 31\nfeet in height."
				}
			]
		},
		{
			"paragraph": "§ 176-36",
			"title": "Side yard requirements for other than detached one-family dwellings.",
			"content": [
				{
					"text": "All buildings, other than buildings being used\nas detached one-family dwellings, shall have side yards of at least\n15 feet. Notwithstanding the foregoing, the side yards of any legal\npreexisting nonconforming building in excess of 31 feet in height\nshall not be reduced to less than 20 feet."
				}
			]
		},
		{
			"paragraph": "§ 176-37",
			"title": "Corner lots.",
			"content": [
				{
					"text": "In case of a corner lot, a building shall be\nrequired to comply with the front yard restrictions only on the narrower\nstreet front. The depth of yard from the other street lines shall\nbe 15% of the width of the lot, but need not be more than 10 feet."
				}
			]
		},
		{
			"paragraph": "§ 176-38",
			"title": "Street frontage and front yard width.",
			"content": [
				{
					"text": "The minimum street frontage and front yard width\nfor single-family dwellings shall be 40 feet. The minimum street frontage\nand front yard width for any legal preexisting nonconforming two-family\ndwellings shall not be reduced to less than 50 feet."
				}
			]
		},
		{
			"paragraph": "§ 176-120",
			"title": "Preexisting nonconforming uses; reconstruction of buildings.",
			"content": [
				{
					"text": "Any nonconforming use existing at the effective\ndate of this chapter may be continued, and any existing building designed,\narranged, intended for or devoted to a nonconforming use may be reconstructed\nas structurally altered, subject to the following regulations:"
				},
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "The cost of structural alterations made in such building\nshall in no case exceed 50% of its structural value nor shall the\nbuilding be enlarged unless the use therein is changed to a conforming\nuse."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "No nonconforming use shall be extended at the expense\nof a conforming use."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "No nonconforming use, if once changed to a use permitted\nin the district in which it is located, shall ever be changed back\nto a nonconforming use."
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "No nonconforming use, which shall have been discontinued\nfor a period exceeding 12 months, shall be resumed nor shall it be\nreplaced by any other nonconforming use."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 176-121",
			"title": "Prohibited uses.",
			"content": [
				{
					"text": "No trade, industry or purpose shall be permitted\nwhich, in the judgment of the Board of Appeals, as provided in Article\nXIII, § 176-147J, is likely to be so conducted as to create\ncorrosive or toxic fumes, gas, smoke or odors, obnoxious dust, vapor\nor wastes or offensive noise or vibration so as to be detrimental\nto the public health, safety or general welfare."
				}
			]
		},
		{
			"paragraph": "§ 176-122",
			"title": "Corner lots.",
			"content": [
				{
					"text": "On any corner lot, no wall, fence or other structure\nshall be erected or altered, and no hedge, tree, shrub, or other growth\nshall be maintained, which may cause danger to traffic on a street\nby obscuring the view."
				}
			]
		},
		{
			"paragraph": "§ 176-123",
			"title": "Irregular lots.",
			"content": [
				{
					"text": "In the case of a narrow corner lot or of any\nshallow, irregular or steeply sloping lot, existing as such at the\neffective date of this chapter, where conformity with the provisions\nof this article would in the judgment of the Board of Appeals make\nit difficult to erect a practicable building, the Board, as provided\nin Article XIII, § 176-147A and B may allow such building\nor structure to project nearer to any street or lot line than is herein\nprescribed, provided that it can be done in a way to safeguard the\nneighborhood and provided that compensating area shall be added to\none or the other required open spaces and provided that in no case,\nin a residence or Apartment District, shall any part of any structure\nbe within less than five feet of any street or lot line."
				}
			]
		},
		{
			"paragraph": "§ 176-124",
			"title": "Accessory buildings and other structures.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "General."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "All accessory buildings and other structures\nshall be no higher than eight feet in height, plus one additional\nfoot in height for each foot they are distant from the nearest property\nline, but in no event may they exceed 25 feet in height."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "All accessory buildings and other structures\nshall be at least three feet from all lot lines."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "With the exception of lighting fixtures, lawn\nsculptures, plant trellises, and mailboxes, which do not exceed six\nfeet in height, all accessory buildings and other aboveground structures\nshall be at least 10 feet more distant from the street line than the\nrear wall of the main building."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Exceptions."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "This section shall not apply to fences, swimming\npools and parabolic antennas, which are provided for elsewhere in\nthis chapter."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "This section is subject to such preemption which\nmay exist in whole or in part by the Federal Communications Commission\nor other federal or state agencies."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "A private garage may be built across a common\nlot line by mutual agreement between adjoining property owners."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "In all zones other than residential zones (Residence A-1, Residence\nB Districts, Residence C Districts, and Apartments Districts) there\nshall be no use, building or structure, as the case may be, that is\nincidental or subordinate, including but not limited to parking areas\nthat are permitted to be on a separate or different lot than the principal\nuse, building or structure. All principal uses, building and structures\nshall be on the same lot as the incidental use, building or structure.[Added 6-27-2012 by L.L. No. 3-2012]"
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "Any\nnonconforming use, building or structure that currently exists at\nthe effective date of this chapter may be continued.[Added 6-27-2012 by L.L. No. 3-2012]"
												}
											]
										}
									]
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 176-124.1",
			"title": "Aboveground exterior oil tanks prohibited.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Prohibition. No aboveground exterior heating, cooking,\nor motor fuel (gasoline, diesel, kerosene, or similar fuel) oil, or\nother liquid petroleum, liquid propane, or other liquid fuel tanks\nor containers shall be permitted within the Village."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Exemptions. The foregoing prohibition shall not preclude\nthe aboveground use of portable liquid propane in safe and secure\ntanks of 25 pounds or less, as typically used for home barbeque grills."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 176-124.2",
			"title": "Temporary structures.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Definitions. As used in this section, the following terms shall have\nthe meanings indicated:"
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Permit required. No temporary structure shall be placed or erected\nwithout first obtaining a permit from the Building Inspector of the\nVillage of Port Washington North."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Standards for issuance of permits. The Building Inspector may issue\npermits for temporary structures on residential or nonresidential\nproperties, as provided in this article, subject to such terms and\nconditions as the Building Inspector may deem necessary to safeguard\nadjoining properties and the health, safety and general welfare of\nthe community. In the consideration and determination of applications\nfor temporary structures, the Building Inspector shall consider the\nfollowing standards as applied to the specific application, as well\nas any other criteria which the Building Inspector may deem relevant\nto the safety and well-being of the adjoining property owners and\nthe community and which are relevant to the specific application."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "The uses permitted in the district in which the property is\nlocated, although not restricted to such uses."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Whether the proposed temporary structure is of such character,\nsize, location, design and site layout as to be appropriate to and\nin harmony with the surrounding properties for the limited time during\nwhich it shall be erected."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Whether the proposed temporary structure will provide a desirable\nservice, facility or convenience to the applicant without significantly\nburdening the adjoining property owner or community."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "Whether the goals of the application can reasonably be accomplished\nin a less intrusive manner to the adjoining property owner or community."
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "Whether the proposed temporary structure will be hazardous,\nconflicting or incongruous to the immediate neighborhood or adjoining\nproperty owner by reason of excessive traffic, assembly of persons\nor vehicles, proximity to travel, or other factors as determined by\nthe Building Inspector."
												}
											]
										},
										{
											"number": "(6) ",
											"content": [
												{
													"text": "Whether the proposed temporary structure will be of such a nature\nas to be objectionable to nearby residents by reason of noise, lights,\nvibration, litter or other factors of aesthetics or impact."
												}
											]
										},
										{
											"number": "(7) ",
											"content": [
												{
													"text": "All temporary structures shall be a minimum of three feet from\nany sidewalk or Village right-of-way."
												}
											]
										},
										{
											"number": "(8) ",
											"content": [
												{
													"text": "All temporary structures shall be on a paved surface unless\notherwise determined by the Building Inspector that the applicant\nhas exhausted all other alternatives and a paved surface is not possible\nfor the particular applicant."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "Filing fees. The filing fees on the applications to the Village of\nPort Washington North shall be pursuant to the fee schedule and as\nprescribed from time to time by the Board of Trustees."
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "Expiration of permits; extensions of time."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "All permits for temporary structures shall automatically expire\n90 days from the date of the permit."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "An applicant may apply for a thirty-day extension of time to\nmaintain a temporary structure for a renewal fee of $50. All extensions\nof time are in the discretion of the Building Inspector. Extensions\nof time may be extended more than once, but at no time to be extended\nmore than three times."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "F. ",
							"content": [
								{
									"text": "Enforcement. The provisions herein described shall be enforceable\nby the Village of Port Washington North, and failure of the Village\nto enforce any and all said regulations or provisions shall in no\nevent be deemed a waiver of the right to do so."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 176-125",
			"title": "Accessory buildings on corner lots.",
			"content": [
				{
					"text": "On corner lots accessory buildings shall be\nlocated as far as possible from all street lines while conforming\nto the requirements of the last above section."
				}
			]
		},
		{
			"paragraph": "§ 176-126",
			"title": "Projection into yards.",
			"content": [
				{
					"text": "No building or part of a building shall be erected\nin or project into a required rear yard, front yard or side yard with\nthe following exceptions:"
				},
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Cornices, eaves, gutters or chimneys projecting not\nmore than 18 inches."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "One-story bay windows projecting not more than three\nfeet into any front, side or rear yard and not to exceed six feet\nin length and the seat and/or sill of said window shall be the entire\nwidth of the projection and shall not be less than two feet above\nthe floor of the room that it is attached to. No foundation wall or\nstructure shall be erected under any part of such bay window projecting\ninto any required side yard."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Steps may project into a rear or front yard not more\nthan five feet and into a side yard not more than two feet."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 176-127",
			"title": "Courts.",
			"content": [
				{
					"text": "Courts shall be governed by the following restrictions:"
				},
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "The width of an inner court shall not be less than\neight feet, but in no event shall it be less than four inches for\neach foot of the building height. For an inner court not on the lot\nline, the least dimension shall not be less than 16 feet."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "The width of an outer court shall not be less than\neight feet, but in no event shall it be less than four inches for\neach foot of building height. If the depth of an outer court shall\nexceed four times its width, the width shall be increased one foot\nfor each four feet of depth."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "The same restrictions as in the foregoing subsections\nshall apply to courts in business and industrial districts but only\nas to floors used for residential purposes."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 176-128",
			"title": "Setbacks.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "No regulation or requirement hereof shall be deemed\nto require the setback of any building beyond the average setback\nline observed by the buildings existing at the effective date of this\nchapter on the same side of the street within the block, provided\nthere be two or more buildings on such block."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "The average setback line observed by buildings on\nthe same side of the street within 200 feet on each side of the lot\nin question shall control in lieu of the average setback line within\nthe block where the block affected has a length of more than 1,000\nfeet between its intersecting streets."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "No building which is used for any of the uses specified\nbelow shall be located in whole or in part within 150 feet of Shore\nRoad and/or 180 feet of Soundview Drive:[Added 7-12-2004 by L.L. No. 6-2004;\namended 1-22-2007 by L.L. No. 1-2007]"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Fast-food convenience store."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Fast-food restaurant."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Fast-service store."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "Take-out-food restaurant."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "Limitation on delivery vehicles within 150 feet of\nShore Road and/or 180 feet of Soundview Drive:[Added 1-22-2007 by L.L. No. 1-2007]"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Except as provided in Subsection D(2), no business\nentity shall have more that one delivery vehicle in use at any one\ntime."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Notwithstanding anything to the contrary in\nSubsection D(1), a business entity may have not more than two delivery\nvehicles in use at any one time upon the following conditions:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "The parking lot wherein the delivery vehicles\nare parked shall have not less than two legal curb cuts to public\nroads."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "No vehicular egress shall be permitted from\nthe parking lot to Shore Road except by a legal curb cut with a traffic\nlight controlling egressing traffic from that curb cut."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "All curb cuts from Shore Road to the parking\nlot that are not controlled by a traffic light for egressing traffic\nfrom the parking lot shall be marked \"entrance only\" with such signs\nand pavement markings as are approved by the Village Building Inspector."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "No delivery vehicle shall be parked, stopped,\nor standing, within the area, even while such vehicle is actually\nbeing loaded or unloaded with food or other goods, if such vehicle\nhas any signs, logos, business name, telephone number, address, or\nother commercial information or designation, unless, at the location\nwhere it is so parked, stopped, or standing, while it is actually\nbeing loaded or unloaded, it is totally screened from all public streets\nby fencing or a live screen in a manner approved by the Village Building\nInspector."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "All delivery vehicles leaving the area shall\nonly do so by exits controlled by a traffic control signal of not\nless than three phases (red, yellow, green), when such exits are provided\nfor the particular lot from which the vehicle is exiting."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "For the purposes of this section, the subject 150\nfoot and 180 foot measurements shall be from the closest point of\nthe curb of the subject road to the closest point of the closest exterior\nwall of the building that provides access to the building, other than\naccess from a door that is used only by the employees at the building\nand not by the general public.[Added 1-22-2007 by L.L. No. 1-2007]"
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 176-129",
			"title": "Extension of districts back from streets on which they front.",
			"content": [
				{
					"text": "Unless otherwise indicated on the Building Zone\nMap."
				},
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Apartment Districts extend 200 feet back from the\nstreet or streets on which they front."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Business Districts extend 100 feet back from the street\nor streets on which they front. Where a rear lot line is more than\n100 feet distant from the street line, they may extend back such additional\ndistance over 100 feet but not over 150 feet from the street line.\nOn side streets intersecting Business Districts, Business Districts\nextend 200 feet back from the street line on which the Business District\nfronts."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Industrial Districts extend 200 feet back from the\nstreet or streets on which they front, but not beyond the limits of\na Business District or district of other classification fronting on\nan adjacent parallel street, or not beyond the line of the adjacent\nparallel street where the frontage on the opposite side of the latter\nhas another classification."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 176-130",
			"title": "Determination of front yard depth.",
			"content": [
				{
					"text": "The depth of all front yards will be reckoned\nfrom existing street lines, but where a street has been widened or\nis proposed to be widened and this new width has been duly authorized\nand recorded on a duly filed map, the depth of front yards shall be\nreckoned from the new street lines."
				}
			]
		},
		{
			"paragraph": "§ 176-131",
			"title": "Building setback on business streets.",
			"content": [
				{
					"text": "Where business streets are less than 50 feet\nin width, buildings shall be set not nearer the street line than 25\nfeet from the center line of the street."
				}
			]
		},
		{
			"paragraph": "§ 176-132",
			"title": "Effect of regulations on buildings under construction.",
			"content": [
				{
					"text": "Nothing herein contained shall require any change\nin the plans, construction or designated use of a building under construction,\nprovided that at the effective date of this chapter the construction\nshall have proceeded to the completion of the foundations and the\nsetting of the first floor beams, and provided further that the work\nthereon shall be diligently prosecuted to completion within one year\nfrom the effective date of this chapter. The Board of Appeals may,\nin its discretion, due to the size or nature of the building, or any\nspecial circumstances which in its judgment are sufficient, extend\nthe date of completion beyond the one year above fixed."
				}
			]
		},
		{
			"paragraph": "§ 176-133",
			"title": "Reduction of yard areas prohibited.",
			"content": [
				{
					"text": "In no event shall the building area in any district\nbe exceeded by reason of the reduction of yard area required leaving\na greater percentage of lot area, nor shall the yard area in any district\nbe decreased by reason of the permitted building area."
				}
			]
		},
		{
			"paragraph": "§ 176-134",
			"title": "Elevator service in multifamily residences.",
			"content": [
				{
					"text": "No building which is arranged, intended or designed\nto be used for multifamily residential purposes shall be erected to\na height in excess of four stories unless it provides for the maintenance\nof adequate elevator service."
				}
			]
		},
		{
			"paragraph": "§ 176-135",
			"title": "Building permit required; application requirements; revocation of permit.",
			"content": [
				{
					"text": "No building shall be erected until the Village\nClerk or Superintendent of Buildings shall issue a permit certifying\nthat the proposed building and use comply in every respect with this\nchapter, and all applications for such permits shall be in writing\nand accompanied by a plot plan in duplicate drawn to a scale showing\nthe actual dimensions of the lot to be built upon, the size of the\nbuilding to be erected, the location of the building upon the lot,\nthe dimensions of all open spaces, the setback lines observed by buildings\nwithin the block and proof, by certificate from an insurance company\nlicensed to do business in the State of New York, that the contractor\nor person or persons performing the work carries liability insurance\nin limits commonly referred to as $250/500,000 for bodily injuries\nand $50,000 for property damage, and such other information as may\nbe necessary to provide for the enforcement of this chapter. Such\ncertificate shall provide that no revocation of said insurance shall\nbe effective except upon 10 days notice to the Village Clerk. The\nrequirement of a certificate of insurance shall be waived in connection\nwith any application for construction whose actual cost is $999 or\nless. Such permit shall be issued for a period of six months from\nthe date thereof. In the event, however, of a change in the provisions\nof this chapter or in the map accompanying the same, during such period\nof six months, which change or changes would prevent the issuance\nof such permit if then applied for and if the Superintendent of Buildings\nor Village Clerk shall determine that work has not begun under such\npermit, he shall revoke said permit and immediately send notice of\nrevocation thereof to the holder thereof at the address given in the\napplication therefor. The Superintendent of Buildings or Village Clerk\nis also authorized at any time during the life of such permit to revoke\nthe same if it shall satisfactorily appear to him that any material\nstatement in or portion of the application therefor is untrue or inaccurate.\nWithin 10 days prior to the expiration of such permit and upon showing\nof sufficient cause therefor, and in the event that no changes in\nthis chapter or in the map accompanying the same have been made to\nprevent, the Superintendent of Buildings or Village Clerk may extend\nthe permit for a further period of six months but such extended permit\nshall be liable to all the provisions of this section as if the same\nwere an original issuance thereof. A copy of this section shall be\nprinted upon each permit or extended permit issued by the Superintendent\nof Buildings or Village Clerk."
				}
			]
		},
		{
			"paragraph": "§ 176-136",
			"title": "Sewage disposal facilities required.",
			"content": [
				{
					"text": "No apartment shall be permitted in any district\nor classification herein described, not provided with suitable or\nefficient municipal sewage disposal facilities, unless an independent\nsewage disposal plant having the approval of the Superintendent of\nBuildings or Village Clerk is constructed for the sanitary disposal\nof the sewage of such buildings.\nEditor's Note: Original Section 17(a), which\nimmediately followed this section, was repealed 10-7-1974.\n"
				}
			]
		},
		{
			"paragraph": "§ 176-137",
			"title": "Garages; motor vehicle storage in conjunction with apartment houses.",
			"content": [
				{
					"text": "Storage places for motor vehicles will be permitted\non the same lot with apartment houses at the rate of one car for each\nfamily, for families who are permanent residents in such buildings,\nsubject to the provisions of Article VI, 176-40C, but no facilities\nfor other than minor repairs will be permitted therein."
				}
			]
		},
		{
			"paragraph": "§ 176-138",
			"title": "Public garages and gasoline service stations.",
			"content": [
				{
					"text": "Public garage or gasoline service station shall\nbe permitted in a Business, Industrial A or Economic Development A\nDistrict when approved by the Board of Trustees of the Village as\na special exception, upon proper application therefor and after public\nhearing on public notice and upon such terms and conditions as said\nBoard may deem reasonable to protect surrounding properties, promote\nproper traffic patterns, and the health, safety and general welfare\nof the community. In no event, however, shall a building or lot be\nused or occupied as a public garage or gasoline service station If\nthe same is within 200 feet of a lot used for a public school or private\nschool approved by the Board of Regents, public library, church, hospital\nor a one- or two-family residence.\nEditor's Note: Original Sections 20 and 21,\nwhich immediately followed this section, were repealed 2-17-1969.\n"
				}
			]
		},
		{
			"paragraph": "§ 176-139",
			"title": "Nullification and voidance of variances and permits.",
			"content": [
				{
					"text": "Every variance, conditional, special exception\nor other use permit granted by the Board of Appeals, Planning Board\nor the Board of Trustees pursuant to the provisions of a Village ordinance\nor the Village Law shall become null, void and of no further force\nor effect one year after the decision granting said variance or use\npermit is filed in the office of the Clerk of the Village, unless,\nwithin said period of one year. the applicant or his successor in\ninterest:"
				},
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Undertakes the construction work authorized by the\nvariance or use permit; or"
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "If said variance or use permit is not granted for\nthe purpose of any construction, institutes the use granted by the\nvariance or use permit."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 176-140",
			"title": "Fencing.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "General."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Unless specifically noted otherwise in the Village\nordinances all fencing shall conform to the requirements of this chapter."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Fences shall be constructed with the finished\nside facing adjoining property. No supports, posts or bracing shall\nbe placed on the same side of the fence which faces adjoining property."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Fences, including the footings, shall be capable\nof sustaining a ten-pound-per-square-foot wind load."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "No fence shall project beyond the property line."
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "Application for permit."
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "A plan of the property indicating the major\nstructures and the proposed location and extent of the fence shall\nbe submitted to the Village Building Inspector in duplicate for approval\nprior to construction."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "The fee shall be $25. All fees prescribed in\nthis section shall be collected by the Village Clerk and no permit\nshall be issued by the Building Inspector until such fees have been\npaid.\nEditor's Note: Amended at time of adoption\nof Code (see Ch. 1, General Provisions, Art. I).\n"
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(6) ",
											"content": [
												{
													"text": "Chain link fabric, if used, shall be black,\nbrown, gray, or green plastic coated. No insert strips shall be permitted,\nexcept in Business Districts, as set forth below. The black, brown,\ngray, or green coating shall be plasticized polyvinyl chloride (PVC)\nwith low temperature (-20º F.) plasticizer and no fillers, extenders\nor extraneous matter other than the necessary stabilizers and pigments.\nThe color shall be stabilized and have light fastness sufficient to\nmeet 4,000 hours under ASTM-D1499 E42 Type B. The vinyl clad wire\nshall withstand an accelerated aging test of 2,000 hours at 145º\nF. without cracking or peeling. The vinyl clad wire shall be self-extinguishing.[Amended 11-13-1980 by L.L. No. 6-1980; 11-14-1985 by L.L. No. 6-1985; 5-17-1999 by L.L. No. 3-1999]"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "The vinyl properties shall conform to the following:"
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "The vinyl wall thickness shall conform to the\nfollowing:"
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(7) ",
											"content": [
												{
													"text": "Any existing fence requiring, in the opinion\nof the Building Inspector, repairs exceeding 50% of the value of the\nfence shall be completely revised to conform to this chapter."
												}
											]
										},
										{
											"number": "(8) ",
											"content": [
												{
													"text": "No barbed wire, concertina wire or similar or\nother pointed or sharp edged wire, which could cause injury to someone\nwho holds it, is permitted.[Added 5-17-1999 by L.L. No. 3-1999]"
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Location limitations."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "On interior lots, no fencing shall be permitted\nin the front yard, except on Mill Pond Road, Avenue C, Valley Road,\nShore Road and Harbor Road.[Amended 7-27-2009 by L.L. No. 3-2009]"
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "On corner lots, the following regulations shall\napply:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "Fencing for a front yard contiguous with public\nproperty shall be limited to fences having a minimum of 50% free area\nwhen projected as a front elevation. Such fencing shall be constructed\nof cedar, cypress or polyvinyl synthetic materials. Metal fences of\nall kinds are prohibited (inclusive of chain link). Such fencing shall\nsimulate in external appearance painted white or unpainted cedar or\ncypress or similar woods.[Amended 7-27-2009 by L.L. No. 3-2009]"
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "Fencing for any yard contiguous with public\nproperty shall conform to the requirements for the front yard.[Amended 11-8-1993 by L.L. No. 6-1993]"
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "Fencing for the side yard contiguous with private\nproperty shall not project forward of the immediately adjacent front\nface of the major structure on the property."
																}
															]
														},
														{
															"number": "(d) ",
															"content": [
																{
																	"text": "Fencing contiguous with public property shall\nbe set back a minimum of two feet from a public sidewalk, and in no\nevent shall the fence be located outside the property line.[Amended 11-8-1993 by L.L. No. 6-1993]"
																}
															]
														},
														{
															"number": "(e) ",
															"content": [
																{
																	"text": "Fencing for a rear yard may project into the adjacent front\nyard, enclosing the rear yard, but shall not project forward of the\nrear face of the major structure on the property. The portion of fence\nenclosing the rear yard shall not exceed five feet in height. This\nsection shall include corner parcels.[Added 7-27-2009 by L.L. No. 3-2009]"
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Notwithstanding any of the provisions in Subsection\n(1) or (2) hereof to the contrary, in a Business District, a chain\nlink fence with black, brown, gray, or green inserts shall be permitted\nso long as the fence meets all of the other requirements of this section\nand is not in the front yard. Such inserts shall be aluminum, PVT,\nperma hedge, or an equivalent thereto as may be approved by the Village\nBuilding Inspector.[Added 5-17-1999 by L.L. No. 3-1999]"
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Maximum height limitations.[Amended 11-8-1993 by L.L. No. 6-1993; 6-13-1994 by L.L. No. 1-1994]"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "The height of a fence shall be measured to the\nhighest point of the fence from the existing grade directly below\nthat point. Fence support posts may exceed the maximum height by not\nmore than four inches so long as said posts are not greater in size\nthan five inches by five inches and other terminal posts (at corners,\nends and gates) do not exceed one every four feet.[Amended 7-27-2009 by L.L. No. 3-2009"
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "In all zoning districts, front yard fences,\nwhen permitted by this § 176-140, shall not exceed three\nfeet in height."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "In residential zones, no fence shall exceed\nfive feet in height, except in a rear yard."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "In residential zones, no fence shall exceed\nsix feet in height in a rear yard. However, any such fence which exceeds\nfive feet in height shall be constructed of either painted white or\nunpainted cedar or cypress or similar woods, or polyvinyl chloride\nor other synthetic materials of durable, weather resistant character\nand construction, which are reasonably acceptable to the Village Building\nOfficial, provided that such polyvinyl chloride or other synthetic\nmaterials simulate in external appearance painted white or unpainted\ncedar or cypress or similar woods. For example and further clarity,\nbut without limiting the foregoing, aluminum, and steel material,\nsuch as chain link, and synthetic materials not satisfying the foregoing\ncriteria are not permitted.[Amended 5-14-2001 by L.L. No. 3-2001]"
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "In nonresidential zones, except as provided\nin Subsection (6) hereof, no fence shall exceed seven feet in height."
												}
											]
										},
										{
											"number": "(6) ",
											"content": [
												{
													"text": "In Business Districts, at retail shopping centers\ncomprising 11 contiguous acres or more, wood fences exceeding seven\nfeet in height but not exceeding 10 feet in height, may be erected\nwith the permission of the Board of Trustees, subject to the following\nconditions and considerations:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "Such fences may only be erected in the rear\nand side yards. For the purpose of determining rear and side yards,\nsatellite buildings with building areas of less than 20,000 square\nfeet shall not be taken into consideration. The front yard shall be\nestablished for the shopping center as a whole and not on a building\nby building basis."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "Appropriate site lines for vehicular and pedestrian\ntraffic shall be provided by curb cuts and at corners."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "An application under this subsection shall be\nfiled with the Village Clerk. Such application must be in writing\nand submitted in triplicate verified by the applicant or applicants\nwhich shall contain the following:"
																},
																{
																	"content": [
																		{
																			"number": "[1] ",
																			"content": [
																				{
																					"text": "Identity of the fee title owner of the property\nand the contract vendee or lessee of the property, if any;"
																				}
																			]
																		},
																		{
																			"number": "[2] ",
																			"content": [
																				{
																					"text": "Fee title owner and contract vendee and/or lessee\nof the property, if any, must join in the application;"
																				}
																			]
																		},
																		{
																			"number": "[3] ",
																			"content": [
																				{
																					"text": "General statement of reasons or facts justifying\nthe relief sought."
																				}
																			]
																		}
																	]
																}
															]
														},
														{
															"number": "(d) ",
															"content": [
																{
																	"text": "The Board of Trustees, in considering such application,\nmay issue a permit for a wood fence not exceeding 10 feet in height,\npermanently or for a limited period of time, subject to such conditions\nand safeguards as shall be deemed appropriate, including the requirement\nfor appropriate landscaping or other aesthetic devices to soften the\nvisual effect of the fence when, in its opinion, it shall find that\nthe public health, morals, safety and general welfare of the Village\nwill be secured and the nature and character of the existing neighborhood\nand the value of the property therein will be protected and secured\nby such fence."
																}
															]
														}
													]
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "Fence supports."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Posts.[Amended 6-2-1986 by L.L. No. 9-1986]"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "All fences greater than five feet in height\nand fences enclosing water pools shall be supported by galvanized\nsteel posts, having the following minimum dimensions:"
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "Fence posts shall be set in concrete footings\nto a minimum depth of 30 inches below grade. Wooden fence sections\nshall be lag bolted or through bolted to the posts using galvanized\nsteel brackets. Nails will not be acceptable. The brackets shall be\na minimum of two feet long, two inches wide and 1/8 inch thick. All\nposts shall be capped. The posts and caps shall not extend above the\nwooden fence sections."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "All galvanized steel posts, if used, shall be\nblack, brown, gray, or green plastic coated. The black, brown, gray,\nor green coating shall be plasticized polyvinyl chloride (PVC) meeting\nall of the standards for PVC applicable to chain link fences set forth\n§ 176-140A(6).[Amended 5-17-1999 by L.L. No. 3-1999]"
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Rails. All wooden fences greater than five feet\nin height and fences enclosing water pools shall be supported on a\nminimum of two horizontal support rails fabricated of galvanized steel\npipe having a minimum outside dimension of 1 3/8 inches. The horizontal\nsupport rails shall be fitted to the posts using standard couplings.\nFence sections shall be lag bolted or through bolted to the horizontal\nrails with galvanized steel clamps having a minimum thickness of 1/8\ninch. Chain link fences enclosing water pools shall have, as a minimum,\na top rail of galvanized steel, 1 3/8 inches O.D."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Notwithstanding anything to the contrary in\nSubsections (1) and (2) of this subsection, rails on fences made with\npolyvinyl chloride or other synthetic materials of durable, weather\nresistant character and construction, which are reasonably acceptable\nto the Village Building Official, and which simulate in external appearance\npainted white or unpainted cedar or cypress or similar woods, may\nalso be made with polyvinyl chloride or such other synthetic materials,\nas applicable.[Added 5-14-2001 by L.L. No. 3-2001]"
												}
											]
										}
									]
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 176-141",
			"title": "Valet parking.",
			"content": [
				{
					"text": "Valet parking shall be conditionally permitted,\nwhen authorized by the Board of Trustees, as an accessory use to any\nuse permitted or conditionally permitted in the Village on the following\nconditions:"
				},
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "In addition to such other signs as may be permitted\nby the Village, additional signs stating \"Valet Parking\" and the name\nof the business may be erected at a location approved by the Board\nof Trustees of sufficient size to be visible from the street to the\nextent deemed by the Board of Trustees to be deemed necessary to inform\nthe public of the valet parking operation."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "The stopping or standing of vehicles for pickup and\nfor delivery by the valet parkers shall be solely at locations which\ndo not prohibit the stopping or standing of vehicles; do not unreasonably\ninterfere with traffic; and do not unreasonably interfere with the\npeace and quiet of nearby property owners."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Except to avoid an imminent accident, or when directed\nby a police officer, under no circumstances shall a vehicle which\nis stopped, is standing or is otherwise being operated on the public\nstreets of the Village for valet parking purposes which is being operated\nby or directed by the valet parkers or someone on behalf of the valet\nparkers or on behalf of the owner, operator, manager, or any other\nagent or employee of the principal use for which the valet parking\nis being provided, violate any of the provisions of the New York State\nVehicle and Traffic Law or the ordinances or local laws of the Village\nof Port Washington North."
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "The valet parkers shall at all times operate the vehicles\nwhich they are parking in a manner so as not to adversely affect nearby\nproperty owners. Accordingly, the valet parkers shall not permit the\nradios in the vehicles they are operating to be heard outside the\nvehicles; shall not operate the vehicles they are parking in such\na manner as to cause their tires to \"squeal\" or make other noises\nby rapidly accelerating or decelerating, except to avoid an accident;\nand shall not sound their horn except to avoid an accident, and then\nonly to the minimum extent necessary."
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "A conditional use permit for valet parking may be\nissued for a period of one year and shall automatically expire at\nthe end of said year unless renewed by the permittee, with the consent\nof the Board of Trustees, for another year."
								}
							]
						},
						{
							"number": "F. ",
							"content": [
								{
									"text": "The failure of the applicant to have received any\nsummonses or to have been found guilty of any violations of the New\nYork State Vehicle and Traffic Law or the Village's ordinances and\nlocal laws shall not preclude the Board of Trustees from denying a\npermit or a renewal of a permit if there is sufficient evidence for\nit to believe that the applicant or the individuals who will be responsible\nfor the business or the valet parking operations have not or will\nnot comply with the conditions set forth in this section."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 176-142",
			"title": "Commercial vehicles.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "As used in this section, the term \"commercial vehicle\"\nshall include every type of motor vehicle used for commercial purposes\non the highways, such as the transportation of goods, wares and merchandise\nand motor coaches carrying passengers."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "No commercial vehicle shall be stored or parked on\nany property which is zoned or used for residential purposes. It shall\nbe an affirmative defense in any prosecution for a violation of this\nsection that:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "It was reasonable or necessary for the vehicle\nto be parked at the subject location while the operator was actually\nengaged in either the loading or the unloading of the vehicle at the\nsubject location; or"
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "It was reasonable or necessary for the vehicle\nto be parked at the subject location while the operator of the vehicle\nwas actually engaged in performing services on the premises or performing\nservices of a residential nature for a person then present at and\na resident of the subject premises."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "No commercial vehicle shall be serviced at any time\non any property which is zoned or used for residential purposes, or\non a public highway which is immediately adjacent to any property\nwhich is zoned or used for residential purposes. It shall be an affirmative\ndefense in any prosecution for a violation of this section that such\nservice was reasonably or necessarily required before such vehicle\ncould be safely moved to a permitted location."
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "No commercial vehicle shall be washed or otherwise\ncleaned at any time on any property which is zoned or used for residential\npurposes, or on a public highway which is immediately adjacent to\nany property which is zoned or used for residential purposes."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 176-143",
			"title": "Hours of convenience and other retail stores.",
			"content": [
				{
					"text": "No convenience or other retail store within\nthe Village of Port Washington North, except as hereinafter provided,\nshall be open for business between the hours of 11:00 p.m. and 6:00\na.m. This section shall not apply to:"
				},
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "The sale of gasoline, kerosene, diesel motor fuel\nand/or gasohol which is regulated by Local Law No. 4 of 1998 of the\nVillage of Port Washington North.\nEditor's Note: See Ch. 102, Sale of Gasoline.\n"
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Supermarkets with retail floor areas in excess of\n25,000 square feet."
								}
							]
						}
					]
				}
			]
		}
	]
}