{
	"url": "http://www.cityofwhiteplains.com/DocumentCenter/View/1682",
	"paras": [
        {
        	"paragraph": "§ 5.8.6",
        	"title": "Height",
        	"content": [
        		{
        			"text": "The maximum permitted “height” shall be six “stories,” but not exceed 65 feet, and two “stories” but not exceed 35 feet for “accessory buildings and structures.” In connection with its approval of a “site plan,” the approving agency may permit a fence or wall to exceed the “height” requirements of Section 4.4.16."
        		}
        	]
        },
        {
        	"paragraph": "§ 5.8.7",
        	"title": "Lot Area, Frontage, Coverage and Yard Requirements:",
        	"content": [
        		{
        			"text": "Lot Area, Frontage, Coverage and Yard Requirements:"
        		},
        		{
        			"content": [
        				{
        					"number": "1. ",
        					"content": [
        						{
        							"text": "The minimum required lot area for all uses including all ancillary uses and accessory uses in a Planned Senior Residential Development District shall be 20 acres. The minimum frontage shall be 700 feet, with 75% of the entire frontage located on a State or County road and sole access (other than for emergency vehicles) shall be to and from a State or County road."
        						}
        					]
        				},
        				{
        					"number": "2. ",
        					"content": [
        						{
        							"text": "The front yard shall measure at least 75 feet in depth, except that the approving agency may permit accessory parking garages within said setback, but with not less than 45 feet from a property line, if adequate screening from adjoining streets, as determined by the approving agency, is provided."
        						}
        					]
        				},
        				{
        					"number": "3. ",
        					"content": [
        						{
        							"text": "The rear yard shall measure at least 55 feet in depth."
        						}
        					]
        				},
        				{
        					"number": "4. ",
        					"content": [
        						{
        							"text": "For residential uses the side yard shall measure 75 feet in depth. For non-residential uses, the side yard shall measure 100 feet in depth."
        						}
        					]
        				},
        				{
        					"number": "5. ",
        					"content": [
        						{
        							"text": "Where the Planned Senior Residential Development District abuts a one or two family dwelling or residential district, accessory structures up to a height of 25 feet may be within 40 feet of the rear or side lot line if adequate screening, as determined by the approving agency, is provided."
        						}
        					]
        				},
        				{
        					"number": "6. ",
        					"content": [
        						{
        							"text": "The maximum building coverage shall not exceed 20% for all buildings, excluding any existing facility determined by the approving agency to meet a critical community need."
        						}
        					]
        				},
        				{
        					"number": "7. ",
        					"content": [
        						{
        							"text": "Dimensional requirements not otherwise specified shall be determined by the approving agency in connection with its approval of a “site plan” application."
        						}
        					]
        				}
        			]
        		}
        	]
        }
    ]
}