{
  "url": "http://ecode360.com/15524316",
  "paras": [
    {
      "paragraph": "§ 271-12",
      "title": "Applicability.",
      "content": [
        {
          "text": "The provisions of this article shall apply in an R District."
        }
      ]
    },
    {
      "paragraph": "§ 271-13",
      "title": "Permitted uses.",
      "content": [
        {
          "content": [
            {
              "number": "A. ",
              "content": [
                {
                  "text": "No building or land shall hereafter be used or occupied and no building\nor part thereof shall be erected, used or altered unless in conformity\nwith the regulations herein specified and except for the purposes\nset forth in this article and for no other purpose."
                }
              ]
            },
            {
              "number": "B. ",
              "content": [
                {
                  "text": "Permitted uses shall be as follows:"
                },
                {
                  "content": [
                    {
                      "number": "(1) ",
                      "content": [
                        {
                          "text": "A single-family detached dwelling."
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "paragraph": "§ 271-14",
      "title": "Fences.",
      "content": [
        {
          "content": [
            {
              "number": "A. ",
              "content": [
                {
                  "text": "In residence districts, fences of any kind or description shall not exceed a height of four feet from ground level. No fences are permitted to be erected within the front yard, as defined under § 271-7 of this chapter. On corner lots or on any lot fronting on more than one street, such plots are determined to have a front yard wherever a street immediately abuts a lot line. All fences shall be so erected that the finished surface shall be faced outward."
                }
              ]
            },
            {
              "number": "B. ",
              "content": [
                {
                  "text": "No fence over three feet in height shall be erected unless the Building Inspector shall issue a permit therefor. The procedure for the issuing of said permit shall be the same as provided in Article XI, § 271-127, hereof. The fee shall be the same as provided for the issuance of a building permit."
                }
              ]
            },
            {
              "number": "C. ",
              "content": [
                {
                  "text": "The enclosure of less than the entire rear yard of a lot, where such\nenclosed portion is used or intended to be used as a dog run or an\nenclosure for an animal or animals, and regardless of the height of\nsuch enclosure, shall not be permitted unless an application for a\nspecial permit therefor shall first have been made to the Board of\nAppeals. The Board of Appeals, if it shall grant such a special permit,\nmay impose such conditions and restrictions with regard to the erection,\nmaintenance and use thereof as it shall deem appropriate."
                }
              ]
            },
            {
              "number": "D. ",
              "content": [
                {
                  "text": "Notwithstanding the foregoing, fences up to a maximum height of six\nfeet from ground level shall be permitted only where the rear yard\nor side yard immediately abuts one of the following public streets,\nzoning districts or uses: Harbor Hill Road, Old Westbury Road, Roslyn\nRoad, Business A District, Business B District, schools, recharge\nbasins or the Park at East Hills. Notwithstanding the foregoing, fences\nup to a maximum of eight feet from ground level shall be permitted\nonly where the rear yard or side yard immediately abuts one of the\nfollowing public streets, zoning districts or uses: Glen Cove Road,\nNorthern Boulevard, Light Industrial District.[Amended 7-20-1998 L.L. No. 8-1998; 5-21-2013 by L.L. No. 7-2013]"
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "paragraph": "§ 271-15",
      "title": "Height restrictions.",
      "content": [
        {
          "content": [
            {
              "number": "A. ",
              "content": [
                {
                  "text": "The height of any principal building shall not exceed 32 feet.[Amended 9-19-2003 by L.L. No. 2-2003]"
                }
              ]
            },
            {
              "number": "B. ",
              "content": [
                {
                  "text": "The height of any accessory building shall not exceed 20 feet."
                }
              ]
            },
            {
              "number": "C. ",
              "content": [
                {
                  "text": "The height of any boundary line fence shall not exceed four feet."
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "paragraph": "§ 271-16",
      "title": "Required lot area.",
      "content": [
        {
          "content": [
            {
              "number": "A. ",
              "content": [
                {
                  "text": "The principal building, as herein defined, or any part thereof shall\nbe erected, constructed, reconstructed, altered, repaired or used\non a plot containing an area of not less than one acre contained in\none lot. Notwithstanding any other state or local law to the contrary,\nthe minimum lot area herein may not be met by combining two or more\ncontiguous plots of land, each of which is less than such required\nminimum lot area.[Amended 8-16-1999 by L.L. No. 5-1999]"
                }
              ]
            },
            {
              "number": "B. ",
              "content": [
                {
                  "text": "There shall not be more than one principal building or portion thereof\nto each one acre contained in a plot."
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "paragraph": "§ 271-17",
      "title": "Lot coverage.",
      "content": [
        {
          "text": "All buildings, including accessory buildings, shall not cover\nmore than 25% of the area of the lot."
        }
      ]
    },
    {
      "paragraph": "§ 271-18",
      "title": "Required floor area.",
      "content": [
        {
          "text": "No main dwelling shall be erected unless it has a habitable\nfloor area of at least 1,800 square feet to be completed prior to\noccupancy."
        }
      ]
    },
    {
      "paragraph": "§ 271-19",
      "title": "Yards.",
      "content": [
        {
          "text": "Each lot shall have front, side and rear yards not less than\nthe depths or widths following."
        },
        {
          "content": [
            {
              "number": "A. ",
              "content": [
                {
                  "text": "Front yard depth: 50 feet."
                }
              ]
            },
            {
              "number": "B. ",
              "content": [
                {
                  "text": "In case of a single-family dwelling, there shall be two side yards,\none on each side of the main building, the aggregate widths of which\nshall be at least 50 feet. Neither side yard shall be less than 20\nfeet wide."
                }
              ]
            },
            {
              "number": "C. ",
              "content": [
                {
                  "text": "Rear yard depth: 30 feet."
                }
              ]
            },
            {
              "number": "D. ",
              "content": [
                {
                  "text": "Corner lot: A building shall not be required to comply with Subsection A, but the depth of yard from any street line shall not be less than 45 feet."
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "paragraph": "§ 271-20",
      "title": "Street frontage required.",
      "content": [
        {
          "text": "No lot shall have a street frontage of less than 160 feet."
        }
      ]
    },
    {
      "paragraph": "§ 271-21",
      "title": "Projection of buildings.",
      "content": [
        {
          "text": "No building or structure or part thereof shall project into\nany yard except as shall be specifically provided in this article."
        }
      ]
    },
    {
      "paragraph": "§ 271-22",
      "title": "Projection of accessory structures.",
      "content": [
        {
          "text": "Stationary outdoor fireplaces may project into the rear yard\nor side yard but shall be at least five feet distant from side and\nrear property lines and shall not exceed eight feet in height."
        }
      ]
    },
    {
      "paragraph": "§ 271-23",
      "title": "Accessory buildings and uses.",
      "content": [
        {
          "content": [
            {
              "number": "A. ",
              "content": [
                {
                  "text": "Accessory buildings or structures shall not occupy more than 20%\nof the rear yard. The yard area occupied by the accessory buildings\nor structures shall be included in computing the maximum percentage\nof the lot area which may be utilized for buildings."
                }
              ]
            },
            {
              "number": "B. ",
              "content": [
                {
                  "text": "Unless otherwise provided in this article, accessory buildings and\nstructures shall be located in the rear yard and shall be not less\nthan 15 feet distant from the main building, not less than 10 feet\ndistant from the rear lot line and not less than 15 feet distant from\nany side line, with the exception of boundary line fences and walls\nwhich may be located on the lot lines."
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "paragraph": "§ 271-24",
      "title": "Churches, schools and related activities.",
      "content": [
        {
          "content": [
            {
              "number": "A. ",
              "content": [
                {
                  "text": "Churches or other similar places of worship, rectories, parish houses,\nconvents and elementary and secondary schools, either parochial or\npublic, operated under the supervision of the Board of Regents of\nthe State of New York, shall be permitted, subject, however, to the\nfollowing conditions and restrictions:"
                },
                {
                  "content": [
                    {
                      "number": "(1) ",
                      "content": [
                        {
                          "text": "Building area. All buildings, including accessory buildings, shall\nnot cover more than 20% of the area of the lot."
                        }
                      ]
                    },
                    {
                      "number": "(2) ",
                      "content": [
                        {
                          "text": "Height. The height of any principal building shall not exceed 35\nfeet; the height of any accessory building shall not exceed 20 feet,\nexcept that an accessory building may be 35 feet in height, provided\nthat it shall be distant at least 100 feet from the main building."
                        }
                      ]
                    },
                    {
                      "number": "(3) ",
                      "content": [
                        {
                          "text": "Yards.\nEach lot shall have front, side and rear yards not less than the depths\nand widths following."
                        },
                        {
                          "content": [
                            {
                              "number": "(a) ",
                              "content": [
                                {
                                  "text": "Front yard depth: 110 feet."
                                }
                              ]
                            },
                            {
                              "number": "(b) ",
                              "content": [
                                {
                                  "text": "Side yard width: each one, 40 feet for a one-story building; each\none, 60 feet for a two-or-more-story building; however, when a side\nyard abuts a street line, the width shall be 110 feet."
                                }
                              ]
                            },
                            {
                              "number": "(c) ",
                              "content": [
                                {
                                  "text": "Rear yard depth: 40 feet for a one-story building; 50 feet for a\ntwo-or-more-story building."
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "number": "(4) ",
                      "content": [
                        {
                          "text": "Parking\narea. Off-street parking on the lot shall be provided in a paved area\nequal in area to two times the area occupied by buildings. Such parking\narea may extend into the side and rear yards but shall be distant\nnot less than 20 feet from any lot line and 15 feet from any street\nline. Surfacing of such area shall be in accordance with Village ordinance."
                        }
                      ]
                    },
                    {
                      "number": "(5) ",
                      "content": [
                        {
                          "text": "Screening.\nWhere a parking area abuts a property line, a screen of evergreen\nshrubs shall be installed along said lines as specified by the Planning\nBoard."
                        }
                      ]
                    },
                    {
                      "number": "(6) ",
                      "content": [
                        {
                          "text": "Marginal\nroadway. A marginal roadway 50 feet in width shall be provided in\nthe front yard and in any side yard abutting a street. Said marginal\nroadway shall extend from the road or street line into the front and\nside yard, shall be separated from the street by a mall 10 feet in\nwidth, and no more than two openings in the mall for access shall\nbe made on any one street; the mall shall be curbed; the pavement\nin the roadway shall be 30 feet in width, and a sidewalk four feet\nin width shall be constructed along the inner side of the marginal\nroadway. All work and construction hereinabove set forth shall be\nin accordance with Village specifications and regulations."
                        }
                      ]
                    },
                    {
                      "number": "(7) ",
                      "content": [
                        {
                          "text": "Plan. The plot plan required to be submitted with the application for the building permit shall, in addition, show the requirements set forth herein, together with the estimated cost of the improvements required in Subsection A(4), (5) and (6)."
                        }
                      ]
                    },
                    {
                      "number": "(8) ",
                      "content": [
                        {
                          "text": "Bond. If the improvements provided in Subsection A(4), (5) and (6) have not been completed prior to the application for a certificate of occupancy, a performance bond for not more than one year may be accepted by the Village Clerk in an amount estimated by the Village Engineer necessary to complete the improvements, which bond shall be a surety company bond in such company as shall be approved by the Board of Trustees and in such form as shall be approved by the Village Attorney. On the acceptance and filing of such bond, the Building Official shall be authorized to issue the certificate of occupancy."
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "number": "B. ",
              "content": [
                {
                  "text": "The provisions of this section shall apply to all residence and business\ndistricts."
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "paragraph": "§ 271-25",
      "title": "Keeping of horses.",
      "content": [
        {
          "content": [
            {
              "number": "A. ",
              "content": [
                {
                  "text": "In any residence district, a plot or parcel of land, herein referred\nto as the \"property\" or the \"premises,\" having an area of more than\none acre and improved with a one-family dwelling actually occupied\nas such, may have thereon not more than two horses for each full acre,\nthe term \"horse\" to include \"pony,\" but only when permitted by the\nBoard of Appeals, after a public hearing, subject to the restrictions\nand conditions hereinafter set forth and such further and other reasonable\nrestrictions and conditions as the Board may impose."
                }
              ]
            },
            {
              "number": "B. ",
              "content": [
                {
                  "text": "The application to the Board of Appeals shall set forth and shall\nalso include a plot plan, which shall show:"
                },
                {
                  "content": [
                    {
                      "number": "(1) ",
                      "content": [
                        {
                          "text": "The dimensions of the property and number of square feet."
                        }
                      ]
                    },
                    {
                      "number": "(2) ",
                      "content": [
                        {
                          "text": "The location of all improvements on the property."
                        }
                      ]
                    },
                    {
                      "number": "(3) ",
                      "content": [
                        {
                          "text": "The proposed location of a stable, together with a sketch or drawing\nof the same and the facilities to be contained therein, which shall\ninclude running water, electricity, and cesspool and sanitary disposal\nfacilities separate from the residence."
                        }
                      ]
                    },
                    {
                      "number": "(4) ",
                      "content": [
                        {
                          "text": "The outdoor area where the horses will be exercised or permitted\nto graze."
                        }
                      ]
                    },
                    {
                      "number": "(5) ",
                      "content": [
                        {
                          "text": "The location of the residences on all abutting properties."
                        }
                      ]
                    },
                    {
                      "number": "(6) ",
                      "content": [
                        {
                          "text": "How the applicant proposes to keep the horses confined to the property."
                        }
                      ]
                    },
                    {
                      "number": "(7) ",
                      "content": [
                        {
                          "text": "How the applicant proposes to store and dispose of the manure, including\nthe location of a manure storage bin which shall be walled on three\nsides by walls not exceeding six feet in height and which shall have\nan area of not less than eight feet square."
                        }
                      ]
                    },
                    {
                      "number": "(8) ",
                      "content": [
                        {
                          "text": "Where the hay, feed or other food for the horses will be kept or\nstored by a suitable enclosure within the stable."
                        }
                      ]
                    },
                    {
                      "number": "(9) ",
                      "content": [
                        {
                          "text": "Such further information as the Board of Appeals may request."
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "number": "C. ",
              "content": [
                {
                  "text": "Together with the application, there shall be submitted to the Board\nof Appeals a written statement from the Long Island Humane Society,\nthe Nassau Suffolk Horsemen's Association or any other agency\nthat said Board may hereafter designate in place of said society,\nwhich shall state whether or not the proposed facilities are adequate\nfor the keeping and stabling of the horses."
                }
              ]
            },
            {
              "number": "D. ",
              "content": [
                {
                  "text": "Each horse kept upon the premises shall, at all times, be owned by\na member of the family residing on the premises, and no other horse\nshall, at any time, be kept, harbored, maintained or boarded on the\npremises. The hiring of or the commercial use of horses shall be prohibited."
                }
              ]
            },
            {
              "number": "E. ",
              "content": [
                {
                  "text": "No stable shall be erected or maintained within 30 feet of the residence\nnor within 30 feet of any side or rear property line and shall be\nlocated only in the rear yard, except that if, at the time of the\napplication, there is in existence on the property of the applicant\nan existing structure erected prior to the enactment of this section,\nthe Board of Appeals may, in its discretion, permit the same to be\nused for a stable, provided that said structure in all other respects\ncomplies with the provisions of this section and of the Building Code[1] of this Village and the fire and health regulations of\nNassau County."
                },
                {
                  "footnote": "[1]\nEditor's Note: See Ch. 223, Building Construction.\n"
                }
              ]
            },
            {
              "number": "F. ",
              "content": [
                {
                  "text": "No living quarters shall be permitted in the same building in which\nthe horses are stabled."
                }
              ]
            },
            {
              "number": "G. ",
              "content": [
                {
                  "text": "No manure or any other material or substances which cause or create\nany noxious or offensive odors or dust or which cause or may cause\nthe presence of or attract any vermin, rodents or other animals shall\nbe permitted to be or remain in, on or upon the premises."
                }
              ]
            },
            {
              "number": "H. ",
              "content": [
                {
                  "text": "No horses shall be permitted to be, roam or graze in or on any part\nof the premises other than the rear yard, and they shall be corralled\nor confined in such manner and by such means and within such portions\nof the rear yard as the Board of Appeals shall direct."
                }
              ]
            },
            {
              "number": "I. ",
              "content": [
                {
                  "text": "The applicant shall construct, plant and maintain such landscaping\nand/or fencing as the Board of Appeals shall direct."
                }
              ]
            },
            {
              "number": "J. ",
              "content": [
                {
                  "text": "The Board of Appeals, in considering the application, shall not grant\nthe same unless it shall find, in each instance, that the granting\nof the same will not:"
                },
                {
                  "content": [
                    {
                      "number": "(1) ",
                      "content": [
                        {
                          "text": "Adversely affect the public health, safety and general welfare."
                        }
                      ]
                    },
                    {
                      "number": "(2) ",
                      "content": [
                        {
                          "text": "Depreciate the value of the property in an area immediately adjoining\nthe subject property."
                        }
                      ]
                    },
                    {
                      "number": "(3) ",
                      "content": [
                        {
                          "text": "Alter the essential character of the neighborhood."
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "number": "K. ",
              "content": [
                {
                  "text": "The application shall be accompanied by a writing signed by each\nowner and the occupant of the subject property and acknowledged in\nthe form required for the recording of a deed, containing a consent,\nin form and substance satisfactory to the Board of Appeals, that so\nlong as any stable shall continue to remain on the property or so\nlong as any horse is kept, maintained or stabled on the property,\nthe Village Building Inspector or any other Village official, person,\nagency or employee designated by the Village Board of Trustees or\nany society duly chartered for the prevention of cruelty to any animals\nor for the regulation of animal treatment shall have the right to\nenter upon the premises or any part thereof for the purpose of making\nsuch inspection and investigation as the Village may deem appropriate,\nand said consent shall be irrevocable."
                }
              ]
            },
            {
              "number": "L. ",
              "content": [
                {
                  "text": "The provisions of this section shall apply in all residence districts."
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}