{
	"url": "http://ecode360.com/11449112",
	"paras": [
		{
			"paragraph": "§ 252-11",
			"title": "Permitted uses.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "In these districts, no buildings or premises shall\nbe used, and no building shall be erected or altered, which is arranged,\nintended or designed to be used for other than any of the following\nspecified trades, industries or uses:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Churches or other places of worship, with or without\nliving quarters for persons engaged in carrying on the church activities\nor of the school affiliated therewith; parish houses or Sunday school\nbuildings; public and parochial schools, provided that any such school\nis licensed by or under the jurisdiction of the Education Department\nof the State of New York; public libraries or telephone exchanges\nwithout storage of trucks, incidental material or construction equipment\nplaced upon the open ground of the premises except in the course of\nconstruction work."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Farming, truck gardening, nurseries or greenhouses,\nprovided that there is no display for commercial purposes or advertisement\non the premises."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Home gardening for personal use."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "Municipal playgrounds or parks."
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "Railroad passenger stations, but not including freight\nyards."
												}
											]
										},
										{
											"number": "(6) ",
											"content": [
												{
													"text": "Single-family detached houses.[Amended 6-18-1968 by Ord. No. 68-14]"
												}
											]
										},
										{
											"number": "(7) ",
											"content": [
												{
													"text": "Usual accessory uses which are necessary to the above\nuses when located in the same building or upon the same lot."
												}
											]
										},
										{
											"number": "(8) ",
											"content": [
												{
													"text": "A home office is permitted as an accessory use to\na dwelling where such use will:[Amended 2-4-2002 by L.L. No. 1-2002]"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "Not exceed 500 square feet;"
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "Not involve nonresident employees or business\nrelated visits by nonresidents of the dwelling;"
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "Involve no evidence of such business outside\nof the dwelling, including signage, storage of materials or equipment,\nor display of work products; and"
																}
															]
														},
														{
															"number": "(d) ",
															"content": [
																{
																	"text": "Involves no external alterations or additions\nto the home for the purpose of accommodating the home office.[1]"
																},
																{
																	"footnote": "[1]\nEditor's Note: Former Subsection A(9), regarding\nthe keeping of boarders or roomers, which immediately followed this\nsubsection, was repealed 7-25-2005 by L.L. No. 2-2005.\n"
																}
															]
														}
													]
												}
											]
										}
									]
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 252-12",
			"title": "Prohibited uses.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "In these districts no building or premises shall be\nused, and no building shall be erected or altered, which is arranged,\nintended or designed to be used for any of the following specified\ntrades, industries or uses:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Cemeteries or crematories."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Clinics or dispensaries."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Clubs, except as such are ordinarily a part of church\nwork."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "Convalescent homes."
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "Hotels."
												}
											]
										},
										{
											"number": "(6) ",
											"content": [
												{
													"text": "Kindergarten, nursery or private schools."
												}
											]
										},
										{
											"number": "(7) ",
											"content": [
												{
													"text": "Mortuaries, undertaking or embalming parlors or similar\nplants, or offices for such establishments or businesses."
												}
											]
										},
										{
											"number": "(8) ",
											"content": [
												{
													"text": "Philanthropic or charitable institutions."
												}
											]
										},
										{
											"number": "(9) ",
											"content": [
												{
													"text": "Public or private hospitals or other places or buildings\nwhere persons suffering from mental or other diseases of any kind\nwhatsoever are kept or treated, except that this shall not prohibit\na doctor in his own office, when conducted within a dwelling, from\nmaking diagnosis or treating of patients."
												}
											]
										},
										{
											"number": "(10) ",
											"content": [
												{
													"text": "Homes for animals or in which animals are boarded\nor hospitals or places where animals are boarded, treated, cared for\nor sold."
												}
											]
										},
										{
											"number": "(11) ",
											"content": [
												{
													"text": "There is prohibited in Dwelling A and Dwelling\nB Districts all uses prohibited in the following districts: Dwelling\nC District, Commercial District, Light Manufacturing or Industrial\nDistricts."
												}
											]
										},
										{
											"number": "(12) ",
											"content": [
												{
													"text": "Boardinghouses, rooming houses or lodging houses.[Amended 6-13-1968 by Ord. No. 68-19]"
												}
											]
										}
									]
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 252-13",
			"title": "Signs and billboards.",
			"content": [
				{
					"text": "No billboards, signboards or advertising signs\nshall be allowed upon the building or premises in either of these\ndistricts, except that a small sign showing the premises to be for\nrent or sale may be used, provided that such sign is not nearer the\nstreet line than the building setback or front yard line and does\nnot exceed four square feet in size."
				}
			]
		},
		{
			"paragraph": "§ 252-14",
			"title": "Required frontage and living area; restrictions on use of other structures for residences.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Except as hereinafter provided, no dwelling or other\nbuilding shall be constructed on a lot that has less than:[Amended 2-5-1990 by L.L. No. 2-1990; 10-21-1996 by L.L. No. 9-1996; 1-6-1997 by L.L. No. 1-1997]"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "A minimum of 55 feet frontage as measured at the street\nline of the lot;"
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "A minimum width of 55 feet at the front setback line\nof the dwelling or buildings; and"
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "A minimum width of 55 feet throughout the front setback\narea."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Each such dwelling must have a separate lot area of\nat least 5,500 square feet and not less than 1,000 square feet of\nliving space above the foundation.[Amended 2-5-1990 by L.L. No. 2-1990]"
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "No other building for residence purposes shall be\nerected on a lot occupied by any one- or two-family house."
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "No dwelling and/or accessory structure shall hereafter\nbe altered or erected which occupies more than 35% of the lot area."
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "Subsections A and B of this section shall not apply to any lot having a frontage of 40 feet or greater, which parcel has been held prior to August 4, 1986, and continuously thereafter, in single and separate ownership.[Added 1-4-1988 by L.L. No. 5-1988;\namended 4-4-1988 by L.L. No. 9-1988]"
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 252-15",
			"title": "Required frontage, lot area and living space for new subdivisions.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Frontage; lot area.[Amended 1-4-1988 by L.L. No. 2-1988; 10-21-1996 by L.L. No. 9-1996; 1-6-1997 by L.L. No. 1-1997]"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "No dwelling or other building shall be constructed\non any lot of a subdivision or tract of land (as distinguished from\na lot) where such lot has:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "A frontage of less than 55 feet as measured\nat the street line of the lot;"
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "A minimum width of less than 55 feet at the\nfront setback line of the dwelling or building; and"
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "A minimum width of 55 feet throughout the front\nsetback area."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Each such dwelling or building must have a separate\nlot area of at least 5,500 square feet and not less than 1,000 square\nfeet of living space above the foundation.[Amended 2-5-1990 by L.L. No. 2-1990; 1-6-1997 by L.L. No.\n1-1997]"
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "By \"tract\" it is meant any division of any parcel\nof land into five or more lots or sites for immediate or future sale\nor for building development in such a way as to create one or more\nnew streets or extensions of existing streets or changes in existing\nstreets or lot lines. This provision shall not apply to any subdivision\nor tract of land which has heretofore been designated as a subdivision\nof land for which a map or tentative plan has been approved or tentatively\napproved by the Planning Board of the Village prior to the sixth day\nof May 1946, or by any other municipal body requiring approval, registration\nor filing of the map.[1]"
								},
								{
									"footnote": "[1]\nEditor's Note: Former Subsection C, defining\n\"subdivision,\" which immediately followed this subsection, was repealed\n3-24-2003 by L.L. No. 2-2003.\n"
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 252-16",
			"title": "Height restrictions; height and dimensions of garages.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "No building\nshall be raised, altered or erected in a Dwelling A or Dwelling B\nDistrict which exceeds 2 1/2 stories or 35 feet in height above curb\nlevel."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Garages\nand accessory structures."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "No\nstructure or accessory structure or accessory building in a Dwelling\nA or Dwelling B District shall be more than 12 feet in height."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Notwithstanding the provisions in Subsection B(1) above:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "A one-car garage, with a gabled roof, in a Dwelling A or B District\nshall not exceed 12 feet in height nor shall it exceed 350 square\nfeet of gross floor area."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "A two-car garage with a gabled rook, with Architectural Review Board\napproval, may be up to 14 feet in height and 450 square feet of gross\nfloor area."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "A three-car garage with a gabled roof, with Architectural Review\nBoard approval, may be up to 14 feet in height and 600 square feet\nof gross floor area."
																}
															]
														},
														{
															"number": "(d) ",
															"content": [
																{
																	"text": "The Architectural Review Board shall consider the size of the lot,\nthe proximity of the garage to surrounding lots, the aesthetic, harmonious,\nand economic impact of the proposed garage on the neighborhood, and\nthe health, safety and welfare of the surrounding neighborhood when\ndetermining the permissible height of two- or three-car garage."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "All\naccessory structures including garages shall be constructed on grade\nwith no footings or other part thereof below grade."
												}
											]
										}
									]
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 252-17",
			"title": "Required setbacks.",
			"content": [
				{
					"text": "No building or part there of shall be erected\nor altered in these districts that is nearer the street line upon\nwhich it fronts than the average setback of the buildings on the same\nside of the street within the same block, but no street wall of a\nbuilding need be set back more than 30 feet in a Dwelling A District\nand 20 feet in a Dwelling B District. When all lots on any side of\na block are vacant, no street wall of a building in a Dwelling A District\nshall be set nearer than 25 feet to the street line and in a Dwelling\nB District shall not be set nearer than 20 feet to the street line.\nPorches in these districts shall not be nearer the street line than\n15 feet in a Dwelling A District and 10 feet in a Dwelling B District.\nOn corner lots the setback distance from the street line, other than\nthe street upon which the building or any projection fronts, shall\nbe not less than 15 feet."
				}
			]
		},
		{
			"paragraph": "§ 252-18",
			"title": "Side yards.",
			"content": [
				{
					"text": "No side yard shall be less than five feet at\nany story height. The sum of the minimum widths of both side yards\nshall not be less than 15 feet."
				}
			]
		},
		{
			"paragraph": "§ 252-19",
			"title": "Rear yards.",
			"content": [
				{
					"text": "A rear yard is required on each lot. The depth\nof a rear yard shall be the mean distance of 20 feet."
				}
			]
		},
		{
			"paragraph": "§ 252-20",
			"title": "Use of trailers or house cars.",
			"content": [
				{
					"text": "Any provision of this chapter to the contrary\nnotwithstanding the temporary use or occupancy of a private trailer\nor house car shall be permitted under the following circumstances:"
				},
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "The private trailer or house car shall be for the\ntemporary use and occupancy of an individual or group of individuals\nwhose single-family residential dwelling has been so damaged by fire\nor by some act of God as to render said dwelling uninhabitable."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "The private trailer or house car must be placed on\nthe same plot as the single-family residential dwelling which is being\nrebuilt or on a contiguous parcel."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "To obtain a permit for the above mentioned use, a\nverified application on a form furnished by the Building Department\nshall be sworn to and filed by the applicant with the Building Department,\nalong with an application fee in such amount as established by resolution\nof the Village Board. Said application shall contain assurances that\nthe following requisites shall be satisfactorily complied with:[Amended 7-25-2005 by L.L. No. 6-2005]"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Sanitary drainage systems shall be connected to a\nsewer or cesspool in a manner approved by the Building Department."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "No wastewater shall be discharged on the ground."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "The electrical system of the trailer or house car\nshall be connected to the available utility lines, and the installation\nthereof shall be approved by the New York Board of Fire Underwriters."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "The water connections shall be made in a manner approved\nby the Building Department."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "Notwithstanding the provisions of this chapter with\nrespect to minimums or requirements, in granting the permit, the Superintendent\nof the Building Department shall consider the rights of adjacent property\nowners so that there shall not be any unreasonable deprivation of\nlight or of a reasonable use of adjoining property."
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "The Superintendent of the Building Department is here\nby authorized, in the exercise of reasonable discretion, to revoke\nany permit issued hereunder if, after due investigation, he finds\nthat the holder thereof has violated any provision of this section\nor if the trailer or house car is being used in an unsafe manner.\nWritten notice of said revocation shall be given by personal service\nor by certified registered mail, return receipt requested."
								}
							]
						},
						{
							"number": "F. ",
							"content": [
								{
									"text": "The length of time a private trailer or house car\nshall be permitted to remain shall be six months, with one three-month\nextension. A further extension shall not be permitted, and the private\ntrailer or house car shall be removed at the end of the permitted\nperiod of time. If the private trailer or house car is not so removed,\nthere shall be a per-diem civil penalty in such amount as set by resolution\nof the Village Board for each day that it remains beyond the permitted\nperiod of time. If the private trailer or house car remains for more\nthan 10 days beyond the permitted period of time, the Superintendent\nof the Building Department or his representative shall, after notifying\nthe owner of said private trailer or house car by registered or certified\nmail, return receipt requested, cause the private trailer or house\ncar to be removed. The expense of removal and any resulting storage\nshall be paid by the owner of the private trailer or house car, and,\nif said cost is not paid within 10 days, the Superintendent of the\nBuilding Department may advertise for the public sale of the private\ntrailer or house car in the official newspaper of the Village of Lynbrook\nand sell the private trailer or house car to the highest bidder at\npublic sale. Any monies realized from the sale shall be applied to\nany outstanding civil penalties and shall be used to reimburse the\nVillage of Lynbrook for any expense incurred in moving and storing\nthe private trailer or house car. Any excess monies shall be remitted\nto the owner of the private trailer or house car.[Amended 7-25-2005 by L.L. No. 6-2005]"
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 252-59",
			"title": "Applicability.",
			"content": [
				{
					"text": "The provisions of this chapter shall be subject\nto such exceptions, additions or modifications as herein provided\nfor in the following supplementary regulations."
				}
			]
		},
		{
			"paragraph": "§ 252-60",
			"title": "Construction of permitted uses.",
			"content": [
				{
					"text": "All uses permitted in the Village shall be in a structure having support by columns or by walls, as defined in § 252-2, and shall be erected in accordance with the Building Code[1] requirements of the Village in all other respects and\nafter a permit and certificate of occupancy have been issued."
				},
				{
					"footnote": "[1]\nEditor's Note: See Ch. 31, Building Construction.\n"
				}
			]
		},
		{
			"paragraph": "§ 252-61",
			"title": "Bulk requirements to be complied with.",
			"content": [
				{
					"text": "No building shall be erected or altered and\nno lot area shall be so reduced that thereby the minimum dimensions\nof yards, courts or other open spaces shall be less than prescribed\nby this chapter, except where a practical and unnecessary hardship\nresults."
				}
			]
		},
		{
			"paragraph": "§ 252-62",
			"title": "Shows and similar exhibitions to be in permanent structures.",
			"content": [
				{
					"text": "In no district shall there be permitted any\nshow, exhibition or performance, circus, carnival, theatrical representation,\nmoving picture shows, feats of horsemanship, caravan of animals, or\nof any animals or artificial curiosity, unless same are housed in\na permanent structure erected for theatrical or show purposes in conformity\nwith the Building Code[1] of the Village."
				},
				{
					"footnote": "[1]\nEditor's Note: See Ch. 81, Building Construction.\n"
				}
			]
		},
		{
			"paragraph": "§ 252-63",
			"title": "Certain amusements to be in permanent structures.",
			"content": [
				{
					"text": "In no district shall there be permitted the\nerection or maintenance of carousel, Ferris wheel, gravity steeplechase,\nscenic cave or scenic railway, bicycle carousel, striking machine,\nswitchback or merry-go-round, unless housed in an enclosed permanent\nstructure erected for such purposes in conformity with the Building\nCode[1] of the Village."
				},
				{
					"footnote": "[1]\nEditor's Note: See Ch. 81, Building Construction.\n"
				}
			]
		},
		{
			"paragraph": "§ 252-64",
			"title": "Minimum setbacks.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "The front yard or setbacks of any structure in all\ndistricts shall be the greater of:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "The front yard setbacks required in that district\npursuant to the Articles of this chapter;"
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "The setbacks shown upon the Zoning Setback Map, as\nprepared by Carman-Dunne, Inc., which map is made a part of this chapter;[1] or"
												},
												{
													"footnote": "[1]\nEditor's Note: A copy of the Zoning Setback\nMap is on file in the office of the Building Department and may be\ninspected during regular business hours.\n"
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "The average front yard setbacks of all existing structures\non the block the parcel upon which the structure is to be built or\nmaintained is located and on the same side of the street as the subject\nparcel."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "With respect to corner plots, such plots in the Commercial,\nLight Manufacturing and Industrial Districts shall be deemed to have\ntwo front yards for purposes of compliance with the front yard setback\nprovisions of this section."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 252-65",
			"title": "Village not subject to chapter.",
			"content": [
				{
					"text": "The Village may permit or erect, alter or use\nin any district any building or premises to be used for the housing\nof fire apparatus or performance of firemanic duties, or premises\nfor municipal use or purpose."
				}
			]
		},
		{
			"paragraph": "§ 252-66",
			"title": "Public parking lots.",
			"content": [
				{
					"text": "The Village may license for use in the Commercial,\nLight Manufacturing and Industrial Districts any lot or plot for public\nparking, for which parking a charge may be made, upon fee to be paid\nby the owner or lessee of said premises to the Village, and said Village\nmay use for public parking, for which no fee is charged, any lot or\nplot in the Village."
				}
			]
		},
		{
			"paragraph": "§ 252-67",
			"title": "Uses allowed with permit.",
			"content": [
				{
					"text": "The Board of Appeals may, in appropriate cases,\nafter public notice and hearing and subject to appropriate conditions\nand safeguards imposed by the said Board of Appeals for the health,\nsafety, morals or general welfare of the public determine and vary\nthe application of the use regulations contained in this article established\nin harmony with the general purpose of the Zoning Ordinances and within\nthe limits of the state enabling acts and the intent thereof, without\nthe applicant being obliged to show practical difficulties or unnecessary\nhardship as follows:"
				},
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Permit in the Light Manufacturing or industrial Districts\na small animal hospital, subject however, to the standard and guide\nprovision contained in this chapter."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "In no district except Light Manufacturing and Industrial\nshall there be permitted to be placed in the open in any yard, lot\nor plot for storage any vehicles, material or tools, nor shall same\nbe permitted upon fly such lot or plot where a building or buildings\nare to be constructed, unless a permit has been legally issued therefor\nand only for the purpose of such construction, but all such materials\nshall be fenced in."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 252-68",
			"title": "Issuance of permits for municipal uses and public utilities.",
			"content": [
				{
					"text": "The Board of Trustees reserves to itself the\ndiscretion, approval and authority to issue permits for the erection,\nenlargement or increase of buildings and uses for municipal uses or\npurposes and for public utility companies for public use, upon such\nconditions as it may deem necessary for the public health, safety,\nmorals and general welfare."
				}
			]
		},
		{
			"paragraph": "§ 252-69",
			"title": "Billboards and signs.",
			"content": [
				{
					"text": "No billboards or advertising signs shall be\nerected or maintained in the A, B or C District, and no billboards\nin the Commercial District. Billboards or advertising signs may be\nerected in the Light Manufacturing or Industrial Districts, provided\nthat same are not more than 50 square feet in area. All such billboards\nand advertising signs shall be three feet or more clear above the\nground and shall be 10 feet or more from any lot line. If not attached\nto the wall of the building for their entire length, they must be\nlighted on both sides, the lights, however, so arranged or shielded\nas not to shine into any building used for dwelling purposes in the\nvicinity of said billboard or sign."
				}
			]
		},
		{
			"paragraph": "§ 252-70",
			"title": "(Reserved)\n                                                                                          [1]",
			"content": [
				{
					"footnote": "[1]\nEditor's Note: Former § 252-70,\nUndersized lots, was repealed 3-19-2007 by L.L. No. 4-2007.\n"
				}
			]
		},
		{
			"paragraph": "§ 252-71",
			"title": "Reductions in lots.",
			"content": [
				{
					"text": "No lot shall be so reduced in area that any\nrequired open space will be smaller than prescribed in the regulation\nfor the district in which said lot is located, except as hereinbefore\nset forth."
				}
			]
		},
		{
			"paragraph": "§ 252-72",
			"title": "Visual obstructions.",
			"content": [
				{
					"text": "After December 18, 1978, on a corner lot in\nany residence district, no fence, wall, hedge or other structure or\nplanting more than three feet in height shall be erected or placed\nfrom a point 20 feet from the inside sidewalk line."
				}
			]
		},
		{
			"paragraph": "§ 252-73",
			"title": "Bay windows.",
			"content": [
				{
					"text": "Bay windows, including their cornices and eaves,\nmay project into any required yard not more than two feet; provided,\nhowever, that the sum of such projection on any wall does not exceed\n1/3 the length of said wall."
				}
			]
		},
		{
			"paragraph": "§ 252-74",
			"title": "Fire escapes.",
			"content": [
				{
					"text": "Open fire escapes may extend into any required\nyard not more than four feet six inches."
				}
			]
		},
		{
			"paragraph": "§ 252-75",
			"title": "(Reserved)\n                                                                                          [1]",
			"content": [
				{
					"footnote": "[1]\nEditor's Note: Former § 252-75,\nLots divided by district boundaries, was repealed 12-9-1991 by L.L.\nNo. 11-1991.\n"
				}
			]
		},
		{
			"paragraph": "§ 252-76",
			"title": "Businesses on residential district boundaries.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Where a residence district is bounded by a portion\nof a Commercial, Light Manufacturing or Industrial District, referred\nto hereafter as \"business district,\" any side street extending through\nsuch residence district into such business district shall not be used\nfor any business purposes except as herein set forth."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "The business structure erected in said business district\nshall face and open upon the street set aside for business purposes,\nexcept that show windows in such business structures may be built\nand exposed upon said side street within the area set aside as a part\nof such business district, and an entrance may be made at the corner\nof such business and residential street; and all other entrances thereto\nmust face on the business street, except that entrances may be made\nfrom such residential street to the upper stories of such business\nstructure."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "All front, side and rear doors of all such business\nstructures must be and remain securely closed, except when being used\nto exit from or enter into such business structures.[Added 4-15-1985 by L.L. No. 3-1985]"
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 252-77",
			"title": "Required yards between business and residence districts.",
			"content": [
				{
					"text": "Where a lot in a business or industrial district\nabuts a lot in a residence district, there shall be provided along\nsuch abutting line a yard equal in width or depth to that required\nin the residence district. Such yard need not be in excess of 10 feet."
				}
			]
		},
		{
			"paragraph": "§ 252-78",
			"title": "Permits affected by legislation in process.",
			"content": [
				{
					"text": "No permit shall be issued for a use which is\nprohibited or which is not expressly permitted in an amendment to\nthis chapter or to a new Zoning Ordinance which has already been published,\nuntil such amendment or ordinance has been either defeated or adopted\nand ordained. In the event it is defeated, then if the use is permitted\nby the old ordinance, a permit shall be issued therefor, if the applicant\nhas complied with all the code and other Village requirements. If\nthe use is prohibited by an adopted or ordained ordinance, then no\npermit shall be issued."
				}
			]
		},
		{
			"paragraph": "§ 252-79",
			"title": "Standards for grant of exception.",
			"content": [
				{
					"text": "When the Board of Appeals grants an exception referred to in this article, then it shall be guided in its determination and discretion by the same standard as is set out in § 252-115."
				}
			]
		},
		{
			"paragraph": "§ 252-80",
			"title": "Storage of fuel to service vehicles of owner or occupant.",
			"content": [
				{
					"text": "A person, firm, association or corporation may,\nfor the sole purpose of servicing the vehicle used in his or its own\nbusiness with gasoline, maintain for such service not more than two\npumps and the tanks necessary therefor, such tanks to hold not more\nthan 2,000 gallons of gasoline. Neither the pumps nor tanks may be\ninstalled inside the building but must be so located that they shall\nbe wholly used and operated within the property lines of the building\nlot, the tanks to be serviced by vehicles without using the sidewalk."
				}
			]
		}
	]
}