{
	"url": "http://ecode360.com/11449176",
	"paras": [
		{
			"paragraph": "§ 252-21",
			"title": "Permitted uses.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "In this district, no building or premises shall be\nused, and no building shall be erected or altered, for other than\none or more of the following uses:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Any use permitted in a Dwelling A or B District."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Multiple dwellings, subject to approval of the Board\nof Trustees, after public hearing and notice.[Amended 11-20-1967 by Ord. No. 67-6]"
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "(Reserved)[1]"
												},
												{
													"footnote": "[1]\nEditor's Note: Former Subsection A(3), which\nlisted hotels, lodges and clubs as permitted uses, as amended 8-13-1968\nby Ord. No. 68-18. was repealed 9-19-1988 by L.L. No. 13-1988 and\nagain 10-26-1992 by L.L. No. 11-1992.\n"
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "Two-family detached houses.[Added 8-13-1968 by Ord. No. 68-18]"
												}
											]
										}
									]
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 252-22",
			"title": "Height restrictions.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "No one-family dwelling, two-family dwelling or other building or part thereof permitted pursuant to § 252-11 shall be raised, altered or erected to a height in access of three stories or 40 feet in height above curb level, except that the height of accessory uses shall be governed by § 252-22B."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Garages\nand accessory structures."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "No\nstructure or accessory structure or accessory building in a Dwelling\nC District shall be more than 12 feet in height."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Notwithstanding the provisions in Subsection B(1) above:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "A one-car garage, with a gabled roof, in a Dwelling C District shall\nnot exceed 12 feet in height nor shall it exceed 350 square feet of\ngross floor area."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "A two-car garage with a gabled roof, with Architectural Review Board\napproval, may be up to 14 feet in height and 450 square feet of gross\nfloor area."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "A three-car garage with a gabled roof, with Architectural Review\nBoard approval, may be up to 14 feet in height and 600 square feet\nof gross floor area."
																}
															]
														},
														{
															"number": "(d) ",
															"content": [
																{
																	"text": "The Architectural Review Board shall consider the size of the lot\nthe proximity of the garage to surrounding lots, the aesthetic, harmonious,\nand economic impact of the proposed garage on the neighborhood, and\nthe health, safety and welfare of the surrounding neighborhood when\ndetermining the permissible height of a two- or three-car garage."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "All\nnecessary structures including garages shall be constructed on grade\nwith no footings or other part thereof below grade."
												}
											]
										}
									]
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 252-23",
			"title": "(Reserved)\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t[1]",
			"content": [
				{
					"footnote": "[1]\nEditor's Note: Former § 252-23.\nRestrictions on structures used for more than two families as residences,\nwas repealed 10-26-1992 by L.L. No. 11-1992.\n"
				}
			]
		},
		{
			"paragraph": "§ 252-24",
			"title": "Required lot area and living space.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "No two-family house shall be constructed in the district,\nnor shall any one-family house heretofore constructed be altered or\nreconstructed into a two-family house in said district unless the\nsame shall have a lot that has not less than:[Amended 10-21-1996 by L.L. No. 9-1996; 1-6-1997 by L.L. No. 1-1997]"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "A minimum of 60 feet of frontage as measured at the\nstreet line of the lot;"
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "A minimum width of no less than 60 feet at the front\nsetback line of the building or dwelling; and"
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "A minimum width of 60 feet throughout the front setback\narea."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Each such dwelling must have a separate lot area of\nat least 6,000 square feet and not less than 2,000 square feet of\nliving space above the foundation."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 252-25",
			"title": "Front yards.",
			"content": [
				{
					"text": "The front yard in Dwelling C District shall\nbe the same as provided for one- and two-family dwellings in the Dwelling\nA District."
				}
			]
		},
		{
			"paragraph": "§ 252-26",
			"title": "Side yards.",
			"content": [
				{
					"text": "Side yards shall be a minimum of 15 feet on each side of the building, except that the side yard requirements for one- and two-family dwellings in this district shall be the same as provided in Article III hereof for Dwelling A and Dwelling B Districts."
				}
			]
		},
		{
			"paragraph": "§ 252-27",
			"title": "Rear yards; restrictions on dwelling behind principal structure.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Rear yards shall be a minimum of 20 feet."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "No dwelling house, apartment house or multiple dwelling\nshall hereafter be erected in the rear of another residence on the\nsame lot, except where such buildings face on two different streets,\nand provided further that there is compliance with the minimum area\nrequirements for front, side and rear yards as hereinbefore provided."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 252-28",
			"title": "Prohibited uses.",
			"content": [
				{
					"text": "There is prohibited in this district all uses\nwhich are prohibited in the Commercial, Light Manufacturing and Industrial\nDistricts."
				}
			]
		},
		{
			"paragraph": "§ 252-59",
			"title": "Applicability.",
			"content": [
				{
					"text": "The provisions of this chapter shall be subject\nto such exceptions, additions or modifications as herein provided\nfor in the following supplementary regulations."
				}
			]
		},
		{
			"paragraph": "§ 252-60",
			"title": "Construction of permitted uses.",
			"content": [
				{
					"text": "All uses permitted in the Village shall be in a structure having support by columns or by walls, as defined in § 252-2, and shall be erected in accordance with the Building Code[1] requirements of the Village in all other respects and\nafter a permit and certificate of occupancy have been issued."
				},
				{
					"footnote": "[1]\nEditor's Note: See Ch. 31, Building Construction.\n"
				}
			]
		},
		{
			"paragraph": "§ 252-61",
			"title": "Bulk requirements to be complied with.",
			"content": [
				{
					"text": "No building shall be erected or altered and\nno lot area shall be so reduced that thereby the minimum dimensions\nof yards, courts or other open spaces shall be less than prescribed\nby this chapter, except where a practical and unnecessary hardship\nresults."
				}
			]
		},
		{
			"paragraph": "§ 252-62",
			"title": "Shows and similar exhibitions to be in permanent structures.",
			"content": [
				{
					"text": "In no district shall there be permitted any\nshow, exhibition or performance, circus, carnival, theatrical representation,\nmoving picture shows, feats of horsemanship, caravan of animals, or\nof any animals or artificial curiosity, unless same are housed in\na permanent structure erected for theatrical or show purposes in conformity\nwith the Building Code[1] of the Village."
				},
				{
					"footnote": "[1]\nEditor's Note: See Ch. 81, Building Construction.\n"
				}
			]
		},
		{
			"paragraph": "§ 252-63",
			"title": "Certain amusements to be in permanent structures.",
			"content": [
				{
					"text": "In no district shall there be permitted the\nerection or maintenance of carousel, Ferris wheel, gravity steeplechase,\nscenic cave or scenic railway, bicycle carousel, striking machine,\nswitchback or merry-go-round, unless housed in an enclosed permanent\nstructure erected for such purposes in conformity with the Building\nCode[1] of the Village."
				},
				{
					"footnote": "[1]\nEditor's Note: See Ch. 81, Building Construction.\n"
				}
			]
		},
		{
			"paragraph": "§ 252-64",
			"title": "Minimum setbacks.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "The front yard or setbacks of any structure in all\ndistricts shall be the greater of:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "The front yard setbacks required in that district\npursuant to the Articles of this chapter;"
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "The setbacks shown upon the Zoning Setback Map, as\nprepared by Carman-Dunne, Inc., which map is made a part of this chapter;[1] or"
												},
												{
													"footnote": "[1]\nEditor's Note: A copy of the Zoning Setback\nMap is on file in the office of the Building Department and may be\ninspected during regular business hours.\n"
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "The average front yard setbacks of all existing structures\non the block the parcel upon which the structure is to be built or\nmaintained is located and on the same side of the street as the subject\nparcel."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "With respect to corner plots, such plots in the Commercial,\nLight Manufacturing and Industrial Districts shall be deemed to have\ntwo front yards for purposes of compliance with the front yard setback\nprovisions of this section."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 252-65",
			"title": "Village not subject to chapter.",
			"content": [
				{
					"text": "The Village may permit or erect, alter or use\nin any district any building or premises to be used for the housing\nof fire apparatus or performance of firemanic duties, or premises\nfor municipal use or purpose."
				}
			]
		},
		{
			"paragraph": "§ 252-66",
			"title": "Public parking lots.",
			"content": [
				{
					"text": "The Village may license for use in the Commercial,\nLight Manufacturing and Industrial Districts any lot or plot for public\nparking, for which parking a charge may be made, upon fee to be paid\nby the owner or lessee of said premises to the Village, and said Village\nmay use for public parking, for which no fee is charged, any lot or\nplot in the Village."
				}
			]
		},
		{
			"paragraph": "§ 252-67",
			"title": "Uses allowed with permit.",
			"content": [
				{
					"text": "The Board of Appeals may, in appropriate cases,\nafter public notice and hearing and subject to appropriate conditions\nand safeguards imposed by the said Board of Appeals for the health,\nsafety, morals or general welfare of the public determine and vary\nthe application of the use regulations contained in this article established\nin harmony with the general purpose of the Zoning Ordinances and within\nthe limits of the state enabling acts and the intent thereof, without\nthe applicant being obliged to show practical difficulties or unnecessary\nhardship as follows:"
				},
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Permit in the Light Manufacturing or industrial Districts\na small animal hospital, subject however, to the standard and guide\nprovision contained in this chapter."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "In no district except Light Manufacturing and Industrial\nshall there be permitted to be placed in the open in any yard, lot\nor plot for storage any vehicles, material or tools, nor shall same\nbe permitted upon fly such lot or plot where a building or buildings\nare to be constructed, unless a permit has been legally issued therefor\nand only for the purpose of such construction, but all such materials\nshall be fenced in."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 252-68",
			"title": "Issuance of permits for municipal uses and public utilities.",
			"content": [
				{
					"text": "The Board of Trustees reserves to itself the\ndiscretion, approval and authority to issue permits for the erection,\nenlargement or increase of buildings and uses for municipal uses or\npurposes and for public utility companies for public use, upon such\nconditions as it may deem necessary for the public health, safety,\nmorals and general welfare."
				}
			]
		},
		{
			"paragraph": "§ 252-69",
			"title": "Billboards and signs.",
			"content": [
				{
					"text": "No billboards or advertising signs shall be\nerected or maintained in the A, B or C District, and no billboards\nin the Commercial District. Billboards or advertising signs may be\nerected in the Light Manufacturing or Industrial Districts, provided\nthat same are not more than 50 square feet in area. All such billboards\nand advertising signs shall be three feet or more clear above the\nground and shall be 10 feet or more from any lot line. If not attached\nto the wall of the building for their entire length, they must be\nlighted on both sides, the lights, however, so arranged or shielded\nas not to shine into any building used for dwelling purposes in the\nvicinity of said billboard or sign."
				}
			]
		},
		{
			"paragraph": "§ 252-70",
			"title": "(Reserved)\n                                                                                          [1]",
			"content": [
				{
					"footnote": "[1]\nEditor's Note: Former § 252-70,\nUndersized lots, was repealed 3-19-2007 by L.L. No. 4-2007.\n"
				}
			]
		},
		{
			"paragraph": "§ 252-71",
			"title": "Reductions in lots.",
			"content": [
				{
					"text": "No lot shall be so reduced in area that any\nrequired open space will be smaller than prescribed in the regulation\nfor the district in which said lot is located, except as hereinbefore\nset forth."
				}
			]
		},
		{
			"paragraph": "§ 252-72",
			"title": "Visual obstructions.",
			"content": [
				{
					"text": "After December 18, 1978, on a corner lot in\nany residence district, no fence, wall, hedge or other structure or\nplanting more than three feet in height shall be erected or placed\nfrom a point 20 feet from the inside sidewalk line."
				}
			]
		},
		{
			"paragraph": "§ 252-73",
			"title": "Bay windows.",
			"content": [
				{
					"text": "Bay windows, including their cornices and eaves,\nmay project into any required yard not more than two feet; provided,\nhowever, that the sum of such projection on any wall does not exceed\n1/3 the length of said wall."
				}
			]
		},
		{
			"paragraph": "§ 252-74",
			"title": "Fire escapes.",
			"content": [
				{
					"text": "Open fire escapes may extend into any required\nyard not more than four feet six inches."
				}
			]
		},
		{
			"paragraph": "§ 252-75",
			"title": "(Reserved)\n                                                                                          [1]",
			"content": [
				{
					"footnote": "[1]\nEditor's Note: Former § 252-75,\nLots divided by district boundaries, was repealed 12-9-1991 by L.L.\nNo. 11-1991.\n"
				}
			]
		},
		{
			"paragraph": "§ 252-76",
			"title": "Businesses on residential district boundaries.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Where a residence district is bounded by a portion\nof a Commercial, Light Manufacturing or Industrial District, referred\nto hereafter as \"business district,\" any side street extending through\nsuch residence district into such business district shall not be used\nfor any business purposes except as herein set forth."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "The business structure erected in said business district\nshall face and open upon the street set aside for business purposes,\nexcept that show windows in such business structures may be built\nand exposed upon said side street within the area set aside as a part\nof such business district, and an entrance may be made at the corner\nof such business and residential street; and all other entrances thereto\nmust face on the business street, except that entrances may be made\nfrom such residential street to the upper stories of such business\nstructure."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "All front, side and rear doors of all such business\nstructures must be and remain securely closed, except when being used\nto exit from or enter into such business structures.[Added 4-15-1985 by L.L. No. 3-1985]"
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 252-77",
			"title": "Required yards between business and residence districts.",
			"content": [
				{
					"text": "Where a lot in a business or industrial district\nabuts a lot in a residence district, there shall be provided along\nsuch abutting line a yard equal in width or depth to that required\nin the residence district. Such yard need not be in excess of 10 feet."
				}
			]
		},
		{
			"paragraph": "§ 252-78",
			"title": "Permits affected by legislation in process.",
			"content": [
				{
					"text": "No permit shall be issued for a use which is\nprohibited or which is not expressly permitted in an amendment to\nthis chapter or to a new Zoning Ordinance which has already been published,\nuntil such amendment or ordinance has been either defeated or adopted\nand ordained. In the event it is defeated, then if the use is permitted\nby the old ordinance, a permit shall be issued therefor, if the applicant\nhas complied with all the code and other Village requirements. If\nthe use is prohibited by an adopted or ordained ordinance, then no\npermit shall be issued."
				}
			]
		},
		{
			"paragraph": "§ 252-79",
			"title": "Standards for grant of exception.",
			"content": [
				{
					"text": "When the Board of Appeals grants an exception referred to in this article, then it shall be guided in its determination and discretion by the same standard as is set out in § 252-115."
				}
			]
		},
		{
			"paragraph": "§ 252-80",
			"title": "Storage of fuel to service vehicles of owner or occupant.",
			"content": [
				{
					"text": "A person, firm, association or corporation may,\nfor the sole purpose of servicing the vehicle used in his or its own\nbusiness with gasoline, maintain for such service not more than two\npumps and the tanks necessary therefor, such tanks to hold not more\nthan 2,000 gallons of gasoline. Neither the pumps nor tanks may be\ninstalled inside the building but must be so located that they shall\nbe wholly used and operated within the property lines of the building\nlot, the tanks to be serviced by vehicles without using the sidewalk."
				}
			]
		}
	]
}