{
	"url": "http://ecode360.com/6308055",
	"paras": [
		{
			"paragraph": "§ 575-90",
			"title": "Applicability.",
			"content": [
				{
					"text": "In a Residence D District the following regulations\nshall apply."
				}
			]
		},
		{
			"paragraph": "§ 575-91",
			"title": "Use.",
			"content": [
				{
					"text": "A building may be erected, altered or used and\na lot or premises may be used for any of the purposes set forth in\nthis section and for no other:"
				},
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Single-family detached dwelling."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Public school."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Church or other building used exclusively for religious purposes, when authorized by the Board of Trustees pursuant to the provisions of § 575-170.9 of this chapter.[Amended 12-15-2015 by L.L. No. 9-2015]"
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "Government or municipal building, for the administration\nof or service rendered by the Village government."
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "Parochial and nonprofit private school, when authorized by the Board of Trustees pursuant to the provisions of § 575-170.9 of this chapter.[Amended 12-15-2015 by L.L. No. 9-2015]"
								}
							]
						},
						{
							"number": "F. ",
							"content": [
								{
									"text": "Municipal park, for recreational use."
								}
							]
						},
						{
							"number": "G. ",
							"content": [
								{
									"text": "Accessory private garage, detached or attached to\nor within the main building, for the parking of vehicles used for\nthe residential use of the main building.[1][Amended 1-6-2004 by L.L. No. 3-2004]"
								},
								{
									"footnote": "[1]\nEditor's Note: Original § 210-57H,\nwhich listed \"certain business uses\" as a permitted use, which previously\nfollowed this subsection, was repealed 7-29-1980 by L.L. No. 4-1980.\n"
								}
							]
						},
						{
							"number": "H. ",
							"content": [
								{
									"text": "Accessory use on the same lot with and customarily incidental to any of the above permitted uses, including those specified in §§ 575-102 and 575-103."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 575-92",
			"title": "Height.",
			"content": [
				{
					"text": "The maximum height of a building shall not exceed 30 feet or\n22 feet at the eaves. The foregoing shall not apply to chimneys, antennas,\nand decorative cupolas, which may not penetrate a sky plane height\nof 35 feet."
				},
				{
					"footnote": "[1]\nEditor's Note: This local law also stated\nthat if any unexpired building permit or any application is substantially\namended after 1-17-2006, it shall be required to conform to the provisions\nof this local law.\n"
				}
			]
		},
		{
			"paragraph": "§ 575-93",
			"title": "Population density and street frontage.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "No single-family dwelling shall be constructed on\nor occupy an interior lot having an area of less than 4,000 square\nfeet or having a street frontage of less than 40 feet."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "No single-family dwelling shall be constructed on\nor occupy a corner lot having an area of less than 4,400 square feet\nor having street frontage of less than 45 feet on any one abutting\nmunicipal street or less than 143 feet on all abutting municipal streets.[Amended 2-4-2003 by L.L. No. 2-2003; 3-18-2003 by L.L. No.\n7-2003]"
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "No building used for one of the purposes referred to in § 575-91C may be constructed on or occupy a lot having an area of less than one acre or having street frontage of less than 200 feet. No building used for one of the purposes referred to in § 575-91E may be constructed on or occupy a lot having an area of less than five acres or having street frontage of less than 200 feet."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 575-94",
			"title": "Building area and floor area ratio.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "For single-family dwelling use, the building area shall not exceed 30% of the lot area and, subject to any modifications required by § 575-167 of this chapter, the floor area ratio shall not exceed the limits hereinafter set forth:[Amended 12-2-1997 by L.L. No. 4-1997]"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "On interior lots: 0.50 of the first 4,000 square feet\nof lot area; 0.20 of the lot area in excess of the first 4,000 square\nfeet which is less than 100 feet from the street on which the lot\nabuts; and 0.10 of the lot area in excess of the first 4,000 square\nfeet which is farther than 100 feet from said street. To the extent\nrequired, all of the area of the lot within 100 feet of the street\non which the lot abuts must be included in the calculation of the\nfirst 4,000 square feet of lot area."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "On corner lots: 0.50 of the first 4,000 square feet\nof lot area; and 0.15 of the lot area in excess of the first 4,000\nsquare feet."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "For uses authorized under § 575-91D and F, the building area and floor area ratio shall be established by the Board of Trustees. For uses referred to in § 575-91C and E, the building area shall not exceed 20% of the lot area, and the floor area ratio may not exceed 0.50 of the first 8,000 square feet of lot area and 0.15 of the lot area in excess of 8,000 square feet."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 575-95",
			"title": "Lot width and lot depth.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "On an interior lot:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "A minimum lot width of 40 feet shall be maintained\nfrom the street line for the first 100 feet of lot depth or 30 feet\nbeyond that point of construction of the principal building that is\nfarthest from the street line, whichever distance is greater."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "There shall be a minimum depth of 100 feet."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "On a corner lot:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "A minimum lot width of 45 feet shall be maintained\nfrom the lesser of the street lines of both public streets for the\nfirst 100 feet of lot depth or 30 feet beyond that point of construction\nof the principal building that is located farthest from such street\nline, whichever distance is greater."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "There shall be a minimum depth of 100 feet from the\nlesser of the street lines of both public streets."
												}
											]
										}
									]
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 575-96",
			"title": "(Reserved)\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t[1]",
			"content": [
				{
					"footnote": "[1]\nEditor's Note: Former § 575-96, Outdoor compressors, was repealed 2-19-2008 by L.L. No. 4-2008. See now § 575-170.2.\n"
				}
			]
		},
		{
			"paragraph": "§ 575-97",
			"title": "Floor area and minimum clearance.",
			"content": [
				{
					"text": "No dwelling shall be erected unless it has a\nhabitable floor area of at least 1,000 square feet. The minimum clearance\nbetween the lower edge of the floor beams and the ground or floor\nbeneath shall be at least two feet."
				}
			]
		},
		{
			"paragraph": "§ 575-98",
			"title": "Front yards.",
			"content": [
				{
					"text": "All lots shall have at least one front yard.\nA corner lot shall have a front yard on each public street on which\nthe lot abuts. All front yards shall have a minimum depth equal to\nthe greater of 20 feet or the average depth of the front yards of\nother lots which are on the same block front and within 200 feet.\nIn no event, however, shall a front yard be required to have a depth\nwhich is greater than 35 feet."
				}
			]
		},
		{
			"paragraph": "§ 575-99",
			"title": "Side yards.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "On an interior lot, a single-family dwelling shall\nhave two side yards, one on each side of the main building. The aggregate\nwidth of the two side yards shall not be less than 15 feet, plus 1/2\nof the width of the lot in excess of 40 feet. No side yard shall have\na width of less than 1/3 of the minimum required aggregate width of\nboth side yards. Where practical, the wider of the two side yards\nshall be placed adjacent to the narrower of the side yards of an adjoining\nlot or lots."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "On a corner lot, a single-family dwelling shall have only one side yard abutting an interior lot adjacent thereto. Said side yard shall have a minimum width of seven feet, plus 1/3 of the width of the lot in excess of 45 feet measured in the same direction. The side yard shall be on the side adjoining the interior lot opposite the front yard having the greater street frontage. The two yards fronting on public streets shall be considered front yards, as provided by § 575-98, and the remaining yard shall be considered a rear yard and shall conform to the provisions of § 575-100.[Amended 2-4-2003 by L.L. No. 2-2003]"
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "On a corner lot, a building other than a single-family dwelling shall have only one side yard. Said side yard shall be on the side adjoining the interior lot opposite the front yard having the greater street frontage. Said side yard shall have a minimum width of 20 feet. The remaining yard shall be considered the rear yard and shall conform to the provisions of § 575-100."
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "On an interior lot, a main building other than a single-family\ndwelling shall have two side yards, neither of which shall be less\nthan 20 feet."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 575-100",
			"title": "Rear yards.",
			"content": [
				{
					"text": "There shall be a rear yard, the depth of which\nshall be 25 feet plus 1/4 of the depth of the lot in excess of 100\nfeet."
				}
			]
		},
		{
			"paragraph": "§ 575-101",
			"title": "Permitted encroachments.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "The following encroachments into required yards are\nhereby permitted:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Cornices, eaves, gutters and chimneys not more than\n24 inches."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Bay windows not more than six feet in length and one\nstory high, three feet."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "One-story open porch, having a maximum eave height\nof 12 feet, and a terrace, neither one of which may project more than\n5 1/2 feet into a minimum front yard.[Amended 12-2-1997 by L.L. No. 4-1997]"
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "One-story enclosed vestibule, not greater than nine\nfeet in width, projecting not more than 5 1/2 feet into a minimum\nfront yard.[Amended 12-2-1997 by L.L. No. 4-1997; 6-5-2001 by L.L. No. 4-2001]"
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "One-story open porch or terrace, which shall project\ninto a rear yard not more than 10 feet."
												}
											]
										},
										{
											"number": "(6) ",
											"content": [
												{
													"text": "Unenclosed and unroofed platform and steps, designed\nto provide safe access to grade from service entrance doors, may extend\nnot more than three feet six inches into a minimum side yard. The\nmaximum horizontal surface of any encroaching platform shall not exceed\n14 square feet."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "In any case where the Board of Appeals has finished\na required yard by a variance, the foregoing permitted encroachments\nshall be reduced to the extent of such diminution."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 575-102",
			"title": "Accessory structures.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "[1]Retaining walls shall not extend above the ground that\nthey support."
								},
								{
									"footnote": "[1]\nEditor’s Note: Former Subsection A, concerning fences, as amended, was repealed 11-20-2012 by L.L. No. 17-2012. This local law also proved for the redesignation of former Subsections B through D as Subsections A through C, respectively.\n"
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Stationary outdoor fireplaces shall be located at\nleast 10 feet from property lines and shall not exceed five feet in\nheight."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Pergolas shall not exceed 10 feet in height."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 575-103",
			"title": "Accessory buildings.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "There shall be no more than two accessory buildings\non a lot. No accessory building shall be over 15 feet in height at\nthe highest point, and in the aggregate said accessory buildings shall\nnot occupy more than 500 square feet or 40% of the rear yard.[Amended 6-26-1990 by L.L. No. 5-1990]"
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Unless otherwise provided in this article, accessory\nbuildings or structures shall be located in the rear yard and shall\nbe not less than 10 feet distant from the main building and not less\nthan three feet distant from the rear and side lot lines.[Amended 11-18-2008 by L.L. No. 9-2008]"
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Unless otherwise provided in this article, accessory\nbuildings or structures on corner lots 100 feet or less in depth shall\nbe located as far as possible from the front property lines."
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "No accessory buildings or structures, except fences\nor retaining walls as hereinabove provided in this article, shall\nbe erected within 20 feet of a residential building on an adjoining\nlot."
								}
							]
						}
					]
				}
			]
		}
	]
}