{
	"url": "http://ecode360.com/6308113",
	"paras": [
		{
			"paragraph": "§ 575-104",
			"title": "Applicability.",
			"content": [
				{
					"text": "In a Residence E District the following regulations\nshall apply."
				}
			]
		},
		{
			"paragraph": "§ 575-105",
			"title": "Use.",
			"content": [
				{
					"text": "A building may be erected, altered, or used and a lot or premises\nmay be used for any of the purposes set forth in this section and\nfor no other:"
				},
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Multifamily dwellings, subject to site plan approval by the Board\nof Trustees."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Townhomes, subject to site approval by the Board of Trustees."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Single-family detached dwellings, conforming to all the provisions of Article VIII."
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "House of worship or other building used exclusively for religious purposes, parish house, parochial and nonprofit private school when authorized by the Board of Trustees pursuant to the provisions of § 575-170.9 of this chapter.[Amended 12-15-2015 by L.L. No. 9-2015]"
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "Regularly organized institution of learning approved by the State\nBoard of Regents and supported by public funds, a public library,\nor public art gallery."
								}
							]
						},
						{
							"number": "F. ",
							"content": [
								{
									"text": "Government or municipal building, for the administration of or service\nrendered by the Village government."
								}
							]
						},
						{
							"number": "G. ",
							"content": [
								{
									"text": "Municipal park, for recreational use."
								}
							]
						},
						{
							"number": "H. ",
							"content": [
								{
									"text": "Accessory private garage, detached or attached to or within the main\nbuilding, for the parking of vehicles used for the residential use\nof the main building."
								}
							]
						},
						{
							"number": "I. ",
							"content": [
								{
									"text": "Accessory use on same lot, including, but not limited to:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Real estate office for the management, marketing, and/or sales\nof the units."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Indoor and outdoor recreation facilities, including indoor swimming\npools, spas, tennis courts, clubhouses, pool houses, recreation and/or\nfitness centers, business centers, meeting spaces, and similar facilities,\nprovided that such facilities are planned as an integral part of the\nprincipal use and are for the sole use of the residents of such principal\nuse and their guests."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Off-street parking areas and garages."
												}
											]
										}
									]
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 575-106",
			"title": "Height.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "The maximum height for a townhome shall not exceed 30 feet or 22\nfeet at the eaves."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "The maximum height for a multifamily dwelling shall not exceed 31\nfeet."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "In the case of a building other than one used for dwelling purposes,\nthe maximum height shall not exceed three stories or 31 feet, except\nfor a spire, dome, or belfry on a house of worship."
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "The following encroachments above said maximum heights are hereby\npermitted:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Parapets, not exceeding three feet in vertical distance from\nbase to the highest point or the minimum height required by the New\nYork State Building Code for such parapets, whichever is greater."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Stairwell and elevator lobbies, water tanks, chimneys, heating\nand air-conditioning apparatus, or other mechanical equipment projections\noccupying less than 10% of the area of the roof and not exceeding\n12 feet in vertical distance from base to the highest point."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Safety railings or walls required by the New York State Building\nCode to enclose outdoor living space or decks, not exceeding the minimum\nheight required by the New York State Building Code for such railings\nor walls."
												}
											]
										}
									]
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 575-107",
			"title": "Lot sizes for multifamily dwellings and townhomes.",
			"content": [
				{
					"text": "No multifamily dwelling or townhome shall be constructed and\nno existing building shall be converted for use as a multifamily dwelling\nor townhome on a lot containing an area of less than 20,000 square\nfeet."
				}
			]
		},
		{
			"paragraph": "§ 575-108",
			"title": "Street frontage for multifamily dwellings and townhomes.",
			"content": [
				{
					"text": "No multifamily dwelling or townhome shall be constructed and\nno existing building shall be converted for use as a multifamily dwelling\nor townhome on a lot having street frontage of less than 150 feet\non one street. For clarification, for a corner lot, 70 feet on one\nstreet and 80 feet on another street would not meet the one-hundred-fifty-foot\nrequirement."
				}
			]
		},
		{
			"paragraph": "§ 575-109",
			"title": "Floor area for multifamily dwellings and townhomes.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "No multifamily dwelling shall provide habitable floor area of less\nthan 600 square feet per unit."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "No townhome shall provide habitable floor area of less than 1,000\nsquare feet per unit."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 575-110",
			"title": "Density for multifamily dwellings and townhomes.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "The maximum density for a multifamily dwelling shall be at the ratio\nof 43 dwelling units per acre."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "The maximum density for townhomes shall be at the ratio of 15 dwelling\nunits per acre."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 575-111",
			"title": "Building area.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "The building area for multifamily dwellings and townhomes shall not\nexceed 60% of the lot area."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "The building area for all other uses shall not exceed 35% of the\nlot area."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "In the discretion of the Board of Trustees, as part of its site plan\nreview, the building area of any structure used solely or primarily\nfor parking, whether attached to or detached from the principal building,\nmay be excluded in whole or in part from the maximum building area\nprovisions of this section."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 575-112",
			"title": "Front yards.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "There shall be a front yard, the depth of which shall not be less\nthan 15 feet from the property line and 21 feet from the curb, unless\notherwise approved by the Board of Trustees."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "On a corner lot, a front yard shall be required on each street, each\nhaving a depth of not less than 15 feet from the property line and\n21 feet from the curb, unless otherwise approved by the Board of Trustees."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 575-113",
			"title": "Side yards.",
			"content": [
				{
					"text": "The minimum side yard setback for each side yard shall be 10\nfeet, which area shall be landscaped, except for necessary access\ndrives, parking, and walkways, in accordance with a plan approved\nas part of the site plan approval."
				}
			]
		},
		{
			"paragraph": "§ 575-114",
			"title": "Rear yards.",
			"content": [
				{
					"text": "There shall be a rear yard, the depth of which shall not be\nless than 25 feet."
				}
			]
		},
		{
			"paragraph": "§ 575-115",
			"title": "Distance between adjacent buildings.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "The minimum distance between buildings shall be 10 feet."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Encroachments not exceeding two feet from each building shall be\npermitted within said ten-foot distance."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "In no event shall the distance between such encroachments be less\nthan eight feet."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 575-115.1",
			"title": "Building length for townhomes",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "No townhome building shall contain more than four townhomes."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "The maximum length of a townhome building shall not exceed 136 feet."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "No horizontal plane of any façade of a townhome building shall\nextend more than 88 feet without a change or break in said plane of\nat least 10 feet."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 575-115.2",
			"title": "Landscaping and buffers.",
			"content": [
				{
					"text": "As part of the site plan approval, the Board of Trustees shall\nrequire a landscape plan that provides adequate buffer and appropriate\ndesign treatment for the uses of the abutting properties."
				}
			]
		},
		{
			"paragraph": "§ 575-115.3",
			"title": "Permitted encroachments.",
			"content": [
				{
					"text": "The following encroachments into required yards are hereby permitted:"
				},
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Cornices, eaves, gutters, and chimneys projecting not more than 24\ninches."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Bay windows not more than six feet in width and one story high, projecting\nnot more than three feet."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "One-story open porch or terrace, projecting not more than five feet\ninto a minimum front yard."
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "One-story enclosed vestibule, not greater than nine feet in width,\nprojecting not more than 5 1/2 feet into a minimum front yard."
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "One-story open porch or terrace, which shall project into a rear\nyard not more than 10 feet."
								}
							]
						},
						{
							"number": "F. ",
							"content": [
								{
									"text": "Unenclosed and unroofed platform and steps, designed to provide safe\naccess to grade from service entrance doors, projecting not more than\nthree feet six inches into a minimum side yard. The maximum horizontal\nsurface of any encroaching platform shall not exceed 14 square feet.\""
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 575-115.4",
			"title": "Accessory structures.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Fences shall not exceed four feet in height, except where a lot or premises in this district is contiguous with a lot or premises in a Residence A, A-1, B, C or D District, subject to the limitations set forth in § 575-150 of this chapter."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Retaining walls shall not extend above the ground that they support."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Stationary outdoor fireplaces shall be located at least 10 feet from\nproperty lines and shall not exceed five feet in height."
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "Pergolas shall not exceed 10 feet in height."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 575-115.5",
			"title": "Accessory buildings.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Accessory buildings, except as otherwise provided in this article,\nshall not be over 15 feet in height at their highest point and shall\nnot occupy more than 40% of the rear yard."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Unless otherwise provided in this article, accessory buildings or\nstructures shall be located in the rear yard and shall be not less\nthan 10 feet distant from the main building and not less than three\nfeet distant from the rear and side lot lines."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Unless otherwise provided in this article, accessory buildings or\nstructures on corner lots 100 feet or less in depth shall be located\nas far as possible from the front property lines."
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "No accessory buildings or structures, except fences or retaining\nwalls as hereinabove provided in this article, shall be erected within\n20 feet of a residential building on an adjoining lot."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 575-115.6",
			"title": "Design standards for multifamily dwellings and townhomes.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "For any multifamily or townhome development, the site plan application shall consider any visual impacts of the proposed development on adjacent properties and the surrounding community, including, but not limited to shadowing effects and those guidelines specified in § 575-179."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "In addition, building frontage along a public street should be designed\nwith principal access to the street. If driveways and indoor garages\nare provided in that area, there should be sufficient space for at\nleast one vehicle to park in the driveway without blocking the sidewalk.\nPrincipal pedestrian access should be provided to the multifamily\nbuilding or townhome from the street."
								}
							]
						}
					]
				}
			]
		}
	]
}