{
	"url": "http://ecode360.com/11013114",
	"paras": [
		{
			"paragraph": "§ 105-10",
			"title": "Permitted principal and accessory uses.",
			"content": [
				{
					"text": "No building, main or accessory, shall be erected\nin an A, B-1, B-2 or C Residence District, unless arranged, intended\nor designated exclusively for one or more of the following specified\nuses:"
				},
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Dwellings for the use and occupancy of but one family,\nincluding the office of a professional person, provided that such\noffice is located in the same dwelling in which the practitioner resides\nand is merely incidental to the primary residence use, and further\nprovided there is no display or advertising and no conspicuous sign\nother than a small professional nameplate. The employment of more\nthan one person by the practitioner in his office shall be deemed\na use not incidental to the primary residence use."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Churches and other places of worship, parish houses,\nSunday school buildings, public libraries and municipal buildings\nor properties, provided that such churches and other places of worship,\nparish houses, Sunday school buildings, public libraries and municipal\nbuildings or properties shall be permitted in a residence district\nonly with the prior approval of the Lake Success Board of Trustees\nand Planning Board, after detailed plans therefor shall have been\nsubmitted with an appropriate application, and after due public notice\nand hearing, and subject to appropriate conditions and safeguards\nand a finding that the proposed use is in harmony with the general\npurpose and intent of the chapter and is reasonably necessary for\nthe health, safety, convenience and general welfare of the Village\nand of its residents, which approval may be granted in the discretion\nof the Board of Trustees, subject to such conditions and restrictions\nwith respect to parking facilities, screening, height of building\nand other facts which, in the discretion of the Board of Trustees,\nit may deem necessary for the health, safety, convenience and general\nwelfare of the Village and its residents."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Tilling the soil, truck gardening, nurseries and greenhouses,\nprovided that they are not used primarily for the growing of vegetables,\nplants or flowers for sale, and provided that there is no display\nof products and no advertising and provided that there is no power\nplant and that any greenhouse heating plant is at least 20 feet distant\nfrom each side lot line and also from the rear lot line."
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "Accessory uses customarily incident to the above uses.\nThe term \"accessory use,\" however, does not include a business or\nany building or use not located on the same lot with the building\nto which it is accessory."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "A garage or group of garages for more than three motor\nvehicles shall not be permitted as accessory use, but such garage\nor garages need not be occupied by the motor vehicles owned by the\noccupant of the premises to come within the designation of an \"accessory\ngarage.\" Such garages may not, however, be occupied by any commercial\ntruck."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "A \"for sale\" or \"for rent\" billboard, signboard or\nadvertising sign shall, in no case, be permitted as an accessory use;\nhowever, two two-foot by two-foot directional signs, for an open house,\nthe wording of which is limited to \"Open House,\" address and directional\narrow only, may be erected 1/2 hour before such event and maintained\nuntil 1/2 hour after it ends. One sign shall be located on the premises\nthat is for sale or for rent, and the other shall be located suitably\nwithin an unpaved area of the Village right-of-way.[Amended 5-11-2009 by L.L. No. 1-2009; 2-8-2010 by L.L. No. 1-2010]"
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "A fence or other structure likely to be an annoyance\nor damage to an adjoining owner or the general public shall, in no\ncase, be permitted as an accessory use."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "A driveway or walk used for access to a business or\nindustrial use shall, in no case, be permitted as an accessory use."
												}
											]
										}
									]
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 105-10.1",
			"title": "Residence AA; permitted principal and accessory uses.",
			"content": [
				{
					"text": "No property situated in a Residence AA District\nshall be used, except for the following uses:"
				},
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Uses permitted in § 105-10."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Private golf course containing not less than 100 acres."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Public primary and secondary school."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 105-11",
			"title": "Floor area.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "No single-family residence shall hereafter be erected\nunless it complies with the following floor area requirements:"
								},
								{
									"content": [
										{
											"number": "1. ",
											"content": [
												{
													"text": "Residence AA: minimum 2500 (square feet)"
												}
											]
										},
										{
											"number": "2. ",
											"content": [
												{
													"text": "Residence A: minimum 1800 (square feet)"
												}
											]
										},
										{
											"number": "3. ",
											"content": [
												{
													"text": "Residence B1: minimum 1400 (square feet)"
												}
											]
										},
										{
											"number": "4. ",
											"content": [
												{
													"text": "Residence B2: minimum 1400 (square feet)"
												}
											]
										},
										{
											"number": "5. ",
											"content": [
												{
													"text": "Residence C: minimum 1200 (square feet)"
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "For the purpose of this section, the floor area shall\nbe that area enclosed within the outside walls of the principal building,\nexcluding porches, terraces and steps. At least 75% of the second\nor third floor area qualifying as floor area shall have a ceiling\nheight of not less than seven feet six inches and shall have access\nfrom the floor below by a permanent built-in stairway. In computing\ntotal floor area, nonhabitable attic or storage areas with ceiling\nheights of less than seven feet, detached garages, garages with ceilings\nless than four feet above grade, or basement and cellar rooms shall\nnot be included."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 105-12",
			"title": "Garages.",
			"content": [
				{
					"text": "Every single-family residence hereafter erected\nshall have provisions for garaging at least one automobile on the\npremises. Such garage shall not be less than 10 feet by 20 feet in\nsize, and any existing conforming garage shall not be reduced to a\nsize less than 10 feet by 20 feet."
				}
			]
		},
		{
			"paragraph": "§ 105-12.1",
			"title": "Parking.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Dismantled or commercial vehicles.[Amended 9-14-1987 by L.L. No. 3-1987; 10-13-2009 by L.L. No.\n3-2009]"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Parking or storage of an unregistered, dismantled or commercial vehicle or vehicles on a lot or premises in any residential district is prohibited except as otherwise provided for in § 101-7B."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "For the purposes of this section, a \"commercial vehicle\" shall\nbe deemed to include:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "All vehicles with lettering, logos or trademarks, other than\nof the make and/or model of the vehicle itself, identifying or advertising\na business, a product or other commercial enterprise or charitable\ninstitution."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "Unregistered vehicles, all pickup trucks, whether covered or\nuncovered, and all vans which do not have windows on both sides of\nthe vehicle covering the entire length of the vehicle, starting at\nthe window at both sides of the driver's seat. Window separation\nnot exceeding eight inches in width, for the purpose of this section,\nshall be considered part of the window. For the purpose of this Code,\nan \"unregistered vehicle\" shall be deemed to include:"
																},
																{
																	"content": [
																		{
																			"number": "[1] ",
																			"content": [
																				{
																					"text": "Any vehicle without a valid New York State registration\nand inspection sticker."
																				}
																			]
																		},
																		{
																			"number": "[2] ",
																			"content": [
																				{
																					"text": "Dealer plates other than one vehicle used by the\nowner of the premises."
																				}
																			]
																		},
																		{
																			"number": "[3] ",
																			"content": [
																				{
																					"text": "Any out-of-state registered vehicle which is not\nregistered to the primary resident of the premises (limited to one\nvehicle)."
																				}
																			]
																		}
																	]
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "All vehicles with more than four wheels."
																}
															]
														},
														{
															"number": "(d) ",
															"content": [
																{
																	"text": "All vehicles which are licensed as taxicabs or livery vehicles\nor buses, said buses having a capacity greater than 16 persons."
																}
															]
														},
														{
															"number": "(e) ",
															"content": [
																{
																	"text": "All vehicles equipped to carry, and/or carrying, business equipment\nor merchandise on the exterior, including but not limited to ladders,\npaints, tarpaulins, etc."
																}
															]
														},
														{
															"number": "(f) ",
															"content": [
																{
																	"text": "Recreational vehicles."
																}
															]
														},
														{
															"number": "(g) ",
															"content": [
																{
																	"text": "Boats, boat trailers and camper trailers."
																}
															]
														}
													]
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Parking or storage of any vehicle shall not be permitted\non a lot or premises in any residential district unless on a paved\ndriveway or unpaved area fronting a garage."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 105-12.2",
			"title": "Circular driveways.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Circular driveways shall be permitted in the Residence\nAA and Residence A Zoning Districts. Circular driveways in Residence\nB1 and Residence B2 Zoning Districts will be permitted only if the\nminimum frontage is 120 feet (excluding corner lots). Circular driveways\nshall be prohibited on corner lots and where street frontage is less\nthan 120 feet. Circular driveways are prohibited in the Residence\nC Zoning District.[Amended 12-11-2000 by L.L. No. 8-2000]"
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "No circular driveway shall be installed unless a building\npermit shall have been issued therefor by the Building Inspector.\nEvery application for such building permit shall be accompanied by\na dimensioned site plan drawn to scale and showing locations of all\ndetails, including the width and radius of such driveway, duly certified\nby a licensed professional engineer or architect, which site plan\nshall have been submitted to and approved by the Planning Board."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Circular driveways shall conform to the following\ndimensions for the zoning district in which they are located:[Amended 12-11-2000 by L.L. No. 8-2000]"
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "All applications for circular driveways shall be accompanied\nby an acceptable landscape plan. No certificate of completion shall\nbe issued by the Building Inspector until such time as the landscape\nplan is satisfactorily completed.[Added 12-11-2000 by L.L. No. 8-2000]"
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 105-12.3",
			"title": "Driveways.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "No driveway shall have a width exceeding 20 feet.\nThe pavement in the required front yard shall not exceed 35%."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "A driveway shall be at least three feet from all side\nand rear property lines."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 105-194",
			"title": "Residence AA, A, B-1, B-2 and C and Business A and B Districts.",
			"content": [
				{
					"text": "No building, main or accessory, hereafter erected\nor altered upon a lot area, upon which a map has not been approved\nby the Planning Board of the Village of Lake Success and the Department\nof Public Works of Nassau County and the County Clerk of the County\nof Nassau prior to the effective date of this Article, shall be erected\nor altered to exceed the height or number of stories or on a smaller\nlot area or to occupy a greater percentage of lot area or to have\na smaller front, side and rear yard or to have a smaller street frontage\nthan is prescribed for buildings in the respective classes of districts\nas follows."
				},
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Residence AA Districts."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "The height of any main building, excluding any\none-family dwelling, shall not exceed 40 feet and such building shall\nnot consist of more than three stories. The height of any one-family\ndwelling shall not exceed 35 feet, with an eave height not to exceed\n25 feet, and shall not consist of more than 2 1/2 stories. The height\nof any accessory building shall not exceed 15 feet and shall not consist\nof more than one story."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "No main or accessory building shall be constructed\non a lot having an area of less than 217,800 square feet."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "The aggregate building area, main and accessory,\nshall not exceed 15% of the lot area, and the gross floor area of\na single-family dwelling shall not exceed 15% of the lot area.[Amended 8-12-2002 by L.L. No. 2-2002]"
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "Each building area shall have front, side and\nrear yards not less than the depths or widths as follows:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "Front yard depth: 75 feet minimum."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "Side yard depth: There shall be two side yards,\none on each side of the building, the aggregate width of which shall\nbe at least 100 feet, and neither side shall be less than 50 feet\nwide."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "Rear yard depth: 75 feet minimum."
																}
															]
														},
														{
															"number": "(d) ",
															"content": [
																{
																	"text": "In addition to the requirements set forth in Subsection A(4)(a), (b) and (c) hereof, any building erected on a corner lot shall have two front yards with depths of not less than 75 feet measured in each case from the street line to the nearest building line."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "No building lot area shall have a street frontage\nof less than 175 feet. When the front street line describes an arc,\nthe front line dimension shall be measured on such arc."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Residence A Districts."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "The height of any building, excluding any one-family\ndwelling, shall not exceed 40 feet, and such building shall not consist\nof more than three stories. The height of any one-family dwelling\nshall not exceed 35 feet, with an eave height not to exceed 25 feet,\nand shall not consist of more than 2 1/2 stories. The height of any\naccessory building shall not exceed 15 feet and shall not consist\nof more than one story."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "No main or accessory building shall be constructed\non a lot having an area of less than 40,000 square feet."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "The aggregate building area, main and accessory,\nshall not exceed 15% of the lot area, and the gross floor area of\na single family dwelling shall not exceed 20% of the lot area. No\ndwelling shall exceed a maximum gross floor area of 12,000 square\nfeet.[Amended 8-12-2002 by L.L. No. 2-2002; 1-8-2007 by L.L. No.\n1-2007]"
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "Each building area shall have front, side and\nrear yards not less than the depths or widths as follows:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "Front yard depth: 50 feet minimum."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "Side yard depth: There shall be two side yards,\none on each side of the building, the aggregate width of which shall\nbe at least 75 feet, and neither side shall be less than 30 feet wide."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "Rear yard depth: 50 feet minimum."
																}
															]
														},
														{
															"number": "(d) ",
															"content": [
																{
																	"text": "In addition to the requirements set forth in Subsection B(4)(a), (b) and (c) hereof, any building erected on a corner lot shall have two front yards with depths of not less than 50 feet measured in each case from the street line to the nearest building line."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "No building lot area shall have a street frontage\nof less than 175 feet. When the front street line describes an arc,\nthe front line dimension shall be measured on such arc."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Residence B Districts."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Residence B-1 District."
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "The height of any building, excluding any one-family\ndwelling, shall not exceed 35 feet, and such building shall not consist\nof more than three stories. The height of any one-family dwelling\nshall not exceed 30 feet, with an eave height not to exceed 23 feet,\nand such building shall not consist of more than two stories."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "No building, main or accessory, shall be constructed\non a lot having an area of less than 20,000 square feet."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "The aggregate building area, main and accessory,\nshall not exceed 20% of the lot area, and the gross floor area of\na single-family dwelling shall not exceed 30% of the lot area. No\ndwelling shall exceed a maximum gross floor area of 7,000 square feet.[Amended 8-12-2002 by L.L. No. 2-2002; 1-8-2007 by L.L. No.\n1-2007]"
																}
															]
														},
														{
															"number": "(d) ",
															"content": [
																{
																	"text": "Required yards."
																},
																{
																	"content": [
																		{
																			"number": "[1] ",
																			"content": [
																				{
																					"text": "Each building area shall have front, side and\nrear yards not less than the depths or width as follows:"
																				},
																				{
																					"content": [
																						{
																							"number": "[a] ",
																							"content": [
																								{
																									"text": "Front yard depth: 40 feet minimum."
																								}
																							]
																						},
																						{
																							"number": "[b] ",
																							"content": [
																								{
																									"text": "Side yard depth: There shall be\ntwo side yards, one on each side of the building, the aggregate width\nof which shall be at least 55 feet, and neither side yard shall be\nless than 25 feet wide."
																								}
																							]
																						},
																						{
																							"number": "[c] ",
																							"content": [
																								{
																									"text": "Rear yard depth: 40 feet minimum."
																								}
																							]
																						}
																					]
																				}
																			]
																		},
																		{
																			"number": "[2] ",
																			"content": [
																				{
																					"text": "In addition to the requirements set forth in\nSubsection C(1)(d)[l][a], [b] and [c] hereof, any building erected\non a corner lot shall have two front yards with depths of not less\nthan 40 feet, measured in each case from the street line to the nearest\nbuilding line."
																				}
																			]
																		}
																	]
																}
															]
														},
														{
															"number": "(e) ",
															"content": [
																{
																	"text": "No building lot area shall have a street frontage\nof less than 125 feet. When the front street line describes an arc,\nthe front line dimension shall be measured on such arc.[Added 4-10-2006 by L.L. No. 6-2006]"
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Residence B-2 District."
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "The height of any main building shall not exceed\n30 feet, with an eave height not to exceed 23 feet, and such building\nshall not consist of more than two stories. The height of any accessory\nbuilding shall not exceed 15 feet and shall not consist of more than\none story."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "No building, main or accessory, shall be constructed\non a lot having an area of less than 10,000 square feet."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "The aggregate building area, main and accessory,\nshall not exceed 25% of the lot area, and the gross floor area of\na single-family dwelling shall not exceed 35% of the lot area. In\naddition, no dwelling shall exceed a maximum of 5,000 square feet\ngross floor area on a lot of 14,000 square feet or less, or exceed\n5,500 square feet gross floor area on a lot larger than 14,000 square\nfeet.[Amended 8-12-2002 by L.L. No. 2-2002]"
																}
															]
														},
														{
															"number": "(d) ",
															"content": [
																{
																	"text": "Required yards."
																},
																{
																	"content": [
																		{
																			"number": "[1] ",
																			"content": [
																				{
																					"text": "Each building area shall have front, side and\nrear yards not less than the depths or width as follows:"
																				},
																				{
																					"content": [
																						{
																							"number": "[a] ",
																							"content": [
																								{
																									"text": "Front yard depth: 35 feet minimum."
																								}
																							]
																						},
																						{
																							"number": "[b] ",
																							"content": [
																								{
																									"text": "Side yard depth: There shall be\ntwo side yards, one on each side of the building, the aggregate width\nof which shall be at least 30 feet, and neither side yard shall be\nless than 12 feet wide."
																								}
																							]
																						},
																						{
																							"number": "[c] ",
																							"content": [
																								{
																									"text": "Rear yard depth: 30 feet minimum."
																								}
																							]
																						}
																					]
																				}
																			]
																		},
																		{
																			"number": "[2] ",
																			"content": [
																				{
																					"text": "In addition to the requirements set forth in\nSubsection C(2)(d)[1][a], [b] and [c] hereof, any building erected\non a corner lot shall have two front yards with depths of not less\nthan 35 feet, measured in each case from the street line to the nearest\nbuilding line."
																				}
																			]
																		}
																	]
																}
															]
														},
														{
															"number": "(e) ",
															"content": [
																{
																	"text": "No building lot area shall have a street frontage\nof less than 100 feet. When the front street line describes an arc,\nthe front line dimension shall be measured on such arc.[Added 4-10-2006 by L.L. No. 6-2006]"
																}
															]
														}
													]
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "Residence C Districts."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "The height of any main building shall not exceed\n28 feet, with an eave height not to exceed 22 feet, and such building\nshall not consist of more than two stories. The height of any accessory\nbuilding shall not exceed 15 feet and shall not consist of more than\none story."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "No building, main or accessory, shall be constructed\non a lot having an area of less than 7,500 square feet."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "The aggregate building area, main and accessory,\nshall not exceed 30% of the lot area, and the gross floor area of\na single-family dwelling shall not exceed 40% of the lot area. In\naddition, no dwelling shall exceed a maximum gross floor area of 4,000\nsquare feet on a lot of 10,000 square feet or less, or exceed a gross\nfloor area of 4,500 square feet on a lot larger than 10,000 square\nfeet.[Amended 8-12-2002 by L.L. No. 2-2002; 1-8-2007 by L.L. No.\n1-2007]"
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "Each building area shall have front, side and\nrear yards not less than the depths or widths as follows:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "Front yard depth: 30 feet minimum."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "Side yard depth: There shall be two side yards,\none on each side of the building, the aggregate width of which shall\nbe at least 30 feet, and neither side yard shall be less than 10 feet\nwide."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "Rear yard depth: 25 feet minimum."
																}
															]
														},
														{
															"number": "(d) ",
															"content": [
																{
																	"text": "In addition to the requirements set forth in Subsection D(4)(a), (b) and (c) hereof, any building erected on a corner lot shall have two front yards with depths of not less than 30 feet, measured in each case from the street line to the nearest building line."
																}
															]
														},
														{
															"number": "(e) ",
															"content": [
																{
																	"text": "No building lot area shall have a street frontage\nof less than 75 feet. When the front street line describes an arc,\nthe front line dimension shall be measured on such arc.[Added 4-10-2006 by L.L. No. 6-2006]"
																}
															]
														}
													]
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "Business A Districts."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "The height of any building shall not exceed\n36 feet, and such building shall not consist of more than two stories."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "No building, main or accessory, shall be constructed\non a lot having an area of less than 1,000 square feet."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "The building area, main and accessory, shall\nnot exceed 50% of the lot area."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "Each building area shall have front and rear\nyards not less than the depths as follows:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "Front yard depth: 20 feet minimum, except that\nno front yard setback is required for buildings fronting on Northern\nBoulevard."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "Rear yard depth: 12 feet minimum, provided that\nthe rear yard shall, in no event, be less than the height of the building."
																}
															]
														}
													]
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "F. ",
							"content": [
								{
									"text": "Business B Districts."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "The height of any building in a Business B District\nshall not exceed 15 feet, and such building shall not consist of more\nthan one story."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "No building, main or accessory, shall be constructed\non a lot having an area of less than 1,000 square feet."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "The building area, main and accessory, shall\nnot exceed 25% of the lot area."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "Each building area shall have front and rear\nyards not less than the depths as follows:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "Front yard depth: 40 feet minimum, except that\nno front yard setback is required for buildings fronting on Northern\nBoulevard."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "Rear yard depth: 12 feet minimum, provided that\nthe rear yard shall, in no event, be less than the height of the building."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "All structures located in the Business B District\non June 1, 1965, may continue as nonconforming structures."
												}
											]
										}
									]
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 105-195",
			"title": "Measurement of yard dimensions.",
			"content": [
				{
					"text": "All front yard, rear yard and side yard dimensions\nspecified in Residence A, B and C Districts and in Business A and\nB Districts are to be measured to the building line or 24 inches inside\nof any overhang exceeding 24 inches."
				}
			]
		},
		{
			"paragraph": "§ 105-196",
			"title": "Height and bulk schedule.",
			"content": [
				{
					"text": "The above restrictions are set forth in Schedule A, Limiting Height and Bulk of Buildings, annexed hereto and made a part of this chapter.[1]"
				},
				{
					"footnote": "[1]\nEditor's Note: Schedule A is included at the end of this chapter.\n"
				}
			]
		},
		{
			"paragraph": "§ 105-197",
			"title": "Average setback line.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "In any residence district, no building or any porch\nthereof shall be erected and no building or any porch thereof shall\nbe reconstructed or altered so as to project in anywise beyond the\naverage setback line observed by the buildings on the same side of\nthe street within the block at the time of the passage of this chapter.\nWhere there are existing buildings at the time of the passage of this\nchapter on only one side of the street within the block, then the\nsetback line on the vacant side shall be the same as the average setback\nline on the improved side of the street within the block; provided,\nhowever, that no new building shall be erected with any portion thereof\nnearer to the street line than 30 feet, irrespective of any provision\nhereinabove to the contrary. The foregoing rule shall, however, in\nno case, be applied so as to keep the street walls, walls or porches\nof buildings further back from the street line than the minimum depth\nof front yard indicated in the Schedule Limiting Height and Bulk of\nBuildings[1] for the district in which such building is located. Where\nthere is no existing building on either side of the street within\nthe block, no new building shall be erected with its street wall,\nwalls or porches nearer the street line than the minimum depth of\nfront yard shown for each respective district in the schedule."
								},
								{
									"footnote": "[1]\nEditor's Note: The Schedule Limiting Height\nand Bulk of Buildings is included at the end of this chapter.\n"
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "The average setback line observed by buildings on\nthe same side of the street within 200 feet on each side of the lot\nin question shall control, in lieu of the average setback line within\nthe block, where the block affected has a length of more than 1,500\nfeet between its intercepting or intersecting streets."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 105-198",
			"title": "Prohibited construction.",
			"content": [
				{
					"text": "Wood-frame construction shall be prohibited\nexcept for single-family dwellings."
				},
				{
					"footnote": "[1]\nEditor's Note: This local law also repealed\nformer § 105-198, Corner lots.\n"
				}
			]
		},
		{
			"paragraph": "§ 105-199",
			"title": "Ventilation; courtyards.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Except as otherwise provided in this chapter, every\nroom in which persons live, sleep, work or congregate shall have at\nleast one window or ventilating skylight opening directly either upon\na street or upon a rear yard, front yard, inner court or outer court\nlocated upon the same lot and conforming to the requirements prescribed\nby this chapter as to its minimum area and least dimensions."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Courtyards and other open spaces, if provided in addition\nto those required by this chapter, need not be of the area and dimensions\nherein prescribed."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 105-200",
			"title": "Rear yards.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "A rear yard extending along the rear lot line shall\nbe required on every lot or portion thereof where the rear line of\nthe lot is more than 55 feet back from the nearest street. This provision\nshall, however, not apply to a corner lot situated in a business district."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "An interior lot running through the block from street\nto street or to within 55 feet of another street shall not be required\nto provide a rear yard when improved with a single building."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 105-201",
			"title": "Court and yard area to be unobstructed.",
			"content": [
				{
					"text": "The area required in a court or yard at any\ngiven level shall be open from such level to the sky unobstructed,\nexcept for the ordinary projections of skylights and parapets above\nthe bottom of such court or yard, and except for the ordinary projections\nof window sills, belt courses, cornices and other ornamental features\nto the extent of not more than four inches."
				}
			]
		},
		{
			"paragraph": "§ 105-202",
			"title": "Applicability of height provisions.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "The height provisions of this chapter shall not apply\nto the erection of church spires, belfries and towers designed exclusively\nfor ornamental purposes, chimneys, fines or gas holders. The height\nprovisions of this chapter shall, moreover, not apply to bulkhead,\nelevator enclosures or water tanks occupying in the aggregate less\nthan 10% of the area of the roof on which they are located."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Nothing in this Article shall prevent the erection\nabove the height limit of a parapet wall or cornice extending above\nsuch height limit not more than three feet."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 105-203",
			"title": "Area regulations for courts and shafts.",
			"content": [
				{
					"text": "Courts or shafts used exclusively for lighting\nand ventilating bathrooms, toilet compartments, hallways or stairways\nneed not comply with the area regulations of the different districts.\nSuch courts or shafts shall, however, not be less than 15 square feet\nin area nor less than three feet in width."
				}
			]
		},
		{
			"paragraph": "§ 105-204",
			"title": "Placement of dwellings or hotels in rear portion of lot.",
			"content": [
				{
					"text": "No dwelling or hotel erected after the passage\nof this chapter shall be constructed in back of or to the rear of\nbuildings on the front of the lot. No building not now used as a dwelling\nor hotel and situated in back of or to the rear of buildings on the\nfront of the lot shall be altered or used after the passage of this\nchapter as a dwelling or hotel. This provision shall, however, not\nprohibit the erection and maintenance of dwelling quarters in connection\nwith an accessory building upon the rear of the lot, provided the\npersons occupying such quarters are employed in domestic service upon\nthe premises."
				}
			]
		},
		{
			"paragraph": "§ 105-205",
			"title": "Restriction on number of families in dwellings or hotels.",
			"content": [
				{
					"text": "No dwelling or hotel shall be erected or altered\nto accommodate or make provision for more families than the number\nindicated in the Schedule Limiting Height and Bulk of Buildings, for\nthe district in which such dwelling or hotel may be located. The area\nof no plot shall, for the purpose of this section, be deemed to exceed\n100 feet back from its street front."
				}
			]
		}
	]
}