{
	"url": "http://ecode360.com/5161767",
	"paras": [
		{
			"paragraph": "§ 280-16",
			"title": "Purpose.",
			"content": [
				{
					"text": "The purpose of the Low-Density Residential R-40\nDistrict is to provide areas for residential development where existing\nneighborhood characteristics, water supply and environmental conditions\npermit full development densities of approximately one dwelling per\nacre and where open space and agricultural preservation are not predominate\nobjectives."
				}
			]
		},
		{
			"paragraph": "§ 280-17",
			"title": "Use regulations.",
			"content": [
				{
					"text": "In an R-40 District, no building or premises\nshall be used and no building or part of a building shall be erected\nor altered which is arranged, intended or designed to be used, in\nwhole or in part, for any uses except the following:"
				},
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Permitted uses:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Same as § 280-13A of the Agricultural-Conservation District, except that wineries are excluded.[Amended 11-29-1994 by L.L. No. 26-1994]"
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Uses permitted by special exception of the Board of\nAppeals. The following uses are permitted as a special exception by\nthe Board of Appeals, as hereinafter provided, and subject to site\nplan approval by the Planning Board:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Same as § 280-13B of the Agricultural-Conservation District, except that a children's recreation camp, farm labor camp and veterinarian's office and animal hospital are not permitted and bed-and-breakfast uses do not require site plan approval."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Libraries, museums or art galleries."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Accessory uses, limited to the following:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Same as § 280-13C of the Agricultural-Conservation District."
												}
											]
										}
									]
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 280-18",
			"title": "Bulk, area and parking regulations.",
			"content": [
				{
					"text": "No building or premises shall be used and no\nbuilding or part thereof shall be erected or altered in the Low-Density\nResidential R-40 District unless the same conforms to the requirements\nof the Bulk Schedule and of the Parking Schedule,[1] with the same force and effect as if such regulations\nwere set forth herein in full."
				},
				{
					"footnote": "[1]\nEditor's Note: The Bulk Schedule is included at the end of this chapter, and the Parking Schedule is in § 280-78A.\n"
				}
			]
		},
		{
			"paragraph": "§ 280-19",
			"title": "Accessory buildings.",
			"content": [
				{
					"text": "Accessory buildings shall be subject to the same requirements as § 280-15 of the Agricultural-Conservation District."
				}
			]
		}
	]
}