{
	"url": "http://ecode360.com/5161767",
	"paras": [
		{
			"paragraph": "§ 280",
			"title": "Bulk Schedule for Residential Districts.",
			"content": [
				{
					"text": "The following regulations shall apply in R-120:"
				},
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Lot size (square feet): 120,000"
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Lot width (feet): 200"
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Lot depth (feet): 300"
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "Front yard (feet): 60"
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "Side yard (feet): 30"
								}
							]
						},
						{
							"number": "F. ",
							"content": [
								{
									"text": "Both side yards (feet): 60"
								}
							]
						},
						{
							"number": "G. ",
							"content": [
								{
									"text": "Rear yard (feet): 85"
								}
							]
						},
						{
							"number": "H. ",
							"content": [
								{
									"text": "Livable floor area (square feet per dwelling unit): 850"
								}
							]
						},
						{
							"number": "I. ",
							"content": [
								{
									"text": "Lot coverage (percent): 10"
								}
							]
						},
						{
							"number": "J. ",
							"content": [
								{
									"text": "Building height (feet): 35"
								}
							]
						},
						{
							"number": "K. ",
							"content": [
								{
									"text": "Number of stories: 2.5"
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 280-12",
			"title": "Purpose.",
			"content": [
				{
					"text": "The purpose of the Agricultural-Conservation\n(A-C) District and the Low-Density Residential R-80, R-120, R-200\nand R-400 Districts is to reasonably control and, to the extent possible,\nprevent the unnecessary loss of those currently open lands within\nthe Town containing large and contiguous areas of prime agricultural\nsoils which are the basis for a significant portion of the Town's\neconomy and those areas with sensitive environmental features, including\naquifer recharge areas and bluffs. In addition, these areas provide\nthe open rural environment so highly valued by year-round residents\nand those persons who support the Town of Southold's recreation, resort\nand second-home economy. The economic, social and aesthetic benefits\nwhich can be obtained for all citizens by limiting loss of such areas\nare well documented and have inspired a host of governmental programs\ndesigned, with varying degrees of success, to achieve this result.\nFor its part, the Town is expending large sums of money to protect\nexisting farm acreage. At the same time, the Town has an obligation\nto exercise its authority to reasonably regulate the subdivision and\ndevelopment of this land to further the same purposes while honoring\nthe legitimate interests of farmers and other farmland owners."
				}
			]
		},
		{
			"paragraph": "§ 280-13",
			"title": "Use regulations.",
			"content": [
				{
					"text": "In A-C, R-80, R-120, R-200 and R-400 Districts,\nno building or premises shall be used and no building or part of a\nbuilding shall be erected or altered which is arranged, intended or\ndesigned to be used, in whole or in part, for any uses except the\nfollowing:"
				},
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Permitted uses.[Amended 5-23-1989 by L.L. No. 8-1989; 11-29-1994 by L.L. No. 25-1994; 11-29-1994 by L.L. No. 26-1994; 5-13-1997 by L.L. No. 8-1997; 7-17-2007 by L.L. No. 15-2007; 6-15-2010 by L.L. No. 2-2010]"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "One-family detached dwellings, not to exceed one dwelling on each\nlot."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "The following agricultural operations and accessory uses thereto,\nincluding irrigation, provided that there shall be no storage of manure,\nfertilizer or other odor- or dust-producing substance or use, except\nspraying and dusting to protect vegetation, within 150 feet of any\nlot line:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "The raising of field and garden crops, vineyard and orchard\nfarming, the maintenance of nurseries and the seasonal sale of products\ngrown on the premises."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "The keeping, breeding, raising and training of horses, domestic\nanimals and fowl (except ducks)[1] on lots of 10 acres or more."
																},
																{
																	"footnote": "[1]\nEditor's Note: See also Ch. 83, Art. I, Ducks.\n"
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "Barns, storage buildings, greenhouses (including plastic-covered)\nand other related structures, provided that such buildings shall conform\nto the yard requirements for principal buildings."
																}
															]
														},
														{
															"number": "(d) ",
															"content": [
																{
																	"text": "The retail sale of local produce from structures of less than\n20 square feet floor area shall be set back at least 10 feet from\nany lot line."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Buildings, structures and uses owned or operated by the Town of Southold,\nschool districts, park districts and fire districts."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "Wineries which meet the following standards:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "The winery shall be a place or premises on which wine made from\nprimarily Long Island grapes is produced and sold;"
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "The winery shall be on a parcel on which at least 10 acres are\ndevoted to vineyard or other agricultural purposes, and which is owned\nby the winery owner;"
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "The winery structures shall be set back a minimum of 100 feet\nfrom a major road; and"
																}
															]
														},
														{
															"number": "(d) ",
															"content": [
																{
																	"text": "The winery shall obtain site plan approval."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "Small wind energy systems on parcels greater than seven acres in size, which parcels are dedicated primarily to uses necessary for bona fide agricultural production, and subject to the standards provided in Chapter 277 of this Town Code."
												}
											]
										},
										{
											"number": "(6) ",
											"content": [
												{
													"text": "One accessory apartment in an existing one-family dwelling, subject to the issuance of a rental permit in accordance with § 280-13D and the following requirements:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "The accessory apartment shall be located in the principal building."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "The owner of the existing dwelling shall occupy one of the dwelling\nunits as the owner's principal residence. The other dwelling\nunit shall be leased for year-round occupancy, evidenced by a written\nlease for a term of one or more years."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "The existing one-family dwelling shall contain not less than\n1,600 square feet of livable floor area."
																}
															]
														},
														{
															"number": "(d) ",
															"content": [
																{
																	"text": "The accessory apartment shall contain not less than 450 square\nfeet of livable floor area."
																}
															]
														},
														{
															"number": "(e) ",
															"content": [
																{
																	"text": "The accessory apartment shall not exceed 40% of the livable floor area of the existing dwelling unit and any addition thereto permitted under § 280-13B(13)(j) hereof."
																}
															]
														},
														{
															"number": "(f) ",
															"content": [
																{
																	"text": "A minimum of three off-street parking spaces shall be provided."
																}
															]
														},
														{
															"number": "(g) ",
															"content": [
																{
																	"text": "Not more than one accessory apartment shall be permitted on\na lot."
																}
															]
														},
														{
															"number": "(h) ",
															"content": [
																{
																	"text": "The accessory apartment shall meet the requirements of an apartment as defined in § 280-4 hereof."
																}
															]
														},
														{
															"number": "(i) ",
															"content": [
																{
																	"text": "The exterior entry to the accessory apartment shall, to the\nmaximum extent possible, retain the existing exterior appearance of\na one-family dwelling."
																}
															]
														},
														{
															"number": "(j) ",
															"content": [
																{
																	"text": "Subject to all other restrictions and requirements in this Code,\na reasonable expansion of the existing foundation, not to exceed 25%\nof the living space of the existing dwelling unit, may be permitted\nto accommodate the creation of an accessory apartment."
																}
															]
														},
														{
															"number": "(k) ",
															"content": [
																{
																	"text": "All conversions shall be subject to the inspection of the Building\nInspector and issuance of a certificate of compliance."
																}
															]
														},
														{
															"number": "(l) ",
															"content": [
																{
																	"text": "The dwelling which is converted to permit an accessory apartment\nshall be in existence and be eligible for or have a valid certificate\nof occupancy issued prior to January 1, 2004, or proof of legal occupancy\nprior to that date."
																}
															]
														},
														{
															"number": "(m) ",
															"content": [
																{
																	"text": "The existing building, together with the accessory apartment, shall comply with all other requirements of Chapter 280 of the Town Code of the Town of Southold."
																}
															]
														},
														{
															"number": "(n) ",
															"content": [
																{
																	"text": "Notwithstanding the provisions of § 280-13B hereof, no site plan approval by the Planning Board shall be required for the establishment of an accessory apartment."
																}
															]
														},
														{
															"number": "(o) ",
															"content": [
																{
																	"text": "Approval by the Suffolk County Department of Health Services\nof the water supply and sewage disposal systems shall be required."
																}
															]
														},
														{
															"number": "(p) ",
															"content": [
																{
																	"text": "No bed-and-breakfast facilities, as authorized by § 280-13B(14) hereof, shall be permitted in or on premises for which an accessory apartment is authorized or exists."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(7) ",
											"content": [
												{
													"text": "Land-based aquaculture operations, including research and development,\nwhich meet the following standards:[Added 9-22-2015 by L.L.\nNo. 8-2015]"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "The land-based aquaculture operations shall be on a parcel that is\nat least seven acres, owned by the land-based aquaculture operator."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "The structures used for land based aquaculture operations shall be\nset back a minimum of 100 feet from any road and 200 feet from any\ncontiguous parcel."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "Any land-based aquaculture operation shall take place in a fully\nenclosed structure."
																}
															]
														},
														{
															"number": "(d) ",
															"content": [
																{
																	"text": "Any land-based aquaculture operation shall be entitled to a retail\narea not more than 10% of the gross floor area of the structure in\nwhich the land-based aquaculture takes place for the direct marketing\nof its products."
																}
															]
														},
														{
															"number": "(e) ",
															"content": [
																{
																	"text": "Land-based aquaculture operations shall be subject to site plan approval\nby the Planning Board."
																}
															]
														}
													]
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Uses permitted by special exception by the Board of Appeals. The following uses are permitted as special exception by the Board of Appeals, as hereinafter provided, and, except for the uses set forth in Subsections B(1), (13) and (14) hereof, are subject to site plan approval by the Planning Board:[Amended 3-14-1989 by L.L. No. 3-1989; 5-20-1993 by L.L. No. 6-1993; 12-21-1993 by L.L. No. 3-1989; 11-29-1994 by L.L. No. 26-1994; 12-27-1994 by L.L. No. 30-1994; 2-7-1995 by L.L. No. 3-1995; 11-12-1996 by L.L. No.\n20-1996; 11-12-1997 by L.L. No. 26-1997; 12-8-1998 by L.L. No.\n26-1998; 10-25-2005 by L.L. No. 18-2005; 6-15-2010 by L.L. No.\n2-2010]"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Two-family dwellings not to exceed one such dwelling on each lot."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Places of worship, including parish houses (but excluding a rectory\nor parsonage, which shall conform to the requirements for a one-family\ndwelling), subject to the following requirements:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "No building or part thereof shall be erected nearer than 50\nfeet to any street line and nearer than 20 feet to any lot line."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "The total area covered by all principal and accessory buildings\nshall not exceed 20% of the area of the lot."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Private elementary or high schools, colleges and other educational\ninstitutions, subject to the following requirements:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "No building shall be less than 50 feet from any street or lot\nline."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "The total area occupied by all principal and accessory buildings\nshall not exceed 20% of the area of the lot."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "Any school shall be a nonprofit organization within the meaning\nof the Internal Revenue Act and shall be registered effectively thereunder\nas such."
																}
															]
														},
														{
															"number": "(d) ",
															"content": [
																{
																	"text": "Any such school shall occupy a lot with an area of not less\nthan five acres plus one acre for each 25 pupils for which the building\nis designed."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "Nursery schools."
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "Philanthropic, eleemosynary or religious institutions, health care,\ncontinuing care and life facilities, but excluding facilities for\nthe treatment of all types of drug addiction, subject to the following\nrequirements:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "No building or part thereof or any parking or loading area shall\nbe located within 100 feet of any street line nor within 50 feet of\nany lot line."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "The total area covered by principal and accessory buildings\nshall not exceed 20% of the area of the lot."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "The maximum height shall be 35 feet or 2 1/2 stories."
																}
															]
														},
														{
															"number": "(d) ",
															"content": [
																{
																	"text": "The entire lot, except areas occupied by buildings or parking\nor loading areas, shall be suitably landscaped and properly maintained."
																}
															]
														},
														{
															"number": "(e) ",
															"content": [
																{
																	"text": "Any health care, continuing care or life care facility shall\nmeet the following standards:"
																},
																{
																	"content": [
																		{
																			"number": "[1] ",
																			"content": [
																				{
																					"text": "All buildings shall be of fire-resistive construction."
																				}
																			]
																		},
																		{
																			"number": "[2] ",
																			"content": [
																				{
																					"text": "All such uses shall be served by adequate water and sewer systems\napproved by the Suffolk County Department of Health."
																				}
																			]
																		},
																		{
																			"number": "[3] ",
																			"content": [
																				{
																					"text": "Patients suffering from communicable diseases shall not be permitted\nin any nursing home or sanatorium. (Communicable diseases are defined\nby the Sanitary Code of the Public Health Council of the State of\nNew York.)"
																				}
																			]
																		},
																		{
																			"number": "[4] ",
																			"content": [
																				{
																					"text": "Eight thousand square feet of lot area shall be provided for\neach patient bed."
																				}
																			]
																		}
																	]
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(6) ",
											"content": [
												{
													"text": "Public utility rights-of-way as well as structures and other installations necessary to serve areas within the Town, except that wireless communication facilities must obtain approval pursuant to Article XVII, subject to such conditions as the Board of Appeals may impose in order to protect and promote the health, safety, appearance and general welfare of the community and the character of the neighborhood in which the proposed structure is to be constructed."
												}
											]
										},
										{
											"number": "(7) ",
											"content": [
												{
													"text": "Beach clubs, tennis clubs, country clubs, golf clubs and annual membership\nclubs and accessory playgrounds, beaches, swimming pools, tennis courts,\nrecreational buildings and maintenance buildings catering exclusively\nto members and their guests, subject to the following requirements:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "No building or part thereof or any parking or loading area shall\nbe located within 100 feet of any street line or within 50 feet of\nany lot line."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "The total area covered by principal and accessory buildings\nshall not exceed 20% of the area of the lot."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "No such use shall occupy a lot with an area of less than three\nacres."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(8) ",
											"content": [
												{
													"text": "Children's recreation camps organized primarily for seasonal\nuse and subject to the following requirements:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "No building, tent, activity area or recreation facility shall\nbe less than 200 feet from any lot line, and any such building, tent,\nactivity area or recreation facility shall be effectively screened\ntherefrom as required by the Planning Board. Buildings intended for\nuse as sleeping quarters shall be not less than 30 feet from each\nother, except tents, which shall be not less than 10 feet apart."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "The minimum lot area shall be not less than 10,000 square feet\nfor each cottage, tent or other principal building and not less than\n3,000 square feet of land area shall be provided for each person accommodated\nin the buildings or tents on the premises."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "The sound level of all outdoor public-address systems shall\nnot exceed the intensity tolerable in a residential neighborhood."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(9) ",
											"content": [
												{
													"text": "Farm labor camps, subject to the following requirements:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "All farm labor camps on farms shall be construed in conformance\nwith applicable laws and shall not be located nearer to any other\nresidence than the residence of the employer, except by specific review\nand approval of the Planning Board."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(10) ",
											"content": [
												{
													"text": "Veterinarian's offices and animal hospitals, subject to\nthe following requirements:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "The housing of all animals shall be in a fully enclosed structure,\nif nearer than 150 feet to any lot line."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(11) ",
											"content": [
												{
													"text": "Cemeteries."
												}
											]
										},
										{
											"number": "(12) ",
											"content": [
												{
													"text": "Stables and riding academies."
												}
											]
										},
										{
											"number": "(13) ",
											"content": [
												{
													"text": "One accessory apartment in a lawfully existing detached accessory\ngarage, barn or storage building, subject to the following requirements:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "The accessory apartment shall contain no less than 450 square\nfeet and shall not exceed 750 square feet of livable floor area and\nshall have no more than one bathroom."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "A minimum of three off-street parking spaces shall be provided\non premises."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "Not more than one accessory apartment shall be permitted on\na lot."
																}
															]
														},
														{
															"number": "(d) ",
															"content": [
																{
																	"text": "The accessory apartment shall meet the requirements of an apartment as defined in § 280-4 hereof."
																}
															]
														},
														{
															"number": "(e) ",
															"content": [
																{
																	"text": "The entirety of the living floor area of the accessory apartment\nmust be on one floor of the accessory structure."
																}
															]
														},
														{
															"number": "(f) ",
															"content": [
																{
																	"text": "The accessory structure which is converted, in whole or in part,\nto permit an accessory apartment shall be in existence and be eligible\nfor or have a valid certificate of occupancy issued prior to January\n1, 2008.[Amended 5-24-2011 by L.L. No. 6-2011]"
																}
															]
														},
														{
															"number": "(g) ",
															"content": [
																{
																	"text": "The existing accessory structure shall comply with all other\nrequirements of this chapter."
																}
															]
														},
														{
															"number": "(h) ",
															"content": [
																{
																	"text": "Approval of the Suffolk County Department of Health Services\nof the water supply and sewage disposal systems shall be required."
																}
															]
														},
														{
															"number": "(i) ",
															"content": [
																{
																	"text": "No bed-and-breakfast facilities, as authorized by § 280-13B(14) hereof shall be permitted in or on premises for which an accessory apartment is authorized or exists."
																}
															]
														},
														{
															"number": "(j) ",
															"content": [
																{
																	"text": "Occupancy of resident structures on the premises shall be subject to the issuance of an annual rental permit in accordance with § 280-13D and the following requirements:"
																},
																{
																	"content": [
																		{
																			"number": "[1] ",
																			"content": [
																				{
																					"text": "The owner of the premises shall occupy either the existing single-family\ndwelling unit or the accessory apartment in the detached accessory\nstructure as the owner's principal residence. The other dwelling\nunit shall be leased for year-round occupancy evidenced by a written\nlease for a term of one or more years to:"
																				},
																				{
																					"content": [
																						{
																							"number": "[a] ",
																							"content": [
																								{
																									"text": "A family member; or"
																								}
																							]
																						},
																						{
																							"number": "[b] ",
																							"content": [
																								{
																									"text": "To a resident who is currently on the Southold\nTown Affordable Housing Registry and eligible for placement."
																								}
																							]
																						}
																					]
																				}
																			]
																		},
																		{
																			"number": "[2] ",
																			"content": [
																				{
																					"text": "Rents charged to a resident on the Affordable Housing Registry\nshall not exceed the rent established by the Town Board annually pursuant\nto § 280-30(F) of this Code."
																				}
																			]
																		},
																		{
																			"number": "[3] ",
																			"content": [
																				{
																					"text": "No accessory apartment shall be occupied by more than the number\nof persons permitted to occupy the dwelling unit under Section 404\nof the Property Maintenance Code of the New York State Uniform Fire\nPrevention and Building Code."
																				}
																			]
																		},
																		{
																			"number": "[4] ",
																			"content": [
																				{
																					"text": "An accessory apartment shall only be occupied or otherwise utilized\nin accordance with the certificate of occupancy issued for the dwelling\nunit."
																				}
																			]
																		}
																	]
																}
															]
														},
														{
															"number": "(k) ",
															"content": [
																{
																	"text": "The Chief Building Inspector, Zoning Inspector, and Town personnel\nwho are engaged in the enforcement of the provisions of this chapter\nare authorized to make or cause to be made inspections to determine\ncompliance with this chapter and are authorized to enter upon any\nproperty for the purpose of said inspections."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(14) ",
											"content": [
												{
													"text": "Bed-and-breakfasts which have been issued a bed-and-breakfast\npermit by the Building Inspector. Said permit shall be issued for\na term of one year if the following conditions are met:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "A smoke alarm shall be provided on each floor and in every guest\nroom."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "The dwelling shall have at least two exits and there shall be\na window large enough for emergency egress in each guest room."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "The identification sign shall be no larger than two square feet\nin areas zoned Residential-Office or higher, but there shall be no\nexterior signage identifying the use as a bed-and-breakfast in residential\nareas."
																}
															]
														},
														{
															"number": "(d) ",
															"content": [
																{
																	"text": "No accessory apartment, as authorized by § 280-13B(13) hereof, shall be permitted in or on premises for which a bed-and-breakfast facility is authorized or exists."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(15) ",
											"content": [
												{
													"text": "Historical society."
												}
											]
										},
										{
											"number": "(16) ",
											"content": [
												{
													"text": "Preservation and use of a federal or state designated historic\nbuilding for the purpose of hosting community events, together with\nthe use of part of such building for professional offices and/or one\napartment, not to exceed a total of three uses per building, provided\nthat such building is owned and maintained by a not-for-profit historic\norganization. In no event shall there be more than one apartment per\nbuilding."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Accessory uses, limited to the following uses and subject to the conditions listed in § 280-15 herein:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Any customary structures or uses which are customarily\nincidental to the principal use, except those prohibited by this chapter."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Home occupation, including home professional office\nand home business office. In permitting these uses, the Town Board\nrecognizes that the residents historically have operated small businesses\nwhich provide services to the community from their homes. The Board\nfinds that these businesses have not impacted negatively on the appearance\nof these residential zones. In the Board's judgment, it finds that\nin order to maintain the economic viability of the Town, to maintain\nthe rural quality of life and in the interests of the welfare of the\nresidents, these businesses (or home occupations) should be permitted\nto continue. In setting forth the following subsections, the Board\nintends to permit as of right certain business uses in residential\nzones with the understanding that these uses are to be conducted in\na manner that will not alter the character of the residential neighborhoods.\nThe Board believes that the following subsections provide sufficient\nsafeguards to accomplish that aim. These uses shall be permitted,\nprovided that:[Amended 4-9-1991 by L.L. No. 10-1991; 7-28-1992 by L.L. No.\n14-1992]"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "No display of products shall be visible from\nthe street, and no stock-in-trade shall be kept on the premises."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "Such occupation is incidental to the residential\nuse of the premises and is carried on in the main building by the\nresidents therein with not more than one nonresident assistant for\nwhom off-street parking must be provided on site."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "Such occupation is carried on in an area not\nto exceed 25% of the area of all floors of the main building, and\nin no event shall such use occupy more than 500 square feet of floor\narea."
																}
															]
														},
														{
															"number": "(d) ",
															"content": [
																{
																	"text": "There shall be no exterior effect at the property\nline, such as noise, traffic, odor, dust, smoke, gas, fumes or radiation."
																}
															]
														},
														{
															"number": "(e) ",
															"content": [
																{
																	"text": "Studios where dancing or music instruction is\noffered to groups in excess of five pupils at one time or where concerts\nor recitals are held are prohibited."
																}
															]
														},
														{
															"number": "(f) ",
															"content": [
																{
																	"text": "In no manner shall the appearance of the building\nbe altered, nor shall the occupation be conducted in a manner that\nwould cause the premises to lose its residential character, including\nbut not limited to the use of colors, materials, construction or lighting."
																}
															]
														},
														{
															"number": "(g) ",
															"content": [
																{
																	"text": "Notwithstanding anything set forth elsewhere\nin this article, home occupations, home business offices and home\nprofessional offices shall in no event be deemed to include animal\nhospitals, kennels, barbershops, beauty parlors, clinics or hospitals,\nmortuaries, nursery schools, clubs, auto repair shops, restaurants,\ntourist homes, rooming houses or boardinghouses and uses similar to\nthose listed above.[2]"
																},
																{
																	"footnote": "[2]\nEditor's Note: Former Subsection C(2)(h), regarding signs, which previously followed this subsection, was repealed 11-29-1994 by L.L. No. 25-1994. For current sign provisions, see Art. XIX, Signs.\n"
																}
															]
														},
														{
															"number": "(h) ",
															"content": [
																{
																	"text": "Home occupations, home business office and home\nprofessional offices shall not include manufacturing, fabrication\nor construction of any type on the site."
																}
															]
														},
														{
															"number": "(i) ",
															"content": [
																{
																	"text": "The outdoor storage of equipment necessary for\nresidents connected with aquaculture shall be screened from view and\nshall conform to the setbacks for accessory structures."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Boat docking facilities for the docking, mooring or\naccommodation of noncommercial boats, subject to the following requirements:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "There shall be docking or mooring facilities\nfor no more than two boats other than those owned and used by the\nowner of the premises for his personal use."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "The Town Trustees shall approve new boat docking\nfacilities."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "Boats at such docking facilities shall not be\nused for overnight sleeping purposes."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "Garden house, toolhouse, storage building, playhouse,\nwading pool, swimming pool or tennis court incidental to the residential\nuse of the premises and not operated for gain, subject to the following\nrequirements:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "Any swimming pool shall be completely enclosed\nwith a permanent chain link (or similar type) fence of not more than\ntwo-inch mesh, not less than four feet in height, erected, maintained\nand provided with a self-closing, self-latching gate to prevent unauthorized\nuse of the pool and to prevent accidents. However, if said pool is\nlocated more than four feet above the ground, then a fence is not\nrequired, provided that all points of access to said pool are adequately\nprotected by a self-closing, self-latching gate. Any swimming pool\nin existence at the effective date of the provisions of this subsection\nshall, within one year from such date, comply with all of the provisions\nhereof."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "Individual outdoor tennis court related to residential\nuse on a lot containing a single-family detached dwelling, provided\nthat the same is set back not less than six feet from all lot lines\nand that there is no lighting for after dark use."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "Private garages; provided, however, that not more\nthan two passenger automobile spaces in such garages may be leased\nto persons not resident on the premises."
												}
											]
										},
										{
											"number": "(6) ",
											"content": [
												{
													"text": "Off-street parking spaces accessory to uses on the\npremises. Not more than four off-street parking spaces shall be permitted\nwithin the minimum front yard."
												}
											]
										},
										{
											"number": "(7) ",
											"content": [
												{
													"text": "The storage of either a boat or travel trailer owned\nand used by the owner or occupant of the premises on which such boat\nor travel trailer is stored, for his personal use, subject to § 280-78Q,\nSupplemental parking regulations,[3] and the following requirements:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "Such boat or trailer shall not exceed 30 feet\nin length."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "Such boat or trailer shall be stored only in\nthe required rear yard, and the area occupied thereby, together with\nthe area of all buildings in the rear yard, shall not exceed 40% of\nthe area of the required rear yard."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "Such boat or trailer shall not be located within\n15 feet of any street or lot line."
																}
															]
														}
													]
												},
												{
													"footnote": "[3]\nEditor's Note: See now § 280-78P.\n"
												}
											]
										},
										{
											"number": "(8) ",
											"content": [
												{
													"text": "Horses and domestic animals other than household pets,\nprovided that such animals shall not be housed within 40 feet of any\nlot line. Housing for flocks of more than 25 fowl shall not be constructed\nwithin 50 feet of any line.[4]"
												},
												{
													"footnote": "[4]\nEditor's Note: Former Subsection C(9), as amended, regarding signs, which previously followed this subsection, was repealed 11-29-1994 by L.L. No. 25-1994. For current sign provisions, see Art. XIX, Signs.\n"
												}
											]
										},
										{
											"number": "(9) ",
											"content": [
												{
													"text": "Yard sales, attic sales, garage sales, auction sales\nor similar types of sales of personal property owned by the occupant\nof the premises and located thereon, subject to the following requirements:[Amended 6-2-2009 by L.L. No. 6-2009]"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "No more than two such sales shall be conducted\non any lot in any one calendar year."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "Adequate supervised parking facilities shall\nbe provided."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "No signs, except one on-premises sign not larger\nthan six square feet in size, displayed for a period of not longer\nthan one week immediately prior to the day of such sale, shall be\npermitted."
																}
															]
														},
														{
															"number": "(d) ",
															"content": [
																{
																	"text": "A permit shall be obtained therefor from the\nTown Clerk upon the payment of a fee of $15."
																}
															]
														},
														{
															"number": "(e) ",
															"content": [
																{
																	"text": "The display permit issued by the Town Clerk\nshall be posted on the premises so it can be read from the street\nand removed before sundown on the day of the sale."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(10) ",
											"content": [
												{
													"text": "Wineries may have an accessory gift shop on\nthe premises which may sell items accessory to wine, such as corkscrews,\nwine glasses, decanters, items for the storage and display of wine,\nbooks on winemaking and the region and nonspecific items bearing the\ninsignia of the winery. Wineries may not have a commercial kitchen\nas an accessory use but may have a noncommercial kitchen facility\nfor private use by the employees.[Added 11-29-1994 by L.L. No. 26-1994]"
												}
											]
										},
										{
											"number": "(11) ",
											"content": [
												{
													"text": "Child care.[Added 11-12-1996 by L.L. No. 20-1996]"
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "Rental permit for accessory apartments. Notwithstanding any prior course of conduct or permission granted, no owner of property shall cause, permit, or allow the occupancy or use of an accessory apartment created pursuant to § 280-13A(6) or § 280-13B(13) without a valid rental permit issued upon application to the Chief Building Inspector.[Added 6-15-2010 by L.L. No. 2-2010]"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Content of application. An application for a rental permit or for\na renewal of a rental permit shall bear the notarized signature of\nthe owner and contain the following information:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "The name, date of birth and telephone number of the owner."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "The address of the subject property including street address\nand Suffolk County Tax Map number."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "In the event the owner is a corporation, partnership, limited\nliability company or other business entity, the name, address and\ntelephone number of each owner, principal, officer, shareholder, partner\nor member of such business."
																}
															]
														},
														{
															"number": "(d) ",
															"content": [
																{
																	"text": "The name(s) and telephone number(s) of all tenants."
																}
															]
														},
														{
															"number": "(e) ",
															"content": [
																{
																	"text": "A copy of the lease agreement between owner and tenant."
																}
															]
														},
														{
															"number": "(f) ",
															"content": [
																{
																	"text": "A copy of the certificate of occupancy or preexisting certificate\nof occupancy for the property."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "The owner of an accessory apartment within an existing one-family dwelling shall, in addition to the information required in § 280-13D(1)(a) through (f), provide a certification that the existing dwelling or accessory apartment is occupied by the owner and that the premises is in compliance with all of the provisions of the Code of the Town of Southold, the laws and sanitary and housing regulations of the County of Suffolk and the laws of the State of New York."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "The owner of an accessory apartment in an accessory structure lawfully existing pursuant to § 280-13B(13) shall, in addition to the information required in § 280-13D(1)(a) through (f), provide a certification that:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "The existing single-family dwelling or the accessory apartment\nin the accessory structure is occupied by the owner as the owner's\nprincipal residence."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "The other dwelling unit on the subject property is to be occupied\nby either a family member or a resident who is currently on the Southold\nTown Affordable Housing Registry and eligible for placement."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "Rents charged to a tenant from the Affordable Housing Registry shall not exceed the rent established by the Town Board annually pursuant to § 280-30F of this Code."
																}
															]
														},
														{
															"number": "(d) ",
															"content": [
																{
																	"text": "The dwelling unit is in compliance with all of the provisions\nof the Code of the Town of Southold, the laws and sanitary and housing\nregulations of the County of Suffolk and the laws of the State of\nNew York."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "Review of application. The application for a rental permit shall be reviewed for completeness and accuracy by the Chief Building Inspector and, in the case of applications pertaining to accessory apartments in accessory structures, by the Government Liaison Officer. The Chief Building Inspector shall not issue a rental permit unless the application includes all of the requisite information enumerated in § 280-13D(1) through (3) and written approval by the Government Liaison Officer that the requirements of § 280-13B(13)(j) have been satisfied. The Chief Building Inspector shall have the right to inspect the property to confirm compliance with the New York State Uniform Fire Prevention and Building Code and this Code.[Amended 5-3-2016 by L.L.\nNo. 4-2016]"
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "Fees. A nonrefundable annual permit application fee in the amount\nof $150 shall be paid at the time of filing of an application for\na rental permit or a renewal rental permit for an accessory apartment\nin an existing single-family dwelling. A nonrefundable annual permit\napplication fee in the amount of $100 shall be paid at the time of\nfiling of an application for a rental permit or a renewal rental permit\nfor an accessory apartment in an accessory structure."
												}
											]
										},
										{
											"number": "(6) ",
											"content": [
												{
													"text": "Registry of permits. It shall be the duty of the Chief Building Inspector\nto maintain a register of permits issued pursuant to this chapter.\nSuch register shall be kept by name of applicant and street address\nand set forth the date of expiration of the rental permit."
												}
											]
										},
										{
											"number": "(7) ",
											"content": [
												{
													"text": "Annual renewal. Rental permits issued pursuant to this chapter shall\nbe valid for a period of one year from the date of issuance and must\nbe renewed by application to the Chief Building Inspector in accordance\nwith the procedures for the issuance of the initial rental permit\nwithin 10 days of expiration."
												}
											]
										},
										{
											"number": "(8) ",
											"content": [
												{
													"text": "Penalties for offenses. In addition to any other penalties for violations\nof this chapter, the Chief Building Inspector or Zoning Inspector\nshall revoke a permit when he or she finds that the owner has caused,\npermitted or allowed to exist and remain upon the premises a violation\nof any provision of the Code of the Town of Southold for a period\nof 14 days or more after written notice has been given to the owner.\nShould the owner permit any such violation of this Code, the laws\nand sanitary and housing regulations of the County of Suffolk and\nthe laws of the State of New York to remain uncured for a period of\n30 days or more after written notice has been given to the owner,\nthe Chief Building Inspector may revoke the certificate of compliance\nfor the accessory apartment."
												}
											]
										},
										{
											"number": "(9) ",
											"content": [
												{
													"text": "Appeal by owner. An appeal of a denial, revocation or renewal of a rental permit by the Chief Building Inspector based upon the owner's failure to satisfy the requirements of § 280-13B(13)(j)[1] and [2] may be taken to the Housing Advisory Commission, by written request, made within 30 days from the date of such revocation. The Housing Advisory Commission shall hold a public hearing on such appeal within 30 days after receipt of written notice of such appeal and, after such hearing, shall make written findings and a decision either sustaining such denial or revocation or issuing or reinstating such permit within 30 days after close of such public hearing. Any appeal of the revocation of a certificate of compliance must be presented to the Zoning Board of Appeals within 30 days from the date of revocation."
												}
											]
										}
									]
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 280-14",
			"title": "Bulk, area and parking regulations.",
			"content": [
				{
					"text": "No building or premises shall be used and no\nbuilding or part thereof shall be erected or altered in the A-C, R-80,\nR-120, R-200 and R-400 Districts unless the same conforms to the Bulk\nSchedule and Parking Schedule[1] incorporated into this chapter with the same force and\neffect as if such regulations were set forth herein full."
				},
				{
					"footnote": "[1]\nEditor's Note: The Bulk Schedule is included at the end of this chapter, and the Parking Schedule is in § 280-78A.\n"
				}
			]
		},
		{
			"paragraph": "§ 280-15",
			"title": "Accessory buildings and structures.",
			"content": [
				{
					"text": "In the Agricultural-Conservation District and\nLow-Density Residential R-80, R-120, R-200 and R-400 Districts, accessory\nbuildings and structures or other accessory uses shall be located\nin the required rear yard, subject to the following requirements:"
				},
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Buildings with a flat or mansard roof shall not exceed\n16 feet in height and shall be set back at the minimum required for\na sloping roof."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Buildings with a sloping roof shall be subject to\nthe following height and setback limitations:"
								},
								{
									"content": [
										{
											"number": "1. ",
											"content": [
												{
													"text": "For Lot Size of: 20,000- 39,999. Maximum Height: 22 feet, Minimum Setback for Side and/or Rear Yard: 20 feet"
												}
											]
										},
										{
											"number": "2. ",
											"content": [
												{
													"text": "For Lot Size of: 40,000- 59,999. Maximum Height: 22 feet, Minimum Setback for Side and/or Rear Yard: 15 feet"
												}
											]
										},
										{
											"number": "3. ",
											"content": [
												{
													"text": "For Lot Size of: 80,000 & over. Maximum Height: 22 feet, Minimum Setback for Side and/or Rear Yard: 25 feet"
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Such buildings shall not exceed 660 square feet on\nlots containing up to 20,000 square feet and shall not exceed 750\nsquare feet on lots 20,000 square feet to 60,000 square feet. On lots\nover 60,000 square feet, no accessory building shall exceed 3% of\nthe total size of the parcel."
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "Dormers are permitted on accessory buildings up to 40% of the roof width. This restriction shall not apply to buildings receiving a certificate of appropriateness from the Town of Southold Historic Preservation Commission pursuant to Chapter 170 of the Town Code."
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "Any accessory structure that is not a building shall not exceed 18 feet in height and shall be set back at the minimum required in Subsection B above."
								}
							]
						},
						{
							"number": "F. ",
							"content": [
								{
									"text": "In the case of a waterfront parcel, accessory buildings and structures may be located in the front yard, provided that such buildings and structures meet the front-yard principal setback requirements as set forth by this Code, and the side yard setback requirements for accessory buildings in Subsection B above."
								}
							]
						}
					]
				}
			]
		}
	]
}