{
	"url": "http://ecode360.com/5161767",
	"paras": [
		{
			"paragraph": "§ 280-37",
			"title": "Purpose.",
			"content": [
				{
					"text": "The purpose of the Residential Office (RO) District\nis to provide a transition area between business areas and low-density\nresidential development along major roads which will provide opportunity\nfor limited nonresidential uses in essentially residential areas while\nstrongly encouraging the adaptive reuse of existing older residences,\nto preserve the existing visual character of the Town and to achieve\nthe goal(s) of well-planned, environmentally sensitive, balanced development,\nwhich the Town has determined to be desirable."
				}
			]
		},
		{
			"paragraph": "§ 280-38",
			"title": "Use regulations.",
			"content": [
				{
					"text": "In the Residential Office (RO) District, no\nbuilding or premises shall be used and no building or part of a building\nshall be erected or altered which is arranged, intended or designed\nto be used, in whole or in part, for any uses except the following:"
				},
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Permitted uses."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "One-family detached dwellings, not to exceed one dwelling\non each lot."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Owner-occupied two-family dwellings."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "The following uses are permitted uses subject to site\nplan approval by the Planning Board:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "Buildings, structures and uses owned or operated\nby the Town of Southold, school districts, park districts and fire\ndistricts."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "Buildings, structures and uses owned or operated\nby fraternal organizations and utilized for activities typically conducted\nby a fraternal organization, including but not limited to public meeting\nplaces, charitable and fund-raising events, patriotic observances\nand catering for public and private functions."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "Bed-and-breakfast uses as set forth in and as regulated by § 280-13B(14)."
																}
															]
														},
														{
															"number": "(d) ",
															"content": [
																{
																	"text": "Professional offices."
																}
															]
														},
														{
															"number": "(e) ",
															"content": [
																{
																	"text": "Churches or similar places of worship, parish\nhouses, convents and monasteries."
																}
															]
														},
														{
															"number": "(f) ",
															"content": [
																{
																	"text": "Libraries, museums, art galleries, exhibit halls,\nartists'/photographers' studios and dance studios."
																}
															]
														},
														{
															"number": "(g) ",
															"content": [
																{
																	"text": "Small business offices such as insurance agencies,\nreal estate agencies, computer software services, financial planning\nsecurities brokers and like-kind small business establishments excluding\nretail sales of any kind or nature and limited to overall floor space\nof 3,000 square feet."
																}
															]
														}
													]
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Uses permitted by special exception by the Board of\nAppeals. The following uses are permitted as a special exception by\nthe Board of Appeals as hereinafter provided and subject to site plan\napproval by the Planning Board, provided that not more than one use\nshall be allowed for each 40,000 square feet of lot area:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Special exception uses as set forth in and regulated by § 280-13B(1) through (7) of the Agricultural-Conservation District."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Funeral homes."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Apartments may be permitted over business and professional\noffices as regulated by § 280-45B(4)(a) through (f), inclusive.[1]"
												},
												{
													"footnote": "[1]\nEditor's Note: Former Subsection B(4) was amended 5-6-2003 by L.L. No. 10-2003. For regulations on apartments, see now § 280-45C.\n"
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "Restaurants, except fast-food or formula restaurants."
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "Custom workshops, provided that they shall not be\nall or part of a commercial center."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Accessory uses. The following uses are permitted as accessory uses and, except for residential accessory uses and signs, which are governed by Article XIX, are subject to site plan review:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Accessory uses as set forth in and regulated by § 280-13C(1) through (7) of the Agricultural-Conservation District and subject to the conditions set forth in § 280-15 thereof."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Accessory uses set forth in and regulated by § 280-22C(2) of the Hamlet Density Residential District."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "Additional standards. All permitted structures as\nset forth in this article, except for single-family dwellings, shall\nbe subject to the following:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "No outdoor storage or display of any kind shall be\npermitted."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "All permitted buildings and other structures shall\nbe visually residential in character, the visible architectural features\nof which shall be consistent and compatible with the architectural\nstyles of the existing structures in the immediate neighborhood."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Store fronts of any kind whatsoever shall not be permitted."
												}
											]
										}
									]
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 280-39",
			"title": "Bulk, area and parking regulations.",
			"content": [
				{
					"text": "No building or premises shall be used and no\nbuilding or part thereof shall be erected or altered in the Residential\nOffice (RO) District unless the same conforms to the Bulk Schedule\nand Parking and Loading Schedules incorporated into this chapter,\nwith the same force and effect as if such regulations were set forth\nherein in full.[1]"
				},
				{
					"footnote": "[1]\nEditor's Note: The Bulk Schedule is included at the end of this chapter, and the Parking and Loading Schedules are in §§ 280-78 and 280-79.\n"
				}
			]
		}
	]
}