{
	"url": "http://ecode360.com/1061220",
	"paras": [
		{
			"paragraph": "§ 205-8",
			"title": "Residence R1 and Suburban Estate OP1 Districts.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Principal uses. In Residence R1 and Suburban Estate\nOP/1 Districts, no land, lot, building or structure shall be used\nand no building or structure shall be erected or altered to be used\nor maintained for any purpose other than one of the following:[Amended 9-19-2000 by L.L. No. 1-2000; 9-16-2008 by L.L. No.\n2-2008]"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Permitted uses:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "A single-family detached dwelling."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "Municipal governmental facility of the Village."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "Village park or reservation."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Special uses only after written application to and\napproval by the Village Board of Trustees of a special use permit\nor certificate, subject to such conditions as said Board may impose,\nand the issuance of a zoning or building permit as follows:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "Diplomatic facility of a foreign nation or mission\nin existence as of July 21, 1994, including any change in the use,\nland area, alteration or construction of any structure and required\nremoval of structures upon cessation of such use."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "Public water supply facilities, including pumping\nstation, buildings and structures pertaining thereto."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "Other essential public utility facilities and\nstructures."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Conditional uses only after written application to\nand approval from the Board of Appeals of a conditional use certificate,\nsubject to such conditions as said Board may impose, and the issuance\nof a zoning or building permit as follows:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "Academic school (See § 205-20A.)"
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "Cemetery. (See § 205-20B.)"
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "Church. (See § 205-20C.)"
																}
															]
														},
														{
															"number": "(d) ",
															"content": [
																{
																	"text": "Club. (See § 205-20D.)"
																}
															]
														},
														{
															"number": "(e) ",
															"content": [
																{
																	"text": "College or university. (See § 205-20E.)"
																}
															]
														},
														{
															"number": "(f) ",
															"content": [
																{
																	"text": "Monastery, convent or novitiate. (See § 205-201H.)"
																}
															]
														},
														{
															"number": "(g) ",
															"content": [
																{
																	"text": "Nonprofit reservation or water conservation area. (See § 205-20F.)"
																}
															]
														},
														{
															"number": "(h) ",
															"content": [
																{
																	"text": "Wireless telecommunication services facility.\n(See § 205-201I.)"
																}
															]
														}
													]
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Accessory uses. Any of the following accessory uses, buildings or structures, as defined in § 205-7, and subject to the provisions of § 205-15, provided that they are incidental to the principal use located on the land or lot:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Customary accessory uses, buildings and structures. (See the definition of \"accessory building\" in § 205-7.)"
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Any form of noncommercial home agriculture or horticulture, including the keeping of domestic animals and pets. (See § 205-15B, C, D and E.)"
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Guest house. (See the definition of \"guest house\" in § 205-7.)"
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "Accessory dwelling (see the definition of \"accessory dwelling\" in § 205-7), including the rental of only one accessory dwelling per lot, subject to the provisions of § 205-9E."
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "Fence or wall. (See § 205-17.)"
												}
											]
										},
										{
											"number": "(6) ",
											"content": [
												{
													"text": "Residential nameplate and other signs subject to the provisions of § 205-14."
												}
											]
										},
										{
											"number": "(7) ",
											"content": [
												{
													"text": "Home occupations, subject to the provisions of § 205-9A."
												}
											]
										},
										{
											"number": "(8) ",
											"content": [
												{
													"text": "Home office or studio of a doctor of medicine, dentist, artist, sculptor, architect, teacher, musician, lawyer or engineer residing in the dwelling, subject to the provisions of § 205-9B."
												}
											]
										},
										{
											"number": "(9) ",
											"content": [
												{
													"text": "Off-street parking, subject to the provisions of § 205-16."
												}
											]
										},
										{
											"number": "(10) ",
											"content": [
												{
													"text": "Wireless telecommunication services facility. (See § 205-20I.)[Added 9-19-2000 by L.L. No. 1-2000]"
												}
											]
										}
									]
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 205-9",
			"title": "Additional regulations.",
			"content": [
				{
					"text": "In addition to the provisions of § 205-11:"
				},
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "An accessory home occupation shall not include the\ndisplay of goods or advertising visible from any street. In connection\nwith such occupation there shall be kept no stock-in-trade nor commodity\nsold upon the premises, no paid assistant shall be employed and no\nelectrical or mechanical equipment shall be used other than ordinary\nhousehold equipment. The space used for a home occupation shall occupy\nnot more than 500 square feet of floor area of the dwelling unit,\nand no such occupation shall be carried on in any accessory building."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "An accessory office or studio shall not occupy more\nspace than the equivalent of 500 square feet of the area of one floor\nof the dwelling in which such office or studio is used; there shall\nbe no display or advertising on the premises in connection with such\nuse except a professional nameplate; no assistants, whether paid or\nnot, shall participate in such use, except that one assistant may\nbe employed if the nature of the profession is such as to require\nan assistant; and any such musician's or sculptor's studio shall be\nequipped and used in such manner that sounds therefrom are not unduly\nannoying to other persons on nearby premises or public places."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Except as provided for in Subsections E and G below, no more than one dwelling unit per lot shall be permitted."
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "No accessory dwelling shall hereafter be erected,\ncreated or enlarged and no existing structure shall hereafter be converted\ninto an accessory dwelling."
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "Only one accessory dwelling legally existing prior\nto January 3, 1961, per lot may be rented or occupied by persons other\nthan bona fide domestic employees, provided that the Village Attorney\ncertifies that official Building Department records confirm, or the\nBoard of Appeals after a public hearing finds, that said accessory\ndwelling was legally in existence prior to January 3, 1961, and the\nVillage Attorney or the Board of Appeals authorizes the Building Inspector\nto issue a certificate of occupancy so as to permit the rental or\noccupancy by nonemployees of the accessory dwelling."
								}
							]
						},
						{
							"number": "F. ",
							"content": [
								{
									"text": "No accessory dwelling shall be moved or enlarged unless\nit is converted into a principal single-family dwelling on a separate\nlot which complies with the provisions of this chapter."
								}
							]
						},
						{
							"number": "G. ",
							"content": [
								{
									"text": "Guest houses legally existing prior to December 31,\n1996, shall not be rented and shall be occupied only by persons regularly\nemployed on the premises by the family occupying the main dwelling\nand/or for temporary use by guests of the occupants of the premises."
								}
							]
						},
						{
							"number": "H. ",
							"content": [
								{
									"text": "Any use not permitted hereinabove or in § 205-8A shall be prohibited."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 205-10",
			"title": "Schedule of standards for R1 and OP1 Districts.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Applicability. Standards shown are minimum requirements\nfor all buildings and structures unless otherwise indicated. Dimensions\nare in feet unless otherwise indicated."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Lot size and yards. Lot size and yards shall be subject to the provisions of this Article IV, §§ 205-12 and 205-15 and Article VIII.[1]"
								},
								{
									"footnote": "[1]\nEditor's Note: Original Sec. 400.3, Floor\narea, which immediately followed this subsection, was deleted 9-19-2000\nby L.L. No. 1-2000.\n"
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Site plan and architectural review requirement. Site plan approval by the Planning Board shall be required before any zoning or building permit is issued for any new or altered use, building or structure, pursuant to the provisions of Article VIII."
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "Bulk volume standards.[Amended 7-27-1999 by L.L. No. 1-1999; 8-16-2004 by L.L. No.\n1-2004; 3-15-2005 by L.L. No. 4-2005; 1-26-2006 by L.L. No. 1-2006; 1-26-2006 by L.L. No. 2-2006]"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Regulation. Subject to the provisions of Article VII of this chapter, no building shall hereafter be erected or enlarged in the district in which it is located except in compliance with the following requirements:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "If it is a main building in the R1 (two-acre)\nDistrict, the building volume shall not exceed 90,000 cubic feet."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "If it is a main building in the OP1 (five-acre)\nDistrict the building volume shall not exceed 150,000 cubic feet except\nthat for a nonconforming lot in bona fide single ownership having\nan area of less than five acres, the lesser volume limit for the R1\n(two-acre) District shall apply."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "The volume of a proximate building shall be\nincluded in the volume calculation of the main building."
																}
															]
														},
														{
															"number": "(d) ",
															"content": [
																{
																	"text": "All buildings shall have roof pitches of at\nleast six on 12, except that a maximum of 20% of the horizontal area\ncovered by the roof may be covered by a flat roof."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Volume calculation and measurement rules. The volume\nof a building [and proximate building(s)] shall be calculated as follows:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "The total volume of a building shall be the\nsum of the volumes of the foundation story, first story, second story\n(if there is one that is not the roof story) and the roof story."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "The volume of each story shall be its height multiplied by the floor area of the story subject to Subsection D(2)(e) immediately below."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "In the calculation of floor area, the length\nof any curved section of the building perimeter shall be the sum of\nthe chords that intersect with each 90° of arc, or portion thereof,\nbetween the point of intersection of the curved section and the adjacent\nstraight section(s). Any complex combination of curved sections of\nthe building perimeter of a structure shall be treated as if they\nwere individual curves intersecting with a straight section at each\npoint of inflection."
																}
															]
														},
														{
															"number": "(d) ",
															"content": [
																{
																	"text": "All portions of a building shall be included\nin the calculation of volume except that 50% of any roofed portion\nof the building not completely enclosed by full walls shall be excluded\nfrom the calculation."
																}
															]
														},
														{
															"number": "(e) ",
															"content": [
																{
																	"text": "The height of each story of a building shall\nbe calculated as follows:"
																},
																{
																	"content": [
																		{
																			"number": "[1] ",
																			"content": [
																				{
																					"text": "For a story with multiple heights, the volume\nof the entire story shall be calculated as the sum of the volumes\nof each portion having a different height. Any void in the floor of\na story shall be deemed to be at the lowest floor elevation of that\nstory. Any void in the ceiling of a story shall be deemed to be at\nthe elevation of the highest ceiling elevation of that story."
																				}
																			]
																		},
																		{
																			"number": "[2] ",
																			"content": [
																				{
																					"text": "Foundation story. The height of the foundation\nstory shall be measured from the average finished grade around the\nfoundation perimeter to the top of the floor of the first story or,\nif the structure is built on a slab, to the top of the slab. The average\nfinished grade shall be the average of the finished contours at each\nexterior corner of the foundation story as situated on the lot."
																				}
																			]
																		},
																		{
																			"number": "[3] ",
																			"content": [
																				{
																					"text": "First story. The height of the first story shall\nbe measured from the floor to the floor of the story above it."
																				}
																			]
																		},
																		{
																			"number": "[4] ",
																			"content": [
																				{
																					"text": "Second story (if not the roof story). If not\na roof story, the height of the second story shall be measured from\nthe level of its floor or, in the absence of a floor above, to the\neaves of the roof above it."
																				}
																			]
																		},
																		{
																			"number": "[5] ",
																			"content": [
																				{
																					"text": "Roof story. The height of each portion of the\nroof story shall be measured from the level of its floor or the ceiling\njoists of the story immediately below it to the top of its highest\nridge beam. If the highest point of its roof is a flat section, then\nthe height shall be measured to the top of that section. The volume\nof each portion of the roof story shall be 40% of the product of its\nheight and its floor area."
																				}
																			]
																		}
																	]
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "In the R1 (two-acre) District no detached single accessory\nbuilding, except for those without a roof and walls, shall have a\nfloor area which exceeds 1,000 square feet. The combined floor area\nof all such accessory buildings or structures on a lot shall not exceed\n1,600 square feet. Fifty percent of any roofed portion of an accessory\nbuilding not completely enclosed by full walls shall be excluded from\nthe calculation of floor area. A proximate building shall be exempt\nfrom this subsection."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "In the OP1 (five-acre) District no detached single\naccessory building, except for those without a roof and walls, shall\nhave a floor area which exceeds 1,200 square feet. The combined floor\narea of all such accessory buildings or structures on a lot shall\nnot exceed 2,000 square feet. Fifty percent of any roofed portion\nof an accessory building not completely enclosed by full walls shall\nbe excluded from the calculation of floor area. A proximate building\nshall be exempt from this subsection."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "Standards.[Amended 12-21-1998 by L.L. No. 4-1998; 7-27-1999 by L.L. No. 1-1999; 1-26-2006 by L.L. No. 1-2006]"
								},
								{
									"footnote": "[2]\nEditor's Note: Appendix B is included as an attachment to this chapter.\n"
								}
							]
						},
						{
							"number": "F. ",
							"content": [
								{
									"text": "Regulation of construction and development in slope\nlands.[Added 1-26-2006 by L.L. No. 2-2006]"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "No development shall be permitted on those portions\nof a lot which contain severe slopes (i.e., greater than 25%) except\nas follows:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "Trees, shrubbery, grass and ground cover may\nbe removed only for the purpose of constructing an access driveway\nand facilities for drainage and utilities."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "No development shall be permitted on those portions\nof a lot which contain steep slopes (i.e., between 15% and 25%) except\nas follows:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "In cases where there is an existing building\nsite or potential building site on the lot, no portions of the lot\nwhich contain steep slopes may be developed except for the purpose\nof constructing an access driveway and facilities for drainage and\nutilities."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "In cases where there is no existing building site or potential building site on the lot, only up to 10% of the gross lot area may be developed in those portions of the lot which have no severe slopes subject to Subsection F(1) above."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "In cases where the entire lot is comprised of severe\nslopes (i.e., over 25%), no development shall be permitted unless\na variance is obtained from the Board of Appeals."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "In cases of a lot in single ownership as defined in § 205-23C, which does not contain an existing building site or a potential building site, a new or enlarged main building may be constructed at the location of the existing main building, provided the footprint of the new or enlarged main building does not exceed the area of the footprint of the main building, as it existed on the effective date of this regulation, by more than 10%."
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "All construction and development activity in slope\nlands shall require prior written approval of the Architectural/Site\nPlan Commissioner (ASPC) and the Village Engineer subject to the following\nguidelines and requirements:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "Driveways shall be constructed with appropriate\nmasonry retaining walls so as to avoid the excessive cutting, filling\nand clearing of natural fauna and flora."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "Appropriate safeguards shall be required to\nprevent erosion."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "Adequate drainage facilities shall be constructed\nand maintained to capture runoff from all new impervious surfaces\nand other disturbed areas."
																}
															]
														},
														{
															"number": "(d) ",
															"content": [
																{
																	"text": "Imposition of reasonable requirements to protect\nand preserve the flora and fauna on the slope lands and the protection\nand preservation of natural habitat."
																}
															]
														},
														{
															"number": "(e) ",
															"content": [
																{
																	"text": "The property owner shall deposit a sum of money required under Chapter 112, Fees and Deposits, to cover reasonable fees charged by the Village Engineer for plan review and site inspection for the development of slope lands."
																}
															]
														}
													]
												}
											]
										}
									]
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 205-11",
			"title": "General use regulations.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Uses in any district. In addition to the use regulations set forth in each district in Article III, the following general use regulations shall apply to all districts:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Special restrictions on incompatible uses. Nothing\nin this chapter shall be construed to permit any use or occupancy\nthat:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "Is or may reasonably be expected to be obnoxious\nor offensive by reason of causing or emitting dust, garbage, gas,\nnoise or vibrations, odor, radiation, refuse matter, smoke or waterborne\nwaste;"
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "Is dangerous or harmful to the health, safety,\npeace or comfort of the community;"
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "Tends to disturb or annoy residents of the Village;"
																}
															]
														},
														{
															"number": "(d) ",
															"content": [
																{
																	"text": "Tends to constitute a public or private nuisance\nby reason of unusual use or appearance which is disharmonious with\nthe character of the neighborhood; or"
																}
															]
														},
														{
															"number": "(e) ",
															"content": [
																{
																	"text": "Involves any explosion menace or any serious\nfire hazard."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Uses specifically prohibited. In addition to the prohibitions referred to in § 205-9H, the following uses shall be specifically prohibited in all districts:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "Abattoirs; agricultural or horticultural processing\nindustries; and manufacturing or fabrication of products."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "Commercial uses, including but not limited to\ndairying, poultry raising/livestock raising, kennels and stables."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "Commercial farming, horticultural nursery, greenhouse,\nvineyards, cutting of native trees and sawing of timber, excavation\nof gravel, soil, sand and other mineral deposit and stripping of sod\nor topsoil."
																}
															]
														},
														{
															"number": "(d) ",
															"content": [
																{
																	"text": "Commercial recreation, including polo field,\nriding club, hockey rink, tennis, racquet or health club, golf course\nand similar activities conducted as a business or available to the\ngeneral public for a fee."
																}
															]
														},
														{
															"number": "(e) ",
															"content": [
																{
																	"text": "Farms for the disposal of garbage or offal;\nplaces for the disposal of sewage or rubbish; hog ranches; pig and\nlivestock feeding farms; and small animal and fur farms."
																}
															]
														},
														{
															"number": "(f) ",
															"content": [
																{
																	"text": "Laboratory or experimental station, except as\nan incidental use on the same premises as a college to which such\nuse is accessory."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Mobile dwelling units. No mobile dwelling unit shall\nbe used and occupied for overnight dwelling purposes while stored\nor parked in any district.[Amended 5-15-2007 by L.L. No. 5-2007]"
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "Any other use not specifically permitted by this chapter\nshall be prohibited."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Building on lot. Each building or structure hereafter erected or altered shall be located on a lot as defined in Article II. In no case shall there be more than one principal use or one main building and its accessory building or buildings on one lot."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Street frontage. Each principal use, dwelling or other main building or structure hereafter erected or altered shall be located upon a lot so as to have unobstructed street frontage upon a street as defined in § 205-7."
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "Lawful easements. Nothing herein contained shall be construed to prohibit a lawful easement or the lawful extension of service lines of public utilities and municipal facilities from such easement, power line right-of-way or abutting street into the property to be served by such utilities or facilities, subject to the requirements of the definition of \"lot area\" in § 205-7."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 205-12",
			"title": "General area regulations.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Lot size. No lot or parcel of land on the effective\ndate of this chapter shall be reduced in any manner below the minimum\nlot size required by this chapter. No nonconforming lot shall be reduced\nin any manner below its existing size and dimensions. The minimum\nlot areas required by this chapter shall be considered the minimum\nfor each and every dwelling unit or main building devoted to a principal\nuse existing at the effective date of this chapter and for any dwelling\nunit or other main building hereafter erected or altered."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Unobstructed yards. No required yard shall be diminished or maintained with lesser dimensions than those prescribed by this chapter. Every part of a required yard shall be open and unobstructed to the sky, except as provided in Subsection D."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Permanence of lot size and open space. No land required\nfor yard, open space or lot area for a dwelling unit or for any other\nprincipal use, building or structure, whether existing or to be established\nin the future, in order to comply with the provisions of this chapter,\nshall be considered as a yard, open space or lot area for any other\ndwelling unit, building or structure, nor shall any yard, open space\nor lot area for a dwelling unit on an adjoining lot be considered\nas providing such yard, open space or lot area for a dwelling unit\nor any other building or structure on a lot upon which a building\nis to be erected.[Amended 9-19-2000 by L.L. No. 1-2000]"
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "Yard requirements and exceptions. Except as otherwise\nspecifically provided by these regulations, no building or structure\nor part thereof shall extend or project into a yard required by this\nchapter."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Projections. The following projections into required\nyards are permitted, provided that the maximum projection specified\nhereinbelow shall not be exceeded:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "Cornices, eaves, gutters and chimneys may project\nnot more than 24 inches."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "Belt courses, sills, stormwater leaders and\nsimilar ornamental or structural features may project not more than\none foot."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "Awnings serving a door or window may project\nnot to exceed five feet."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Other structures. Nothing herein shall be construed\nto prevent the construction and maintenance of access driveways, garden\nwalks and similar at-grade accessory or appurtenant facilities nor\nof accessory subterranean facilities, such as a private sanitary system,\nin a required yard, provided that they are set back at least 10 feet\nfrom a boundary line."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "In order to protect adjoining property owners and\nnatural habitat, buffer areas shall be preserved on lots where new\nconstruction is proposed, and existing buffer areas shall be maintained\non all lots.[Added 1-26-2006 by L.L. No. 2-2006]"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "The property owner may incorporate new plant materials\nin the buffer areas so long as the new plantings do not adversely\naffect the existing vegetation. However, no existing live tree or\nshrub of any size shall be removed from the buffer areas without first\nfiling an application with and securing approval from the Architectural/Site\nPlan Commissioner (ASPC)."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "No driveway shall be permitted in any buffer area."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Only boundary line fences that have a transparency\nfactor of at least 60% may be located in buffer areas, provided there\nis no unnecessary destruction of vegetation."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "The ASPC may approve modifications of buffer areas\nto improve visibility for vehicles."
												}
											]
										}
									]
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 205-13",
			"title": "Height regulations.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Height inclusion and exception. The height limitations of this chapter set forth in § 205-10E shall not apply to the following structures:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "A spire, cupola, tower, pinnacle or similar structure\nserving as an architectural embellishment may exceed the height prescribed\nfor the district in which it is located upon approval by the Board\nof Appeals."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "A chimney may be erected to a height not more than\nfive feet higher than the maximum permitted height of a building."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "An accessory radio, television or other antenna, other\nthan a satellite dish antenna, may be erected to a height not more\nthan 10 feet in excess of the height prescribed by these regulations\nupon approval of the plans by the Building Inspector."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "Freestanding flagpoles which do not exceed 40 feet\nin height.[Amended 7-27-1999 by L.L. No. 1-1999]"
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "Wireless telecommunication services facilities when\nsuch structures are otherwise permitted by approval of the Board of\nAppeals.[Added 9-19-2000 by L.L. No. 1-2000]"
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Height of units of building. Whenever a building or\nstructure or portion thereof is constructed on sloping ground or at\ndifferent levels, the height of the building and of each such portion\nshall be measured from the mean natural grade surrounding each unit\nof building and measured vertically to the highest part of the building.[Amended 7-27-1999 by L.L. No. 1-1999]"
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 205-14",
			"title": "Signs.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Accessory signs. A sign (as defined in Article II) located on a lot or land or on a building or structure for the purpose of identification or protection of the same or for directing attention to a use lawfully conducted on the premises shall be deemed to be accessory and incidental to such land, building or structure."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Signs requiring a sign permit. A sign greater than two square feet in area, and any illuminated sign before such sign is displayed or illuminated, except any sign listed in Subsections C and D below, shall not be placed on land or on a building unless the Board of Appeals, upon application and after public notice and hearing, grants approval for such sign and a sign permit is duly issued for the same by the Building Inspector. For the purpose of these regulations, \"area\" as applied to the size of a sign shall mean the maximum projected area of the oblong, parallelogram or other shape which encloses the sign structure, device or representation."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Signs requiring no permit. No permit shall be required\nfor any of the following accessory signs which may be displayed in\nany district:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "A nonilluminated nameplate, which may have reflecting\nletters, bearing the name of the occupant or professional person residing\non the premises, provided that such sign shall not exceed two square\nfeet in area."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "One temporary sign pertaining to the sale or rental\nof land or property on which it is displayed, provided that such sign\nshall not exceed two square feet in area, shall not project beyond\nthe required front yard setback line, shall not be illuminated and\nshall be removed within three days after the sale or rental of the\nland or property."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "A nonilluminated informational or directional sign\nor historic marker erected by a public agency and any similar sign\nlocated within a public park, playground or reservation and erected\nand maintained therein by the public agency having jurisdiction over\nsuch park, playground or reservation, provided that no such sign shall\nexceed 10 square feet in area, subject to approval of the Village\nBoard of Trustees."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "Municipal signs necessary to the public welfare of\nthe Village, after approval of the Village Board of Trustees, and\nofficial notices displayed at or under the direction of any public\nor court officer in the performance of his official duties, provided\nthat such notices shall be removed not later than five days after\ntheir purpose is accomplished."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "Sign application requirements."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Written application for a sign permit shall be made, by the owner or his authorized agent, to the Building Inspector and shall be accompanied by plans and detailed information, including the sign's exact location on the building or land, its area and dimensions, methods and materials to be used in its construction and support and the precise manner of illumination, if any is proposed. The Building Inspector shall refer the application to the Board of Appeals for action pursuant to Subsection B."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "All signs shall be designed, installed and maintained\nin a safe condition, in accordance with the New York State Uniform\nFire Prevention and Building Code and applicable ordinances of the\nVillage.[Amended 9-19-2000 by L.L. No. 1-2000]"
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Any nonilluminated institutional sign or bulletin\nboard erected upon the premises and maintained by a church, club,\nprivate institution or public agency shall not project beyond the\nbuilding lines nor exceed 16 square feet in area."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "Not more than one sign shall be used for each use\nor activity coming within the provisions of this section, except as\notherwise permitted herein."
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "A nameplate or sign may be attached to the dwelling\nto which it is accessory or to a post, which may be located within\nthe front yard, provided that such post shall not exceed four feet\nin height nor extend nearer than 10 feet to the street line. Any other\ntype of permitted sign shall be attached to the building to which\nit is accessory, except as may otherwise be specifically approved\nby the Board of Appeals."
												}
											]
										},
										{
											"number": "(6) ",
											"content": [
												{
													"text": "Upon application, and after public notice and hearing,\nthe Board of Appeals may approve, subject to such conditions as it\nmay prescribe, a permitted sign on a freestanding structure or the\nnonflashing illumination of an institutional bulletin board or sign\nor of a municipal or public sign, provided that the Board finds that\nsuch freestanding sign or such illumination, as the case may be, is\nreasonably necessary for the public convenience and will not adversely\naffect the character of adjacent property, and provided that such\nillumination shall be by indirect lighting, with the source thereof\nso shielded as to prevent glare, and provided, further, that, except\nfor a nameplate, no such sign shall be located beyond the building\nline."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "Prohibited signs. The following signs shall be prohibited\nin all districts:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Advertising sign, as defined in Article II, and any sign not specifically permitted hereinabove."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Any sign or nameplate within the triangular area described in § 205-17B."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Any sign of which all or any part is in motion by\nany means, including fluttering, rotating or other moving signs set\nin motion by movement of the atmosphere."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "A sign displaying flashing or intermittent lights\nor lights of changing degrees of intensity and illuminated tubing\nor strings of lights outlining roof lines, doors, windows or wall\nedges of any building."
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "Any sign that interferes with or obscures a sign displayed\nby public authority for traffic instructions or direction or other\npublic information."
												}
											]
										},
										{
											"number": "(6) ",
											"content": [
												{
													"text": "Any sign that produces or causes any direct glare\ninto a street or into or upon any residence property or dwelling unit."
												}
											]
										},
										{
											"number": "(7) ",
											"content": [
												{
													"text": "Any business sign on a street or highway."
												}
											]
										}
									]
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 205-15",
			"title": "Accessory uses and buildings.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Uses. An accessory use, as defined in § 205-7, shall be subject to the following general regulations:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Any accessory use shall be used, operated, occupied\nand maintained under the same ownership or by the same lessee as that\nof the principal permitted use on the premises to which it is accessory."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Such accessory use shall not involve nor include any\nuse, building, structure or structural feature inconsistent with the\nprincipal permitted use."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "No accessory use shall be permitted and no accessory\nbuilding or structure shall be located on any lot or land prior to\nthe time of the establishment of the principal use or of the construction\nof the main building to which it is accessory, as the case may be."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "Any artificial body of water shall be equipped with\nan effective aeration or filtration system to prevent unpleasant odors\nand a breeding place for mosquitoes and other undesirable insects.[Added 12-21-1998 by L.L. No. 4-1998]"
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Keeping of animals and fowl for domestic purposes."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Only occupants of a dwelling in any district shall\nbe permitted to keep horses or livestock for their personal use, provided\nthat there is compliance with the following standards and conditions:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "No such use shall be permitted on lots having\nan area of less than one acre."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "The number of horses and livestock and the number\nof stalls and structural facilities reasonably necessary for the shelter\nof the same permitted on each lot shall not exceed the following:"
																},
																{
																	"content": [
																		{
																			"number": "[1] ",
																			"content": [
																				{
																					"text": "For lots having at least two acres in area,\ntwo horses or livestock (in any aggregate combination) for the first\nacre of lot area plus one additional horse or livestock for each additional\nfull acre of lot area."
																				}
																			]
																		},
																		{
																			"number": "[2] ",
																			"content": [
																				{
																					"text": "For lots having at least five acres in area, three horses or livestock (in any aggregate combination) for the first two acres of lot area plus one additional horse or livestock for each additional full acre of lot area, subject to the provisions of Subsection B(1)(h) below."
																				}
																			]
																		}
																	]
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "Any such horses or livestock shall be owned\nin fact as well as in name solely by the resident occupants of the\nlot, who shall, upon written request of the Building Inspector, produce\na sworn affidavit and other reasonable evidence of said ownership."
																}
															]
														},
														{
															"number": "(d) ",
															"content": [
																{
																	"text": "The boarding or keeping of horses or livestock\nowned by persons other than those who are the residence occupants\nof any lot is strictly prohibited."
																}
															]
														},
														{
															"number": "(e) ",
															"content": [
																{
																	"text": "All grain-type feed shall be kept in rodent-proof\nmetal containers."
																}
															]
														},
														{
															"number": "(f) ",
															"content": [
																{
																	"text": "Manure shall not be stored within 150 feet from\nany boundary line and shall be stored and treated in such a manner\nso that it shall not create any odor or attract or harbor any rodents,\nflies or other insects."
																}
															]
														},
														{
															"number": "(g) ",
															"content": [
																{
																	"text": "The location of stables, barns and sheds used to shelter horses and livestock shall be subject to the setback requirements for accessory buildings as set forth in § 205-10E plus an additional 25 feet, except that any private riding ring, private paddock, corral or other roofless enclosure for horses and livestock and any unenclosed area for their unattended maintenance shall be located not less than 20 feet from any side or rear boundary line and 75 feet from any front boundary line."
																}
															]
														},
														{
															"number": "(h) ",
															"content": [
																{
																	"text": "No person shall keep more than four horses or\nlivestock on any one lot irrespective of its area in any district\nunless the same is authorized and approved by the Board of Appeals."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Small animal pens and enclosures shall be adequately\nfenced to a height of at least six feet, and such pens and enclosures,\nas well as any other accessory building, structure or enclosure, used\nfor the keeping of bees and other domestic animals shall be located\nat least 75 feet from the rear or side lot line and at least 100 feet\nfrom any street, except that a dog kennel housing five dogs or more\nshall be located at least 500 feet from any lot line."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Conditions under which horses, cows, sheep or domestic\nfowl, birds and small animals are kept shall be such as may be specified\nor required by the County Department of Health or by other ordinances\nof the Village."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Fertilizers and compost. No compost shall be made\nor stored nor shall any fertilizer be stored within 100 feet of any\nlot line unless kept in an airtight storage container."
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "Accessory use limitations. No accessory use shall include a business, commercial or industrial use or activity, except as provided in § 205-8B(7) and (8)."
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "Location of and restrictions on accessory uses, buildings,\nstructures or facilities."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "No accessory use, building or structure shall be located\nwithin the applicable minimum yard prescribed by this chapter, except\nas may otherwise be approved by the Board of Appeals or as may otherwise\nbe specifically provided herein."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "There shall be only one curb cut or driveway access\nto a lot."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "A driveway may be located within a required yard,\nprovided that it is set back at least 10 feet from any side or rear\nlot line."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "Off-street parking areas shall not be located in a\nrequired front yard nor less than 10 feet from any lot line of a side\nor rear yard."
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "Any uses or buildings accessory to parks or reservations\nmay occupy in the aggregate an area which shall not exceed the maximum\nbuilding cover permitted in the district."
												}
											]
										},
										{
											"number": "(6) ",
											"content": [
												{
													"text": "No tennis or other athletic court shall be illuminated\nby artificial lighting to facilitate its use, nor shall such courts\nbe used before 8:00 a.m. or after 9:00 p.m."
												}
											]
										},
										{
											"number": "(7) ",
											"content": [
												{
													"text": "Buildings and structures accessory to parks or a reservation\nshall comply with all yard requirements of this chapter for a main\nbuilding in the particular district in which they are located."
												}
											]
										},
										{
											"number": "(8) ",
											"content": [
												{
													"text": "Any existing freestanding aboveground electrical service\nmeter structure which, prior to September 1, 2000, was improperly\nlocated in violation of the applicable minimum yard regulations may\ncontinue to remain in its existing location provided it is concealed\nfrom the street and adjacent properties by live evergreen planting,\nprovided such planting is installed no later than May 31, 2001. The\nprovisions of this subsection shall not apply to utility poles or\noverhead wires.[Added 9-19-2000 by L.L. No. 1-2000]"
												}
											]
										},
										{
											"number": "(9) ",
											"content": [
												{
													"text": "Any aboveground electrical, telephone or cable television\napparatus or structure located within the right-of-way of a public\nor private street shall be concealed from view, to the extent practicable,\nby live evergreen planting by the owner of such apparatus or structure.\nLive evergreen planting for existing apparatus or structures shall\nbe installed and maintained no later than September 1, 2001. The provisions\nof this subsection shall not apply to utility poles or overhead wires.[Added 9-19-2000 by L.L. No. 1-2000]"
												}
											]
										}
									]
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 205-16",
			"title": "Off-street parking and loading.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Off-street facilities required. In all districts in\nwhich the types of buildings and uses specified hereinafter are permitted\nby this chapter, off-street parking and off-street loading facilities\nin connection with uses hereafter commenced or buildings hereafter\nerected or altered shall be provided in amounts not less than hereinafter\nspecified."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Schedule of required off-street parking. The minimum\namount of required number of off-street parking spaces by use classification\nis set forth in the following schedule:"
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Calculation of parking space."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "For the purposes of this section, \"parking space\"\nshall mean an area of not less than 180 square feet, exclusive of\ndrives or aisles giving access thereto, for the parking of automobiles.\nWhen the computation to determine the number of required spaces results\nin a requirement of a fractional space, any fraction up to and including\n1/2 shall be disregarded, and fractions over 1/2 shall require one\nparking space."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "In the case of a use not listed in the schedule, the\nrequirements for off-street parking for a use listed and to which\nsaid use is similar shall apply. In the case of mixed uses, the requirements\nshall be the sum of the various uses computed separately, and off-street\nparking for one such use shall not be considered as providing required\nspaces for any other use, except as otherwise specified hereinbelow."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Nothing in this section shall be construed to prevent collective provision of off-street parking facilities for two or more buildings or uses, subject to § 205-18, provided that the total spaces shall be not less than the sum of the requirements for the separate uses in accordance with the schedule, except that when the Board of Appeals finds that two uses are occupied or used at different times of the day or week, it may approve the number of spaces prescribed for the use with the greatest requirements."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "Location of parking spaces. The off-street parking\nspace required for single-family dwellings may be located in a private\ndriveway or garage. In all districts, the off-street parking facilities\nrequired for the uses specified in this section, and for other similar\nuses, shall be on the same lot or parcel of land as the building or\nuse they are intended to serve."
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "Design and layout."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "The design and layout of any off-street parking facility, except for single-family detached dwellings, shall be approved pursuant to § 205-18 prior to issuance of a permit."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "All off-street parking facilities required by this\nsection shall be paved, marked, drained, lighted and maintained by\nthe owner or lessee in accordance with specifications of the Village,\nand such facilities shall be arranged for convenient access and safety\nof pedestrians and vehicles. In the interest of safety, such facilities\nshall have adequate means of access to and egress from a street."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "The paved surface of a parking area shall not extend\nnearer than 20 feet to any property line. Whenever a parking area\nfor a nonresidential use abuts on or is opposite a residential property,\nthe Board of Appeals may require the applicant to install and maintain\nfencing and/or screen planting of a character and in such location\nas it may deem adequate to screen the parking area from residential\nproperty. In such locations, any lighting installations shall be arranged\nso as to avoid the reflection and glare of such lighting onto the\nabutting or neighboring residential property."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "F. ",
							"content": [
								{
									"text": "Permanence of facilities. No required open space in\nan off-street parking facility shall be encroached upon by buildings,\nstorage or any other use, nor shall the required number of parking\nspaces be reduced, except upon formal approval of the Board of Appeals\nand then only after proof that, by reason of diminution in floor area,\nseating capacity or change in other requirements, the proposed reduction\nis reasonable and consistent with public convenience and safety."
								}
							]
						},
						{
							"number": "G. ",
							"content": [
								{
									"text": "Off-street loading. For any building or premises used\nfor institutional or similar purposes, the Board of Appeals shall\ndetermine the requirements, if any, in addition to off-street parking,\nfor areas needed to accommodate off-street loading of goods and materials.\nWhenever, in the opinion of the Board, separate off-street loading\nspace is required for safety and convenience, it may specify the number,\nlocation and size of berths and accessways thereto to be installed\nand maintained on the premises."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 205-17",
			"title": "Fences, walls and visibility.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Building permit, height measurement and location."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "A building permit shall be required for all fences,\ngates, gateposts, entry piers and walls the height of which shall\nbe measured from the natural ground level at the base of the structure."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "The provisions of this chapter shall not be deemed\nto prohibit any necessary retaining wall nor to prohibit a fence,\ngate, gatepost, entry pier, wall or structure in the nature of a fence\n(except enclosures for animals) in a required yard."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Fences and walls on historic roads, any fence, wall, gate, gatepost or entry pier constructed on a lot which is adjacent to a historic road of the Village (Chicken Valley Road, Mill River Road, Oyster Bay - Glen Cove Road, Piping Rock Road, Planting Fields Road, Remsen's Lane, Ripley Lane, Wheatley Road, and Wolver Hollow Road) designated in § 177-6 of this Code shall be subject to the following requirements:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "No fence or wall on or within 10 feet of a lot line\nthat is entirely contiguous to a historic road or on or within 10\nfeet of that portion an interior side line of a lot between the building\nline of the principal dwelling on the lot and any historic road shall\nexceed four feet in height."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "The height of a gate, gatepost or entry pier shall\nnot exceed six feet."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "No decorative lantern or finial for a gatepost or\nentry pier shall exceed 12 inches in height measured the top of the\ngate, gatepost or entry pier, but in no event shall the total height\nof the gate, gatepost or entry pier, including the decorative lantern\nor finial, exceed the height of six feet six inches."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "Only traditional-style fence-like structures in keeping\nwith the historical country-like ambience, atmosphere and appearance\nof the neighborhood shall be permitted. Traditional fence-like structures\nshall include, but shall not be limited to: post and rail fences,\nstockade fences, three- to four-rail board fence, wrought-iron fences,\npicket fences, stucco walls, fieldstone walls, and similar-styled\nstructures. A traditional style fence-like structure shall be colored\nwhite, black or a subdued natural-like color and have no shiny or\nreflective surface."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Fences and walls on nonhistoric roads."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "No fence or wall shall exceed six feet six inches\nin height."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "No gate, gatepost or entry pier shall exceed a height\nof seven feet."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "No decorative lantern or finial for a gate, gatepost\nor entry pier shall exceed 18 inches in height measured from the top\nof the gate, gatepost or entry pier, but in no event shall the total\nheight of the gate, gatepost or entry pier, including the decorative\nlantern or finial, exceed seven feet six inches."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "Visibility at intersection. On a corner lot, no fence,\nwall, hedge or other structure or planting more than two feet six\ninches in height, measured from the curb or ground level along the\nproperty line, whichever is higher, shall be erected, planted or maintained\nwithin the triangular area formed by the intersecting street right-of-way\nlines and a straight line joining said right-of-way street lines at\npoints 30 feet distant from the point of intersection. Nothing herein\ncontained shall apply to existing or native trees, provided that no\nbranches are nearer than six feet to the ground."
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "Design of fences and walls. The design, color, texture\nand proportion of any fence, gate, gatepost, entry pier or wall shall\nbe approved by the Architectural/Site Plan Commissioner prior to the\nissuance of a building permit for and the construction of such structure."
								}
							]
						}
					]
				}
			]
		}
	]
}