{
	"url": "http://ecode360.com/29712367",
	"paras": [
		{
			"paragraph": "§ 301-27",
			"title": "Purpose and intent.",
			"content": [
				{
					"text": "The intent of the Residence B-80 (RB80) Zoning Use District\nis to allow for low-density single-family residential development\nand encourage protection of prime agricultural soils where appropriate."
				}
			]
		},
		{
			"paragraph": "§ 301-28",
			"title": "Uses.",
			"content": [
				{
					"text": "In the RB80 Zoning Use District, no building, structure or premises\nshall be used or arranged or designed to be used, and no building\nor structure shall be hereafter erected, reconstructed or altered,\nunless otherwise provided in this chapter, except for the following\npermitted uses or specially permitted uses and their customary accessory\nuses:"
				},
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Permitted uses:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Agricultural production, including but not limited to the following:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "Field crops, including corn, wheat, oats, rye, barley, hay,\npotatoes, and dry beans."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "Fruits, including apples, peaches, grapes, cherries and berries."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "Vegetables, including tomatoes, snap beans, cabbage, carrots,\nbeets and onions."
																}
															]
														},
														{
															"number": "(d) ",
															"content": [
																{
																	"text": "Horticultural specialties, including nursery stock, ornamental\nshrubs, ornamental trees and flowers."
																}
															]
														},
														{
															"number": "(e) ",
															"content": [
																{
																	"text": "Livestock and livestock products, including cattle, sheep, hogs,\ngoats, horses, poultry, farmed deer, farmed buffalo, fur-bearing animals,\nmilk, eggs and furs."
																}
															]
														},
														{
															"number": "(f) ",
															"content": [
																{
																	"text": "Christmas trees grown in a managed Christmas tree operation,\nwhether dug for transplanting or cut from the stump."
																}
															]
														},
														{
															"number": "(g) ",
															"content": [
																{
																	"text": "Commercial horse-boarding operations."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Dwelling, one-family."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Attached single-family dwelling units within a cluster subdivision.[Amended 7-19-2005 by L.L. No. 32-2005]"
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "Riding academy, corral or facilities for the training of horses,\nincluding but not limited to private polo chukkers."
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "Greenhouse, provided that the subject parcel is a minimum of five\nacres. A permanent greenhouse to be used for retail sales shall be\nsubject to site plan review and approval.[Amended 9-6-2006 by L.L. No. 36-2006]"
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Specially permitted uses, by special permit of the Town Board:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Bed-and-breakfast."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Overhead electrical power transmission and distribution lines in\nexcess of 13 kilovolts."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Educational institution without boarding facilities or dormitories,\nprivate."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "Day-care facility conducted in a residence."
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "Golf course (standard), with or without clubhouse."
												}
											]
										},
										{
											"number": "(6) ",
											"content": [
												{
													"text": "An accessory dwelling unit with a maximum living area of 1,000 square\nfeet on a lot of 10 acres or more, provided that the total number\nof dwelling units yielded by the original subdivision creating such\nlot is not exceeded."
												}
											]
										},
										{
											"number": "(7) ",
											"content": [
												{
													"text": "Professional offices of attorneys, architects, medical doctors, or\ndentists, provided that the subject real property conforms to the\nfollowing conditions:[Added 1-21-2009 by L.L. No. 6-2009]"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "The property is improved with a single-family residence at the time of the adoption of this Subsection B(7)."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "The professional office use shall be within the building footprint\nof the existing single-family residence."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "The property has frontage along New York State Route 25 between\nRoute 105 and the Town boundary with the Town of Southold."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(8) ",
											"content": [
												{
													"text": "Home occupations or professions conducted within an accessory building\nby the residents thereof.[Added 6-2-2010 by L.L. No. 13-2010]"
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Accessory uses. Accessory uses shall include those uses customarily\nincidental to any of the above permitted uses or specially permitted\nuses when located on the same lot. Specifically permitted are the\nfollowing:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Home occupations or professions conducted within the dwelling by\nthe residents thereof.[Amended 6-2-2010 by L.L. No. 13-2010]"
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "The sale at retail of homegrown or homemade products, provided that all retail uses shall be subject to site plan approval pursuant to Article LVI, Site Plan Review, and the other provisions of this chapter. The farmer may sell supporting farm products and farm products not grown by the farmer, provided that the area devoted to the sale of said products at no time exceeds 40% of the total merchandising area."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Agricultural worker housing pursuant to the requirements of § 301-239.[Added 3-15-2005 by L.L. No. 5-2005]"
												}
											]
										}
									]
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 301-29",
			"title": "Accessory buildings and structures.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Location."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "No accessory building or structure shall be erected, reconstructed\nor altered so as to be situate as follows:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "In a front yard."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "In a side yard, unless the accessory building is 60 feet from\na side street line, 25 feet from a property line and 10 feet from\nany other building."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "In a rear yard, unless the accessory building is 20 feet from\na property line, 10 feet from any other building and 60 feet from\na side street line and rear street line."
																}
															]
														},
														{
															"number": "(d) ",
															"content": [
																{
																	"text": "One accessory building with a maximum floor area of 144 square feet or less, a maximum height of 12 feet or less, located in the rear yard, shall be excepted from the provisions of Subsection A(1)(c) and additionally shall not require a permit. It shall be permitted five feet from a property line, 10 feet from any other building and 60 feet from a side street line and rear street line.[Amended 7-19-2011 by L.L. No. 21-2011]"
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Excepted from Subsection A(1)(a), (b) and (c) of this section are fences not exceeding four feet in height which may be erected on the lot lines of the front yard or any existing street line of a one-family dwelling, and fences not exceeding six feet in height which may be erected on other lot lines of a one-family dwelling. Fences on a corner lot must comply with § 301-245. On lots used for other than one-family dwellings, wire strand or open woven wire fences up to six feet in height may be erected on all lot lines. If such fence is erected along any street, the permitted height thereof shall be measured from the existing elevation of the center line of such street."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Where an accessory building is constructed as a building subordinate\nto the use of a park or playground, the building shall be erected,\nreconstructed or altered in conformity to the requirements hereof\nfor a main building."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 301-30",
			"title": "Living area.",
			"content": [
				{
					"text": "No dwelling shall be erected unless provisions shall be made\ntherein as follows:"
				},
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "For a single-family dwelling, exclusive of attached garages, carports,\nunenclosed porches and breezeways, there shall be provided not less\nthan 1,500 square feet of living area for the first story."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 301-31",
			"title": "Lot, yard, bulk and height requirements.",
			"content": [
				{
					"text": "No buildings shall be erected nor any lot or land area utilized\nunless in conformity with the Zoning Schedule[1] incorporated into this article by reference and made a\npart hereof with the same force and effect as if such requirements\nwere herein set forth in full as specified in said schedule, except\nas may be hereafter specifically modified."
				},
				{
                	"content": [
                		{
                			"number": "A. ",
                			"content": [
                				{
                					"text": "Minimum Lot Area (square feet): 80,000"
                				}
                			]
                		},
                		{
                			"number": "B. ",
                			"content": [
                				{
                					"text": "Minimum Lot Width (feet): 175"
                				}
                			]
                		},
                		{
                			"number": "C. ",
                			"content": [
                				{
                					"text": "Maximum Impervious Surface (%): 15"
                				}
                			]
                		},
                		{
                			"number": "D. ",
                			"content": [
                				{
                					"text": "Maximum Height of Residential Buildings (feet): 35"
                				}
                			]
                		},
                		{
                			"number": "E. ",
                			"content": [
                				{
                					"text": "Minimum Front Yard Depth (feet): 60"
                				}
                			]
                		},
                		{
                			"number": "F. ",
                			"content": [
                				{
                					"text": "Minimum Either Side Yard Width (feet): 30"
                				}
                			]
                		},
                		{
                			"number": "G. ",
                			"content": [
                				{
                					"text": "Minimum Both Side Yards, Total Width (feet): 65"
                				}
                			]
                		},
                		{
                			"number": "H. ",
                			"content": [
                				{
                					"text": "Minimum Side Yard Abutting Side Street (feet): 60"
                				}
                			]
                		},
                		{
                			"number": "I. ",
                			"content": [
                				{
                					"text": "Minimum Rear Yard Depth (feet): 75"
                				}
                			]
                		}
                	]
                }
			]
		},
		{
			"paragraph": "§ 301-32",
			"title": "Cluster development and additional subdivision requirements.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Purpose and intent. It is the purpose of this article to require\ncluster development pursuant to § 278 of the Town Law in\norder to allow for maximum flexibility in achieving a compatible arrangement\nof agricultural and residential land uses and to protect prime agricultural\nsoils, scenic vistas, and significant natural features."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "In order to accomplish the clustering of residential lots within\nthe RB80 Zoning Use District, an applicant for subdivision shall provide\na standard yield plan and a cluster plat which succeeds in preserving\nagricultural land for agricultural use to the greatest extent practicable.\nIn its review of a cluster subdivision plat, the Planning Board shall\nconsider the following:[1]"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "The location and extent of prime agricultural soils;"
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "The location of wooded areas;"
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "The location and extent of natural features;"
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "The general topography and the location and extent of sloped areas;"
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "The spatial relationship of the property to contiguous or neighboring\npreserved agricultural land;"
												}
											]
										},
										{
											"number": "(6) ",
											"content": [
												{
													"text": "The general stormwater tributary area and the extent and direction\nof overland drainage."
												}
											]
										}
									]
								},
								{
									"footnote": "[1]\nEditor's Note: Amended at time of adoption of Code (see Ch. 101, General Provisions, Art. I).\n"
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Cluster development in this article shall require that a minimum\nof 70% of Class I or Class II prime agricultural soils are preserved\nthrough the creation of farm lots or preservation of 70% of land as\nopen space, recording of agricultural or open space easements which\nrestrict division of said lot(s), coverage and such other items as\nthe Planning Board deems appropriate to preserve the agriculture and\nscenic vistas created by the farm lot or open space area."
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "The Planning Board may approve a cluster subdivision with a reduced\npercentage of preserved prime agricultural soils or open space based\nupon unique characteristics of land such that public utilities, streets,\narrangement of lots or existence of natural features require development\nwith less than 70% preservation of prime agriculture soils or open\nspace. In the event that the Planning Board approves a cluster subdivision\nthat preserves less than 70% of prime agricultural soils or open space,\nthe Planning Board must set forth all considerations, practical difficulties,\nand/or reasons supporting a decision to approve the cluster plat within\nthe resolution approving the preliminary plat. In no event may the\nPlanning Board approve a cluster subdivision plat with less than 50%\nof the area of the tract being preserved as prime soils or open spaces\narea."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 301-33",
			"title": "Guidelines for cluster development.",
			"content": [
				{
					"text": "The Planning Board shall apply the following guidelines in addition to Article LIII, Subdivision Regulations, and Article LIV, Cluster Development, of this chapter, for all cluster subdivisions:"
				},
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "The cluster subdivision plat shall be designated so as to situate\nthe agricultural lots or open space along an existing highway or roadway\nor adjacent to existing agricultural lots or preserved land or such\nother location such that maximum preservation of agricultural and\nscenic vistas are achieved."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "The cluster subdivision plat must depict an arrangement of residential\nlots so as to reduce, to the maximum extent practicable, any nuisance\nor conflict between residential and agricultural uses, both within\nthe tract and in relation to adjoining and nearby tracts, and to demonstrate\ncompatibility of the cluster plat with existing residential development\nand agricultural land uses."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "The residential portion of the cluster subdivision plat must be so laid out, and protected during construction, as to remain as harmonious to the greatest extent practicable with the natural environment minimizing the clearing of treed areas, the grading of earth, removal of soils, and precluding the disturbance of surface waters and wetlands and other similar disturbances of the natural environment pursuant to Chapter 295, Wetlands, of the Riverhead Town Code."
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "The agricultural lot shall be laid out so as to provide for one building\narea, and said building area shall be counted towards yield. The Planning\nBoard shall describe the square footage of the building area, and\nthe Planning Board may, in its discretion, require that the building\narea be plotted on the subdivision map. The Planning Board shall require\ncovenants and restrictions to enforce dimensional requirements, lot\ncoverage, impervious surface limits, retention or plan for all stormwater\nrunoff for both the residential and agricultural components of the\nsubject property as set forth in the Town Code, and such other items\nthe Planning Board deems appropriate to conform with the intent of\nthe cluster regulations, including, but not limited to, location and\nlimitation of parking, outdoor storage, clearing limits, and means\nof ingress and egress. The Planning Board shall require covenants\nand restrictions to be filed affecting the aforestated prior to issuance\nof final plat approval."
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "The agricultural lot must be laid out so as to provide a minimum\nlot size of 10 acres. An agricultural lot with a lot size greater\nthan 20 acres shall only be divided if required to ensure appropriate\narrangement of lots, streets and public utilities or preserve or highlight\nexistence of natural features. An agricultural lot shall prohibit\nerection, construction, or placement of any structures, permanent\nor temporary, without prior approval of the Planning Board."
								}
							]
						},
						{
							"number": "F. ",
							"content": [
								{
									"text": "The Planning Board shall not cluster lots in order to create golf\ncourses, playgrounds, tennis courts, swimming pools or any other amenity\nas required open space. The sole purpose of the cluster plat is to\npreserve agricultural land for agricultural use and other natural\nfeatures and open space to the greatest extent practicable.[1]"
								},
								{
									"footnote": "[1]\nEditor's Note: Amended at time of adoption of Code (see Ch. 101, General Provisions, Art. I).\n"
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 301-34",
			"title": "Nonconforming lots.",
			"content": [
				{
					"text": "With the exception of lots improved prior to the enactment of zoning within the Town of Riverhead, a lot held in single and separate ownership and having legal improvements upon it at the effective date of this article shall not be considered nonconforming pursuant to § 301-222 as to lot area and setback requirements. Such improved properties shall be entitled to maintain the existing lot areas and setbacks that were required at the time the structures were issued certificates of occupancy. To preclude an unintended merger of nonconforming lots due to the zoning changes adopted herein, a twelve-month grace period commencing with the effective date of this article shall be imposed to provide those whose lots would merge by operation of law the opportunity to checkerboard the ownership of their lots to preclude the merger."
				}
			]
		}
	]
}