{
	"url": "http://ecode360.com/29712367",
	"paras": [
		{
			"paragraph": "§ 301-43",
			"title": "Purpose.",
			"content": [
				{
					"text": "It is the purpose of this article to implement the recommendations of the Comprehensive Plan to permit the construction of high-density living accommodations with suitable facilities and services that are sufficiently adequate to provide seniors and disabled older individuals with comfortable and safe home-like housing in a congregate setting while providing a continuum of care that allows seniors and older individuals to age in place, and to further provide services that encourage personal independence and enhance the quality of life. In addition, it is the intent of the Town Board to provide a diversity of housing types to be located in close proximity to shopping, medical offices, public services and public transportation. Particular development applications made pursuant to this zoning use district will require the transfer of development rights pursuant to Article XLII, Transfer of Development Rights, of this chapter.[1]"
				},
				{
					"footnote": "[1]\nEditor's Note: Original § 108-117 of the 1976 Code, Definitions, which immediately followed this section, was repealed at time of adoption of Code (see Ch. 101, General Provisions, Art. I). See now § 301-3, Definitions; word usage.\n"
				}
			]
		},
		{
			"paragraph": "§ 301-44",
			"title": "Uses.",
			"content": [
				{
					"text": "In the Residence RC District (Retirement Community), no building,\nstructure or premises shall be used or arranged or designed to be\nused and no building shall be hereafter erected, reconstructed or\naltered or occupied, unless otherwise provided in this chapter for\nthe following specially permitted uses:"
				},
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "One-family dwelling units, either attached or detached, designed\nto provide living accommodations for persons 55 years of age or older."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Independent congregate-living residences."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Assisted-living retirement community."
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "Continuing-care retirement community."
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "Accessory uses. Accessory uses shall include structures, buildings\nor improvements which are located on the same lot as the principal\nuse and are customarily incidental to the principal use and designed\nfor the sole use of the residents of the community or their guests."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 301-45",
			"title": "Lot, yard, dimensional, yield and height requirements.",
			"content": [
				{
					"text": "No building shall be erected nor any lot or land area utilized\nunless in conformity with the Zoning Schedule[1] incorporated into this chapter by reference and made a\npart hereof with the same force and effect as if such requirements\nwere herein set forth in full as specified in said schedule, except\nas may be hereafter specifically modified."
				},
				{
                	"content": [
                		{
                			"number": "A. ",
                			"content": [
                				{
                					"text": "Minimum Lot Area (square feet): 653,400"
                				}
                			]
                		},
                		{
                			"number": "B. ",
                			"content": [
                				{
                					"text": "Minimum Lot Width (feet): 150"
                				}
                			]
                		},
                		{
                			"number": "C. ",
                			"content": [
                				{
                					"text": "Maximum Impervious Surface (%): 15"
                				}
                			]
                		},
                		{
                			"number": "D. ",
                			"content": [
                				{
                					"text": "Maximum Height of Residential Buildings (feet): 35"
                				}
                			]
                		},
                		{
                			"number": "E. ",
                			"content": [
                				{
                					"text": "Minimum Front Yard Depth (feet): 25"
                				}
                			]
                		},
                		{
                			"number": "F. ",
                			"content": [
                				{
                					"text": "Minimum Either Side Yard Width (feet): 10"
                				}
                			]
                		},
                		{
                			"number": "G. ",
                			"content": [
                				{
                					"text": "Minimum Both Side Yards, Total Width (feet): 25"
                				}
                			]
                		},
                		{
                			"number": "H. ",
                			"content": [
                				{
                					"text": "Minimum Side Yard Abutting Side Street (feet): 25"
                				}
                			]
                		},
                		{
                			"number": "I. ",
                			"content": [
                				{
                					"text": "Minimum Rear Yard Depth (feet): 40"
                				}
                			]
                		}
                	]
                },
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "The as-of-right development yield for one-family dwelling units, either attached or detached, for persons 55 years of age or older as provided under § 301-44A shall not exceed one dwelling unit per 40,000 square feet of land area without the use of transferred development rights pursuant to Article XLII, Transfer of Development Rights, of this chapter."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "There shall be dimensional requirements for all residential units\nwithin the Residence RC Zoning Use District, to wit:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Independent dwelling units within a continuing-care retirement community\nshall not exceed 1,200 square feet and shall not be less than 600\nsquare feet."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "All other units within either an assisted-living retirement community\nor a continuing-care retirement community shall not exceed 1,050 square\nfeet and shall not be less than 350 square feet."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "There shall be a maximum of two bedrooms for all residential units\nwithin either an assisted-living retirement community or a continuing-care\nretirement community."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "The development yield for all residential units within either an\naffordable assisted-living retirement community or an affordable continuing-care\nretirement community shall be as follows:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Independent living units shall not exceed four dwelling units per\n40,000 square feet of real property."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Assisted-living units shall not exceed eight units per 40,000 square\nfeet of real property."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "The development yield for all residential units within either a conventional\nassisted-living retirement community or a conventional continuing-care\nfacility shall be as follows:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Independent living units shall not exceed two dwelling units per\n40,000 square feet of real property. Independent living units shall\nnot exceed four dwelling units per acre with the redemption of development\nrights, at a rate of one additional unit per development right."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Assisted-living units shall not exceed four dwelling units per 40,000\nsquare feet of real property. Assisted-living units shall not exceed\neight dwelling units per acre with the redemption of development rights,\nat a rate of one additional unit per development right."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "The lot area shall not be less than 15 acres of contiguous real property\nin single or consolidated ownership. The contemplated development\nshall not be subdivideable. Multiple lots shall be consolidated prior\nto the approval of the relevant special permit."
								}
							]
						}
					]
				},
				{
					"footnote": "[1]\nEditor's Note: The Zoning Schedule is included as an attachment\nto this chapter.\n"
				}
			]
		},
		{
			"paragraph": "§ 301-46",
			"title": "Additional requirements.",
			"content": [
				{
					"text": "The site plan shall show, in addition to all other requirements\nof this chapter, the following:"
				},
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "All lots shall be located within the Town of Riverhead Water District\nand Sewer District or be located within 1,500 feet of the Water District\nand Sewer District and subject to approval for the requisite capacity\nfor the proposed development. The applicant shall be responsible for\nall costs related to application for Water and/or Sewer District extension\nand costs related to extension of the appurtenances to include the\nparcel in the water and sewer districts."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "The method of water supply and of sewage disposal, conforming to\nHealth Department requirements."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "At least 30% of the total site area shall be devoted to open space\nwhich shall be kept in its natural state or landscaped and maintained\nwith grass for passive recreational uses such as picnic areas, walking\ntrails, gardening and horticultural."
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "The use of interconnecting walkways, trails and natural walking paths\nfor pedestrian traffic shall be an integral part of the design of\nany development to facilitate access between common areas, groups\nof dwelling units and open space areas."
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "All primary walkways and sidewalks shall meet Americans with Disabilities\nAct (ADA) requirements. Trails and natural walking paths are exempt\nfrom this requirement; however, the Town encourages maximizing accessibility\nto all residents. Due consideration shall be given to planning walks,\nramps, and driveways to prevent slipping, stumbling, and handrails\nand ample places for rest shall be strategically provided."
								}
							]
						},
						{
							"number": "F. ",
							"content": [
								{
									"text": "A buffer strip of not less than 10 feet in width consisting of massed\ntrees and shrubbery or existing mature vegetation supplemented by\nnew landscaping shall be maintained alongside front and rear property\nlines, except the buffer area shall be 25 feet in width along any\nlot line abutting a residential district or use. The trees and shrubbery\nshall consist of evergreens and deciduous plant material which, when\nplanted, shall be at least six feet tall and when mature shall be\nmaintained at a height of not less than eight feet, so as to provide\nan effective natural screen. No structure shall be permitted within\nthis strip or buffer."
								}
							]
						},
						{
							"number": "G. ",
							"content": [
								{
									"text": "All utilities shall be placed underground, including telephone, electric\nand cable telephone service."
								}
							]
						},
						{
							"number": "H. ",
							"content": [
								{
									"text": "All parking shall comply with the Parking Schedule set forth in § 301-231 of this chapter, notwithstanding the following:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "No parking shall be provided within 25 linear feet of the principal\nfrontage."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Parking and loading areas shall be placed as far from adjacent residences\nas possible (but a minimum of 50 linear feet) and surrounded by landscaping."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "I. ",
							"content": [
								{
									"text": "The proposed method of collection and disposal of stormwater, designed\nso as not to interfere with adjoining properties or burden public\nfacilities."
								}
							]
						},
						{
							"number": "J. ",
							"content": [
								{
									"text": "The proposed lighting facilities for the safety of pedestrian and\nvehicular traffic, with exterior spotlighting of buildings or grounds\nto be from shaded sources and located so that the light beams are\nnot directed toward any lot in a residential district or toward a\npublic highway."
								}
							]
						},
						{
							"number": "K. ",
							"content": [
								{
									"text": "The provisions of this section (§ 301-46) which were added by Local Law No. 9-2012, adopted on June 19, 2012, are intended to and shall take effect for those parcels designated or mapped as Retirement Community after the effective date of Local Law No. 9-2012. Parcels that were mapped as Retirement Community prior to June 19, 2012, shall be subject to the additional requirements of § 301-46 in effect prior to June 19, 2012.[Added 3-1-2016 by L.L.\nNo. 8-2016]"
								}
							]
						}
					]
				}
			]
		}
	]
}