{
	"url": "http://ecode360.com/29712367",
	"paras": [
		{
			"paragraph": "§ 301-47",
			"title": "Purpose and intent.",
			"content": [
				{
					"text": "The intent of the Hamlet Residential (HR) Zoning Use District\nis to allow for low-density single-family residential development\nand medium-density single-family residential development with transferred\ndevelopment rights."
				}
			]
		},
		{
			"paragraph": "§ 301-48",
			"title": "Uses.",
			"content": [
				{
					"text": "In the HR Zoning Use District, no building, structure or premises\nshall be used or arranged or designed to be used, and no building\nor structure shall be hereafter erected, reconstructed or altered,\nunless otherwise provided in this chapter, except for the following\npermitted uses or specially permitted uses and their customary accessory\nuses:"
				},
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Permitted uses:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Dwelling, one-family."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Parks and playgrounds, noncommercial."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Attached single-family dwelling units."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "Agricultural production, including but not limited to the following:[Added 8-7-2007 by L.L. No. 23-2007]"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "Field crops, including corn, wheat, oats, rye, barley, hay,\npotatoes and dry beans."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "Fruits, including apples, peaches, grapes, cherries and berries."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "Vegetables, including tomatoes, snap beans, cabbage, carrots,\nbeets and onions."
																}
															]
														},
														{
															"number": "(d) ",
															"content": [
																{
																	"text": "Horticultural specialties, including nursery stock, ornamental\nshrubs, ornamental trees and flowers."
																}
															]
														},
														{
															"number": "(e) ",
															"content": [
																{
																	"text": "Livestock and livestock products, including cattle, sheep, hogs,\ngoats, horses, poultry, farmed deer, farmed buffalo, fur-bearing animals,\nmilk, eggs and furs."
																}
															]
														},
														{
															"number": "(f) ",
															"content": [
																{
																	"text": "Christmas trees grown in a managed Christmas tree operation,\nwhether dug for transplanting or cut from the stump."
																}
															]
														},
														{
															"number": "(g) ",
															"content": [
																{
																	"text": "Commercial horse-boarding operations."
																}
															]
														}
													]
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Specially permitted uses, by special permit of the Town Board:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Bed-and-breakfast."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Day-care facility conducted in a residence."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Overhead electrical power transmission and distribution lines in\nexcess of 13 kilovolts."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "Nursery school when conducted in a residence."
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "Home occupations or professions conducted within an accessory building\nby the residents thereof.[Added 6-2-2010 by L.L. No. 13-2010]"
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Accessory uses. Accessory uses shall include those uses customarily\nincidental to any of the above permitted uses when located on the\nsame lot. Specifically permitted are the following:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Home occupations or professions conducted within the dwelling by\nthe residents thereof.[Amended 6-2-2010 by L.L. No. 13-2010]"
												}
											]
										}
									]
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 301-49",
			"title": "Accessory buildings and structures.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Location."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "No accessory building or structure shall be erected, reconstructed\nor altered so as to be situate as follows:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "In a front yard."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "In a side yard, unless the accessory building is 60 feet from\na side street line, 25 feet from a property line and 10 feet from\nany other building."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "In a rear yard, unless the accessory building is 20 feet from\na property line, 10 feet from any other building and 60 feet from\na side street line and rear street line."
																}
															]
														},
														{
															"number": "(d) ",
															"content": [
																{
																	"text": "One accessory building with a maximum floor area of 144 square feet or less, a maximum height of 12 feet or less, located in the rear yard, shall be excepted from the provisions of Subsection A(1)(c) and additionally shall not require a permit. It shall be permitted five feet from a property line, 10 feet from any other building and 60 feet from a side street line and rear street line.[Amended 7-19-2011 by L.L. No. 21-2011]"
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Excepted from Subsection A(1)(a), (b) and (c) of this section are fences not exceeding four feet in height which may be erected on the lot lines of the front yard or any existing street line of a one-family dwelling, and fences not exceeding six feet in height which may be erected on other lot lines of a one-family dwelling. Fences on a corner lot must comply with § 301-245. On lots used for other than one-family dwellings, wire strand or open woven wire fences up to six feet in height may be erected on all lot lines. If such fence is erected along any street, the permitted height thereof shall be measured from the existing elevation of the center line of such street."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Where an accessory building is constructed as a building subordinate\nto the use of a park or playground, the building shall be erected,\nreconstructed or altered in conformity to the requirements hereof\nfor a main building."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 301-50",
			"title": "Living area.",
			"content": [
				{
					"text": "No dwelling shall be erected unless provisions shall be made\ntherein as follows:"
				},
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "For a single-family dwelling, exclusive of attached garages, carports,\nunenclosed porches and breezeways, there shall be provided not less\nthan 1,500 square feet of living area for the first story."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 301-51",
			"title": "Lot, yard, bulk and height requirements.",
			"content": [
				{
					"text": "No buildings shall be erected nor any lot or land area utilized\nunless in conformity with the Zoning Schedule[1] incorporated into this article by reference and made a\npart hereof with the same force and effect as if such requirements\nwere herein set forth in full as specified in said schedule, except\nas may be hereafter specifically modified."
				},
				{
                	"content": [
                		{
                			"number": "A. ",
                			"content": [
                				{
                					"text": "Minimum Lot Area (square feet): 80,000"
                				}
                			]
                		},
                		{
                			"number": "B. ",
                			"content": [
                				{
                					"text": "Minimum Lot Width (feet): 175"
                				}
                			]
                		},
                		{
                			"number": "C. ",
                			"content": [
                				{
                					"text": "Maximum Impervious Surface (%): 15"
                				}
                			]
                		},
                		{
                			"number": "D. ",
                			"content": [
                				{
                					"text": "Maximum Height of Residential Buildings (feet): 35"
                				}
                			]
                		},
                		{
                			"number": "E. ",
                			"content": [
                				{
                					"text": "Minimum Front Yard Depth (feet): 60"
                				}
                			]
                		},
                		{
                			"number": "F. ",
                			"content": [
                				{
                					"text": "Minimum Either Side Yard Width (feet): 30"
                				}
                			]
                		},
                		{
                			"number": "G. ",
                			"content": [
                				{
                					"text": "Minimum Both Side Yards, Total Width (feet): 65"
                				}
                			]
                		},
                		{
                			"number": "H. ",
                			"content": [
                				{
                					"text": "Minimum Side Yard Abutting Side Street (feet): 60"
                				}
                			]
                		},
                		{
                			"number": "I. ",
                			"content": [
                				{
                					"text": "Minimum Rear Yard Depth (feet): 75"
                				}
                			]
                		}
                	]
                }
			]
		},
		{
			"paragraph": "§ 301-52",
			"title": "Cluster development and additional subdivision requirements.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Purpose and intent. It is the purpose of this article to encourage\ncluster development pursuant to § 278 of the Town Law in\norder to allow for maximum flexibility in achieving a compatible arrangement\nof residential lots and environmentally sensitive lands."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "In order to accomplish the clustering of residential lots within\nthe HR Zoning Use District, an applicant for subdivision shall provide\na standard yield plan and a cluster plat, which succeeds in preserving\nnatural features and the community character of a traditional residential\nneighborhood to the greatest extent practicable. In its review of\na cluster subdivision plat, the Planning Board shall consider the\nfollowing:[1]"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "The location of wooded areas;"
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "The location and extent of natural features;"
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "The general topography and the location and extent of sloped areas;"
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "The spatial relationship of the property to contiguous or neighboring\npreserved agricultural land;"
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "The general stormwater tributary area and the extent and direction\nof overland drainage."
												}
											]
										}
									]
								},
								{
									"footnote": "[1]\nEditor's Note: Amended at time of adoption of Code (see Ch. 101, General Provisions, Art. I).\n"
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 301-53",
			"title": "Guidelines for cluster development.",
			"content": [
				{
					"text": "The residential portion of the cluster subdivision plat must be so laid out, and protected during construction, as to remain as harmonious to the greatest extent practicable with the natural environment minimizing the clearing of treed areas, the grading of earth, removal of soils, and precluding the disturbance of surface waters and wetlands and other similar disturbances of the natural environment pursuant to Chapter 295, Wetlands, of the Riverhead Town Code."
				}
			]
		},
		{
			"paragraph": "§ 301-54",
			"title": "Nonconforming lots.",
			"content": [
				{
					"text": "With the exception of lots improved prior to the enactment of zoning within the Town of Riverhead, a lot held in single and separate ownership and having legal improvements upon it at the effective date of this article shall not be considered nonconforming pursuant to § 301-222 as to lot area and setback requirements. Such improved properties shall be entitled to maintain the existing lot areas and setbacks that were required at the time the structures were issued certificates of occupancy. To preclude an unintended merger of nonconforming lots due to the zoning changes adopted herein, a twelve-month grace period commencing with the effective date of this article shall be imposed to provide those whose lots would merge by operation of law the opportunity to checkerboard the ownership of their lots to preclude the merger."
				}
			]
		}
	]
}