{
	"url": "http://ecode360.com/14671659",
	"paras": [
		{
			"paragraph": "§ 300-4.1",
			"title": "Intent.",
			"content": [
				{
					"text": "The R-20 One-Family Residence District is to be the principal\nresidence district in the Village. As a result of the Village's\nlong development history, it is anticipated that there may be some\nnonconforming residence and nonresidence uses. No new such uses shall\nbe established, and every effort shall be exercised to contain those\nnonconforming buildings and uses that now exist."
				}
			]
		},
		{
			"paragraph": "§ 300-4.2",
			"title": "Permitted and special exception uses.",
			"content": [
				{
					"text": "Within the R-20 One-Family Residence District, any building,\nstructure, lot or land shall be utilized only in accordance with the\nTable of Uses.[1]"
				},
				{
					"footnote": "[1]\nEditor's Note: The Table of Uses is included as an attachment\nto this chapter.\n"
				}
			]
		},
		{
			"paragraph": "§ 300-4.3",
			"title": "Dimensional regulations.",
			"content": [
				{
					"text": "Dimensional regulations within the R-20 District any building,\nstructure, lot or land shall be utilized only in accordance with the\nTable of Dimensional Regulations.[1]"
				},
				{
					"text": "Lot area minimum(square feet): 20,000"
				},
				{
					"text": "Lot coverage total: 25%"
				},
				{
					"text": "Minimum lot width (feet): 100"
				},
				{
					"text": "Maximum height (stories/feet) 2/35"
				},
				{
					"text": "Yards, principal building,minimum (feet) Front yard: 35"
				},
				{
					"text": "Yards, principal building,minimum (feet) Side yard: 15"
				},
				{
					"text": "Yards, principal building,minimum (feet) Total side yards: 30"
				},
				{
					"text": "Yards, principal building,minimum (feet) Rear yard: 30"
				},
				{
					"text": "Minimum dimensions at accessory buildings and structures(feet) Distance from front lot line: 35"
				},
				{
					"text": "Minimum dimensions at accessory buildings and structures(feet) Distance from rear and side lot lines in rear yard: 10"
				},
				{
					"text": "Minimum dimensions at accessory buildings and structures(feet) Maximum height (stories/feet): 1/15"
				},
				{
					"text": "Minimum dimensions at accessory buildings and structures(feet) Maximum coverage of rear yard (percent): 30%"
				},
				{
					"footnote": "[1]\nEditor's Note: The Table of Dimensional Regulations is included\nat the end of this chapter.\n"
				}
			]
		},
		{
			"paragraph": "§ 300-9.1",
			"title": "Placement of accessory buildings, structures and uses.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "In all districts.[Amended 7-12-2011 by L.L. No. 7-2011; 4-21-2016 by L.L. No. 5-2016]"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Accessory buildings, including garages, if connected only by\nan open breezeway-type structure, shall not be less than 10 feet from\nthe main building and, in all events, shall not be less than 10 feet\nfrom other accessory buildings."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "A private garage may be constructed as a structural part of\na main building, provided that, when so constructed, the garage walls\nshall be regarded as the walls of the main building in applying the\nfront, rear and side yard regulations of this chapter."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "No accessory building or accessory structure shall be constructed\nupon a lot or plot, unless a main or principal building already exists\non said lot or plot and has a valid certificate of occupancy or a\nvalid building permit has been issued and is in effect for the construction\nor erection of a main or principal building.[Amended 10-11-2016 by L.L. No. 8-2016]"
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "Accessory buildings, including private garages, and accessory\nstructures shall not be placed within a front yard and shall not occupy\nmore than 30% of any rear yard.[Amended 10-11-2016 by L.L. No. 8-2016]"
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "An access driveway may be located within a required yard."
												}
											]
										},
										{
											"number": "(6) ",
											"content": [
												{
													"text": "No access driveway shall be permitted through a lot to provide\naccess to a second lot, which lot is used or may be used for any use\nprohibited in the district in which the first lot is located."
												}
											]
										},
										{
											"number": "(7) ",
											"content": [
												{
													"text": "Accessory off-street parking or truck-loading areas shall be\nimproved in accordance with Village specifications, except that, upon\nwritten certification by the Village Engineer that a plot or parcel\nof land cannot comply with the standards for drainage due to the topography\nof the plot or parcel and such condition cannot be remedied without\ninjury or damage to adjoining parcels, the Building Inspector may\nwaive such requirement."
												}
											]
										},
										{
											"number": "(8) ",
											"content": [
												{
													"text": "Required accessory off-street parking areas or truck-loading\nspace shall not be encroached upon by buildings, open storage or any\nother use, whether temporary or otherwise."
												}
											]
										},
										{
											"number": "(9) ",
											"content": [
												{
													"text": "The storage of manure or of odor- or dust-producing substances\nas an accessory use shall not be permitted within 50 feet of any side\nor rear lot line or within one 100 feet of any front lot line."
												}
											]
										},
										{
											"number": "(10) ",
											"content": [
												{
													"text": "The keeping of more than two dogs more than six months old in\noutdoor shelters or pens or the keeping of any horses, farm animals\nor fowl shall not be permitted as accessory uses, except for the keeping\nof chickens as a special exception accessory use as provided for in\n§ 300-11.21 of this chapter."
												}
											]
										},
										{
											"number": "(11) ",
											"content": [
												{
													"text": "Swimming pool equipment, including pumps and heating elements,\nshall be located in conformance with the applicable regulations set\nforth in this chapter for accessory buildings and structures. All\nsuch equipment shall be housed in closed structures which shall prevent\nnoise, sound or vibration caused by the equipment from crossing property\nlines and in all events shall be screened on all sides facing adjacent\nproperties or visible from any street with evergreen vegetation."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "In residence districts.[Amended 9-9-2014 by L.L.\nNo. 12-2014; 4-21-2016 by L.L. No. 5-2016]"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Accessory off-street parking areas shall not be less than five\nfeet from any property line in a required front, side or rear yard."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "No commercial vehicle, except for a three-fourths-ton or smaller\npickup truck or van or a contract school bus accommodating not more\nthan 12 passengers, nor any house trailer, mobile home, recreation\nvehicle or camp trailer, boat or boat trailer or any similar equipment\nshall be parked or stored on any lot, except that not more than one\ncamping trailer or recreation vehicle not over 25 feet in length and\nnot more than one boat, including a boat trailer on which it rests,\nmay be stored per dwelling unit on the same lot with such dwelling\nunit, provided that no such vehicle, trailer, mobile home, boat or\nsimilar equipment shall be used for living or sleeping purposes while\nso located, and further provided that it is not located in any front\nyard or in any required side yard or within 10 feet of any property\nline in any required rear yard."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "In the case of a waterfront lot, when a rear lot line is a street\nor right-of-way, the minimum setback of an accessory structure to\nthe street line shall be twice the required setback to the rear lot\nline."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "Driveways shall be provided with a dry well or other approved\ndrainage structure with a retention capacity of two inches of rainfall\nper hour."
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "No accessory building shall have a gross floor area equal to\nor greater than 600 square feet."
												}
											]
										},
										{
											"number": "(6) ",
											"content": [
												{
													"text": "No accessory building and/or accessory structure shall contain\nany plumbing fixtures. Notwithstanding the foregoing, pool houses\nwith a gross floor area of 200 square feet or less shall be permitted\na shower, sink and toilet.[Amended 11-8-2016 by L.L. No. 11-2016]"
												}
											]
										},
										{
											"number": "(7) ",
											"content": [
												{
													"text": "No accessory building shall have a basement or cellar."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "In nonresidential districts."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Accessory off-street parking areas in the RM Resort Motel and WF Waterfront Districts may be located in required front, side or rear yards, provided that they are set back at least 10 feet from all property lines, and further provided that they do not encroach on required transitional yards established in accordance with § 300-9.2C. In the VB District, accessory off-street parking areas may be located in required front, side or rear yards, provided that they do not encroach on required transitional yards established in accordance with § 300-9.2C."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "No house trailer, mobile home, camping trailer or similar equipment\nshall be parked or stored on any lot."
												}
											]
										}
									]
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 300-9.2",
			"title": "Lot frontage; yards; transition yards; courts.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Frontage. The minimum road frontage of a lot at the street line shall\nbe at least 20 feet in all districts, except in those districts where\nthere are no minimum lot area requirements. The minimum frontage of\nany lot on a public street and the minimum access width of any lot\nshall be 20 feet. If frontage is provided by means of a flag strip\naccess, width shall be measured perpendicular to the sides of the\nflag strip. Notwithstanding this requirement, the Planning Board may\napprove the creation of a new lot not having such frontage if the\nnew lot will have access to a public street by means of a common driveway\neasement or access easement which is 20 feet or more in width at all\npoints and which easement is the subject of a duly recorded legal\ninstrument which cannot be revoked or terminated without Planning\nBoard approval."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Yards."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "The following accessory structures may be located in any required\nfront or rear yard:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "Awning or movable canopy not exceeding 10 feet in height, provided\nthat it does not exceed 20% of the required yard area."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "Open arbor or trellis."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "Retaining wall, fence or masonry wall, subject to § 300-9.4."
																}
															]
														},
														{
															"number": "(d) ",
															"content": [
																{
																	"text": "Unroofed steps, patio or terrace not higher than one foot above\nground level."
																}
															]
														},
														{
															"number": "(e) ",
															"content": [
																{
																	"text": "A flag pole utilized for the display of the flag of the United\nStates, provided that it is set back a minimum of 15 feet from the\nstreet line and a minimum of 10 feet from all side lot lines. The\nmaximum height of the flag pole shall not exceed 15 feet above existing\ngrade, except that the maximum height shall be 30 feet in the RM and\nWF Districts.[Added 9-9-2014 by L.L. No. 12-2014]"
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "The space in a required front yard shall be open and unobstructed, except for structures provided for in Subsection B(1) and the following:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "An unroofed balcony projecting not more than three feet into\nthe yard. A balcony, for purposes of this chapter, shall not be greater\nthan eight feet in width and projecting no more than three feet in\ndepth."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "Other projections specifically authorized in Subsection B(3) and (4) below."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Every part of a required yard shall be open to the sky, unobstructed\nexcept for retaining walls and for accessory buildings in a rear yard\nand except for the projection of sills, belt courses and ornamental\nfeatures projecting not to exceed six inches. Cornices and eaves shall\nnot project more than 18 inches."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "Open or lattice-enclosed fireproof fire escapes or stairways\nrequired by law, projecting into a yard not more than three feet,\nand the minimum required projections of chimneys and pilasters shall\nbe permitted by the Building Inspector when placed so as not to obstruct\nlight and ventilation."
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "Where a lot extends through from street to street, the applicable\nfront yard regulations shall apply on both street frontages."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Transitional yards. The following minimum required transitional yards\nand screening shall be provided within nonresidential districts:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Adjoining residential districts."
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "The minimum required transitional side and rear yards shall\nbe 15 feet."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "The minimum required screening within such transitional side\nand rear yards shall be a six-foot-high stockade-type fence or equal,\nand landscape plantings shall be erected and maintained by the nonresidential\nproperty owner along the side and rear property lines; provided, however,\nthat the Planning Board may waive or modify these requirements for\nscreening where the same screening effect is accomplished by the natural\nterrain or foliage."
																}
															]
														}
													]
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "Courts and spacing between principal buildings."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Outer courts or spaces."
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "The least width at the lowest level of an outer court or of\na space between building walls shall be not less than the largest\nof the following three dimensions:"
																},
																{
																	"content": [
																		{
																			"number": "[1] ",
																			"content": [
																				{
																					"text": "One-third of the maximum building height above such lowest level\nof the building walls erected on the same lot and bounding such court\nor space."
																				}
																			]
																		},
																		{
																			"number": "[2] ",
																			"content": [
																				{
																					"text": "Two-thirds of the horizontal depth of such court or space."
																				}
																			]
																		},
																		{
																			"number": "[3] ",
																			"content": [
																				{
																					"text": "Fifteen feet."
																				}
																			]
																		}
																	]
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "The horizontal depth of an outer court or of a space between\nbuilding walls shall not exceed 1 1/2 times the least width."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Inner courts or spaces. The least horizontal dimension of an\ninner court at its lowest level shall be not less than the larger\nof the following two dimensions:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "Two-thirds of the maximum building height above such lowest\nlevel of the building walls erected on the same lot and bounding such\ncourt or space."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "Fifteen feet."
																}
															]
														}
													]
												}
											]
										}
									]
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 300-9.3",
			"title": "Height; exceptions; pyramid law.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Nothing herein contained shall restrict the height of the following\narchitectural and structural features beyond any applicable limitation\nin the Table of Dimensional Regulations.[1]"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "On any public or semipublic building, a spire, cupola, dome,\nbelfry or clock tower."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Flagpole, chimney flue, elevator or stair bulkhead as accessory\nfacilities to permitted or special exception uses in a given district."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Radio or television tower, transmission line or tower or similar\nstructure necessary as a public service facility, only after approval\nas a special exception use by the Planning Board."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "The total height permitted under this section shall not exceed\n125% of the permitted height of the structure on which the feature\nis placed."
												}
											]
										}
									]
								},
								{
									"footnote": "[1]\nEditor's Note: The Table of Dimensional Regulations is included\nat the end of this chapter.\n"
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "No structure, excepting a public service facility erected pursuant to Subsection A to a height in excess of the height limit for the district in which it is situated shall:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Exceed 10% of the building or structure area."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Be used for residence or occupancy purposes."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Have any sign, nameplate display or advertising device of any\nkind whatsoever inscribed upon or attached to such structure."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "No private radio or television antenna, mast or tower shall exceed\nthe maximum permitted height prescribed for the district in which\nsuch proposed structure is to be located."
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "In the R-20 One-Family Residence District, all buildings and structures,\nexcept chimneys and decorative railings, must remain inside the sky\nplane of the lot. The sky plane shall begin at the property lines\nat the elevation of the existing natural grade, and extend to the\nbuilding or structure at an angle of 45°. The height limitation\nin the Table of Dimensional Regulations shall not be exceeded.[2][Amended 9-9-2014 by L.L. No. 12-2014]"
								},
								{
									"footnote": "[2]\nEditor's Note: The Table of Dimensional Regulations is\nincluded as an attachment to this chapter.\n"
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 300-9.4",
			"title": "Fences, walls and gates.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "In residence districts.[Amended 4-21-2016 by L.L. No. 5-2016]"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "No fence or wall in a front yard shall have a height greater\nthan four feet, except in the case of a waterfront lot where such\nfence or wall shall not exceed four feet in both the front and rear\nyard."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "In no case shall any fence or wall have a height greater than\nsix feet."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Any fence or wall having a height of four feet or less shall be exempt from building permit requirements, provided that it shall be constructed of standard materials used for such purposes, with the finished side facing the adjoining lot. The exemption herein shall not apply to any property designated a landmark under § 300-14.4."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "In all events, all fences shall be erected with the finished\nside facing the adjoining lot."
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "Retaining walls shall be set back at least three feet from all\nproperty lines."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "In nonresidence districts."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "No fence or wall within 10 feet of a lot line in a required\nfront yard shall have a height greater than four feet."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "No fence or wall within 10 feet of a lot line in a side yard\nor rear yard shall have a height greater than six feet."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "In no case shall a fence or wall have a height greater than\nsix feet."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "In all events, all fences shall be erected with the finished\nside facing the adjoining lot or is otherwise completely screened\nwith evergreen or equal landscaping."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "The height of a fence or wall shall be measured from the ground level at the base of the fence, except that, where there is a retaining wall, the height shall be measured from the average of the ground levels at each side of the retaining wall; and further, except that any fence or wall on the uphill side of such retaining wall may be at least four feet high, notwithstanding the provisions of Subsection A and B."
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "Gates located in any front yard shall not exceed four feet in height\nabove natural grade and gates located in any side or rear yard shall\nnot exceed six feet in height above natural grade."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 300-9.5",
			"title": "Visual clearance at intersections.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Purpose. Visual clearance shall be provided and maintained at all\nintersections of streets and of driveways and streets."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Clearance standards. On a corner lot in any district or at any driveway\nintersection with a street, within the triangular area determined\nas provided in this section, no wall or fence or other structure shall\nbe erected to a height in excess of two feet; no vehicle, object or\nany other obstruction of a height in excess of two feet shall be parked\nor placed; and no hedge, shrub or other growth shall be maintained\nat a height in excess of four feet, except that trees whose branches\nare trimmed away to a height of at least 10 feet above the curb level,\nor pavement level where there is no curb, shall be permitted. Such\ntriangular area shall be determined by two points, one on each intersecting\nstreet line, each of which points is 15 feet from the intersection\nof such street lines or 15 feet along such driveway lines."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "With respect to any lot in the VB Village Business District, the Planning Board may modify the requirements of § 300-9.5B by reducing such requirements, incident to site plan review and approval, where the Planning Board finds that reasonable visual clearance would be accomplished by such modification, after considering the particular circumstances relating to such lot."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 300-9.6",
			"title": "Off-street parking and truck loading.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "General. Off-street parking and truck-loading spaces shall be provided\nand kept available as an accessory use to all buildings, structures\nand uses in amounts not less than those specified in this section.\nExcept as otherwise expressly provided, the requirements of this section\nshall apply under the following circumstances:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "All new buildings and structures erected for use on a property\nshall be subject to these requirements."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Any building and/or structure which is hereafter enlarged shall\nbe subject to these requirements."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "All new uses of a property shall be subject to these requirements."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "Any use of a property which is hereafter changed shall be subject\nto these requirements."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Method of determining off-street parking space requirements."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "The requirement for a single use (e.g., a one-family dwelling\nor a retail store) shall be determined directly from the schedule\nof such requirements which is a part of this section."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "The requirement for a combination use made up of several component\nuse (e.g., a bowling alley combined with an auditorium; a restaurant\nand bar; or a retail store combined with an office building) shall\nbe determined by establishing the requirement for each component use\nfor the schedule of such requirements, which is a part of this section,\nand adding them together."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "When the required number of spaces is determined to result in\na fraction, it shall be increased to the next highest whole number."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "If the use is not specifically listed in the schedule of such\nrequirements, the requirements shall be the same as for the most similar\nuse listed."
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "A garage or carport may be used to meet the requirements of\nthis section. A driveway may only be used to meet the requirements\nof this section where it serves a one-family or two-family dwelling."
												}
											]
										},
										{
											"number": "(6) ",
											"content": [
												{
													"text": "Uses which require approval pursuant to the special exception use procedure set forth in Article XI may be required to provide off-street parking spaces in excess of the requirements of § 300-9.4C, D and E, as indicated in § 300-11.3I."
												}
											]
										},
										{
											"number": "(7) ",
											"content": [
												{
													"text": "\"Floor area\" or \"gross floor area,\" as these terms are used in this § 300-9.6, shall have the meaning provided under § 300-2.2 for \"floor area, gross.\""
												}
											]
										},
										{
											"number": "(8) ",
											"content": [
												{
													"text": "When the schedule under Subsection D below requires the number of spaces to be calculated per employee and employees are on the premises in shifts, the number to be used is the number of employees present during the largest shift; in all other cases, it shall mean the total number of employees on the premises or who will use the premises for parking at any time."
												}
											]
										},
										{
											"number": "(9) ",
											"content": [
												{
													"text": "No garage or other parking area shall be located in violation\nof the New York State Uniform Fire Prevention and Building Code.[1] Any garage or parking area under a multiple dwelling,\nmotel, apartment building or other use (excepting a single-family\nor two-family residence) containing residential improvements shall\nrequire the prior written express approval of the Fire Marshal."
												},
												{
													"footnote": "[1]\nEditor's Note: See Ch. 92, Building Construction.\n"
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "The schedule of off-street parking space requirements for residential\nuses shall be as follows:"
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "The schedule of off-street parking space requirements for nonresidential\nuses shall be as follows:[Amended 9-9-2014 by L.L. No. 12-2014]"
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "Off-street truck-loading space requirements. Every building or structure\nor lot used for nonresidential purposes shall be provided with off-street\ntruck-loading spaces in accordance with the following schedule:"
								}
							]
						},
						{
							"number": "F. ",
							"content": [
								{
									"text": "Supplemental regulations for private garages and off-street parking\nareas in residence districts."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Not more than two parking spaces per dwelling unit may be rented\nto persons living off the premises in the case of a one-family or\ntwo-family dwelling use, and not more than one parking space per each\ntwo dwelling units may be rented to persons living off the premises\nin the case of any other residence use."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Not more than one commercial vehicle shall be housed or parked in a private garage, and any such use shall be subject to § 300-9.1B(2) above."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "G. ",
							"content": [
								{
									"text": "Access driveway requirements."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Private garages, public parking areas, filling stations and\nrepair garages may have separate or combined entrances."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Every separate entrance or exit driveway shall have a minimum\nunobstructed width of 10 feet on local roads and 15 feet on county\nand state highway routes. Every combined entrance and exit driveway\nshall have a minimum unobstructed width of 20 feet. Parking areas\nwith 20 spaces or more shall have at least two separate entrance and\nexit driveways."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "The intersection of a separate or combined exit and entrance driveway of a public parking area with the public street shall have the corner clearance prescribed in § 300-9.5."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "The gradient of driveways shall be such as to facilitate entrance\nand exit traffic flow."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "H. ",
							"content": [
								{
									"text": "Design requirements for nonresidential parking and truck-loading\nareas."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "All accessory off-street parking and truck-loading areas shall be located in accordance with the provisions of § 300-9.1. For all properties and uses subject to site plan review pursuant to Article XIV of this chapter, off-street parking and truck-loading spaces shall be located only as said spaces are indicated and approved by the Planning Board. Any changes to the spaces shall require the further review and approval of the Planning Board."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "The physical improvements of off-street parking and truck-loading\nareas shall include:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "Curbs, paving, sidewalks and drainage facilities complying with\nthe standards established in Village codes, regulations or specifications."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "No parking area shall be so designed as to cause surface drainage\nto flow into a public street."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "Adequate lighting in public parking areas to assure the general\nsafety and convenience of the public."
																}
															]
														},
														{
															"number": "(d) ",
															"content": [
																{
																	"text": "Appropriate screening for the protection of adjacent properties, particularly along district boundary lines, as provided in § 300-9.2C."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "All aisles within parking areas shall have a minimum width of\n24 feet when the parking spaces are at an angle of 90° with the\naisle; 18 feet when the parking spaces are at 60°; and 12 feet\nwhen the parking spaces are at 45°."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "Aisles and turning areas shall provide good internal circulation\nwith adequate radii to assure ease of mobility, ample clearance and\nconvenient access and egress. Sufficient area for maneuvering into\nand out of all parking spaces shall be provided and shall allow for\na minimum backing-out area of at least 10 feet beyond any parking\nspace for end-of-row parking spaces. No off-street parking spaces\nshall be designed or permitted which back directly out onto any through\nstreet. Aisles permitting two-way traffic flow shall have a minimum\nwidth of 24 feet. Aisles permitting one-way traffic flow shall have\na minimum width of 12 feet. In all events and under all circumstances,\nthe design of any parking spaces and truck-loading spaces is subject\nto the approval of the Planning Board."
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "Center-line gradients of aisles shall not exceed 8%."
												}
											]
										},
										{
											"number": "(6) ",
											"content": [
												{
													"text": "Accessory off-street parking areas shall be marked off into\nspaces with a minimum width of nine feet and a minimum length of 20\nfeet, or a minimum width of 10 feet and a minimum length of 18 feet.\nThe dimensions of the parking spaces shall be determined by the Planning\nBoard, based upon the design and type of improvements to be made to\nthe parking area. Spaces nine feet by 20 feet, as a policy, shall\nonly be considered where the parking areas are to be substantially\nimproved with asphalt or concrete paving and the parking area consists\nof 50 or more spaces. Spaces 10 feet by 18 feet shall be used for\nall other instances, including, in particular, where the parking area\nis improved merely with oil and bluestone or gravel. The dimensions\nof parking spaces for trucks or special equipment shall be determined\nby the Planning Board."
												}
											]
										},
										{
											"number": "(7) ",
											"content": [
												{
													"text": "An accessory off-street truck-loading space shall have a minimum\nwidth of 12 feet, a minimum length of 33 feet and a minimum clear\nheight of 14 feet. The related aisles or driveways shall have the\nsame minimum width and clear height."
												}
											]
										},
										{
											"number": "(8) ",
											"content": [
												{
													"text": "All accessory off-street parking areas shall provide for handicapped\naccess and parking. A minimum of 5% of the total number of parking\nspaces required for any site shall be allocated to handicapped parking;\nprovided, however, that in no case shall the number of handicapped\nspaces be greater than five spaces unless additional spaces are required\nunder New York Vehicle and Traffic Law § 1203-c, as amended.\nHandicapped spaces shall be marked off into spaces with the same minimum\nwidth as required for regular parking spaces plus an adjacent five-foot-wide\nunloading area, in effect providing for a fourteen- or fifteen-foot-wide\nparking space. Each such space shall be striped with blue paint and\nshall contain the international handicapped symbol and a sign approved\nby the Planning Board at the head of each space."
												}
											]
										},
										{
											"number": "(9) ",
											"content": [
												{
													"text": "To improve the aesthetics of a site, promote public safety,\nmoderate climatic effects and minimize nuisances such as noise and\nglare, accessory off-street parking areas shall include appropriate\nlandscaping at the perimeter and within the interior of the parking\nareas. The Planning Board shall determine the amount, location and\ntype of landscaping; provided, however, that accessory off-street\nparking areas with a requirement of over 20 spaces shall have at least\n25 square feet of interior landscaping for each parking space. Additionally,\ninterior parking islands shall allow ample room for plantings without\ndisturbance from vehicular and pedestrian traffic. Landscaped areas\nshall be so designed as not to obstruct a driver's view."
												}
											]
										},
										{
											"number": "(10) ",
											"content": [
												{
													"text": "Pavement markings."
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "Traffic pavement marking shall be provided on various internal\nroadways and parking areas which may include parking stalls, stop\nbars, crosswalks, lane lines, fire zones, handicapped parking stalls,\ndirectional arrows and other miscellaneous markings. Signs may also\nbe provided along said roadways to identify these areas. Pavement\nmarkings and signs shall conform to the New York State Manual of Traffic\nControl Devices or as directed by the Planning Board."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "Where striping can be accomplished, all parking spaces shall\nbe striped in accordance with the approved plan. All striping shall\nbe four-inch-wide lines except handicapped spaces, which shall be\nfour-inch blue lines. Specifications of the paint and method of application\nshall be determined by the Planning Board."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "Traffic islands separating opposing flows of traffic shall be\nbordered by two four-inch-wide yellow lines and crosshatched with\ntwelve-inch-wide yellow bars."
																}
															]
														},
														{
															"number": "(d) ",
															"content": [
																{
																	"text": "Fire zones shall be installed in accordance with the directions\nof the Planning Board and advisory recommendations of the Sag Harbor\nFire Marshal."
																}
															]
														}
													]
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "I. ",
							"content": [
								{
									"text": "Exemptions and variances."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Existing buildings and uses in the Village Business District,\nOffice District and Waterfront District are exempt as follows:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "The provisions of § 300-9.6 shall not apply to any land use, buildings or structure lawfully existing on the effective date of this subsection (for purposes of this subsection this date shall be September 4, 1984), whether continued as a legal nonconforming use or thereafter converted or changed without enlargement to a different lawful use having an equal or lesser number of parking and truck-loading spaces, except as provided otherwise in § 300-12.6B(1)(b). Preexistence may be established by any one or more of the following:"
																},
																{
																	"content": [
																		{
																			"number": "[1] ",
																			"content": [
																				{
																					"text": "A valid certificate of occupancy or certificate of compliance."
																				}
																			]
																		},
																		{
																			"number": "[2] ",
																			"content": [
																				{
																					"text": "An original sealed survey of the premises (not a photocopy)."
																				}
																			]
																		},
																		{
																			"number": "[3] ",
																			"content": [
																				{
																					"text": "A date-verified aerial photo."
																				}
																			]
																		},
																		{
																			"number": "[4] ",
																			"content": [
																				{
																					"text": "A valid sewer use permit containing such proof of such preexistence."
																				}
																			]
																		},
																		{
																			"number": "[5] ",
																			"content": [
																				{
																					"text": "An original Sanborn map of the premises or equivalent."
																				}
																			]
																		},
																		{
																			"number": "[6] ",
																			"content": [
																				{
																					"text": "An affidavit or other proof acceptable to the Building Inspector."
																				}
																			]
																		}
																	]
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "Requirements for preexisting buildings, structures or lots;\nchange of use."
																},
																{
																	"content": [
																		{
																			"number": "[1] ",
																			"content": [
																				{
																					"text": "No building, structure or lot lawfully existing shall be enlarged unless the off-street parking and truck-loading space requirements of this § 300-9.6 are complied with to the same extent as would be required if the entire preexisting building or structure or lot and the proposed enlargement were being submitted as a new application for a building permit for the entire project, except that credit shall be given for the off-street parking and truck-loading spaces that would have been required for the existing building or structure if the premises did not have preexisting status. Any credit shall, however, be limited in application to the preexisting building, and new spaces shall be supplied and installed for any enlargement. It is intended by this provision that additional off-street parking and truck-loading spaces shall be provided with respect to the proposed enlargement, but no additional spaces shall be required with respect to the preexisting building or structure. By way of illustration, and not limitation, a legal preexisting building with a parking requirement of eight spaces which supplies five spaces shall, upon enlargement, supply as many new spaces as the enlargement requires, and the five preexisting spaces shall be credited against the eight required and shall satisfy only said requirement of eight spaces."
																				}
																			]
																		},
																		{
																			"number": "[2] ",
																			"content": [
																				{
																					"text": "No lawfully existing use shall be changed to a use with greater off-street parking or truck-loading space requirements unless the off-street parking and truck-loading space requirements of this § 300-9.6 are complied with to the same extent that would be required if the proposed change of use were being submitted as a new application for a building permit, except that credit shall be given for the off-street parking and truck-loading spaces that would have been required for the lawful preexisting use if said use did not have preexisting status. Any credit shall, however, be limited in application to the preexisting building, and new spaces shall be supplied and installed for any change of use. It is intended by this provision that additional off-street parking and truck-loading spaces shall be provided with respect to the change of use subject to the aforesaid credit. By way of illustration and not limitation, a legal preexisting building with a parking requirement of eight spaces which supplies five spaces shall, upon change of use, supply as many new spaces as the change of use requires, and the five preexisting spaces shall be credited against the eight required and shall satisfy only said requirement of eight spaces."
																				}
																			]
																		},
																		{
																			"number": "[3] ",
																			"content": [
																				{
																					"text": "Conforming spaces actually provided on the premises, even if\ninformal and unpaved, shall be allocated to the preexisting portions\nonly or to the prior use but shall be formalized and paved as a condition\nof issuance of any site plan approval, building permit, certificate\nof compliance or certificate of occupancy, whichever shall apply."
																				}
																			]
																		}
																	]
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Where the Planning Board shall determine that dedication of\nland or an easement in perpetuity to the Village is desirable to facilitate\nimprovement of existing or proposed public parking facilities and\nsaid dedication of land or easement is voluntarily and unconditionally\noffered to the Village for said purposes, the off-street parking requirements\nhereunder may be waived in whole or in part by the Planning Board.\nThe number of spaces that may be waived shall be calculated on the\nbasis of one space per each 200 square feet of land area covered in\nthe dedication or easement."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "The Board of Appeals, subject to the applicable provisions of § 300-12.6E, may grant a variance from the requirements, in whole or in part, for the off-street parking and truck-loading spaces stipulated in this section."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "J. ",
							"content": [
								{
									"text": "Standards for parking variances. Upon any application for variances to the provisions of § 300-9.6, the Board of Appeals shall utilize the standards provided under Village Law § 7-712-b(3), as amended from time to time."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 300-9.7",
			"title": "Signs.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Schedule of permitted signs. The following schedule of permitted\nsigns shall apply according to the district in which the lot is located\non the Zoning Map, whether such lot is used for a permitted use or\nfor a special exception use:"
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Professional signs and announcement signs."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "A professional sign or an announcement sign for a home professional\noffice or home occupation shall bear only the name and profession\nor occupation of the resident. Such sign shall have a maximum area\nof two square feet and may be located on the building wall or in the\nrequired front yard, provided that it is set back at least 10 feet\nfrom all property lines and is not more than six feet above the natural\nground level at its location."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "A church or other place of worship may have one announcement\nsign, not over 18 square feet in area, on each public street frontage\nof its property, either fixed on the main wall of the building or\nlocated in the required front yard, provided that it is set back at\nleast 10 feet from the front property line and at least 25 feet from\nall other property lines. A church or other place of worship may also\nhave one temporary announcement sign, not over 32 square feet in area,\non each public street frontage of its property, located in the required\nfront yard, for a period not to exceed 30 days, for the purpose of\nannouncing a special event, provided that it is set back at least\n10 feet from the front property line and at least 25 feet from all\nother property lines. No detached or ground sign shall exceed an overall\nheight of eight feet. The sign permit for such temporary sign shall\nautomatically be deemed revoked 30 days after the date of issuance\nof such permit, and such temporary sign shall be removed from the\npremises upon the revocation of such permit. There shall be no fee\nfor the permit for such temporary sign."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "A parish house, club, school or public or semipublic building\nmay have one announcement sign, not over six square feet in area,\non each public street frontage of its property, either fixed on the\nmain wall of the building or located in the required front yard, provided\nthat it is set back at least 10 feet from the front property line\nand at least 25 feet from all other property lines. A parish house,\nclub, school or public or semipublic building may also have one temporary\nannouncement sign, not over 32 square feet in area, on each public\nstreet frontage of its property, located in the required front yard,\nfor a period not to exceed 30 days, for the purpose of announcing\na special event, provided that it is set back at least 10 feet from\nthe front property line and at least 25 feet from all other property\nlines, No detached or ground sign shall exceed an overall height of\neight feet. The sign permit for such temporary sign shall automatically\nbe deemed revoked 30 days after the date of issuance of such permit,\nand such temporary sign shall be removed from the premises upon the\nrevocation of such permit. There shall be no fee for the permit for\nsuch temporary sign."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "Such signs may be double-faced."
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "Lighting for such signs shall be mounted on the top of or above\nthe sign, directed downward, and positioned or shielded so that the\nlight source is not visible beyond the boundary of the property on\nwhich the sign is located."
												}
											]
										},
										{
											"number": "(6) ",
											"content": [
												{
													"text": "In addition to all other permitted signs, a restaurant, delicatessen,\nspecialty food store, or coffee shop may display one erasable portable\nsign not to exceed six square feet of advertising space to announce\nits menu or daily specials. Such sign shall not be displayed on or\nabove the public right-of-way, nor shall it obstruct parking, pedestrian,\nor accessible walkways. It shall be stored inside the premises when\nit is not open for business.[Added 9-9-2014 by L.L. No. 12-2014]"
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Village Business District identification signs."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "A wall identification sign shall be attached to or incorporated\nin a building wall. Such sign shall not:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "Exceed in total area two square feet for each horizontal foot\nof such wall on which it is mounted."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "Exceed in width 75% of the horizontal measurement of the wall\non which it is mounted."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "Project more than one foot from such wall."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "An awning identification sign on a properly adjustable awning\nconstructed of cloth on an iron tube frame, the lowest point of which\nshall be at least seven feet above the sidewalk or ground elevation\nat the base of the wall on which it is mounted. Such sign shall not:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "Exceed a total area of one square foot for each two horizontal\nfeet of the window or door opening which it protects."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "Exceed a depth of 10 inches."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "A detached or ground identification sign may only be erected\nwhere the building is set back from the street line a distance of\n25 feet or more. Such sign shall not:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "Exceed in total area 18 square feet."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "Exceed eight feet in height measured from the ground level."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "Have less than three feet of clear space between the ground\nlevel and the bottom of the signboard, provided that necessary supports\nmay extend through such clear space."
																}
															]
														},
														{
															"number": "(d) ",
															"content": [
																{
																	"text": "Be set back less than 20 feet from any property line, except\nthat, if the average front setback of existing buildings within the\nsame block is less than 10 feet, then the average setback so established\nshall be applied to such sign."
																}
															]
														}
													]
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "All other nonresidential district identification signs."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "A wall identification sign shall be attached to or incorporated\nin a building wall. Such sign shall not:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "Exceed in total area one square foot for each horizontal foot\nof such wall on which it is mounted."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "Exceed in width 75% of the horizontal measurement of the wall\non which it is mounted."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "Project more than one foot from such wall."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "A detached or ground identification sign may only be erected\nwhere the building is set back from the street line a distance of\n40 feet or more. Such sign shall not:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "Exceed in total area 40 square feet."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "Exceed 10 feet in height measured from the ground level."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "Have less than four feet of clear space between the ground level\nand the bottom of the signboard, provided that necessary supports\nmay extend through such clear space."
																}
															]
														},
														{
															"number": "(d) ",
															"content": [
																{
																	"text": "Be set back less than 20 feet from any property line, except\nthat, if the average front setback of existing buildings within the\nsame block is less than 10 feet, then the average setback so established\nshall be applied to such sign."
																}
															]
														}
													]
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "Real estate and construction signs. Real estate and construction\nsigns shall be set back at least three feet from any property line.\nSuch signs shall have a maximum area of four square feet, except that\nsubdivision signs shall have a maximum area of 24 square feet. Such\nsigns shall not be illuminated in any residence district.[Amended 9-9-2014 by L.L. No. 12-2014]"
								}
							]
						},
						{
							"number": "F. ",
							"content": [
								{
									"text": "General provisions."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "The area of a sign shall be determined by the smallest rectangle\nthat encompasses all of the letters or symbols that make up the sign,\ntogether with the area of any background of a color or material different\nfrom the general finish of the building, whether painted or applied."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "The outlining by direct illumination of all or part of a building,\nsuch as a gable, roof, wall, side or corner, is prohibited, except\nfor holiday display."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "No flashing or moving signs, except time-and-temperature information,\nor rooftop signs shall be permitted in any district."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "Illumination of signs shall be accomplished by means of a fully\nshielded light source mounted on top of or above the sign, directed\ndownward and positioned or shielded so that the light source is not\nvisible beyond the property lines, disturbs the vision of passing\nmotorists or constitutes a hazard to traffic."
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "Temporary or permanent signs resting on or attached to vehicles\nshall not be used as a means to circumvent the provisions of this\nchapter."
												}
											]
										},
										{
											"number": "(6) ",
											"content": [
												{
													"text": "No sign shall be so located as to detract from or obstruct historical\nbuildings from public view."
												}
											]
										},
										{
											"number": "(7) ",
											"content": [
												{
													"text": "Billboards are prohibited in all districts, except that the\nVillage may establish special public information centers wherein directional\nsigns for businesses which are approved by the Village Board of Trustees\nmay be located."
												}
											]
										},
										{
											"number": "(8) ",
											"content": [
												{
													"text": "No neon sign shall be permitted in any district."
												}
											]
										},
										{
											"number": "(9) ",
											"content": [
												{
													"text": "Nothing contained in this chapter shall be construed to prohibit\nthe Village or any other governmental agency from erecting and maintaining\npublic signs deemed to be necessary in the public interest."
												}
											]
										},
										{
											"number": "(10) ",
											"content": [
												{
													"text": "Any sign to be erected in any part of the Historic District\nshall be allowed only upon an express, affirmative finding of the\nBoard of Historic Preservation and Architectural Review that said\nsign is consistent with the historic character of the area including\nhistoric materials and features."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "G. ",
							"content": [
								{
									"text": "Procedures, permits and fees."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "No sign shall be erected in the Village of Sag Harbor without\nfirst obtaining a permit from the Building Inspector and paying the\nrequired fee set forth in this section, except that a residence nameplate,\nstreet number, \"for sale,\" \"for rent,\" \"beware\" or \"caution\" sign\nnot exceeding a gross area, inclusive of frame, of two square feet,\nelevated not to exceed two feet above existing natural grade, and\naccessory to a one- or two-family residential building, shall not\nrequire such a permit."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Applications for sign permits shall be made upon forms provided\nby the Building Inspector and shall include plans, specifications\nand other such information as the Building Inspector may require."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "The Building Inspector shall determine that such proposed sign\ncomplies with all the requirements of this chapter and all other applicable\nlaws and regulations of the Village of Sag Harbor before authorizing\nissuance of a sign permit. Nonconforming signs shall be designated\nas such on the sign permit issued."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "No sign permit shall be issued prior to payment of the required\nfee. The fee for a sign permit application and for issuance of a sign\npermit shall be as established from time to time by the Board of Trustees."
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "Each sign shall be assigned a permit number."
												}
											]
										},
										{
											"number": "(6) ",
											"content": [
												{
													"text": "Each sign for which a sign permit has been issued may be inspected\nfor adequate maintenance, freedom from any hazardous condition and\nstructural soundness. If such sign is found to be unsafe, the Building\nInspector shall revoke the sign permit until such time as satisfactory\nadjustments have been made."
												}
											]
										},
										{
											"number": "(7) ",
											"content": [
												{
													"text": "No existing sign shall be structurally altered, rebuilt, enlarged,\nextended, relocated or modified in any way except in conformity with\nthe provisions of this section."
												}
											]
										},
										{
											"number": "(8) ",
											"content": [
												{
													"text": "Any sign requiring a sign permit which does not have such a permit or which does not have a sign permit number shall be deemed to be an illegal sign under the provisions of this chapter. The Building Inspector shall cause a notice of such violation to be served on the owner of the building, structure or lot where said sign is located, or the lessee or tenant of the part of or of the entire building, structure or lot where said sign is located, requiring such owner or lessee or tenant to remove such illegal sign. Such notice may be served personally or by certified mail, return receipt requested. Persons found guilty of such violation shall be subject to a fine and/or imprisonment as set forth in § 300-17.6."
												}
											]
										},
										{
											"number": "(9) ",
											"content": [
												{
													"text": "No sign other than a sign erected by a governmental agency shall\nbe erected or placed within the right-of-way lines of a public street,\nand any such sign may be removed by the Building Inspector without\nnotice to the owner."
												}
											]
										}
									]
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 300-9.8",
			"title": "Buildings or land in the VB District with multiple uses.",
			"content": [
				{
					"text": "Notwithstanding any other provisions of this chapter, any building\nor land within the VB District that is benefited by more than one\ncertificate of occupancy or compliance or a single certificate allowing\nmultiple uses upon the effective date of enactment of this amendment\nin or upon the building or land shall be allowed the uses as are represented\nby such certificate(s), although the building or landowner may elect\nto combine one or more such uses or to redistribute among the various\nuses the floor areas previously allocated to such uses, provided that\nthe total floor area of all uses allowed by such certificate(s) is\nnot exceeded. Any such combination of uses or reallocation of floor\nareas among uses shall not require site plan review or any special\nexception or other discretionary approval or authorization from any\nVillage Board or agency, provided that any use or uses is permitted\nunder the certificate(s) of occupancy or compliance for that building\nor land."
				}
			]
		},
		{
			"paragraph": "§ 300-9.9",
			"title": "Lighting.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Residential standards."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Exterior lighting shall be designed, installed and maintained\nto minimize glare."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Irrespective of any other provision herein, all lighting on\nnew construction for which a building permit is issued after the effective\ndate of this chapter must be fully shielded."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "No light source shall be visible beyond the boundary of the\nproperty on which it is located, including from a body of water or\nroadway."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "All fixtures shall be aimed downward.[Added 9-9-2014 by L.L. No. 12-2014]"
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "Up to two outdoor lighting fixtures per lot are exempt from\nthe shielding requirements, provided that each such exemption fixture\nhas a total light output of 900 lumens or less (60 watts incandescent\nor less).[Added 9-9-2014 by L.L. No. 12-2014]"
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Commercial lighting standards and requirements. Exterior commercial\nlighting which is improperly designed, insufficiently shielded or\nunnecessarily intense can have a detrimental effect on many of the\nqualities which the Village seeks to foster and protect. Therefore,\nin reviewing site plans the Planning Board shall consider the impacts\nof any proposed exterior lighting on public safety, adjacent property\n(especially residential property), the natural environment and the\ngeneral appearance of the Village. To this end, the Planning Board\nis directed to apply the specific standards and requirements of this\nsection to any proposed exterior lighting. The Planning Board shall\nhave the power to vary or modify any standards or requirements, where\nappropriate, provided the Board finds that doing so will not negate\nthe purposes of this section."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Location of light fixtures. All exterior light fixtures shall\nbe located so as to minimize or avoid glare and the adverse effects\nof exterior lighting on nearby properties, especially residential\nproperty."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Mounting height. Light fixtures shall be mounted at the lowest\npractical height, taking into account the area to be illuminated and\nthe relationship between the mounting height and the number of fixtures\nrequired to illuminate that area unless a greater mounting height\nis required by the nature of the use or the size of the structure\n(e.g., boat storage buildings, multiple-dwelling units and commercial\ngarages), light fixtures shall not be mounted at a height greater\nthan 12 feet above natural grade."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Type of lamp. The following types of lamps shall not be permitted:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "Mercury vapor;"
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "Neon, unless legally preexisting;"
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "Laser; and"
																}
															]
														},
														{
															"number": "(d) ",
															"content": [
																{
																	"text": "Any light source with a color temperature greater than 3,000\nKelvin (K)."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "Utility-pole-mounted lighting is prohibited."
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "Shielding of light source. Full cutoff light fixtures shall\nbe used for all light sources."
												}
											]
										},
										{
											"number": "(6) ",
											"content": [
												{
													"text": "Landscape lighting is discouraged. Facade lighting is also discouraged."
												}
											]
										},
										{
											"number": "(7) ",
											"content": [
												{
													"text": "Installation of automatic lighting controls is recommended.\nMotion sensors should be aimed and adjusted such that lights are not\ntriggered by motion off the property."
												}
											]
										},
										{
											"number": "(8) ",
											"content": [
												{
													"text": "All lights are to be extinguished no later than 1/2 hour after\nclose of business. \"Dusk-to-dawn\" sensors, without a shutoff control\nare prohibited."
												}
											]
										},
										{
											"number": "(9) ",
											"content": [
												{
													"text": "Light levels at the property line shall not exceed 0.1 footcandle\nadjacent to property zoned for commercial use, and 0.05 footcandle\nat residential property boundaries."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "In the case of a flagpole lot, the front lot line used for the determination\nof lot width and the required front yard shall be one of the internal\nlot lines designated by the owner."
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "In the case of a waterfront lot:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "A waterfront lot line shall be considered the front lot line.\nThe line opposite the front lot line shall be considered the rear\nlot line."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "When a lot is formed by a waterfront lot line and a street right-of-way\nor easement line intersecting, such lot shall be considered a corner\nlot."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "When a rear lot line is a street or right-of-way, the required\nrear yard setback for accessory buildings and structures shall be\nthe same as the required rear yard for a principal building in the\napplicable district."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "Light levels shall not be in excess of five footcandles on any\nlit surface."
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "Exceptions. The following types of lighting are exempt from\nthe foregoing provisions:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "Temporary lighting;"
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "Lighting which the Village Board has expressly allowed in connection\nwith a special event;"
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "Flag uplighting, provided any such flag is not used for advertising\npurposes, and has a fixture as close to the pole as possible, and\nhas a light source that emits a narrow beam of light. The light source\nmust be recessed within a fixture with an opaque shield so that, as\ndesigned and installed, the light fixture projects all its light above\nthe horizontal plane and is aimed directly at the flag. The light\nsource must not be visible across the property line;"
																}
															]
														},
														{
															"number": "(d) ",
															"content": [
																{
																	"text": "U. S. Coast Guard approved maritime navigational lighting and\nall temporary emergency lighting needed by fire, ambulance, or police\ndepartments, or other emergency services;"
																}
															]
														},
														{
															"number": "(e) ",
															"content": [
																{
																	"text": "Municipal streetlighting;"
																}
															]
														},
														{
															"number": "(f) ",
															"content": [
																{
																	"text": "All essential lighting for emergency facilities; and"
																}
															]
														},
														{
															"number": "(g) ",
															"content": [
																{
																	"text": "Marina-power-pedestal lighting."
																}
															]
														}
													]
												}
											]
										}
									]
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 300-9.10",
			"title": "Surface water runoff.",
			"content": [
				{
					"text": "It shall be a violation of this chapter, subject to the penalties set forth in § 300-17.6, to create or maintain any condition that causes, permits, allows, facilitates or contributes to a detriment to adjoining properties, including, without limitation, public and private roads, caused by erosion, flooding or diversion of surface, ground, or floodwaters."
				}
			]
		},
		{
			"paragraph": "§ 300-9.11",
			"title": "Gross floor area for certain residential dwellings in R-20 and OD Districts.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Maximum gross floor area in the R-20 and OD districts."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "The gross floor area of any one-family detached dwelling shall\nnot exceed the permitted gross floor area calculated as follows:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "Lots of 6,250 square feet or less: 2,500 square feet gross floor\narea."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "Lots greater than 6,250 square feet and less than 25,000 square\nfeet: 2,500 square feet gross floor area plus (lot area minus 6,250\nsquare feet) times (0.08)."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "Lots 25,000 square feet or greater: 4,000 square feet gross\nfloor area."
																}
															]
														},
														{
															"number": "(d) ",
															"content": [
																{
																	"text": "The Village Board of Trustees may grant a special permit for a one-family detached dwelling, which exceeds the provisions of this subsection, provided the requirements of Subsection B are met."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "In determining the maximum permitted gross floor area, the following\nprovisions shall apply:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "\"Lot area\" shall have the same meaning as \"lot, area of,\" as\ndefined in this chapter."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "\"Gross floor area\" shall have the same meaning as \"floor area,\ngross,\" as defined in this chapter."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "In the case of two or more dwelling units legally existing on\nthe same lot, the gross floor area of all dwellings shall be the cumulative\ntotal gross floor area of all dwellings on the lot."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "In determining maximum lot coverage, whether under the gross\nfloor area requirement or the percentage of lot coverage restriction\nin this article, the more restrictive requirement or standard shall\napply."
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "These provisions shall apply in the R-20 and OD Districts."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Special permit."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "In the case of lots with an area in excess of 25,000 square\nfeet, an applicant may apply to the Village Board of Trustees for\na special permit for a one-family detached dwelling to contain more\nthan 4,000 square feet of gross floor area. The gross floor area of\nany one-family detached dwelling pursuant to this subsection shall\nnot exceed the permitted gross floor area ratio calculated as follows:\n4,000 square feet gross floor area plus (lot area minus 25,000 square\nfeet) times (0.08). However, in no case shall the gross floor area\nexceed 7,000 square feet."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Applications for a special permit shall be submitted in the\nform required."
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "Upon receipt of a complete application, the Village Board of\nTrustees shall fix a time and place for a public hearing and shall\nprovide for giving notice of the public hearing by publishing a notice\nin the official newspaper at least 10 days prior to the hearing."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "In addition, at least 10 days prior to the hearing, the applicant\nshall mail notice of the time, date, place and nature of the hearing\nto the owners of record of every property which abuts and every property\nwhich is within 200 feet of the property involved in the application.\nSuch notice shall be made by certified mail and addressed to the owners\nat the addresses listed for them on the local assessment roll. On\nor before the commencement of the public hearing, the applicant shall\nfile a radius map prepared by a professional and an affidavit with\npostal receipts annexed thereto confirming mailing of said notices."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "The applicant or his agent shall also erect or cause to be erected\na sign or signs which shall be displayed on the parcel upon which\nthe application is made, facing each public street on which the property\nabuts, giving notice that an application has been made to the Village\nBoard of Trustees, and stating the time and place where the public\nhearing will be held. The sign(s) shall not be located more than 10\nfeet from the street line and shall not be less than two feet nor\nmore than six feet above the natural grade at the street line. The\nsign(s) shall be displayed for not less than 10 days immediately preceding\nthe public hearing date. The applicant shall file an affidavit with\nthe Village Board of Trustees that he has complied with the provisions\nof this section. Failure to submit such affidavit shall result in\nthe adjournment of the public hearing."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "For every such special permit, the Board of Trustees shall determine\nthat:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "Harmony of use. Such use will be in harmony with § 300-1.2, Legislative findings and determinations, and will promote the general purposes and intent of this chapter as stated in § 300-1.3, Declaration of purpose."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "Lot area. The plot area is sufficient, appropriate and adequate\nfor the use."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "Adjacent properties. The proposed use will not prevent the orderly\nand reasonable use of adjacent properties."
																}
															]
														},
														{
															"number": "(d) ",
															"content": [
																{
																	"text": "Compatibility. The site is particularly suitable for the location\nof such use in the Village and, if sited at that location, the proposed\nuse will in fact be compatible with its surroundings, with the character\nof the neighborhood, and of the community in general, particularly\nwith regard to visibility, scale and overall appearance."
																}
															]
														},
														{
															"number": "(e) ",
															"content": [
																{
																	"text": "Parking. There are off-street parking spaces at least in the\nnumber required by the provisions of this chapter, but in any case\nan adequate number for the anticipated number of occupants, and, further,\nthat the layout of the spaces and driveways is convenient and conducive\nto safe operation."
																}
															]
														},
														{
															"number": "(f) ",
															"content": [
																{
																	"text": "Buffering and screening. Adequate buffer yards and screening\nare provided where necessary to protect adjacent properties and land\nuses."
																}
															]
														},
														{
															"number": "(g) ",
															"content": [
																{
																	"text": "Runoff and waste. Adequate provisions will be made for the collection\nand disposal of stormwater runoff from the site and of sanitary sewage,\nrefuse or other waste, whether liquid, solid, gaseous or of other\ncharacteristic."
																}
															]
														},
														{
															"number": "(h) ",
															"content": [
																{
																	"text": "Environmental protection. The natural characteristics of the\nsite are such that the proposed use may be introduced there without\nundue disturbance or disruption of important natural resources."
																}
															]
														},
														{
															"number": "(i) ",
															"content": [
																{
																	"text": "Historic District. In the Historic District, the Board of Trustees shall utilize and be guided by the Secretary of the Interior's Standards for Rehabilitation and Guidelines for Rehabilitating Historic Buildings, as well as the provisions of Article XIII of this chapter."
																}
															]
														},
														{
															"number": "(j) ",
															"content": [
																{
																	"text": "Compliance with other laws. The proposed use can and will comply\nwith all provisions of this chapter and the Village Code applicable\nto the proposed use and can meet every other applicable federal, state,\ncounty and local law, rule or regulation."
																}
															]
														},
														{
															"number": "(k) ",
															"content": [
																{
																	"text": "These provisions shall apply in the R-20 and OD Districts."
																}
															]
														}
													]
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "The provisions of this section shall also apply to:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "The construction or conversion of any building for use as a\ntwo-family detached dwelling, as allowed pursuant to this chapter,\nas a special exception use."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "The conversion of a multifamily dwelling or any other building\ninto a one-family detached dwelling."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "The provisions of Subsections A and B of this section shall not apply to a residential one-family or two-family detached dwelling or two or more dwelling units legally existing on the same lot which are nonconforming uses in a zoning district other than R-20 or OD. In such cases, the nonconforming use shall not be reconstructed, structurally altered, restored or repaired to an extent exceeding 100% of the gross floor area of such legal preexisting nonconforming dwelling use."
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "Notwithstanding any provision of this section to the contrary, the\nrecord owner of any real property with a pending application for a\nbuilding permit for construction that is not in compliance with the\nprovisions of this section may petition the Village Board of Trustees\nfor relief, provided that the record owner of the real property has\nat least one permit or approval from the Village Board of Trustees,\nthe Zoning Board of Appeals, the Planning Board, the Harbor Committee,\nor the Board of Historic Preservation and Architectural Review."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "The Village Board of Trustees may grant such relief where it\ndetermines that the record owner of the real property has incurred\nsubstantial expenditures in improving the land or otherwise in reliance\non such approval or permit prior to the date of adoption of this section."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Any relief granted pursuant to this section shall expire one\nyear after the effective date of this section, if a building permit\nhas not been issued and construction commenced."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "The provisions of this section providing for the granting of relief by the Village Board of Trustees shall be in addition to the authority of the Board of Zoning Appeals to grant relief pursuant to Article XII of Chapter 300 (Zoning) of the Village Code and § 7-712-b of the State Village Law."
												}
											]
										}
									]
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 300-16.1",
			"title": "Statutory authorization and purpose.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Findings. The Village Board of Trustees of the Village of Sag Harbor\nfinds that the potential and/or actual damages from flooding and erosion\nmay be a problem to the residents of the Village of Sag Harbor and\nthat such damages may include: destruction or loss of private and\npublic housing, damage to public facilities, both publicly and privately\nowned, and injury to and loss of human life. In order to minimize\nthe threat of such damages and to achieve the purposes and objectives\nhereinafter set forth, this article is adopted."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Statement of purpose. It is the purpose of this article to promote\nthe public health, safety and general welfare, and to minimize public\nand private losses due to flood conditions in specific areas by provisions\ndesigned to:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Regulate uses which are dangerous to health, safety and property\ndue to water or erosion hazards or which result in damaging increases\nin erosion or in flood heights or velocities;"
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Require that uses vulnerable to floods, including facilities\nwhich serve such uses, be protected against flood damage at the time\nof initial construction;"
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Control the alteration of natural floodplains, stream channels,\nand natural protective barriers which are involved in the accommodation\nof floodwaters;"
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "Control filling, grading, dredging and other development which\nmay increase erosion or flood damages;"
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "Regulate the construction of flood barriers which will unnaturally\ndivert floodwaters or which may increase flood hazards to other lands;\nand"
												}
											]
										},
										{
											"number": "(6) ",
											"content": [
												{
													"text": "Qualify and maintain for participation in the National Flood\nInsurance Program."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Objectives. The objectives of this article are:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "To protect human life and health;"
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "To minimize expenditure of public money for costly flood-control\nprojects;"
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "To minimize the need for rescue and relief efforts associated\nwith flooding and generally undertaken at the expense of the general\npublic;"
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "To minimize prolonged business interruptions;"
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "To minimize damage to public facilities and utilities such as\nwater and gas mains, electric, telephone, sewer lines, streets and\nbridges located in areas of special flood hazard;"
												}
											]
										},
										{
											"number": "(6) ",
											"content": [
												{
													"text": "To help maintain a stable tax base by providing for the sound\nuse and development of areas of special flood hazard so as to minimize\nfuture flood-blight areas;"
												}
											]
										},
										{
											"number": "(7) ",
											"content": [
												{
													"text": "To provide that developers are notified that property is in\nan area of special flood hazard; and"
												}
											]
										},
										{
											"number": "(8) ",
											"content": [
												{
													"text": "To ensure that those who occupy the areas of special flood hazard\nassume responsibility for their actions."
												}
											]
										}
									]
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 300-16.2",
			"title": "Definitions.",
			"content": [
				{
					"text": "Unless specifically defined below, words or phrases used in\nthis article shall be interpreted so as to give them the meaning they\nhave in common usage and to give this article its most reasonable\napplication."
				}
			]
		},
		{
			"paragraph": "§ 300-16.3",
			"title": "General provisions.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Lands to which this article applies. This article shall apply to\nall areas of special flood hazard within the jurisdiction of the Village\nof Sag Harbor."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Basis for establishing the areas of special flood hazard."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "The areas of special flood hazard for the Village of Sag Harbor,\nCommunity Number 360807, are identified and defined on the following\ndocuments prepared by the Federal Emergency Management Agency:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "Flood Insurance Rate Map Panel Numbers: 36103C0189H, 36103C0193H,\n36103C0194H, 36103C0527H, 36103C0531H, 36103C0532H, whose effective\ndate is September 25, 2009, and any subsequent revisions to these\nmap panels that do not affect areas under our community's jurisdiction."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "A scientific and engineering report entitled \"Flood Insurance\nStudy, Suffolk County, New York, All Jurisdictions,\" dated September\n25, 2009."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "The above documents are hereby adopted and declared to be a\npart of this chapter. The Flood Insurance Study and/or maps are on\nfile at: Sag Harbor Village Hall, 55 Main Street, Sag Harbor, NY 11963,\noffice of the Building Inspector."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Interpretation and conflict with other laws. This article includes\nall revisions to the National Flood Insurance Program through October\n27, 1997, and shall supersede all previous laws adopted for the purpose\nof flood damage prevention. In their interpretation and application,\nthe provisions of this article shall be held to be minimum requirements,\nadopted for the promotion of the public health, safety and welfare.\nWhenever the requirements of this article are at variance with the\nrequirements of any other lawfully adopted rules, regulations or ordinances,\nthe most restrictive or that imposing the higher standards shall govern."
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "Penalties for noncompliance. No structure in an area of special flood hazard shall hereafter be constructed, located, extended, converted or altered and no land shall be excavated or filled without full compliance with the terms of this article and any other applicable regulations. Any infraction of the provisions of this article by failure to comply with any of its requirements, including infractions of conditions and safeguards established in connection with conditions of the permit, shall constitute a violation. Any person who violates this article or fails to comply with any of its requirements shall, upon conviction thereof, be fined no more than $250 or imprisoned for not more than 15 days, or both. Each day of noncompliance shall be considered a separate offense. Nothing herein contained shall prevent the Village of Sag Harbor from taking such other lawful action as necessary to prevent or remedy an infraction. Any structure found not compliant with the requirements of this article for which the developer and/or owner has not applied for and received an approved variance under § 300-16.6 will be declared noncompliant and notification sent to the Federal Emergency Management Agency."
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "Warning and disclaimer of liability. The degree of flood protection\nrequired by this article is considered reasonable for regulatory purposes\nand is based on scientific and engineering considerations. Larger\nfloods can and will occur on rare occasions. Flood heights may be\nincreased by man-made or natural causes. This article does not imply\nthat land outside the area of special flood hazards or uses permitted\nwithin such areas will be free from flooding or flood damages. This\narticle shall not create liability on the part of the Village of Sag\nHarbor, any officer or employee thereof, or the Federal Emergency\nManagement Agency for any flood damages that result from reliance\non this article or any administrative decision lawfully made thereunder."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 300-16.4",
			"title": "Administration.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Designation of the local administrator. The Building Inspector is\nhereby appointed local administrator to administer and implement this\narticle by granting or denying floodplain development permits in accordance\nwith its provisions."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "The floodplain development permit."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Purpose. A floodplain development permit is hereby established for all construction and other development to be undertaken in areas of special flood hazard in this community for the purpose of protecting its citizens from increased flood hazards and ensuring that new development is constructed in a manner that minimizes its exposure to flooding. It shall be unlawful to undertake any development in an area of special flood hazard, as shown on the Flood Insurance Rate Map enumerated in § 300-16.3B, without a valid floodplain development permit. Application for a permit shall be made on forms furnished by the local administrator and may include, but not be limited to, plans, in duplicate, drawn to scale and showing: the nature, location, dimensions, and elevations of the area in question; existing or proposed structures, fill, storage of materials, drainage facilities, and the location of the foregoing."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Fees. All applications for a floodplain development permit shall\nbe accompanied by an application fee. The application fee shall be\ndetermined by the Board of Trustees by resolution of the Board. In\naddition, the applicant shall be responsible for reimbursing the Village\nof Sag Harbor for any additional costs necessary for review, inspection\nand approval of this project. The local administrator may require\na deposit of no more than $500 to cover these additional costs."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Application for a permit. The applicant shall provide the following\ninformation, as appropriate. Additional information may be required\non the permit application form."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "The proposed elevation, in relation to mean sea level, of the\nlowest floor (including basement or cellar) of any new or substantially\nimproved structure to be located in Zone A1-A30, AE or AH, or Zone\nA if base flood elevation data is available. Upon completion of the\nlowest floor, the permittee shall submit to the local administrator\nthe as-built elevation, certified by a licensed professional engineer\nor surveyor."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "The proposed elevation, in relation to mean sea level, of the\nbottom of the lowest structural member of the lowest floor (excluding\npilings and columns) of any new or substantially improved structure\nto be located in Zone VI-V30 or VE, or Zone V if base flood elevation\ndata is available. Upon completion of the lowest floor, the permittee\nshall submit to the local administrator the as-built elevation, certified\nby a licensed professional engineer or surveyor."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "The proposed elevation, in relation to mean sea level, to which\nany new or substantially improved nonresidential structure will be\nfloodproofed. Upon completion of the floodproofed portion of the structure,\nthe permittee shall submit to the local administrator the as-built\nfloodproofed elevation, certified by a professional engineer or surveyor."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "A certificate from a licensed professional engineer or architect that any utility floodproofing will meet the criteria in § 300-16.5B(3), Utilities."
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "A certificate from a licensed professional engineer or architect that any nonresidential floodproofed structure will meet the floodproofing criteria in § 300-16.5E, Nonresidential structures."
												}
											]
										},
										{
											"number": "(6) ",
											"content": [
												{
													"text": "A description of the extent to which any watercourse will be altered or relocated as a result of proposed development. Computations by a licensed professional engineer must be submitted that demonstrate that the altered or relocated segment will provide equal or greater conveyance than the original stream segment. The applicant must submit any maps, computations or other material required by the Federal Emergency Management Agency (FEMA) to revise the documents enumerated in § 300-16.3B, when notified by the local administrator, and must pay any fees or other costs assessed by FEMA for this purpose. The applicant must also provide assurances that the conveyance capacity of the altered or relocated stream segment will be maintained."
												}
											]
										},
										{
											"number": "(7) ",
											"content": [
												{
													"text": "A technical analysis by a licensed professional engineer, if\nrequired by the local administrator, which shows whether proposed\ndevelopment to be located in an area of special flood hazard may result\nin physical damage to any other property."
												}
											]
										},
										{
											"number": "(8) ",
											"content": [
												{
													"text": "In Zone A, when no base flood elevation data is available from\nother sources, base flood elevation data shall be provided by the\npermit applicant for subdivision proposals and other proposed developments\n(including proposals for manufactured home and recreational vehicle\nparks and subdivisions) that are greater than either 50 lots or five\nacres."
												}
											]
										},
										{
											"number": "(9) ",
											"content": [
												{
													"text": "In Zones V1-V30 and VE, and also Zone V if base flood elevation\ndata is available, designs and specifications, certified by a licensed\nprofessional engineer or architect, for any breakaway walls in a proposed\nstructure with design strengths in excess of 20 pounds per square\nfoot."
												}
											]
										},
										{
											"number": "(10) ",
											"content": [
												{
													"text": "In Zones V1-V30 and VE, and also Zone V if base flood elevation\ndata is available, for all new and substantial improvements to structures,\nfloodplain development permit applications shall be accompanied by\ndesign plans and specifications, prepared in sufficient detail to\nenable independent review of the foundation support and connection\ncomponents. Said plans and specifications shall be developed or reviewed\nby a licensed professional engineer or architect and shall be accompanied\nby a statement, bearing the signature of the architect or engineer,\ncertifying that the design and methods of construction to be used\nare in accordance with accepted standards of practice and with all\napplicable provisions of this article."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "Duties and responsibilities of the local administrator. Duties of\nthe local administrator shall include, but not be limited to, the\nfollowing."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Permit application review. The local administrator shall conduct\nthe following permit application review before issuing a floodplain\ndevelopment permit:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "Review all applications for completeness, particularly with the requirements of § 300-16.4C, Application for a permit, and for compliance with the provisions and standards of this article."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "Review subdivision and other proposed new development, including manufactured home parks, to determine whether proposed building sites will be reasonably safe from flooding. If a proposed building site is located in an area of special flood hazard, all new construction and substantial improvements shall meet the applicable standards of § 300-16.5, Construction standards, and, in particular, § 300-16.5A(2) Subdivision proposals."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "Determine whether any proposed development in an area of special flood hazard may result in physical damage to any other property (e.g., stream bank erosion and increased flood velocities). The local administrator may require the applicant to submit additional technical analyses and data necessary to complete the determination. If the proposed development may result in physical damage to any other property or fails to meet the requirements of § 300-16.5, Construction standards, no permit shall be issued. The applicant may revise the application to include measures that mitigate or eliminate the adverse effects and resubmit the application."
																}
															]
														},
														{
															"number": "(d) ",
															"content": [
																{
																	"text": "Determine that all necessary permits have been received from\nthose governmental agencies from which approval is required by state\nor federal law."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Use of other flood data."
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "When the Federal Emergency Management Agency has designated areas of special flood hazard on the community's Flood Insurance Rate Map (FIRM) but has neither produced water surface elevation data (these areas are designated Zone A or V on the FIRM) nor identified a floodway, the local administrator shall obtain, review and reasonably utilize any base flood elevation and floodway data available from a federal, state or other source, including data developed pursuant to § 300-16.4C(7), as criteria for requiring that new construction, substantial improvements or other proposed development meet the requirements of this article."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "When base flood elevation data is not available, the local administrator\nmay use flood information from any other authoritative source, such\nas historical data, to establish flood elevations within the areas\nof special flood hazard for the purposes of this article."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Alteration of watercourses."
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "Notification to adjacent communities and the New York State\nDepartment of Environmental Conservation prior to permitting any alteration\nor relocation of a watercourse, and submittal of evidence of such\nnotification to the Regional Director, Region II, Federal Emergency\nManagement Agency."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "Determine that the permit holder has provided for maintenance\nwithin the altered or relocated portion of said watercourse so that\nthe flood-carrying capacity is not diminished."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "Construction stage."
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "In Zones A1-A30, AE and AH, and also Zone A if base flood elevation\ndata is available, upon placement of the lowest floor or completion\nof floodproofing of a new or substantially improved structure, obtain\nfrom the permit holder a certification of the as-built elevation of\nthe lowest floor or floodproofed elevation, in relation to mean sea\nlevel. The certificate shall be prepared by or under the direct supervision\nof a licensed land surveyor or professional engineer and certified\nby same. For manufactured homes, the permit holder shall submit the\ncertificate of elevation upon placement of the structure on the site.\nA certificate of elevation must also be submitted for a recreational\nvehicle if it remains on a site for 180 consecutive days or longer\n(unless it is fully licensed and ready for highway use)."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "In Zones V1-V30 and VE, and also Zone V if base flood elevation\ndata is available, upon placement of the lowest floor of a new or\nsubstantially improved structure, the permit holder shall submit to\nthe local administrator a certificate of elevation in relation to\nmean sea level of the bottom of the lowest structural member of the\nlowest floor (excluding pilings and columns). The certificate shall\nbe prepared by or under the direct supervision of a licensed land\nsurveyor or professional engineer and certified by same. For manufactured\nhomes, the permit holder shall submit the certificate of elevation\nupon placement of the structure on the site. An elevation certificate\nmust also be submitted for a recreational vehicle if it remains on\na site 180 consecutive days or longer (unless it is fully licensed\nand ready for highway use)."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "Any further work undertaken prior to submission and approval\nof the certification shall be at the permit holder's risk. The\nlocal administrator shall review all data submitted. Deficiencies\ndetected shall be cause to issue a stop-work order for the project\nunless immediately corrected."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "Inspections. The local administrator and/or the developer's\nengineer or architect shall make periodic inspections at appropriate\ntimes throughout the period of construction in order to monitor compliance\nwith permit conditions and enable said inspector to certify, if requested,\nthat the development is in compliance with the requirements of the\nfloodplain development permit and/or any variance provisions."
												}
											]
										},
										{
											"number": "(6) ",
											"content": [
												{
													"text": "Stop-work orders."
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "The local administrator shall issue or cause to be issued a stop-work order for any floodplain development found ongoing without a development permit. Disregard of a stop-work order shall subject the violator to the penalties described in § 300-16.3E of this article."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "The local administrator shall issue or cause to be issued a stop-work order for any floodplain development found noncompliant with the provisions of this article and/or the conditions of the development permit. Disregard of a stop-work order shall subject the violator to the penalties described in § 300-16.3E of this article."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(7) ",
											"content": [
												{
													"text": "Certificate of compliance."
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "In areas of special flood hazard, as determined by documents enumerated in § 300-16.3B, it shall be unlawful to occupy or to permit the use or occupancy of any building or premises, or both, or part thereof hereafter created, erected, changed, converted or wholly or partly altered or enlarged in its use or structure until a certificate of compliance has been issued by the local administrator stating that the building or land conforms to the requirements of this article."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "A certificate of compliance shall be issued by the local administrator\nupon satisfactory completion of all development in areas of special\nflood hazard."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "Issuance of the certificate shall be based upon the inspections conducted as prescribed in § 300-16.4D(5), Inspections, and/or any certified elevations, hydraulic data, floodproofing, anchoring requirements or encroachment analyses which may have been required as a condition of the approved permit."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(8) ",
											"content": [
												{
													"text": "Information to be retained. The local administrator shall retain\nand make available for inspection, copies of the following:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "Floodplain development permits and certificates of compliance;"
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "Certifications of as-built lowest floor elevations of structures, required pursuant to § 300-16.4D(4)(a) and (b), and whether or not the structures contain a basement;"
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "Floodproofing certificates required pursuant to § 300-16.4D(4)(a), and whether or not the structures contain a basement;"
																}
															]
														},
														{
															"number": "(d) ",
															"content": [
																{
																	"text": "Variances issued pursuant to § 300-16.6, Variance procedures; and"
																}
															]
														},
														{
															"number": "(e) ",
															"content": [
																{
																	"text": "Notices required under § 300-16.4D(3), Alteration of watercourses."
																}
															]
														}
													]
												}
											]
										}
									]
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 300-16.5",
			"title": "Construction standards.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "General standards. The following standards apply to new development, including new and substantially improved structures, in the areas of special flood hazard shown on the Flood Insurance Rate Map designated in § 300-16.3B."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Coastal high hazard areas. The following requirements apply\nwithin Zones V1-V30, VE and V:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "All new construction, including manufactured homes and recreational\nvehicles on site 180 days or longer and not fully licensed for highway\nuse, shall be located landward of the reach of high tide."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "The use of fill for structural support of buildings, manufactured\nhomes or recreational vehicles on site 180 days or longer is prohibited.\nMan-made alteration of sand dunes which would increase potential flood\ndamage is prohibited."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Subdivision proposals. The following standards apply to all\nnew subdivision proposals and other proposed development in areas\nof special flood hazard (including proposals for manufactured home\nand recreational vehicle parks and subdivisions):"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "Proposals shall be consistent with the need to minimize flood\ndamage;"
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "Public utilities and facilities such as sewer, gas, electrical\nand water systems shall be located and constructed so as to minimize\nflood damage; and"
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "Adequate drainage shall be provided to reduce exposure to flood\ndamage."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Encroachments."
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "Within Zones A1-A30 and AE, on streams without a regulatory\nfloodway, no new construction, substantial improvements or other development\n(including fill) shall be permitted unless:"
																},
																{
																	"content": [
																		{
																			"number": "[1] ",
																			"content": [
																				{
																					"text": "The applicant demonstrates that the cumulative\neffect of the proposed development, when combined with all other existing\nand anticipated development, will not increase the water surface elevation\nof the base flood more than one foot at any location; or"
																				}
																			]
																		},
																		{
																			"number": "[2] ",
																			"content": [
																				{
																					"text": "The Village of Sag Harbor agrees to apply to the\nFederal Emergency Management Agency (FEMA) for a conditional FIRM\nrevision, FEMA approval is received, and the applicant provides all\nnecessary data, analyses and mapping and reimburses the Village of\nSag Harbor for all fees and other costs in relation to the application.\nThe applicant must also provide all data, analyses and mapping and\nreimburse the Village of Sag Harbor for all costs related to the final\nmap revision."
																				}
																			]
																		}
																	]
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "On streams with a regulatory floodway, as shown on the Flood Boundary and Floodway Map or the Flood Insurance Rate Map adopted in § 300-16.3B, no new construction, substantial improvements or other development in the floodway (including fill) shall be permitted unless:"
																},
																{
																	"content": [
																		{
																			"number": "[1] ",
																			"content": [
																				{
																					"text": "A technical evaluation by a licensed professional\nengineer shows that such an encroachment shall not result in any increase\nin flood levels during occurrence of the base flood; or"
																				}
																			]
																		},
																		{
																			"number": "[2] ",
																			"content": [
																				{
																					"text": "The Village of Sag Harbor agrees to apply to the\nFederal Emergency Management Agency (FEMA) for a conditional FIRM\nand floodway revision, FEMA approval is received, and the applicant\nprovides all necessary data, analyses and mapping and reimburses the\nVillage of Sag Harbor for all fees and other costs in relation to\nthe application. The applicant must also provide all data, analyses\nand mapping and reimburse the Village of Sag Harbor for all costs\nrelated to the final map revisions."
																				}
																			]
																		}
																	]
																}
															]
														}
													]
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Standards for all structures."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Anchoring. New structures and substantial improvements to structures\nin areas of special flood hazard shall be anchored to prevent flotation,\ncollapse or lateral movement during the base flood. This requirement\nis in addition to applicable state and local anchoring requirements\nfor resisting wind forces."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Construction materials and methods."
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "New construction and substantial improvements to structures\nshall be constructed with materials and utility equipment resistant\nto flood damage."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "New construction and substantial improvements to structures\nshall be constructed using methods and practices that minimize flood\ndamage."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "For enclosed areas below the lowest floor of a structure within\nZones A1-A30, AE or AH, and also Zone A if base flood elevation data\nis available, new and substantially improved structures shall have\nfully enclosed areas below the lowest floor that are usable solely\nfor parking of vehicles, building access or storage in an area other\nthan a basement and which are subject to flooding designed to automatically\nequalize hydrostatic flood forces on exterior walls by allowing for\nthe entry and exit of floodwaters. Designs for meeting this requirement\nmust either be certified by a licensed professional engineer or architect\nor meet or exceed the following minimum criteria:"
																},
																{
																	"content": [
																		{
																			"number": "[1] ",
																			"content": [
																				{
																					"text": "A minimum of two openings having a total net area\nof not less than one square inch for every square foot of enclosed\narea subject to flooding."
																				}
																			]
																		},
																		{
																			"number": "[2] ",
																			"content": [
																				{
																					"text": "The bottom of all such openings no higher than\none foot above the lowest adjacent finished grade."
																				}
																			]
																		},
																		{
																			"number": "[3] ",
																			"content": [
																				{
																					"text": "Openings may be equipped with louvers, valves,\nscreens or other coverings or devices, provided they permit the automatic\nentry and exit of floodwaters. Enclosed areas subgrade on all sides\nare considered basements and are not permitted."
																				}
																			]
																		}
																	]
																}
															]
														},
														{
															"number": "(d) ",
															"content": [
																{
																	"text": "Within Zones V1-V30 and VE, and also within Zone V if base flood\nelevation data is available, new construction and substantial improvements\nshall have the space below the lowest floor either free from obstruction\nor constructed with nonsupporting breakaway walls, open wood latticework\nor insect screening intended to collapse under wind and water loads\nwithout causing collapse, displacement, or other structural damage\nto the elevated portion of the building or supporting foundation system.\nThe enclosed space below the lowest floor shall be used only for parking\nvehicles, building access or storage. Use of this space for human\nhabitation is expressly prohibited. The construction of stairs, stairwells\nand elevator shafts is subject to the design requirements for breakaway\nwalls."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Utilities."
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "New and replacement electrical equipment, heating, ventilating,\nair conditioning, plumbing connections, and other service equipment\nshall be located at or above the base flood elevation or be designed\nto prevent water from entering and accumulating within the components\nduring a flood and to resist hydrostatic and hydrodynamic loads and\nstresses. Electrical wiring and outlets, switches, junction boxes\nand panels shall be elevated to or above the base flood elevation\nunless they conform to the appropriate provisions of the electrical\npart of the Building Code of New York State or the Residential Code\nof New York State for location of such items in wet locations;"
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "New and replacement water supply systems shall be designed to\nminimize or eliminate infiltration of floodwaters into the system;"
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "New and replacement sanitary sewage systems shall be designed\nto minimize or eliminate infiltration of floodwaters. Sanitary sewer\nand storm drainage systems for buildings that have openings below\nthe base flood elevation shall be provided with automatic backflow\nvalves or other automatic backflow devices that are installed in each\ndischarge line passing through a building's exterior wall; and"
																}
															]
														},
														{
															"number": "(d) ",
															"content": [
																{
																	"text": "On-site waste disposal systems shall be located to avoid impairment\nto them or contamination from them during flooding."
																}
															]
														}
													]
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Residential structures (except coastal high hazard areas)."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Elevation. The following standards apply to new and substantially improved residential structures located in areas of special flood hazard, in addition to the requirements in Subsections A(2), Subdivision proposals, and A(3), Encroachments, and B, Standards for all structures."
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "Within Zones A1-A30, AE and AH, and also Zone A if base flood\nelevation data is available, new construction and substantial improvements\nshall have the lowest floor (including basement) elevated to or above\ntwo feet above the base flood elevation."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "Within Zone A, when no base flood elevation data is available,\nnew and substantially improved structures shall have the lowest floor\n(including basement) elevated at least three feet above the highest\nadjacent grade."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "Within Zone AO, new and substantially improved structures shall have the lowest floor (including basement) elevated above the highest adjacent grade at least as high as two feet above the depth number specified in feet on the community's Flood Insurance Rate Map enumerated in § 300-16.3B (at least two feet if no depth number is specified)."
																}
															]
														},
														{
															"number": "(d) ",
															"content": [
																{
																	"text": "Within Zones AH and AO, adequate drainage paths are required\nto guide floodwaters around and away from proposed structures on slopes."
																}
															]
														}
													]
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "Residential structures (coastal high hazard areas). The following standards, in addition to the standards in Subsections A(1), Coastal high hazard areas, and A(2), Subdivision proposals, and B, Standards for all structures, apply to new and substantially improved residential structures located in areas of special flood hazard shown as Zone V1-V30, VE or V on the community's Flood Insurance Rate Map designated in § 300-16.3B."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Elevation. New construction and substantial improvements shall\nbe elevated on pilings, columns or shear walls such that the bottom\nof the lowest horizontal structural member supporting the lowest elevated\nfloor (excluding columns, piles, diagonal bracing attached to the\npiles or columns, grade beams, pile caps and other members designed\nto either withstand storm action or break away without imparting damaging\nloads to the structure) is elevated to or above two feet above base\nflood elevation so as not to impede the flow of water."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Determination of loading forces. Structural design shall consider\nthe effects of wind and water loads acting simultaneously during the\nbase flood on all building components."
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "The structural design shall be adequate to resist water forces\nthat would occur during the base flood. Horizontal water loads considered\nshall include inertial and drag forces of waves, current drag forces,\nand impact forces from waterborne storm debris. Dynamic uplift loads\nshall also be considered if bulkheads, walls or other natural or man-made\nflow obstructions could cause wave run-up beyond the elevation of\nthe base flood."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "Buildings shall be designed and constructed to resist the forces\ndue to wind pressure. Wind forces on the superstructure include windward\nand leeward forces on vertical walls, uplift on the roof, internal\nforces when openings allow wind to enter the house, and upward force\non the underside of the house when it is exposed. In the design, the\nwind should be assumed to blow potentially from any lateral direction\nrelative to the house."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "Wind loading values used shall be those required by the Building\nCode.[1]"
																},
																{
																	"footnote": "[1]\nEditor's Note: See Ch. 92, Building Construction.\n"
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Foundation standards."
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "The pilings or column foundation and structure attached thereto\nshall be adequately anchored to resist flotation, collapse or lateral\nmovement due to the effects of wind and water pressures acting simultaneously\non all building components. Foundations must be designed to transfer\nsafely to the underlying soil all loads due to wind, water, dead load,\nlive load and other loads (including uplift due to wind and water)."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "Spread footings and fill material shall not be used for structural\nsupport of a new building or substantial improvement of an existing\nstructure."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "Pile foundation design."
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "The design ratio of pile spacing to pile diameter shall not\nbe less than 8:1 for individual piles (this shall not apply to pile\nclusters located below the design grade). The maximum center-to-center\nspacing of wood piles shall not be more than 12 feet on center under\nload-bearing sills, beams, or girders:"
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "Pilings shall have adequate soil penetration (bearing capacity)\nto resist the combined wave and wind loads (lateral and uplift) associated\nwith the base flood acting simultaneously with typical structure (live\nand dead) loads and shall include consideration of decreased resistance\ncapacity caused by erosion of soil strata surrounding the piles. The\nminimum penetration for foundation piles is to an elevation of five\nfeet below mean sea level (msl) datum if the BFE is +10 msl or less,\nor to be at least 10 feet below msl if the BFE is greater than +10\nmsl."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "Pile foundation analysis shall also include consideration of\npiles in column action from the bottom of the structure to the stable\nsoil elevation of the site. Pilings may be horizontally or diagonally\nbraced to withstand wind and water forces."
																}
															]
														},
														{
															"number": "(d) ",
															"content": [
																{
																	"text": "The minimum acceptable sizes for timber piles are a tip diameter\nof eight inches for round timber piles and eight inches by eight inches\nfor square timber piles. All wood piles must be treated in accordance\nwith requirements of EPEE-C3 to minimize decay and damage from fungus."
																}
															]
														},
														{
															"number": "(e) ",
															"content": [
																{
																	"text": "Reinforced concrete piles shall be cast of concrete having a\ntwenty-eight-day ultimate compressive strength of not less than 5,000\npounds per square inch and shall be reinforced with a minimum of four\nlongitudinal steel bars having a combined area of not less than 1%\nnor more than 4% of the gross concrete area. Reinforcing for precast\npiles shall have a concrete cover of not less than 1 1/4 inches\nfor No. 5 bars and smaller and not less than 1 1/2 inches for\nNo. 6 through No. 11 bars. Reinforcement for piles cast in the field\nshall have a concrete cover of not less than two inches."
																}
															]
														},
														{
															"number": "(f) ",
															"content": [
																{
																	"text": "Piles shall be driven by means of a pile driver or drop hammer,\njetted, or augered into place."
																}
															]
														},
														{
															"number": "(g) ",
															"content": [
																{
																	"text": "Additional support for piles in the form of bracing may include\nlateral or diagonal bracing between piles."
																}
															]
														},
														{
															"number": "(h) ",
															"content": [
																{
																	"text": "When necessary, piles shall be braced at the ground line in\nboth directions by a wood timber grade beam or a reinforced concrete\ngrade beam. These at-grade supports should be securely attached to\nthe piles to provide support even if scoured from beneath."
																}
															]
														},
														{
															"number": "(i) ",
															"content": [
																{
																	"text": "Diagonal bracing between piles, consisting of two-inch by eight-inch\n(minimum) members bolted to the piles, shall be limited in location\nto below the lowest supporting structural member and above the stable\nsoil elevation, and aligned in the vertical plane along pile rows\nperpendicular to the shoreline. Galvanized steel rods (minimum diameter\n1/2 inch) or cable-type bracing is permitted in any plane."
																}
															]
														},
														{
															"number": "(j) ",
															"content": [
																{
																	"text": "Knee braces, which stiffen both the upper portion of a pile\nand the beam-to-pile connection, may be used along pile rows perpendicular\nand parallel to the shoreline. Knee braces shall be two-by-eight lumber\nbolted to the sides of the pile/beam, or four-by-four or larger braces\nframed into the pile/beam. Bolting shall consist of two five-eighths-inch\ngalvanized steel bolts (each end) for two-by-two members, or one five-eighths-inch\nlag bolt (each end) for square members. Knee braces shall not extend\nmore than three feet below the elevation of the base flood."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "Column foundation design. Masonry piers or poured-in-place concrete\npiers shall be internally reinforced to resist vertical and lateral\nloads and be connected with a moment-resisting connection to a pile\ncap or pile shaft."
												}
											]
										},
										{
											"number": "(6) ",
											"content": [
												{
													"text": "Connectors and fasteners. Galvanized metal connectors, wood\nconnectors, or bolts of size and number adequate for the calculated\nloads must be used to connect adjoining components of a structure.\nToe nailing as a principal method of connection is not permitted.\nAll metal connectors and fasteners used in exposed locations shall\nbe steel, hot-dipped galvanized after fabrication. Connectors in protected\ninterior locations shall be fabricated from galvanized sheet."
												}
											]
										},
										{
											"number": "(7) ",
											"content": [
												{
													"text": "Beam-to-pile connections. The primary floor beams or girders\nshall span the supports in the direction parallel to the flow of potential\nfloodwater and wave action and shall be fastened to the columns or\npilings by bolting, with or without cover plates. Concrete members\nshall be connected by reinforcement, if cast in place, or (if precast)\nshall be securely connected by bolting and welding. If sills, beams,\nor girders are attached to wood piling at a notch, a minimum of two\nfive-eighths-inch galvanized steel bolts or two hot-dipped galvanized\nstraps 3/16 inch by four inches by 18 inches each bolted with two\none-half-inch lag bolts per beam member shall be used. Notching of\npile tops shall be the minimum sufficient to provide ledge support\nfor beam members without unduly weakening pile connections. Piling\nshall not be notched so that the cross section is reduced below 50%."
												}
											]
										},
										{
											"number": "(8) ",
											"content": [
												{
													"text": "Floor and deck connections."
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "Wood two- by four-inch (minimum) connectors or metal joist anchors\nshall be used to tie floor joists to floor beams/girders. These should\nbe installed on alternate floor joists, at a minimum. Cross bridging\nof all floor joists shall be provided. Such cross bridging may be\none- by three-inch members, placed eight feet on-center maximum, or\nsolid bridging of same depth as joist at same spacing."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "Plywood should be used for subflooring and attic flooring to\nprovide good torsional resistance in the horizontal plane of the structure.\nThe plywood should not be less than three-fourths-inch total thickness,\nand should be exterior grade and fastened to beams or joists with\n8d annular or spiral thread galvanized nails. Such fastening shall\nbe supplemented by the application of waterproof industrial adhesive\napplied to all bearing surfaces."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(9) ",
											"content": [
												{
													"text": "Exterior wall connections. All bottom plates shall have any\nrequired breaks under a wall stud or an anchor bolt. Approved anchors\nwill be used to secure rafters or joists and top and bottom plates\nto studs in exterior and bearing walls to form a continuous tie. Continuous\nplywood sheathing (15/32 inch or thicker) — overlapping the\ntop wall plate and continuing down to the sill, beam, or girder—may\nbe used to provide the continuous tie. If the sheets of plywood are\nnot vertically continuous, then two-by-four nailer blocking shall\nbe provided at all horizontal joints. In lieu of the plywood, galvanized\nsteel rods of one-half-inch diameter or galvanized steel straps not\nless than one inch wide by 1/16 inch thick may be used to connect\nfrom the top wall plate to the sill, beam or girder. Washers with\na minimum diameter of three inches shall be used at each end of the\none-half-inch round rods. These anchors shall be installed no more\nthan two feet from each corner rod no more than four feet on center."
												}
											]
										},
										{
											"number": "(10) ",
											"content": [
												{
													"text": "Ceiling joist/rafter connections. All ceiling joists or rafters\nshall be installed in such a manner that the joists provide a continuous\ntie across the rafters. Ceiling joists and rafters shall be securely\nfastened at their intersections. A metal or wood connector shall be\nused at alternate ceiling joist/rafter connections to the wall top\nplate. Gable roofs shall be additionally stabilized by installing\ntwo-by-four blocking on two-foot centers between the rafters at each\ngable end. Blocking shall be installed a minimum of eight feet toward\nthe house interior from each gable end."
												}
											]
										},
										{
											"number": "(11) ",
											"content": [
												{
													"text": "Projecting members. All cantilevers and other projecting members\nmust be adequately supported and braced to withstand wind and water\nuplift forces. Roof eave overhangs shall be limited to a maximum of\ntwo feet and joist overhangs to a maximum of one foot. Larger overhangs\nand porches will be permitted if designed or reviewed and certified\nby a registered professional engineer or architect."
												}
											]
										},
										{
											"number": "(12) ",
											"content": [
												{
													"text": "Roof sheathing."
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "Plywood or other wood material, when used as roof sheathing,\nshall not be less than 15/32 inch in thickness and shall be of exterior\nsheathing grade or equivalent. All attaching devices for sheathing\nand roof coverings shall be galvanized or be of other suitable corrosion-resistant\nmaterial."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "All corners, gable ends, and roof overhangs exceeding six inches\nshall be reinforced by the application of waterproof industrial adhesive\napplied to all bearing surfaces of any plywood sheet used in the sheathing\nof such corner, gable end, or roof overhang."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "In addition, roofs should be sloped as steeply as practicable\nto reduce uplift pressures, and special care should be used in securing\nridges, hips, valleys, eaves, vents, chimneys, and other points of\ndiscontinuity in the roofing surface."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(13) ",
											"content": [
												{
													"text": "Protection of openings. All exterior glass panels, windows and\ndoors shall be designed, detailed and constructed to withstand loads\ndue to the design wind speed of 75 miles per hour. Connections for\nthese elements must be designed to transfer safely the design loads\nto the supporting structure. Panel widths of multiple-panel sliding\nglass doors shall not exceed three feet."
												}
											]
										},
										{
											"number": "(14) ",
											"content": [
												{
													"text": "Breakaway wall design standards."
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "The breakaway wall shall have a design safe loading resistance\nof not less than 10 and not more than 20 pounds per square foot, with\nthe criterion that the safety of the overall structure at the point\nof wall failure be confirmed using established procedures. Grade beams\nshall be installed in both directions for all piles considered to\ncarry the breakaway wall load. Knee braces are required for front\nrow piles that support breakaway walls."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "Use of breakaway wall strengths in excess of 20 pounds per square\nfoot shall not be permitted unless a registered professional engineer\nor architect has developed or reviewed the structural design and specifications\nfor the building foundation and breakaway wall components, and certifies\nthat: 1) the breakaway walls will fail under water loads less than\nthose that would occur during the base flood; and 2) the elevated\nportion of the building and supporting foundation system will not\nbe subject to collapse, displacement or other structural damage due\nto the effects of wind and water loads acting simultaneously on all\nbuilding components (structural and nonstructural). Water loading\nvalues used shall be those associated with the base flood. Wind loading\nvalues shall be those required by the Building Code."
																}
															]
														}
													]
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "Nonresidential structures (except coastal high hazard areas). The following standards apply to new and substantially improved commercial, industrial and other nonresidential structures located in areas of special flood hazard, in addition to the requirements in Subsections A(2), Subdivision proposals, A(3), Encroachments, and B, Standards for all structures."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Within Zones A1-A30, AE and AH, and also Zone A if base flood\nelevation data is available, new construction and substantial improvements\nof any nonresidential structure, together with attendant utility and\nsanitary facilities, shall either:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "Have the lowest floor, including basement or cellar, elevated\nto or above two feet above the base flood elevation; or"
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "Be floodproofed so that the structure is watertight below two\nfeet above the base flood elevation with walls substantially impermeable\nto the passage of water. All structural components located below the\nbase flood elevation must be capable of resisting hydrostatic and\nhydrodynamic loads and the effects of buoyancy."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Within Zone AO, new construction and substantial improvements\nof nonresidential structures shall:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "Have the lowest floor (including basement) elevated above the\nhighest adjacent grade at least as high as two feet above the depth\nnumber specified in feet on the community's FIRM (at least two\nfeet if no depth number is specified); or"
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "Together with attendant utility and sanitary facilities, be completely floodproofed to that level to meet the floodproofing standard specified in § 300-16.5B(3)."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "If the structure is to be floodproofed, a licensed professional engineer or architect shall develop and/or review structural design, specifications, and plans for construction. A floodproofing certificate or other certification shall be provided to the local administrator that certifies the design and methods of construction are in accordance with accepted standards of practice for meeting the provisions of § 300-16.5E(1)(b), including the specific elevation (in relation to mean sea level) to which the structure is to be floodproofed."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "Within Zones AH and AO, adequate drainage paths are required\nto guide floodwaters around and away from proposed structures on slopes."
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "Within Zone A, when no base flood elevation data is available,\nthe lowest floor (including basement) shall be elevated at least three\nfeet above the highest adjacent grade."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "F. ",
							"content": [
								{
									"text": "Nonresidential structures (coastal high hazard areas). In Zones V1-V30,\nVE, and also Zone V if base flood elevations are available, new construction\nand substantial improvements of any nonresidential structure, together\nwith attendant utility and sanitary facilities, shall have the bottom\nof the lowest member of the lowest floor elevated to or above two\nfeet above the base flood elevation. Floodproofing of structures is\nnot an allowable alternative to elevating the lowest floor to two\nfeet above the base flood elevation in Zones V1-V30, VE and V."
								}
							]
						},
						{
							"number": "G. ",
							"content": [
								{
									"text": "Manufactured homes and recreational vehicles. The following standards in addition to the standards in Subsections A, General standards, and B, Standards for all structures, apply, as indicated, in areas of special flood hazard to manufactured homes and to recreational vehicles which are located in areas of special flood hazard."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Recreational vehicles."
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "Recreational vehicles placed on sites within Zones A1-A30, AE,\nAH, V1-V30, V, and VE shall either:"
																},
																{
																	"content": [
																		{
																			"number": "[1] ",
																			"content": [
																				{
																					"text": "Be on site fewer than 180 consecutive days;"
																				}
																			]
																		},
																		{
																			"number": "[2] ",
																			"content": [
																				{
																					"text": "Be fully licensed and ready for highway use; or"
																				}
																			]
																		},
																		{
																			"number": "[3] ",
																			"content": [
																				{
																					"text": "Meet the requirements for manufactured homes in § 300-16.5G(2), (3) and (4) below."
																				}
																			]
																		}
																	]
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "A recreational vehicle is ready for highway use if it is on\nits wheels or jacking system, is attached to the site only by quick-disconnect-type\nutilities and security devices and has no permanently attached additions."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "A manufactured home that is placed or substantially improved\nin Zones A1-A30, AE, AH, V1-V30, V, and VE shall be elevated on a\npermanent foundation such that the lowest floor is elevated to or\nabove two feet above the base flood elevation and is securely anchored\nto an adequately anchored foundation system to resist flotation, collapse\nand lateral movement. Elevation on piers consisting of dry stacked\nblocks is prohibited."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Within Zones A or V, when no base flood elevation data is available,\nnew and substantially improved manufactured homes shall be elevated\nsuch that the manufactured home chassis is supported by reinforced\npiers or other foundation elements of at least equivalent strength\nthat are no less than 36 inches in height above grade and are securely\nanchored to an adequately anchored foundation system to resist flotation,\ncollapse or lateral movement. Elevation on piers consisting of dry\nstacked blocks is prohibited."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "Within Zone AO, the floor shall be elevated above the highest adjacent grade at least as high as the depth number specified on the Flood Insurance Rate Map enumerated in § 300-16.3B (at least two feet if no depth number is specified). Elevation on piers consisting of dry stacked blocks is prohibited."
												}
											]
										}
									]
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 300-16.6",
			"title": "Variance procedure.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Appeals board."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "The Board of Zoning Appeals, as established by the Village of\nSag Harbor Board of Trustees, shall hear and decide appeals and requests\nfor variances from the requirements of this article."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "The Board of Zoning Appeals shall hear and decide appeals when\nit is alleged there is an error in any requirement, decision or determination\nmade by the local administrator in the enforcement or administration\nof this article."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Those aggrieved by the decision of the Board of Zoning Appeals\nmay appeal such decision to the Supreme Court pursuant to Article\n78 of the Civil Practice Law and Rules."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "In passing upon such applications, the Board of Zoning Appeals\nshall consider all technical evaluations, all relevant factors, standards\nspecified in other sections of this article, and:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "The danger that materials may be swept onto other lands to the\ninjury of others;"
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "The danger to life and property due to flooding or erosion damage;"
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "The susceptibility of the proposed facility and its contents\nto flood damage and the effect of such damage on the individual owner;"
																}
															]
														},
														{
															"number": "(d) ",
															"content": [
																{
																	"text": "The importance of the services provided by the proposed facility\nto the community;"
																}
															]
														},
														{
															"number": "(e) ",
															"content": [
																{
																	"text": "The necessity to the facility of a waterfront location, where\napplicable;"
																}
															]
														},
														{
															"number": "(f) ",
															"content": [
																{
																	"text": "The availability of alternative locations for the proposed use\nwhich are not subject to flooding or erosion damage;"
																}
															]
														},
														{
															"number": "(g) ",
															"content": [
																{
																	"text": "The compatibility of the proposed use with existing and anticipated\ndevelopment;"
																}
															]
														},
														{
															"number": "(h) ",
															"content": [
																{
																	"text": "The relationship of the proposed use to the Comprehensive Plan\nand floodplain management program of that area;"
																}
															]
														},
														{
															"number": "(i) ",
															"content": [
																{
																	"text": "The safety of access to the property in times of flood for ordinary\nand emergency vehicles;"
																}
															]
														},
														{
															"number": "(j) ",
															"content": [
																{
																	"text": "The costs to local governments and the dangers associated with\nconducting search and rescue operations during periods of flooding;"
																}
															]
														},
														{
															"number": "(k) ",
															"content": [
																{
																	"text": "The expected heights, velocity, duration, rate of rise and sediment\ntransport of the floodwaters and the effects of wave action, if applicable,\nexpected at the site; and"
																}
															]
														},
														{
															"number": "(l) ",
															"content": [
																{
																	"text": "The costs of providing governmental services during and after\nflood conditions, including search and rescue operations, maintenance\nand repair of public utilities and facilities such as sewer, gas,\nelectrical, and water systems and streets and bridges."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "Upon consideration of the factors of § 300-16.6A(4) and the purposes of this article, the Board of Zoning Appeals may attach such conditions to the granting of variances as it deems necessary to further the purposes of this article."
												}
											]
										},
										{
											"number": "(6) ",
											"content": [
												{
													"text": "The local administrator shall maintain the records of all appeal\nactions including technical information and report any variances to\nthe Federal Emergency Management Agency upon request."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Conditions for variances."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Generally, variances may be issued for new construction and substantial improvements to be erected on a lot of 1/2 acre or less in size contiguous to and surrounded by lots with existing structures constructed below the base flood elevation, providing items in § 300-16.6A(4)(a) through (l) have been fully considered. As the lot size increases beyond the 1/2 acre, the technical justification required for issuing the variance increases."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Variances may be issued for the repair or rehabilitation of\nhistoric structures upon determination that:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "The proposed repair or rehabilitation will not preclude the\nstructure's continued designation as a historic structure; and"
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "The variance is the minimum necessary to preserve the historic\ncharacter and design of the structure."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Variances may be issued by a community for new construction\nand substantial improvements and for other development necessary for\nthe conduct of a functionally dependent use, provided that:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "The criteria of Subsection B(1), (4), (5), and (6) of this section are met; and"
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "The structure or other development is protected by methods that\nminimize flood damages during the base flood and create no additional\nthreat to public safety."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "Variances shall not be issued within any designated floodway\nif any increase in flood levels during the base flood discharge would\nresult."
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "Variances shall only be issued upon a determination that the\nvariance is the minimum necessary, considering the flood hazard, to\nafford relief."
												}
											]
										},
										{
											"number": "(6) ",
											"content": [
												{
													"text": "Variances shall only be issued upon receiving written justification\nof:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "A showing of good and sufficient cause;"
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "A determination that failure to grant the variance would result\nin exceptional hardship to the applicant; and"
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "A determination that the granting of a variance will not result\nin increased flood heights, additional threats to public safety, extraordinary\npublic expense, create nuisances, cause fraud on or victimization\nof the public or conflict with existing local laws or ordinances."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(7) ",
											"content": [
												{
													"text": "Any applicant to whom a variance is granted for a building with\nthe lowest floor below the base flood elevation shall be given written\nnotice over the signature of a community official that the cost of\nflood insurance will be commensurate with the increased risk resulting\nfrom lowest floor elevation."
												}
											]
										}
									]
								}
							]
						}
					]
				}
			]
		}
	]
}