{
	"url": "http://ecode360.com/6982320",
	"paras": [
		{
			"paragraph": "§ 150-23",
			"title": "Applicable regulations.",
			"content": [
				{
					"text": "In a Residence C District, the following regulations\nof this article shall apply."
				}
			]
		},
		{
			"paragraph": "§ 150-24",
			"title": "Permitted uses.",
			"content": [
				{
					"text": "No building shall be erected, altered or used\nand no lot or premises shall be used except for one or more of the\npurposes permitted in a Residence B District."
				}
			]
		},
		{
			"paragraph": "§ 150-25",
			"title": "Height restrictions.",
			"content": [
				{
					"text": "The maximum height of any building or any part\nthereof shall be 28 feet in the case of a gable, hip or gambrel roof,\nor 25 feet in the case of all other roofs, or 2 1/2 stories,\nwhichever is less. No principal building shall be raised and no principal\nbuilding or any part thereof shall be erected or altered which has\na height of less than one story or 20 feet, whichever is less."
				}
			]
		},
		{
			"paragraph": "§ 150-26",
			"title": "Size of lot.",
			"content": [
				{
					"text": "No building shall hereafter be erected or altered\non a lot of less area than 12,000 square feet, nor shall a building\nhereafter be erected or altered unless such lot shall have a frontage\nof not less than 100 feet on at least one street, except that in the\ncase of a corner lot, such lot shall have a frontage of not less than\n100 feet on at least two streets. Any lot smaller in area or with\nless frontage than in this section required, of which the ownership\nat the date of adoption of this section differs from the ownership\nof all adjoining lots, may be improved as herein permitted, provided\nthat the minimum yard areas hereafter required are provided."
				}
			]
		},
		{
			"paragraph": "§ 150-27",
			"title": "Rear yards.",
			"content": [
				{
					"text": "Every building hereafter erected or altered\nshall have a rear yard of a minimum depth of 20 feet."
				}
			]
		},
		{
			"paragraph": "§ 150-28",
			"title": "Front yards.",
			"content": [
				{
					"text": "No building shall hereafter be erected or altered\nwhich shall have its front wall nearer to the street line than 20\nfeet. In case of a corner lot, a front yard shall be required on each\nstreet upon which the lot abuts. The interior angles formed by the\nintersection of the lot's lines with the street line shall not be\nless than 75° for the street lines to the front yard setback line\nor lines."
				}
			]
		},
		{
			"paragraph": "§ 150-29",
			"title": "Side yards.",
			"content": [
				{
					"text": "Two side yards shall be provided on every lot,\neach having a minimum width of at least 15 feet, provided that in\nthe case of a lot of a width of less than 100 feet, of which the ownership\nat the date of the adoption of this section differs from the ownership\nof all adjoining lots, the side yards may be of less width when authorized\nby a special exception by the Board of Appeals as hereinafter provided."
				}
			]
		},
		{
			"paragraph": "§ 150-30",
			"title": "Habitable floor area.",
			"content": [
				{
					"text": "No main dwelling shall be erected unless it\nhas habitable floor area of 1,600 square feet."
				}
			]
		},
		{
			"paragraph": "§ 150-30.1",
			"title": "Front height/setback ratio.",
			"content": [
				{
					"text": "The maximum building height to front yard setback\nratio shall be 1.050."
				}
			]
		},
		{
			"paragraph": "§ 150-30.2",
			"title": "Side height/setback ratio.",
			"content": [
				{
					"text": "The maximum building height to side yard setback\nratio shall be 1.400."
				}
			]
		},
		{
			"paragraph": "§ 150-30.3",
			"title": "Maximum floor area.",
			"content": [
				{
					"text": "The maximum permitted floor area shall be calculated\nbased upon the following table:"
				}
			]
		},
		{
			"paragraph": "§ 150-39",
			"title": "Lot coverage; impervious site coverage; accessory buildings or structures.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "The areas occupied by all buildings and structures\nand accessory uses which extend above the grade of the property shall\nnot exceed the following percentage of the lot area in the indicated\ndistrict:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Residence 2A, Residence 1A, Residence A and Residence\nB: 15%."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Residence C and Residence D: 20%."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "The maximum permitted impervious site coverage shall\nbe calculated based upon the following table:"
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Where the area of all lawful buildings, structures, uses or impervious site coverage exceeds the maximum area permitted to be occupied pursuant to Subsection A or B of this section, none of such buildings, structures, uses or impervious site coverage shall thereafter be altered or enlarged in height, depth or width."
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "The following shall be considered accessory uses,\nbuildings or structures for the purposes of this section; tennis courts\nor similar facilities, paddle tennis courts, swimming pools, garages,\ngreenhouses, playhouses, garden houses, toolhouses. stables, barns,\nsolar energy collectors and studios and television, radio or other\nreception facilities located on the ground. For the purposes of this\nsection, a deck having a maximum height less than three feet above\nthe finished grade, determined as the finished grade without retaining\nwalls or other nonnatural support, shall not be considered to extend\nabove the grade, and a deck having a maximum height of three or more\nfeet above the finished grade, determined as the finished grade without\nretaining walls or other nonnatural support, shall be considered to\nextend above the grade."
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "Accessory buildings and structures not greater than\n100 square feet in floor area and not more than 10 feet in height\nmeasured to the highest point of the building or structure shall be\nlocated not closer than 1/3 of the side yard and rear yard dimensions\napplicable in the district in which the lot is located. Accessory\nbuildings and structures are not permitted in a front yard.[Amended 7-24-2006 by L.L. No. 3-2006]"
								}
							]
						},
						{
							"number": "F. ",
							"content": [
								{
									"text": "Individual accessory buildings and structures greater\nthan 100 square feet in ground floor area or greater than 10 feet\nin height shall meet the following requirements:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Accessory buildings and structures permitted under\nthis section shall comply with the front, rear and side yard requirements\nspecified for the district in which the lot is located and shall be\nlimited in height to a maximum of 18 feet, measured to the highest\npoint of the building or structure."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "The ground floor of an individual accessory building\nor structure permitted under this section shall not exceed 5% of the\narea of the lot on which the accessory building or structure is located."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "The construction of accessory buildings or structures\nover 2,000 square feet in ground floor area shall not be permitted\nwithout a permit from the Zoning Board of Appeals."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "G. ",
							"content": [
								{
									"text": "Private recreational courts. Notwithstanding any other\nprovision of this chapter, a recreational court with an impervious\nhard and/or prepared surface, such as, but not limited to, tennis\ncourts, volleyball courts, and basketball courts, shall be permitted\nas accessory to a single-family residential use, with a special permit\nfrom the Board of Appeals, provided that the location of the court\ncomplies with all applicable setback requirements, all applicable\nlot coverage requirements, and the other provisions of this chapter.\nIn addition to the foregoing conditions, a private recreational court\nshall comply with the following requirements:[Amended 7-28-2003 by L.L. No. 2-2003]"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "The lot or premises upon which the court or facility\nis located shall have a minimum area of 40,000 square feet."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "The maximum lot coverage of a court or other such\nfacility and any structure accessory thereto, including impervious\nsurfaces, shall not exceed 8,000 square feet in the aggregate."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "(Reserved)"
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "(Reserved)"
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "No private recreational court or facility may be constructed,\nmaintained or used within the Village for rent, lease or any commercial\npurpose."
												}
											]
										},
										{
											"number": "(6) ",
											"content": [
												{
													"text": "Construction and maintenance of platform or deck tennis\ncourts or facilities is prohibited on private residential properties\nwithin the Village."
												}
											]
										},
										{
											"number": "(7) ",
											"content": [
												{
													"text": "No private recreational court, including the fence\nenclosing it, shall be built or maintained in a front yard nor within\n20 feet of a rear or side lot line."
												}
											]
										},
										{
											"number": "(8) ",
											"content": [
												{
													"text": "All private recreational courts shall be completely\nenclosed with a chain link fence, which shall be constructed and maintained\nin accordance with the following specifications, so long as the court\nremains in existence:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "Height: not less than 10 feet nor more than\n12 feet above the playing surface."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "Fabric: not less than nine-gauge steel having\na uniform square mesh with two inches between parallel sides. The\nmesh shall have a green plastic coating."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "End and comer posts: 2 1/2 inches ID galvanized\npipe with a wall thickness of 0.203 of an inch."
																}
															]
														},
														{
															"number": "(d) ",
															"content": [
																{
																	"text": "Line posts: two inches ID galvanized pipe with\na wall thickness of 0.154 of an inch."
																}
															]
														},
														{
															"number": "(e) ",
															"content": [
																{
																	"text": "Horizontal lines: three horizontal rails running\nbetween the vertical posts situated at the top, center and bottom\nof the chain link fabric. These rails shall be 1 1/4 inches ID\ngalvanized pipe having a wall thickness of 0.14 of an inch."
																}
															]
														},
														{
															"number": "(f) ",
															"content": [
																{
																	"text": "Distance between posts: not more than 10 feet."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(9) ",
											"content": [
												{
													"text": "All private recreational courts and the fencing surrounding\nthem shall be completely screened from adjoining properties by a living\nscreen of coniferous trees. Said trees shall be at least four feet\nin height when planted and shall be planted five feet on center between\nthe fence surrounding the court and the lot lines of the lot on which\nthe court is located, on all sides of the court not facing the dwelling."
												}
											]
										},
										{
											"number": "(10) ",
											"content": [
												{
													"text": "The height of the playing surface of the private\nrecreational court shall not be above the existing mean level of the\nground immediately surrounding the court area in its natural state\nprior to construction of the court."
												}
											]
										},
										{
											"number": "(11) ",
											"content": [
												{
													"text": "No private recreational court shall be constructed\nor maintained so as to permit any drainage water to flow onto adjacent\nproperties or public streets."
												}
											]
										},
										{
											"number": "(12) ",
											"content": [
												{
													"text": "(Reserved)"
												}
											]
										},
										{
											"number": "(13) ",
											"content": [
												{
													"text": "No sound equipment may be installed or used\nin connection with any private recreational court or the use thereof.\nIf so permitted by the Board of Appeals, such court may be lit, provided\nthat no such lighting shall cast light or reflected light onto adjacent\nproperty. Unless otherwise permitted by the Board of Appeals, no such\ncourt shall be used or operated except between the hours of 9:00 a.m.\nand dusk on the same day."
												}
											]
										},
										{
											"number": "(14) ",
											"content": [
												{
													"text": "Building permits and certificates of occupancy\nfor private recreational courts must be obtained from the Building\nInspector in accordance with the provisions of the Building Code of\nthe Village of Woodsburgh."
												}
											]
										}
									]
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 150-39.1",
			"title": "Certain activities in front yards.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "No owner or occupant of property in the Village, and\nno other person, shall engage in or permit any of the following activities\nto occur or take place in the front yard of any property in the Village:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Installation, placement or maintenance of a\nbarbecue, or other cooking facility or equipment, whether permanent\nor portable;"
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Installation, placement or maintenance of tables,\nincluding picnic tables or other similar facilities, whether permanent\nor portable;"
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Installation, placement or maintenance of any\ntent, or other similar structure or enclosure, whether permanent or\ntemporary in nature;"
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "Cooking, or consumption of food or drink by\nmore than three persons."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Notwithstanding the foregoing, any one or more of\nthe foregoing activities may be conducted on a temporary basis with\na permit from the Board of Trustees (which may be granted without\na public hearing) in the case of a special event, provided that no\nsuch permit shall be valid for more than 10 consecutive days, and\nno such permit shall be granted more often than once per year for\nany property. For the purposes of this section only, in the case of\na corner lot, the term \"front yard\" shall mean the yard in front of\nthat portion of the dwelling where the front door of the dwelling\nis located."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 150-40",
			"title": "Projections from buildings.",
			"content": [
				{
					"text": "No building or part of a building shall be erected\nin or shall project into a rear yard, front yard or side yard, with\nthe following exceptions:"
				},
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Cornices, eaves, gutters, chimneys or flues projecting\nnot more than 18 inches or windowsills, belt courses or other ornamental\nfeatures projecting not more than four inches."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "In any district, one-story bay windows projecting\nnot more than 18 inches.[Amended 4-16-1960]"
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "A private garage accessory to the principal use or building situated upon the same lot may be constructed within the side yard or rear yard, subject to the restrictions contained in Articles II, III, IV and V and §§ 150-41 and 150-54 hereof."
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "Accessory buildings other than private garages may\nbe erected within the rear yard, provided that no such accessory building\nshall have a height of more than 18 feet, and it shall further comply\nwith all rear, front and side yard regulations applicable to the residence\ndistrict in which the accessory building is located.[Amended 4-16-1960]"
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 150-41",
			"title": "Lots in more than one district.",
			"content": [
				{
					"text": "In the case of a lot situated partly in two\nor more districts, no principal building, use or establishment shall\nbe constructed, altered or maintained thereon except in conformity\nwith the regulations applying to the most highly restricted district\nin which such building, use or establishment or any part thereof is\nsituated; and no accessory building, use or establishment shall be\nconstructed, altered or maintained unless the principal building use\nor establishment to which it is accessory is one permitted in the\ndistrict in which such accessory building, use or establishment is\nsituated."
				}
			]
		},
		{
			"paragraph": "§ 150-42",
			"title": "Water bodies to be included in districts.",
			"content": [
				{
					"text": "Building zone districts include all ponds, streams\nand waterways adjacent thereto, whether or not so designated upon\nthe Building Zone Map, including lands under water and lands hereafter\nformed by filling accretion, emergence, avulsion or otherwise. In\ncase a pond, stream or waterway, as shown on said map, forms the boundary\nbetween two or more districts of the same class, the district shall\nbe considered as continuous. In case a pond, stream or waterway, as\nshown on said map, forms the boundary between two or more districts\nof different classes, each district shall be deemed to extend to the\ncenter of the pond or the thread of the stream or waterway, as the\ncase may be."
				}
			]
		},
		{
			"paragraph": "§ 150-43",
			"title": "Existing construction.",
			"content": [
				{
					"text": "Nothing herein contained shall require any change\nin the plans of buildings, construction of which has proceeded above\nthe level of the cellar throughout 50% or more of its area at the\ntime of the passage of this chapter and the construction of which\nshall be diligently prosecuted within a year of the date of the passage\nhereof and the ground-story framework of which, including the second\ntier of beams, shall be completed within such year and which entire\nbuilding shall have been completed within two years of the date of\nthe passage of this chapter."
				}
			]
		},
		{
			"paragraph": "§ 150-43.1",
			"title": "Nonconforming uses and structures.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "As used in this section, the following terms shall\nhave the meanings indicated:"
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Any legal nonconforming use or legal nonconforming\nstructure in the Village of Woodsburgh may continue to exist and to\nbe used and maintained. Notwithstanding the foregoing, no such structure\nshall be altered, enlarged or otherwise reconstructed or replaced\nexcept in conformity with the laws of the Village of Woodsburgh in\neffect at the time of such alteration, enlargement, reconstruction\nor replacement Notwithstanding the foregoing, no such use may be altered,\nenlarged, located, relocated or otherwise moved or transferred to\nany part of property on which such use was not in existence or use\nat the time of enactment of any zoning law of the Village of Woodsburgh\nwhich made such use a legal nonconforming use."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "No use or structure in the village may be used or\noccupied or maintained for any purpose unless said use or structure\nconforms to the village laws or is a legal nonconforming use or structure."
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "In the event that any legal nonconforming use or legal\nnonconforming structure is abandoned or such use or structure is not\nused or occupied or continued for a period of 12 consecutive months,\nthe legal nonconforming status of such use or structure shall be deemed\nto have been abandoned, and thereafter such use or structure shall\nnot be used or occupied except in conformity with the then-existing\nlaws of the village."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 150-44",
			"title": "Restorations.",
			"content": [
				{
					"text": "Nothing in this chapter shall prevent the restoration of a building destroyed by fire, explosion, act of God or act of a public enemy, to the extent of not more than 50% of its value, or prevent the continuance of the use of such building or part thereof as such use existed at the time of such destruction in such building or part thereof or prevent a change of such existing use under the limitation provided by § 150-46B, but any building destroyed in the manner aforesaid to an extent exceeding 50% of its value at the time of such destruction may be reconstructed and thereafter used only in such manner as to conform to all the provisions of this chapter. Nothing in this chapter shall prevent the restoration of a wall declared unsafe."
				}
			]
		},
		{
			"paragraph": "§ 150-45",
			"title": "Public streets.",
			"content": [
				{
					"text": "For the purpose of computing the building area,\nthe size of the lot, the rear yards, front yards and side yards, any\nproposed street or streets shown on any official map or plan of the\nvillage or any amendment or modification thereof now or hereafter\nduly adopted by the Planning Board or Planning Commission or Board\nof Trustees of the Village of Woodsburgh, Inc., shall be considered\na public street with the same force and effect as if the same had\nbeen duly opened and improved and made available for public use; provided,\nhowever, that upon the dedication of any such street or streets or\nany part thereof, the Board of Trustees may, in its resolution accepting\nsuch dedication, provide that the area of the street or part thereof\nso dedicated may be included in computing the building area, the size\nof lot and the depth of the yard abutting thereon under any application\nsubmitted within five years after the date of such resolution for\nthe construction, alteration or use of a building or other structure\nupon the lot or lots of which the street or part thereof so dedicated\nformed a part."
				}
			]
		},
		{
			"paragraph": "§ 150-46",
			"title": "Apartment houses.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "No apartment house shall be used or altered and no\napplication shall be made for a building permit to alter an apartment\nhouse which shall have or be designated to have:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "An exterior clothesline or clothespole or other device\nfor drying or airing clothes, laundry, bedding or draperies."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Any side or rear wall or facade of a design or appearance\nor color substantially differing from that of the front wall or facade."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "An exposed water tank."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "An exposed shed or structure for the housing of elevator\nor other machinery."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "No apartment house shall be altered or used and no\napplication shall be made for a building permit for the alteration\nof an apartment house unless:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "The exterior design and appearance thereof shall be\nin harmony with the apartment houses, if any, previously constructed\nor authorized to be constructed upon the lot or lots adjacent thereto."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "The plans and specifications thereof shall have been\nexamined and approved as to type, design and exterior appearance and\nunless the plans and specifications for the disposal of sewage from\nsuch apartment house shall have been previously examined and approved\nas to type, design and adequacy by an architect or engineer appointed\nfor the purpose by the Board of Trustees of the Village of Woodsburgh,\nInc. The approval or disapproval of such architect or engineer shall\nbe final and binding for all purposes unless reversed or modified\non appeal by the Board of Appeals."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "The sewage from such apartment house shall be conveyed\nto and a connection made with a street sewer or a combined street\nstormwater drain and sewer."
												}
											]
										}
									]
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 150-47",
			"title": "Swimming pools.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Definitions. As used in this section, the following\nterms shall have the meanings indicated:[Amended 9-24-1984 by L.L. No. 3-1984; 11-25-1991 by L.L. No.\n3-1991]"
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "No swimming pool shall be constructed or erected unless\na permit for the same shall have been issued by the Board of Appeals\nof the Village of Woodsburgh. An application for such permit shall\nbe accompanied by plot, site and building plans of such pool showing\ndimensions, design, location and use of all structures, equipment,\ndrainage, sanitary filtration, water supply and disposal facilities,\nfencing, covering of pool and such other information as may be required\nby said Board.[Amended 1-9-1992 by L.L. No. 2-1992; 11-26-2002 by L.L. No.\n2-2002]"
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "No swimming pool in a residential area shall be constructed\nor maintained above the ground or upon any deck or platform."
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "Notwithstanding any other provisions contained in\nthe Building Zone Ordinance of the Village of Woodsburgh, every swimming\npool hereafter constructed, modified or altered shall be enclosed\nby a fence of such type as may be approved by the Building Inspector\nof the Village of Woodsburgh, which conforms to all applicable legal\nrequirements, and which does not exceed the minimum height required\nby law for such fences. Said fence is to be properly screened with\nshrubs and plants located outside the fence, and such fence shall\nbe located at least four feet from the pool.[Amended 1-9-2006 by L.L. No. 1-2006]"
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "Every swimming pool or hot tub heretofore or hereafter\nconstructed or maintained shall be completely drained when not in\nregular use or shall be covered by a cover of such construction as\nto sustain the weight of an average adult individual. The cover is\nto be properly and securely anchored around the perimeter of the pool\nor hot tub.[Added 9-24-1984 by L.L. No. 3-1984]"
								}
							]
						},
						{
							"number": "F. ",
							"content": [
								{
									"text": "Should the owner abandon a swimming pool, he/she shall\nfill in or remove the excavation or depression and restore the surface\nof the ground to its original grade and approximately the same condition\nas before the pool was installed, and he/she shall further notify\nthe Building Inspector of the village of the abandonment so that an\ninspection of the site may be made."
								}
							]
						},
						{
							"number": "G. ",
							"content": [
								{
									"text": "(Reserved)[1]"
								},
								{
									"footnote": "[1]\nEditor's Note: Former Subsection G, concerning\nthe drainage of swimming pools and hot tubs, added 9-24-1984 by L.L.\nNo. 3-1984, was repealed 9-15-1992 by L.L. No. 5-1992.\n"
								}
							]
						},
						{
							"number": "H. ",
							"content": [
								{
									"text": "No swimming pool shall be built or maintained except\nin a rear yard as defined by the Building Zone Ordinance of the village.\nThe pool, including the fences surrounding it and the foundation for\nthe purifying apparatus, if any, shall be located not less than 25\nfeet from the rear lot line and not less than 25 feet from the side\nproperty lines of the premises or, in the case of a corner lot, not\nless than 25 feet from any property line along an abutting street."
								}
							]
						},
						{
							"number": "I. ",
							"content": [
								{
									"text": "For the purpose of computing the building area, the\nfence along the side of a swimming pool, the base for the spring-board\nor diving platform and the foundation for the purifying apparatus,\nif any, shall be included.[Amended 9-19-1988 by L.L. No. 5-1988]"
								}
							]
						},
						{
							"number": "J. ",
							"content": [
								{
									"text": "The bacterial standards established by the provisions\nof the New York State Sanitary Code relating to public swimming pools\nshall be maintained either by chemical treatment or filtration."
								}
							]
						},
						{
							"number": "K. ",
							"content": [
								{
									"text": "No permission shall be granted for the installation\nof any swimming pool until the owner of the premises has filed a certification\nby a professional engineer licensed by the State of New York that\nthe drainage of such pool is adequate and will not interfere with\nthe public water supply system, with existing sanitary facilities\nor with public highways. Plans and specifications must be submitted\nby a professional engineer or registered architect licensed by the\nState of New York, and a fee as set by resolution of the Board of\nTrustees from time to time must be paid to the Clerk of the village\nat the time of filing plans. The fee to be paid upon each annual renewal\nshall be as set by resolution of the Board of Trustees from time to\ntime.[2][Amended 12-11-1989 by L.L. No. 25-1989]"
								},
								{
									"footnote": "[2]\nEditor's Note: The fees provided for in this\nsection are included on the schedule of fees on file in the office\nof the Village Clerk.\n"
								}
							]
						},
						{
							"number": "L. ",
							"content": [
								{
									"text": "All gates, latches, locks, pumps, plumbing, piping\nand any and all other parts of and accessories to a swimming pool\nwithin the village shall be continuously maintained in good order\nand proper repair. The Building Inspector shall be empowered to enforce\nthe regulations herein set forth and to compel the removal of any\nswimming pool that fails to meet the requirements of this chapter."
								}
							]
						},
						{
							"number": "M. ",
							"content": [
								{
									"text": "The pool or any auxiliary apparatus or equipment or\nother device used in connection therewith shall be used in such a\nmanner as not to cause disturbance or annoyance to other residents\nof the village. No loudspeaker devices shall be permitted to be used\non or near the pool or in connection with the use of the pool. The\npool shall be lighted by underwater lighting only, and the balance\nof the pool area shall be lighted only with nonglaring lights."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 150-48",
			"title": "Places of worship and schools.",
			"content": [
				{
					"text": "In addition to the regulations and requirements\nelsewhere contained in the laws of the Village of Woodsburgh, all\nchurches and other places of worship, schools and structures accessory\nthereto hereafter erected or altered shall comply with the following\nrequirements, and no lot or premises on which such a use is situated\nshall be used except in compliance with such requirements:"
				},
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Height. No such building or use, except a building\ndevoted exclusively to public worship, shall have a height of more\nthan two stories or 30 feet above the curb level of the lot."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Building area. No such building, together with its\naccessory structures, shall occupy in the aggregate more than 25%\nof the area of the lot."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Size of lot. No such building or use shall be permitted\non a lot having an area of less than 80,000 square feet."
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "Rear yard. Every such building shall have a rear yard\nof a minimum depth of 50 feet. No accessory structure shall be built\nin the rear yard closer than 50 feet to the rear property line."
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "Front yards. Every such building shall have a front\nyard of a minimum depth of 75 feet. No accessory structure or use\nis permitted in the front yard."
								}
							]
						},
						{
							"number": "F. ",
							"content": [
								{
									"text": "Side yards. The side yard of every such building shall\nhave a minimum width of 50 feet. No accessory structure is permitted\nin the side yard."
								}
							]
						},
						{
							"number": "G. ",
							"content": [
								{
									"text": "Minimum street frontage. No such building or use shall\nbe permitted on a lot having a street frontage of less than 150 feet.\nIn the case of a lot adjoining more than one street, the frontage\non each street shall be not less than 150 feet."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 150-49",
			"title": "Off-street parking.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "No building shall be hereafter erected, altered or\nadded to for use as a place of worship or as a school or for purposes\nincidental thereto unless off-street parking on the premises shall\nbe provided for to the extent of the greater of either:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Not less than one parking space for each five permanent\nseats in such building or for each part of the total area within such\nbuilding or structure as is or may be made available for five permanent\nor temporary seats; or"
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Two hundred square feet for each 100 square feet of\nfloor area in the building."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "As used in this section, the following terms shall\nhave the meanings indicated:"
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Said off-street parking area shall be constructed\nwith not less than four inches of crushed rock compacted or other\nsuitable material as approved by the Village Engineer and penetrated\nwith asphalt material not less than two inches bituminous wearing\ncourse compacted."
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "Each parking area must be provided with adequate facility\nfor drainage. Such drainage shall not drain into village roads or\nvillage draining system but shall be self-contained and constructed\nin a manner to be approved by the Village Engineer."
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "In no case shall any parking space required by this\nsection be located in the front yard or in the required setback areas\nof the side and rear yards as defined in the Building Zone Ordinance."
								}
							]
						},
						{
							"number": "F. ",
							"content": [
								{
									"text": "All parking spaces required by this section shall\nbe maintained in good condition and have adequate means of ingress\nand egress as approved by the Building Inspector of the Village of\nWoodsburgh."
								}
							]
						},
						{
							"number": "G. ",
							"content": [
								{
									"text": "Notwithstanding any other provisions contained in\nthe Building Zone Ordinance of the Village of Woodsburgh, every parking\narea heretofore or hereafter constructed or maintained shall be enclosed\nwith a good quality solid sapling fence, six feet in height, with\nthe finished side facing the property lines and entirely enclosing\nthe parking area, with the exception of the parts used for ingress\nand egress. Said fence is to be properly landscaped and screened with\nshrubs and plants to be situated on the outside of the fence."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 150-50",
			"title": "Fences.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "No fence or wall shall hereafter be erected or installed\nin the Village unless and until a permit for the same has been issued\nby the Building Official. No permit shall be issued for the erection\nof any fence or wall unless a survey, drawings and specifications\nshall first have been approved by the Building Official. No permit\nshall be required for the repair or replacement of a lawfully existing\nfence, or any portion thereof, where the repair or replacement is\nin kind, without the addition of new materials and without the extension,\nalteration or expansion of the fence or any part thereof, so long\nas the repair or replacement does not exceed 50% of the existing surface\narea of the fence.[Amended 9-27-2004 by L.L. No. 3-2004]"
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Except as otherwise provided by law with respect to\na fence erected or installed in connection with a swimming pool, no\nfence or wall in excess of four feet in height, as measured from the\nnatural grade adjacent to such fence or wall, shall be permitted.\nThis provision shall not apply to the repair or replacement in kind\nof an existing fence or wall, provided that the height of such existing\nfence or wall is not increased."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "No fence or wall shall be erected or installed within\nfive feet of a front property line. Where a fence, or any portion\nthereof, is otherwise permitted to be located in a front yard, the\nportion of the fence which is located generally parallel to the front\nproperty line shall not exceed 50% of the linear dimension of the\nfront property line(s).[Amended 11-22-2004 by L.L. No. 4-2004]"
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "All fences and walls shall be made of first-class\nmaterials and shall be constructed and installed in the best workmanlike\nmanner known to the trade. All fences and walls shall be sturdy, plumb,\nlevel and true. Fences may be constructed of wood, masonry, metals,\nPVC plastic, or combinations thereof, or such other materials as may\nbe satisfactory to the Board of Trustees (which determination may\nbe made without a public hearing). All metal fences shall have a protective\ncoating, and those fences of a style or type of construction known\nas \"chain link\" or \"cyclone\" shall comply with the specifications\nof the Chain Link Manufacturers' Institute. All wood fences shall\nhave wood posts spaced not more than 12 feet apart. That portion of\nany fence, or its support structure, embedded in the ground shall\nbe either of nonrotting materials or shall be treated in a manner\nto prevent or minimize rotting. Horizontal rails shall be securely\nfastened to the posts and shall be of sufficient strength to span\nthe distance between the posts. Masonry fences or walls shall be set\non a concrete footing at a depth not less than 18 inches into the\nground.[Amended 6-25-2001 by L.L. No. 3-2001[2]]"
								},
								{
									"footnote": "[2]\nEditor's Note: With the adoption of this local\nlaw, the Board of Trustees passed a resolution stating that the purpose\nof this legislation is to permit a wider variety of materials to be\nused for fences and to require that open fences constructed of chain\nlink have adequate exterior landscaping to the end that unsightly\nappearance may be eliminated or mitigated.\n"
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "All fences shall be properly maintained, and all gates\nand latches shall be maintained in good working order."
								}
							]
						},
						{
							"number": "F. ",
							"content": [
								{
									"text": "All fences shall be constructed so that the finished\nside shall face the adjoining premises, or the street, as the case\nmay be. In addition, all fences of any type deemed by the Building\nOfficial to be other than an \"open fence\" (except that such term shall\nnot include a chain-link fence) shall be located a distance from the\nproperty line sufficient to permit appropriate landscaping to be placed\nand maintained on the property of the applicant, and between the fence\nand the property line, to screen the view of the fence from off the\nproperty on which it is located. The plan for such required landscaping\nshall be submitted to the Building Official with the permit application,\nand the installation and continued maintenance of such landscaping\nshall be a condition of any permit issued for such fence, whether\nor not stated in such permit. Where an applicant for a permit can\ndemonstrate to the Building Official that it is impractical to install\nor maintain such landscaping by reason of the proximity of an existing\nfence on an adjoining property, the Building Official may issue a\npermit for erection or installation of the fence without requiring\nthe installation and maintenance of landscaping, provided, however,\nthat any such permit shall in such event be issued on the condition,\nwhether or not expressly stated in the permit, that in the event that\nthe fence on the adjoining property is removed, or ceases to exist\nas a functional fence, the permit applicant, or the successor in interest\nof such applicant, will install and maintain appropriate screen landscaping\nas approved or directed by the Building Official.[Amended 6-25-2001 by L.L. No. 3-2001][3]"
								},
								{
									"footnote": "[3]\nEditor's Note: See also the footnote regarding this local law which accompanies § 150-50D.\n"
								}
							]
						}
					]
				},
				{
					"footnote": "[1]\nEditor's Note: According to this local law,\nits purpose is to add regulations regarding fences that are not of\nan open design. The Board of Trustees intends to regulate the setback\nof such fences so that landscaping can and must be installed and maintained\nto screen the view of the fence from adjoining properties, except\nin cases in which the fence faces another fence on an adjoining property\nmaking it impractical or unfeasible to install and maintain landscaping\nbetween the fences.\n"
				}
			]
		},
		{
			"paragraph": "§ 150-50.1",
			"title": "Signs.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Definition. As used in this chapter, the term \"sign\"\nshall mean and refer to any object, device, display or structure,\nor part thereof, situated outdoors or indoors, which is used on a\ntemporary or permanent basis to advertise, identify, display, direct\nor attract attention to an object, person, institution, organization,\nbusiness, product, service, event or location by any means, including\nwords, letters, figures, design, symbols, movement, sound, fixtures,\ncolors, illumination or projected images. The term \"sign\" shall also\ninclude any text, symbol, lights, marks, letters or figures painted\nor otherwise displayed on or incorporated in the composition of the\nexterior facing of a building or structure. The term \"sign\" shall\nnot include a national or state flag having a surface area on any\nside not in excess of 20 square feet nor any object, device, display\nor structure, or part thereof, erected or installed by lawful direction\nof a governmental entity or agency."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "No sign shall be erected or maintained on any building\nor premises in the Village of Woodsburgh, except as follows:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Not more than one real estate sign, advertising\nthe sale or rental of the premises on which such sign is maintained."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Not more than one sign for the purposes of identifying\nthe name, address, occupant and permitted nonresidential use of the\npremises on which such sign is located, which sign shall not have\na vertical dimension or horizontal dimension greater than one foot."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Signs promoting or opposing the candidacy of\nany person for public office or expressing a point of view concerning\na public issue or an election. Such signs may be displayed or maintained\nfor no more than 45 days within any four-month period, unless a permit\nis obtained from the Board of Trustees. Any such permit may be granted\nby said Board subject to reasonable restrictions and conditions as\nto the size, location, time and duration, place and manner of display\nof such signs."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "Not more than three signs indicating that the\nsubject premises are protected by a security system, or security service,\nprovided that no such sign shall exceed one square foot in area."
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "Such other signs as the village is required\nby law to permit, provided that no such sign shall be erected, constructed\nor maintained without the prior permission of the Board of Trustees.\nSuch permission may be granted subject to reasonable restrictions\nand conditions as to the size, location, time and duration, place\nand manner of display of such signs."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Notwithstanding any other provision of this section,\nno sign shall be erected or maintained on any building or premises\nto advertise any commercial or business activity or enterprise which\nis not conducted at such premises. This prohibition shall include\nthe indication or display of the name, address or telephone number,\nor other identifying information, as to or about any person, firm\nor entity having a role or interest with respect to any construction\nor repair work, or other similar activity, which is, will be or has\nbeen conducted on the premises, if such person, firm or entity does\nnot have a lawful regular place of business at the premises."
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "Except as otherwise provided in this section:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "The total area of all signs permitted on any\npremises shall not exceed six square feet."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "The area of any individual sign shall not exceed\nthree square feet."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "No sign shall be located in a side or rear yard.\nNotwithstanding any other provision of this chapter, a sign permitted\nby this section may be located in a front yard, provided that such\nsign is located at least 15 feet from every property boundary line."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "No sign shall be illuminated nor contain any\nmoving parts nor emit any sound audible beyond the boundaries of the\nproperty on which it is located."
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "No part of any sign or its support structure\nshall exceed six feet in height above the unaltered grade of the ground\nadjacent to such sign."
												}
											]
										}
									]
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 150-50.2",
			"title": "Air-conditioning units.",
			"content": [
				{
					"text": "Notwithstanding any other provision of this\nchapter, no air conditioning unit or equipment shall be located in\na front yard, or within 15 feet of a property line in the side yard\nor rear yard of any property; provided, however, that where the minimum\nrequired side or rear yard setback for any property is 18 feet or\nless, no such unit or equipment shall be located closer to the property\nline than 4.5 feet less than the required minimum setback. No air-conditioning\ncompressor unit or similar equipment may be installed or relocated\non or after the effective date of this section unless the unit or\nequipment is sufficiently screened from neighboring properties by\nnatural plantings, of a species, height and separation approved by\nthe Code Official, or other appropriate barrier approved by the Code\nOfficial, for that purpose and to reduce the noise effect of such\nunit or equipment neighboring property, and such natural plantings\nor barrier shall be maintained in good condition at all times so long\nas such unit or equipment remains on the property."
				},
				{
					"footnote": "[1]\nEditor's Note: With the adoption of this local\nlaw, the Board of Trustees passed a resolution stating that the purpose\nof this legislation is to enact minimum setback requirements for adequate\nscreening for such equipment, to the end that noise and unsightly\nappearance may be eliminated or mitigated.\n"
				}
			]
		},
		{
			"paragraph": "§ 150-51",
			"title": "Siting of wireless communications towers and antennas.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Purpose. The purpose of this section is to establish general guidelines for the siting of wireless communications towers and antennas. The goals of this section are to protect residential areas and land uses from potential adverse impacts of towers and antennas; encourage the location of towers in nonresidential areas; minimize the total number of towers throughout the community; strongly encourage the joint use of new and existing tower sites as a primary option rather than construction of additional single-use towers; encourage users of towers and antennas to configure them in a way that minimizes the adverse visual impact of the towers and antennas through careful design, siting, landscape screening and innovative camouflaging techniques; enhance the ability of the providers of telecommunications services to provide such services to the community quickly, effectively and efficiently; consider the public health and safety of communication towers; and avoid potential damage to adjacent properties from tower failure through engineering and careful siting of tower structures. In furtherance of these goals, the village shall give due consideration to the village's Comprehensive Plan, Zoning Map, existing land uses and environmentally sensitive areas in approving sites for the location of towers and antennas."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Definitions. As used in this section, the following\nterms shall have the meanings set forth below:"
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Applicability."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "New towers and antennas. All new towers or antennas in the Village of Woodsburgh shall be subject to these regulations, except as provided in Subsections C(2) through (5), inclusive."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Amateur radio station operators and receive-only antennas.\nThis section shall not apply to any tower, or the installation of\nany antenna, that is under 40 feet in height and is owned and operated\nby a federally licensed amateur radio station operator or is used\nexclusively for receive-only antennas."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Preexisting towers or antennas. Preexisting towers and preexisting antennas shall not be required to meet the requirements of this section, other than the requirements of Subsections D(6) and (7)."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "AM array. For purposes of implementing this section,\nan AM array, consisting of one or more tower units and supporting\nground system which functions as one AM broadcasting antenna, shall\nbe considered one tower. Measurements for setbacks and separation\ndistances shall be measured from the outer perimeter of the towers\nincluded in the AM array. Additional tower units may be added within\nthe perimeter of the AM array by right."
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "Television reception and satellite reception only\nantennas. Notwithstanding any other provision of this section, antennas\nextending not more than four feet in height above the building or\nstructure upon which they are located, and used only for reception\nof television signals, and antennas used only for the purposes of\nreceiving satellite signal transmissions, and having a diameter not\nmore than two meters when located in a business district, or not more\nthan one meter in diameter when located in a residential or multifamily\nresidential district, are not subject to regulation pursuant to this\nsection, and do not require a building permit, provided that such\nantenna is located on the roof of a principal building or within a\nbuilding."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "General requirements."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Principal or accessory use. Antennas and towers may\nbe considered either principal or accessory uses. A different existing\nuse of an existing structure on the same lot shall not preclude the\ninstallation of an antenna or tower on such lot."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Lot size. For purposes of determining whether the\ninstallation of a tower or antenna complies with district development\nregulations, including but not limited to setback requirements, lot\ncoverage requirements and other such requirements, the dimensions\nof the entire lot shall control, even though the antennas or towers\nmay be located on leased parcels within such lot."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Inventory of existing sites. Each applicant for an\nantenna and/or tower shall provide to the Building Official an inventory\nof its existing towers, antennas or sites approved for towers or antennas\nthat are either within the jurisdiction of the village or within one\nmile of the border thereof, including specific information about the\nlocation, height and design of each tower. The Building Official may\nshare such information with other applicants applying for administrative\napprovals or special use permits under this section or other organizations\nseeking to locate antennas within the jurisdiction of the village;\nprovided, however that the Building Official is not, by sharing such\ninformation, in any way representing or warranting that such sites\nare available or suitable."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "Aesthetics. Towers and antennas shall meet the following\nrequirements:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "Towers shall either maintain a galvanized steel\nfinish or, subject to any applicable standards of the FAA, be painted\na neutral color so as to reduce visual obtrusiveness."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "At a tower site, the design of the buildings\nand related structures shall, to the extent possible, use materials,\ncolors, textures, screening and landscaping that will blend them into\nthe natural setting and surrounding buildings."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "If an antenna is installed on a structure other\nthan a tower, the antenna and supporting electrical and mechanical\nequipment must be of a neutral color that is identical to or closely\ncompatible with the color of the supporting structure so as to make\nthe antenna and related equipment as visually unobtrusive as possible."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "Lighting. Towers shall not be artificially lighted\nunless required by the FAA or other applicable authority. If lighting\nis required, the lighting alternatives and design chosen must cause\nthe least disturbance to the surrounding views."
												}
											]
										},
										{
											"number": "(6) ",
											"content": [
												{
													"text": "State or federal requirements. All towers must meet\nor exceed current standards and regulations of the FAA, the FCC and\nany other agency of the state or federal government with the authority\nto regulate towers and antennas. If such standards and regulations\nare changed, then the owners of the towers and antennas governed by\nthis section shall bring such towers and antennas into compliance\nwith such revised standards and regulations within six months of the\neffective date of such standards and regulations, unless a different\ncompliance schedule is mandated by the controlling state or federal\nagency. Failure to bring towers and antennas into compliance with\nsuch revised standards and regulations shall constitute grounds for\nthe removal of the tower or antenna at the owner's expense."
												}
											]
										},
										{
											"number": "(7) ",
											"content": [
												{
													"text": "Building codes; safety standards. To ensure the structural\nintegrity of towers, the owner of a tower shall ensure that it is\nmaintained in compliance with standards contained in applicable state\nor local building codes and the applicable standards for towers that\nare published by the Electronic Industries Association, as amended\nfrom time to time. If, upon inspection, the Building Official concludes\nthat a tower fails to comply with such codes and standards and constitutes\na danger to persons or property, then upon notice being provided to\nthe owner of the tower, the owner shall have 30 days to bring such\ntower into compliance with such standards. Failure to bring such tower\ninto compliance within said 30 days shall constitute grounds for the\nremoval of the tower or antenna at the owner's expense."
												}
											]
										},
										{
											"number": "(8) ",
											"content": [
												{
													"text": "Measurement. For purposes of measurement, tower setbacks\nand separation distances shall be calculated and applied to facilities\nlocated in the village irrespective of municipal and county jurisdictional\nboundaries."
												}
											]
										},
										{
											"number": "(9) ",
											"content": [
												{
													"text": "Not essential services. Towers and antennas shall\nbe regulated and permitted pursuant to this section and shall not\nbe regulated or permitted as essential services, public utilities\nor private utilities."
												}
											]
										},
										{
											"number": "(10) ",
											"content": [
												{
													"text": "Franchises, owners and/or operators of towers\nor antennas shall certify that all franchises required by law for\nthe construction and/or operation of a wireless communication system\nin the village have been obtained and shall file a copy of all required\nfranchises with the Building Official."
												}
											]
										},
										{
											"number": "(11) ",
											"content": [
												{
													"text": "Public notice. For purposes of this section, any special use request, variance request or appeal of an administratively approved use or special use shall require public notice to all abutting property owners and all property owners of properties that are located within the corresponding separation distance listed in Subsection G(2)(e)[2], Table 2, in addition to any notice otherwise required by the Village Code for such applications."
												}
											]
										},
										{
											"number": "(12) ",
											"content": [
												{
													"text": "Signs. No signs shall be allowed on an antenna\nor tower."
												}
											]
										},
										{
											"number": "(13) ",
											"content": [
												{
													"text": "Buildings and support equipment. Buildings and support equipment associated with antennas or towers shall comply with the requirements of Subsection H of this section."
												}
											]
										},
										{
											"number": "(14) ",
											"content": [
												{
													"text": "Multiple antenna/tower plan. The village encourages\nthe users of towers and antennas to submit a single application for\napproval of multiple towers and/or antenna sites. Applications for\napproval of multiple sites shall be given priority in the review process."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "Permitted uses."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "General. The uses listed in this subsection as permitted\nuses shall not require any approval from the village."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Permitted uses. The following uses are specifically\npermitted:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "Antennas or towers located on property owned,\nleased or otherwise controlled by the village, provided a license\nor lease authorizing such antenna or tower has been approved by the\nvillage."
																}
															]
														}
													]
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "F. ",
							"content": [
								{
									"text": "Administratively approved uses."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "General. The following provisions shall govern the\nissuance of administrative approvals for towers and antennas."
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "The Building Official may administratively approve\nthe uses listed in this subsection."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "Each applicant for administrative approval shall apply to the Building Official by providing the information set forth in Subsection G(2)(a) and (c) of this section and a nonrefundable fee as established by resolution of the Board of Trustees to reimburse the village for the costs of reviewing the application."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "The Building Official shall review the application for administrative approval and determine if the proposed use complies with Subsections D and G(2)(d) and (e) of this section."
																}
															]
														},
														{
															"number": "(d) ",
															"content": [
																{
																	"text": "The Building Official shall respond to each\nsuch application within 60 days after receiving it by either approving\nor denying the application. If the Building Official fails to respond\nto the applicant within said 60 days, then the application shall be\ndeemed to be approved."
																}
															]
														},
														{
															"number": "(e) ",
															"content": [
																{
																	"text": "In connection with any such administrative approval, the Building Official may, in order to encourage shared use, administratively waive any zoning district setback requirements in Subsection G(2)(d) or separation distances between towers in Subsection G(2)(e) by up to 50%."
																}
															]
														},
														{
															"number": "(f) ",
															"content": [
																{
																	"text": "In connection with any such administrative approval,\nthe Building Official may, in order to encourage the use of monopoles,\nadministratively allow the reconstruction of an existing tower to\nmonopole construction."
																}
															]
														},
														{
															"number": "(g) ",
															"content": [
																{
																	"text": "If an administrative approval is denied, the applicant shall file an application for a special use permit pursuant to Subsection G prior to filing any appeal that may be available under the Zoning Code."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "List of administratively approved uses. The following\nuses may be approved by the Building Official after conducting an\nadministrative review:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "Locating a tower or antenna, including the placement\nof additional buildings or other supporting equipment used in connection\nwith said tower or antenna, in a residential district, provided that\nsaid antenna or tower complies with all applicable yard and setback\nrequirements, and is for the exclusive use of the owner or residential\noccupant of the property."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "(Reserved)"
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "(Reserved)"
																}
															]
														},
														{
															"number": "(d) ",
															"content": [
																{
																	"text": "(Reserved)"
																}
															]
														},
														{
															"number": "(e) ",
															"content": [
																{
																	"text": "Installing a cable microcell network through\nthe use of multiple low-powered transmitters/receivers attached to\nexisting wireline systems, such as conventional cable or telephone\nwires, or similar technology that does not require the use of towers."
																}
															]
														}
													]
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "G. ",
							"content": [
								{
									"text": "Special use permits."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "General. The following provisions shall govern the\nissuance of special use permits for towers or antennas by the Board\nof Trustees."
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "If the tower or antenna is not a permitted use under Subsection E of this section or permitted to be approved administratively pursuant to Subsection F of this section, then a special use permit from the Board of Trustees shall be required for the construction of a tower or the placement of an antenna in all zoning districts."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "Applications for special use permits under this\nsubsection shall be subject to the procedures and requirements of\nthis chapter generally applicable to special use permit applications,\nexcept as modified in this subsection."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "In granting a special use permit, the Board\nof Trustees may impose conditions to the extent the Board of Trustees\nconcludes such conditions are necessary to minimize any adverse effect\nof the proposed tower on adjoining properties."
																}
															]
														},
														{
															"number": "(d) ",
															"content": [
																{
																	"text": "Any information of an engineering nature that\nthe applicant submits, whether civil, mechanical or electrical, shall\nbe certified by a licensed professional engineer."
																}
															]
														},
														{
															"number": "(e) ",
															"content": [
																{
																	"text": "An applicant for a special use permit shall\nsubmit the information described in this subsection and a nonrefundable\nfee as established by resolution of the Board of Trustees to reimburse\nthe village for the costs of reviewing the application."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Towers."
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "Information required. In addition to any information\nrequired for applications for special use permits pursuant to this\nchapter, applicants for a special use permit for a tower shall submit\nthe following information:"
																},
																{
																	"content": [
																		{
																			"number": "[1] ",
																			"content": [
																				{
																					"text": "A scaled site plan clearly indicating the location, type and height of the proposed tower, on-site land uses and zoning, adjacent land uses and zoning (including when adjacent to other municipalities), zoning classification of the site and all properties within the applicable separation distances set forth in Subsection G(2)(e), adjacent roadways, proposed means of access, setbacks from property lines, elevation drawings of the proposed tower and any other structures, topography, parking and other information deemed by the Building Official to be necessary to assess compliance with this section."
																				}
																			]
																		},
																		{
																			"number": "[2] ",
																			"content": [
																				{
																					"text": "Legal description of the parent tract and leased\nparcel (if applicable)."
																				}
																			]
																		},
																		{
																			"number": "[3] ",
																			"content": [
																				{
																					"text": "The setback distance between the proposed tower\nand the nearest residential unit, and all adjoining properties."
																				}
																			]
																		},
																		{
																			"number": "[4] ",
																			"content": [
																				{
																					"text": "The separation distance from other towers described in the inventory of existing sites submitted pursuant to Subsection D(3) shall be shown on an updated site plan or map. The applicant shall also identify the type of construction of the existing tower(s) and the owner/operator of the existing tower(s), if known."
																				}
																			]
																		},
																		{
																			"number": "[5] ",
																			"content": [
																				{
																					"text": "A landscape plan showing specific landscape\nmaterials."
																				}
																			]
																		},
																		{
																			"number": "[6] ",
																			"content": [
																				{
																					"text": "Method of fencing and finished color and, if\napplicable, the method of camouflage and illumination."
																				}
																			]
																		},
																		{
																			"number": "[7] ",
																			"content": [
																				{
																					"text": "A description of compliance with Subsections D(3), (4), (5), (6), (7), (10), (12) and (13) and G(2)(d) and (e) and all applicable federal, state or local laws, rules or regulations."
																				}
																			]
																		},
																		{
																			"number": "[8] ",
																			"content": [
																				{
																					"text": "A notarized statement by the applicant as to\nwhether construction of the tower will accommodate collocation of\nadditional antennas for future users."
																				}
																			]
																		},
																		{
																			"number": "[9] ",
																			"content": [
																				{
																					"text": "Identification of the entities providing the\nbackhaul network for the tower(s) described in the application and\nother cellular sites owned or operated by the applicant in the municipality."
																				}
																			]
																		},
																		{
																			"number": "[10] ",
																			"content": [
																				{
																					"text": "A description of the suitability of the use\nof existing towers, other structures or alternative technology not\nrequiring the use of towers or structures to provide the services\nto be provided through the use of the proposed new tower."
																				}
																			]
																		},
																		{
																			"number": "[11] ",
																			"content": [
																				{
																					"text": "A description of the feasible locations of future\ntowers or antennas within the village based upon existing physical,\nengineering, technological or geographical limitations in the event\nthat the proposed tower is erected."
																				}
																			]
																		}
																	]
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "Factors considered in granting special use permits\nfor towers. In addition to any standards for consideration of special\nuse permit applications pursuant to this chapter, the Board of Trustees\nshall consider the following factors in determining whether to issue\na special use permit, although the Board of Trustees may waive or\nreduce the burden on the applicant of one or more of these criteria\nif the Board of Trustees concludes that the goals of this section\nare better served thereby:"
																},
																{
																	"content": [
																		{
																			"number": "[1] ",
																			"content": [
																				{
																					"text": "The height of the proposed tower."
																				}
																			]
																		},
																		{
																			"number": "[2] ",
																			"content": [
																				{
																					"text": "The proximity of the tower to residential structures\nand residential district boundaries."
																				}
																			]
																		},
																		{
																			"number": "[3] ",
																			"content": [
																				{
																					"text": "The nature of uses on adjacent and nearby properties."
																				}
																			]
																		},
																		{
																			"number": "[4] ",
																			"content": [
																				{
																					"text": "The surrounding topography."
																				}
																			]
																		},
																		{
																			"number": "[5] ",
																			"content": [
																				{
																					"text": "The surrounding tree coverage and foliage."
																				}
																			]
																		},
																		{
																			"number": "[6] ",
																			"content": [
																				{
																					"text": "The design of the tower, with particular reference\nto design characteristics that have the effect of reducing or eliminating\nvisual obtrusiveness."
																				}
																			]
																		},
																		{
																			"number": "[7] ",
																			"content": [
																				{
																					"text": "The proposed ingress and egress."
																				}
																			]
																		},
																		{
																			"number": "[8] ",
																			"content": [
																				{
																					"text": "The availability of suitable existing towers, other structures or alternative technologies not requiring the use of towers or structures, as discussed in Subsection G(2)(c) this section."
																				}
																			]
																		}
																	]
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "Availability of suitable existing towers, other\nstructures or alternative technology. No new tower shall be permitted\nunless the applicant demonstrates to the reasonable satisfaction of\nthe Board of Trustees that no existing tower, structure or alternative\ntechnology that does not require the use of towers or structures can\naccommodate the applicant's proposed antenna. An applicant shall submit\ninformation requested by the Board of Trustees related to the availability\nof suitable existing towers, other structures or alternative technology.\nEvidence submitted to demonstrate that no existing tower, structure\nor alternative technology can accommodate the applicant's proposed\nantenna may consist of any of the following:"
																},
																{
																	"content": [
																		{
																			"number": "[1] ",
																			"content": [
																				{
																					"text": "No existing towers or structures are located\nwithin the geographic area which meet the applicant's engineering\nrequirements."
																				}
																			]
																		},
																		{
																			"number": "[2] ",
																			"content": [
																				{
																					"text": "Existing towers or structures are not of sufficient\nheight to meet the applicant's engineering requirements."
																				}
																			]
																		},
																		{
																			"number": "[3] ",
																			"content": [
																				{
																					"text": "Existing towers or structures do not have sufficient\nstructural strength to support the applicant's proposed antenna and\nrelated equipment."
																				}
																			]
																		},
																		{
																			"number": "[4] ",
																			"content": [
																				{
																					"text": "The applicant's proposed antenna would cause\nelectromagnetic interference with the antenna on the existing towers\nor structures, or the antenna on the existing towers or structures\nwould cause interference with the applicant's proposed antenna."
																				}
																			]
																		},
																		{
																			"number": "[5] ",
																			"content": [
																				{
																					"text": "The fees, costs or contractual provisions required\nby the owner in order to share an existing tower or structure or to\nadapt an existing tower or structure for sharing are unreasonable.\nCosts exceeding new tower development are presumed to be unreasonable."
																				}
																			]
																		},
																		{
																			"number": "[6] ",
																			"content": [
																				{
																					"text": "The applicant demonstrates that there are other\nlimiting factors that render existing towers and structures unsuitable."
																				}
																			]
																		},
																		{
																			"number": "[7] ",
																			"content": [
																				{
																					"text": "The applicant demonstrates that an alternative\ntechnology that does not require the use of towers or structures,\nsuch as a cable microcell network using multiple low-powered transmitters/receivers\nattached to a wireline system, is unsuitable. Costs of alternative\ntechnology that exceed new tower or antenna development shall not\nbe presumed to render the technology unsuitable."
																				}
																			]
																		}
																	]
																}
															]
														},
														{
															"number": "(d) ",
															"content": [
																{
																	"text": "Setbacks. The following setback requirements\nshall apply to all towers for which a special use permit is required;\nprovided, however, that the Board of Trustees may reduce the standard\nsetback requirements if the goals of this section would be better\nserved thereby:"
																},
																{
																	"content": [
																		{
																			"number": "[1] ",
																			"content": [
																				{
																					"text": "Towers must be set back a distance equal to\nat least 75% of the height of the tower from any adjoining lot line."
																				}
																			]
																		},
																		{
																			"number": "[2] ",
																			"content": [
																				{
																					"text": "Guys and accessory buildings must satisfy the\nminimum zoning district setback requirements."
																				}
																			]
																		}
																	]
																}
															]
														},
														{
															"number": "(e) ",
															"content": [
																{
																	"text": "Separation. The following separation requirements\nshall apply to all towers and antennas for which a special use permit\nis required; provided, however, that the Board of Trustees may reduce\nthe standard separation requirements if the goals of this section\nwould be better served thereby."
																},
																{
																	"content": [
																		{
																			"number": "[1] ",
																			"content": [
																				{
																					"text": "Separation from off-site uses/designated areas."
																				},
																				{
																					"content": [
																						{
																							"number": "[a] ",
																							"content": [
																								{
																									"text": "Tower separation shall be measured from the\nbase of the tower to the lot line of the off-site uses and/or designated\nareas as specified in Table 1, except as otherwise provided in Table\n1."
																								}
																							]
																						},
																						{
																							"number": "[b] ",
																							"content": [
																								{
																									"text": "Separation requirements for towers shall comply\nwith the minimum standards established in Table 1."
																								}
																							]
																						}
																					]
																				}
																			]
																		},
																		{
																			"number": "[2] ",
																			"content": [
																				{
																					"text": "Separation distances between towers. Separation\ndistances between towers shall be applicable for and measured between\nthe proposed tower and preexisting towers. The separation distances\nshall be measured by drawing or following a straight line between\nthe base of the existing tower and the proposed base, pursuant to\na site plan, of the proposed tower. The separation distances (listed\nin linear feet) shall be as shown in Table 2."
																				}
																			]
																		}
																	]
																}
															]
														},
														{
															"number": "(f) ",
															"content": [
																{
																	"text": "Security fencing. Towers shall be enclosed by\nsecurity fencing not less than six feet in height and shall also be\nequipped with an appropriate anti-climbing device; provided, however,\nthat the Board of Trustees may waive such requirements, as it deems\nappropriate."
																}
															]
														},
														{
															"number": "(g) ",
															"content": [
																{
																	"text": "Landscaping. The following requirements shall\ngovern the landscaping surrounding towers for which a special use\npermit is required; provided, however, that the Board of Trustees\nmay waive such requirements if the goals of this section would be\nbetter served thereby."
																},
																{
																	"content": [
																		{
																			"number": "[1] ",
																			"content": [
																				{
																					"text": "Tower facilities shall be landscaped with a\nbuffer of plant materials that effectively screens the view of the\ntower compound from property used for residences. The standard buffer\nshall consist of a landscaped strip at least four feet wide outside\nthe perimeter of the compound."
																				}
																			]
																		},
																		{
																			"number": "[2] ",
																			"content": [
																				{
																					"text": "In locations where the visual impact of the\ntower would be minimal, the landscaping requirement may be reduced\nor waived."
																				}
																			]
																		},
																		{
																			"number": "[3] ",
																			"content": [
																				{
																					"text": "Existing mature tree growth and natural land\nforms on the site shall be preserved to the maximum extent possible.\nIn some cases, such as towers sited on large, wooded lots, natural\ngrowth around the property perimeter may be sufficient buffer."
																				}
																			]
																		}
																	]
																}
															]
														}
													]
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "H. ",
							"content": [
								{
									"text": "Buildings or other equipment storage."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Antennas mounted on structures or rooftops. The equipment\ncabinet or structure used in association with antennas shall comply\nwith the following:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "The cabinet or structure shall not contain more\nthan 300 square feet of gross floor area or be more than 15 feet in\nheight. In addition, for buildings and structures which are less than\n65 feet in height, the related unmanned equipment structure, if over\n200 square feet of gross floor area or 10 feet in height, shall be\nlocated on the ground and shall not be located on the roof of the\nstructure."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "If the equipment structure is located on the\nroof of a building, the area of the equipment structure and other\nequipment and structures shall not occupy more than 15% of the roof\narea."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "Equipment storage buildings or cabinets shall\ncomply with all applicable building codes."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Antennas mounted on utility poles or light poles.\nThe equipment cabinet or structure used in association with antennas\nshall be located in accordance with the following:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "In residential districts, the equipment cabinet\nor structure may be located:"
																},
																{
																	"content": [
																		{
																			"number": "[1] ",
																			"content": [
																				{
																					"text": "In a front or side yard, provided that the cabinet\nor structure is no greater than three feet in height or six square\nfeet of gross floor area and the cabinet/structure is located a minimum\nof 20 feet from all lot lines. The cabinet/structure shall be screened\nby an evergreen hedge with an ultimate height of at least 48 inches\nand a planted height of at least 36 inches."
																				}
																			]
																		},
																		{
																			"number": "[2] ",
																			"content": [
																				{
																					"text": "In a rear yard, provided that the cabinet or\nstructure is no greater than three feet in height or six square feet\nin gross floor area. The cabinet/structure shall be screened by an\nevergreen hedge with an ultimate height of at least eight feet and\na planted height of at least 36 inches."
																				}
																			]
																		}
																	]
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "In any nonresidential district the equipment\ncabinet or structure shall be no greater than six feet in height or\n12 square feet in gross floor area. The structure or cabinet shall\nbe screened by an evergreen hedge with an ultimate height of at least\neight feet and a planted height of at least 36 inches. In all other\ninstances, structures or cabinets shall be screened from view of all\nresidential properties which abut or are directly across the street\nfrom the structure or cabinet by a solid fence six feet in height\nor an evergreen hedge with an ultimate height of at least eight feet\nand a planted height of at least 36 inches."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Antennas located on towers. The related unmanned equipment\nstructure shall not contain more than 60 square feet of gross floor\narea or be more than five feet in height, and shall be located in\naccordance with the minimum yard requirements of the zoning district\nin which located."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "Modification of building size requirements. The requirements of Subsections H(1) through (3) may be modified by the Building Official in the case of administratively approved uses or by the Board of Trustees in the case of uses permitted by special use to encourage collocation."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "I. ",
							"content": [
								{
									"text": "Removal of abandoned antennas and towers. Any antenna\nor tower that is not operated for a continuous period of six months\nshall be considered abandoned, and the owner of such antenna or tower\nshall remove the same within 90 days of receipt of notice from the\nVillage notifying the owner of such abandonment. Failure to remove\nan abandoned antenna or tower within said 90 days shall be grounds\nto remove the tower or antenna at the owner's expense. If there are\ntwo or more users of a single tower, then this provision shall not\nbecome effective until all users cease using the tower."
								}
							]
						},
						{
							"number": "J. ",
							"content": [
								{
									"text": "Nonconforming uses."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Not expansion of nonconforming use. Towers that are\nconstructed and antennas that are installed in accordance with the\nprovisions of this section shall not be deemed to constitute the expansion\nof a nonconforming use or structure."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Preexisting towers. Preexisting towers which were\nlegally established shall be allowed to continue their usage as they\npresently exist. Routine maintenance (including replacement with a\nnew tower of like construction and height) shall be permitted on such\npreexisting towers. New construction other than routine maintenance\non a preexisting tower shall comply with the requirements of this\nsection."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Rebuilding damaged or destroyed nonconforming towers or antennas. Notwithstanding the provisions of Subsection I, bona fide nonconforming towers or antennas that are damaged or destroyed may be rebuilt without having to first obtain administrative approval or a special use permit and without having to meet the separation requirements specified in Subsections G(2)(d) and (e). The type, height and location of the tower on site shall be of the same type and intensity as the original facility approval. Building permits to rebuild the facility shall comply with the then-applicable building codes and shall be obtained within 180 days from the date the facility is damaged or destroyed. If no permit is obtained or if said permit expires, the tower or antenna shall be deemed abandoned as specified in Subsection I."
												}
											]
										}
									]
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 150-52",
			"title": "Service stations.",
			"content": [
				{
					"text": "No public garage or automobile service station\nshall be permitted in any district."
				}
			]
		},
		{
			"paragraph": "§ 150-52.1",
			"title": "Storage containers, temporary.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Definitions. As used in this section, the following\nterms shall have the indicated meaning except where the context clearly\ndemonstrates otherwise:"
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Prohibition. No person or entity shall locate, or\npermit to be located, any storage container on any property in the\nVillage without a permit as authorized by this section."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Permit required; regulations. Upon proper written\napplication pursuant to this section, the Building Inspector may issue\na permit for a storage container, subject to the conditions set forth\nin this section."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "The form of such application shall be established\nby the Building Department."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Such application shall be accompanied by payment\nof a fee in an amount determined from time to time by resolution of\nthe Board of Trustees."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "A permit for a storage container may be granted\nonly in the event there is existing and in effect at all times during\nthe period the storage container is on the property a valid building\npermit with respect to improvements to a one- or two-family dwelling\nlocated on the same property."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "No more than one storage container shall be\npermitted on the property at one time, and such storage container\nshall not occupy a ground area in excess of 120 square feet, nor be\nmore than eight feet in height."
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "Any authorized storage container shall be set\nback not less than five feet from the side and rear property lines\nand from any structures on the property. A storage container located\nin the front yard shall be set back not less than 10 feet from the\nfront property line."
												}
											]
										},
										{
											"number": "(6) ",
											"content": [
												{
													"text": "In determining whether to grant a permit for\na storage container, the Building Inspector shall consider the rights\nand interests of owners and occupants of adjoining properties, to\nthe end that such adjoining properties not be deprived or unduly limited\nin light, air or reasonable use during the period of time that the\nstorage container is on any property."
												}
											]
										},
										{
											"number": "(7) ",
											"content": [
												{
													"text": "The duration of any permit for a storage container\nshall not exceed 60 days, except that upon written application and\npayment of any additional fee as may be from time to time established\nby the Board of Trustees, the Building Inspector may extend the duration\nof such permit for an additional period of time not to exceed 30 days.\nFurther extensions of time shall be in the discretion of the Building\nInspector upon good cause shown."
												}
											]
										},
										{
											"number": "(8) ",
											"content": [
												{
													"text": "Storage containers shall be removed from the\nproperty no later than the date of permit expiration."
												}
											]
										},
										{
											"number": "(9) ",
											"content": [
												{
													"text": "In granting or extending any permit pursuant\nto this section, the Building Inspector may impose reasonable conditions\nwhere such conditions are determined to be necessary to protect the\npublic health, safety or general welfare."
												}
											]
										},
										{
											"number": "(10) ",
											"content": [
												{
													"text": "Any permit issued pursuant to this section may\nbe revoked by the Building Inspector if, after due investigation,\nit is determined that the permit holder has violated any condition\nof this section or of such permit, that the container is being maintained\nin an unsafe condition, or that the container is a nuisance. Written\nnotice of such revocation shall be given either by personal delivery\nto the permit holder or the owner of the property on which the container\nis located, or by mailing such notice to such person or entity in\na sealed postage paid envelope addressed to the permit holder or the\nproperty owner at the address indicated for such person or entity\nin the records of the Building Department."
												}
											]
										}
									]
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 150-53",
			"title": "Parking fields.",
			"content": [
				{
					"text": "No private or public parking fields shall be\npermitted in any district, except as a special exception by the Board\nof Trustees of the Village of Woodsburgh."
				}
			]
		},
		{
			"paragraph": "§ 150-54",
			"title": "Private garages.",
			"content": [
				{
					"text": "No private garage shall occupy more than 5%\nof the area of the lot. Where more than one private garage is erected\non one lot, the combined area of all of such garages or groups of\ngarages shall not exceed 5% of the lot. No private garage shall be\npermitted within a side yard or within a rear yard except under the\nfollowing conditions:"
				},
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "In a residence district, when used as accessory to\na dwelling for not over one family or one housekeeping unit only,\na private garage may be constructed in a rear yard, provided that\nno part thereof is nearer than four feet from the nearest property\nline, except in the Residence A District, where the same shall not\nbe nearer than 15 feet from the nearest property line, and except\nin the Residence 1A District, where the same shall not be nearer than\n30 feet from the nearest property line, and except in the Residence\n2A District, where the same shall not be nearer than 40 feet from\nthe nearest property line.[Amended 11-27-1989 by L.L. No. 24-1989]"
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "In a Residence D District, when used as accessory\nto a church, club, school or apartment house, if authorized as a special\nexception by the Board of Appeals under conditions as to construction\nbelow grade, filling and grading at the rear and sides thereof, landscaping\nand the like which will avoid injury or annoyance to adjoining property\nowners and under such other conditions as the Board of Appeals may\ndetermine; provided, however, that no such garage accommodating more\nthan five motor vehicles or any part thereof shall be situated nearer\nthan 15 feet to the rear line or nearer than 10 feet to any side line,\nand no such garage accommodating fewer than five motor vehicles or\nany part thereof shall be situated nearer than four feet to the nearest\nproperty line."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 150-55",
			"title": "Excavations.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "No excavations other than for construction of walls,\nbuildings and parts thereof shall be commenced except in conformity\nwith the provisions of this chapter."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Before any excavation for purposes other than the\nconstruction of a wall, building or part thereof or for public use\nis commenced and topsoil, earth, sand, gravel, rock or other substance\nis removed from the ground, the owner or lessee of the premises or\nagent of either shall obtain a written permit therefor and for that\npurpose shall file with the Clerk of the Village at his office an\napplication, in duplicate, for a permit containing a detailed statement\nof the proposed work and a plan setting forth in detail the extent\nof the proposed excavation. Such statement and plan shall state and\nshow the exact condition of the plot and premises before and after\nthe proposed excavation."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Every application for such permit shall be accompanied\nby a building plan as drawn to scale, giving the location and dimensions\nof the premises upon which it is proposed to excavate and the location\nof any existing buildings, and also a sworn statement, in writing,\ngiving the full name and address of the owner of the premises."
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "No such excavation shall be made within 10 feet of\nany street line nor unless adequate barricades are erected and maintained\nand adequate provisions made for the prevention of flying dust and\nunless the excavation is immediately refilled with clean nonburnable\nfill containing no garbage, refuse, offal or any deleterious or unwholesome\nmatter and dust-down or its equal is spread to prevent dust from flying\nand such premises are graded to the level of the abutting highway\nwhere such excavations are below street level; provided, further,\nthat, in the case of removal of topsoil, there shall be left at least\nsix inches of topsoil upon the surface from which the topsoil is removed,\nand the area from which the topsoil is taken shall be immediately\nreseeded with rye or other fast-growing vegetation until growth is\nestablished."
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "Before the issuance of a permit, the one to whom the\npermit is to be issued shall execute and file with the Village Clerk\na bond, approved by the Board of Trustees of the Village of Woodsburgh\nand in an amount to be fixed by said Board, but not less than $2,000,\nwith a surety company as surety and conditioned for the faithful performance\nof all conditions contained in this section, the observance of all\nmunicipal ordinances and to indemnify the Village of Woodsburgh or\nany resident thereof for any damage to its or his property or person\nrespectively."
								}
							]
						},
						{
							"number": "F. ",
							"content": [
								{
									"text": "The Clerk of the Village of Woodsburgh shall charge\nand collect for the aforesaid permit a fee as set by resolution of\nthe Board of Trustees from time to time.[1][Amended 12-11-1989 by L.L. No. 25-1989]"
								},
								{
									"footnote": "[1]\nEditor's Note: See Ch. A155, Fee Schedule.\n"
								}
							]
						},
						{
							"number": "G. ",
							"content": [
								{
									"text": "Such permit shall expire by limitation 20 days from\nthe date of its issuance unless extended."
								}
							]
						},
						{
							"number": "H. ",
							"content": [
								{
									"text": "Nothing contained in this section shall require a\nperson to obtain a permit to remove or prevent a person from removing\ntopsoil from one part of his lands to another part of the same premises\nwhen such removal is necessary as an accessory use or is made for\nthe purpose of improving said property."
								}
							]
						}
					]
				}
			]
		}
	]
}