{
	"url": "http://ecode360.com/6982414",
	"paras": [
		{
			"paragraph": "§ 150-14",
			"title": "Applicable regulations.",
			"content": [
				{
					"text": "In a Residence B District, the following regulations\nof this article shall apply."
				}
			]
		},
		{
			"paragraph": "§ 150-15",
			"title": "Permitted uses.",
			"content": [
				{
					"text": "No building shall be erected, altered or used\nand no lot or premises shall be used except for one or more of the\nfollowing purposes:"
				},
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Purposes permitted in the Residence A District."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 150-16",
			"title": "Height restrictions.",
			"content": [
				{
					"text": "The maximum height of any building or any part\nthereof shall be 28 feet in the case of a gable, hip or gambrel roof,\nor 25 feet in the case of all other roofs, or 2 1/2 stories,\nwhichever is less. No principal building shall be raised and no principal\nbuilding or any part thereof shall be erected or altered which has\na height of less than one story or 20 feet, whichever is less."
				}
			]
		},
		{
			"paragraph": "§ 150-17",
			"title": "Size of lot.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "No building shall hereafter be erected or altered\non a lot of less area than 14,500 square feet, nor shall a building\nhereafter be erected or altered unless such lot shall have a frontage\nof not less than 100 feet on at least one street, except that in the\ncase of a corner lot, such lot shall have a frontage of not less than\n100 feet on at least two streets. Any lot smaller in area or with\nless frontage than in this section required, of which the ownership\nat the date of adoption of this section differs from the ownership\nof all adjoining lots, may be improved as herein permitted, provided\nthat the minimum yard areas hereafter required are provided."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Further exception to this section is made in the case\nof a parcel of land located on the easterly side of Willow Road 295.60\nfeet south of Keene Lane, 64.55 feet southerly along Willow Road,\neasterly 361 feet to Woodmere Boulevard, northerly on Woodmere Boulevard\n228 feet, thence westerly 125 feet and thence southwesterly 301.60\nfeet to the point of beginning, which may be divided into three building\nplots of not less than 12,000 square feet each, but the frontage of\n64.55 feet on Willow Road shall be permitted for one building plot,\nprovided that the mean width of said lot is not less than 100 feet\nand the minimum yard areas hereinbefore required are provided and\nthat the front yard shall be not less than 45 feet in depth."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 150-18",
			"title": "Rear yards.",
			"content": [
				{
					"text": "Every building hereafter erected or altered\nshall have a rear yard of a minimum depth of 25 feet."
				}
			]
		},
		{
			"paragraph": "§ 150-19",
			"title": "Front yards.",
			"content": [
				{
					"text": "No building shall be hereafter erected or altered\nwhich shall have its front wall nearer to the street line than 35\nfeet. In case of a corner lot, a front yard shall be required on each\nstreet upon which the lot abuts. The interior angles formed by the\nintersection of the lot's lines with the street line shall not be\nless than 75° for the entire distance from the street lines to\nthe front yard setback line or lines."
				}
			]
		},
		{
			"paragraph": "§ 150-20",
			"title": "Side yards.",
			"content": [
				{
					"text": "Two side yards shall be provided on every lot,\neach having a minimum width of at least 15 feet, provided that in\nthe case of a lot of a width of less than 100 feet, of which the ownership\nat the date of the adoption of this section differs from the ownership\nof all adjoining lots, the side yards may be of less width when authorized\nby a special exception by the Board of Appeals as hereinafter provided."
				}
			]
		},
		{
			"paragraph": "§ 150-21",
			"title": "Waterfront development.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Where property borders upon tidewater or where interior\nlots have a right-of-way to the waterfront and rights of user permitting\nthe same, there may be constructed adjacent to and abutting the waterline\non the property a dock, pergola, summerhouse, boathouse or bathhouse\nnot designed or to be used for the storage of automobiles or keeping\nof horses or for any purpose other than to facilitate the uses of\nthe waterfront. None of such buildings may be over two stories in\nheight. No such accessory buildings or docks as may be erected shall\nbe used for any public use or for any other use not permitted specifically\nunder this section. In the case of a structure permitted by this subsection,\nthere shall be two side yards, one on each side of the structure,\nand each shall be at least 15% of the width of the lot. Neither side\nyard shall be less than 7 1/2 feet. In the case of a lot held\nin single and separate ownership at the effective date of this subsection\nof a width less than 50 feet, a structure permitted by this subsection\nmay be built thereon with the side yards of less width when authorized\nas a special exception by the Board of Appeals."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "No principal building and no accessory building, except\nas noted above, shall be constructed upon any lot fronting or bordering\nupon water at a distance of less than 50 feet, measured from any part\nof such building to the high-water mark."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 150-22",
			"title": "Habitable floor area.",
			"content": [
				{
					"text": "No main dwelling shall be erected unless it\nhas habitable floor area of 2,000 square feet."
				}
			]
		},
		{
			"paragraph": "§ 150-22.1",
			"title": "Front height/setback ratio.",
			"content": [
				{
					"text": "The maximum building height to front yard setback\nratio shall be 0.600."
				}
			]
		},
		{
			"paragraph": "§ 150-22.2",
			"title": "Side height/setback ratio.",
			"content": [
				{
					"text": "The maximum building height to side yard setback\nratio shall be 1.400."
				}
			]
		},
		{
			"paragraph": "§ 150-22.3",
			"title": "Maximum floor area.",
			"content": [
				{
					"text": "The maximum permitted floor area shall be calculated\nbased upon the following table:"
				},
				{
					"Lot Size(square feet)": "0 to 12,000",
					"Maximum Permitted Floor Area(square feet)": "3,000"
				},
				{
					"Lot Size(square feet)": "12,001 to 14,000",
					"Maximum Permitted Floor Area(square feet)": "3,000, plus 0.26 times lot area over 12,000"
				},
				{
					"Lot Size(square feet)": "14,001 to 16,000",
					"Maximum Permitted Floor Area(square feet)": "3,000, plus 0.25 times lot area over 12,000"
				},
				{
					"Lot Size(square feet)": "16,001 to 18,000",
					"Maximum Permitted Floor Area(square feet)": "3,000, plus 0.24 times lot area over 12,000"
				},
				{
					"Lot Size(square feet)": "18,001 to 20,000",
					"Maximum Permitted Floor Area(square feet)": "3,000, plus 0.23 times lot area over 12,000"
				},
				{
					"Lot Size(square feet)": "20,001 to 22,000",
					"Maximum Permitted Floor Area(square feet)": "3,000, plus 0.22 times lot area over 12,000"
				},
				{
					"Lot Size(square feet)": "22,001 to 23,000",
					"Maximum Permitted Floor Area(square feet)": "3,000, plus 0.21 times lot area over 12,000"
				},
				{
					"Lot Size(square feet)": "23,001 to 29,000",
					"Maximum Permitted Floor Area(square feet)": "3,000, plus 0.20 times lot area over 12,000"
				},
				{
					"Lot Size(square feet)": "29,001 to 30,000",
					"Maximum Permitted Floor Area(square feet)": "3,000, plus 0.19 times lot area over 12,000"
				},
				{
					"Lot Size(square feet)": "30,001 and above",
					"Maximum Permitted Floor Area(square feet)": "3,000, plus 0.18 times lot area over 12,000"
				}
			]
		}
	]
}