{
	"url": "http://ecode360.com/11024420",
	"paras": [
	    {
        	"paragraph": "§ 220a",
        	"title": "Schedule of Dimensional and Bulk Regulations for Residential Districts",
        	"content": [
        		{
        			"text": "The following regulations shall apply in an R-2F-7.5 district:"
        		},
        		{
        			"content": [
        				{
        					"number": "A. ",
        					"content": [
        						{
        							"text": "Minimum lot size (square feet): 7,500"
        						}
        					]
        				},
        				{
        					"number": "B. ",
        					"content": [
        						{
        							"text": "Minimum front yard (feet): 25"
        						}
        					]
        				},
        				{
        					"number": "C. ",
        					"content": [
        						{
        							"text": "Minimum side yard (feet): 8"
        						}
        					]
        				},
        				{
        					"number": "D. ",
        					"content": [
        						{
        							"text": "Minimum rear yard (feet): 20"
        						}
        					]
        				},
        				{
        					"number": "E. ",
        					"content": [
        						{
        							"text": "Maximum building height (stories/feet): 3/35"
        						}
        					]
        				},
        				{
        					"number": "F. ",
        					"content": [
        						{
        							"text": "Maximum building coverage (percentage of lot area): 35"
        						}
        					]
        				}
        			]
        		}
        	]
        },
		{
			"paragraph": "§ 220-40",
			"title": "Accessory apartments.",
			"content": [
				{
					"text": "It is the specific purpose and intent of this section to allow accessory apartments on one-family parcels of minimum size of 1/2 acre to provide the opportunity for the development of affordable housing, AFFH units as defined in § 220-2B of this chapter, or to meet the needs of the elderly, the young, persons of middle income, or the relatives or domestic employees of the owners of the principal residence. It is also the purpose of this provision to allow more efficient use of the Town's existing dwellings and accessory buildings, and to afford existing residents the opportunity to remain in large, underutilized houses by virtue of the added income produced by accessory apartments, and to protect and preserve property values in the Town of Lewisboro. To help achieve these goals to promote the other objectives of this chapter and of the Town Development Plan, the following specific standards and limitations are set forth for such accessory apartment use."
				},
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Occupancy."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "The owner(s) of the one-family lot upon which the accessory apartment\nis to be located shall occupy and maintain as his or her legal full-time\nresidence at least one of the dwelling units on the lot."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "The maximum occupancy of the accessory apartment is four persons."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Location and number of units."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "An accessory apartment may be located in the principal dwelling building\nor in a permitted accessory building, such as a barn or garage, and\nmay include existing, new, or expanded structure construction."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "There shall be no more than one accessory apartment permitted per\none family building lot."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "An accessory apartment is not permitted on any single lot where more\nthan one dwelling unit already exists, regardless of whether the additional\ndwelling is a prior nonconforming dwelling unit or not. The property\nowner' s right to subdivide his or her property shall be deemed\nto be waived if there is an accessory apartment in an accessory building,\nunless the proposed subdivided lots still meet all of this section'\ns requirements without a variance."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Size."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "The minimum floor area for an accessory apartment located within\na principal dwelling building shall be 300 square feet, but in no\ncase shall it exceed 25% of the total floor area of the dwelling building\nin which it is located."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "For an accessory apartment located in an existing accessory building,\nthe minimum floor area shall also be 300 square feet."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Each accessory apartment, whether in a principal dwelling unit or\nan accessory building, shall be limited to a maximum of two bedrooms."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "Other requirements."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Exterior appearance. Principal buildings containing an accessory\napartment shall have only one front or principal entry to the building,\nand the accessory apartment shall be located, designed, constructed,\nand landscaped so as to preserve the appearance of the principal building\nas a single-family residence to the maximum extent feasible and further\nto enhance and not detract from the single-family character of the\nprincipal building and the surrounding neighborhood. An accessory\napartment may have a separate, distinct entry as long as said entry,\nin the opinion of the permitting agency, does not detract from the\nsingle-family character of the principal building."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Off-street parking. Off-street parking requirements shall be that\ntwo off street parking spaces must be provided for each dwelling unit\non the property of the applicant. Additional parking areas shall be\npaved only when proven necessary and shall be screened and buffered\nfrom adjacent properties to the extent possible."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Approval of utilities. Prior to the issuance of a building permit\nfor the establishment of an accessory apartment in a principal dwelling\nor the conversion of an existing accessory building to an accessory\napartment use, all septic systems and wells must be approved by the\nWestchester County Department of Health. In addition, the Department\nof Health must approve both the location and adequacy of septic systems\nand wells and any change in the number or location of bedrooms. (NOTE:\nThis section may be waived by the Building Inspector if there is no\naddition to the existing residence or the basic bedroom count and\nlocation remain the same.)"
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "Inspections."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Accessory apartments shall be subject to inspection by the Building\nDepartment every two years to verify that the units remain as approved.\nA fee for this inspection, the amount of which is to be set by the\nTown Board, may be charged for each inspection."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "At the time of the biennial inspection, a registration form shall\nbe completed by the owner of the accessory apartment and returned\nto the Building Department within 10 days of receipt. This form shall\ninclude the basic facts about the accessory apartment, including owner's\nname(s), tenant's names(s), location, size, and percentage of\nthe principal building it occupies. Registration forms must be signed\nby the property owner and notarized. Registration forms for middle-income\nor AFFH unit accessory apartments shall include the amount of monthly\nrent paid by the tenant and the annual gross income of the tenant,\nas reported on federal income tax forms for the previous year."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "F. ",
							"content": [
								{
									"text": "Assessment. The property which contains any accessory apartment shall be assessed in the manner authorized by the State of New York. If the owner of an accessory apartment has agreed to register the apartment as a middle-income apartment and to limit the monthly rent to the amount set forth in § 220-26F(4) of this chapter, or if the accessory apartment is an AFFH unit, the assessor shall take the limitation on rental income into account in determining the amount, if any, the accessory apartment will add to the assessed value of the property."
								}
							]
						},
						{
							"number": "G. ",
							"content": [
								{
									"text": "Administration. The Housing Committee and the Housing Administrator\nshall monitor middle-income and AFFH unit accessory apartments in\nthe Town and, through the Building Department, shall oversee the regulations\npertaining thereto. Specifically, the Housing Committee and Housing\nAdministrator shall be responsible for:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Maintaining a list of available middle-income and AFFH unit accessory\napartments."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Determining a prospective renter's eligibility for renting a\nmiddle-income or AFFH unit accessory apartment."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Maintaining a list of eligible renters of middle-income and AFFH\nunit accessory apartments."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "Monitoring the turnover in the owners of middle-income and AFFH unit\naccessory apartments."
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "Monitoring the turnover in the renters of middle-income and AFFH\nunit accessory apartments."
												}
											]
										},
										{
											"number": "(6) ",
											"content": [
												{
													"text": "Establishing policies and procedures, as well as the requisite forms\nrequired, to review income and eligibility requirements and rents\ncharged."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "H. ",
							"content": [
								{
									"text": "Other provisions."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "A fee shall be paid in an amount set forth in a fee schedule established\nby resolution of the Town Board."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Rent. The rent for any middle-income accessory apartment shall not exceed the permitted rentals for middle-income dwelling units, as described in § 220-26F(4) of this chapter."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "If any middle-income unit shall become vacant, the owner shall inform\nthe Housing Administrator of the vacancy. The Housing Administrator\nshall inform the eligible middle-income persons on his or her waiting\nlist of the vacancy."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "The owner of a unit may list his or her unit as a middle-income unit. The unit, once listed as a middle-income unit, will be eligible for assessment as provided in § 220-40F of this chapter and shall be subject to the rent limitations and other rules established for middle-income housing units."
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "Occupancy. The occupants of a middle-income accessory unit must qualify as members of a middle-income family, as defined in § 220-2B of this chapter."
												}
											]
										},
										{
											"number": "(6) ",
											"content": [
												{
													"text": "Term. Once an accessory apartment is listed as a middle-income unit,\nit must remain as a middle-income unit for the full term of its permit."
												}
											]
										},
										{
											"number": "(7) ",
											"content": [
												{
													"text": "The owner of a middle-income accessory apartment shall have the right\nto choose any tenant from the list of eligible tenants that is maintained\nby the Housing Administrator and Housing Committee Chairman."
												}
											]
										},
										{
											"number": "(8) ",
											"content": [
												{
													"text": "Exemptions. In the event that no middle-income family is on the Housing\nCommittee's list for a middle-income accessory apartment, or\nin the event that no family on the waiting list agrees to rent the\naccessory apartment, the Housing Committee may exempt the accessory\napartment from the above middle-income requirements for the term of\nthe next lease or occupancy."
												}
											]
										}
									]
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 220-40.1",
			"title": "Accessory residence dwellings.",
			"content": [
				{
					"text": "An accessory residence dwelling, not to exceed one per lot,\nincidental and subordinate to a principal detached one-family dwelling,\nand located on the same lot, is subject to the following standards\nand requirements:"
				},
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Minimum lot area. A minimum lot area of 20 acres shall be provided\nand shall include a minimum buildable area, as defined herein, two\ntimes that required for an individual lot in the zoning district in\nwhich the accessory residence dwelling is to be located."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Lot, yard and bulk requirements. All lot, yard and bulk requirements\nof the zoning district in which the accessory residence dwelling is\nto be located shall apply."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Location. An accessory residence dwelling shall be sited in a manner\nthat will permit future subdivision and separation of all buildings\nin conformance with the minimum lot area and bulk yard requirements\nof the zoning district in which the accessory residence dwelling is\nto be located. Subdivision approval shall not be granted if any nonconformity\nwould be established due to the existing use, size or location of\nan accessory residence dwelling."
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "Access. Street access may be shared with that of the principal one-family\nresidence; additional street curb cuts or separate access driveways\nshall not be required."
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "Size; number of bedrooms."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "The exterior size of an accessory residence dwelling shall not\nexceed 1,500 square feet, or be less than 600 square feet, in gross\nfloor area, excluding unhabitable and unfinished garage and basement\nspace as defined herein."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "A maximum of two bedrooms is permitted in an accessory residence\ndwelling, provided that adequate water supply and sewage disposal\nfacilities are provided."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "F. ",
							"content": [
								{
									"text": "Water supply and sewage disposal. Prior to issuance of a building\npermit for an accessory residence dwelling, all water supply and sewage\ndisposal systems shall be approved by the Westchester County Department\nof Health and New York City Department of Environmental Protection,\nas appropriate."
								}
							]
						},
						{
							"number": "G. ",
							"content": [
								{
									"text": "Prohibition of other permitted accessory uses. The establishment\nof an accessory residence dwelling on a lot shall prohibit the use\nof that lot and any buildings on the lot as an accessory apartment,\nas defined herein; and the existence of an accessory apartment will\nprohibit the establishment of an accessory residence dwelling. Further,\nthe accessory use of renting of rooms shall be strictly prohibited\nin both the principal and accessory residence dwellings; and the accessory\nuse of a professional office, studio or home occupation shall be strictly\nprohibited in the accessory residence dwelling, or by any occupant\nof the accessory dwelling."
								}
							]
						},
						{
							"number": "H. ",
							"content": [
								{
									"text": "Parking."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Off-street parking areas and access drives shall be located,\ndesigned, screened and buffered so as to minimize disturbances to\nadjacent properties."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Two parking spaces shall be required for the accessory residence dwelling and shall be provided as required by Article VII of this chapter."
												}
											]
										}
									]
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 220-41",
			"title": "Transformer stations.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Transformer stations and customary accessory uses shall be subject to a finding, in addition to all other findings required by § 220-32 that a public necessity exists for a transformer station in the residential area, and that the particular site for which application is made is the least objectionable of possible sites from the public standpoint and takes into consideration future, as well as present, needs."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "The lot on which the transformer station is located shall have an\narea of at least 10,000 square feet. The station shall be set back\nat least 25 feet from all property lines, enclosed by protective fencing\nand a gate which shall be closed and locked, except when necessary\nto obtain access thereto."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "The installation shall be so designed, enclosed, painted or colored\nand screened with evergreens that it will be harmonious with the residential\narea in which it is located. The entire property shall be suitably\nlandscaped and maintained in reasonable conformity with the standards\nof property maintenance of the neighborhood in which it is located."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 220-41.1",
			"title": "Communication facilities, communication towers, antenna towers or monopoles.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Purpose and intent. The purpose of this section is:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "To establish clear standards for the siting of wireless communication\nfacilities, buildings and structures, equipment, communication towers,\nantenna towers and monopoles."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "To promote the health, safety and general welfare of the residents\nof Lewisboro through the establishment of minimum standards to reduce\nthe adverse visual effect of communication facilities, including but\nnot limited to transmission towers and antennas, through the use of\nadvanced technology, careful design, siting and screening and buffering."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "To protect residential areas and land uses and property values\nfrom potential adverse impacts of towers and antennas."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "To encourage the location of communication facilities and communication\ntowers in areas suitably screened, buffered and adequately separated\nfrom residential uses."
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "To minimize the total number of communication facilities and\ncommunication towers throughout the community."
												}
											]
										},
										{
											"number": "(6) ",
											"content": [
												{
													"text": "To encourage the joint use of new and existing communication\ntower sites as a primary option rather than construction of additional\nsingle-use communication towers while recognizing that collocation\non higher towers is not always preferable to two less visible, less\nobtrusive shorter towers; thereby maximizing the use of existing communication\ntowers or alternative antenna host sites, while not unreasonably limiting\ncompetition among communication providers or unreasonably limiting\nreception of receive-only antennas."
												}
											]
										},
										{
											"number": "(7) ",
											"content": [
												{
													"text": "To require users of communication towers and antennas to locate\nthem, to the extent possible, in areas where the adverse impact on\nthe community is shown to be minimal."
												}
											]
										},
										{
											"number": "(8) ",
											"content": [
												{
													"text": "To require users of communication towers and antennas to configure\nthem in a way that minimizes adverse visual, aesthetic and community\ncharacter intrusion impacts caused by the installation and view of\ncommunication towers and antennas, through careful design, siting,\nlandscape screening and buffering, sufficient setbacks to reduce visual\nimpacts to adjacent properties, and innovative camouflaging techniques\nsuch as alternative tower structures, thereby protecting the physical\nappearance of the community and preserving its scenic and natural\nbeauty."
												}
											]
										},
										{
											"number": "(9) ",
											"content": [
												{
													"text": "To enhance the ability of the providers of telecommunications\nservices to provide such services to the community quickly, effectively\nand efficiently by facilitating the siting of personal wireless communication\nfacilities."
												}
											]
										},
										{
											"number": "(10) ",
											"content": [
												{
													"text": "To assure the integrity and financial soundness of any communication\nfacility firm seeking to build a wireless communication facility in\nthe Town of Lewisboro."
												}
											]
										},
										{
											"number": "(11) ",
											"content": [
												{
													"text": "To consider the public health and safety of communication facilities\nand towers."
												}
											]
										},
										{
											"number": "(12) ",
											"content": [
												{
													"text": "To avoid potential damage to adjacent properties from communication\ntower failure through careful engineering and appropriate siting of\ncommunication towers."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Regulatory compliance."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "No communication facility shall be located, constructed or maintained\non any lot, structure or land area except in conformity with this\nchapter."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "All communication facilities, equipment and devices shall be\nsecurely mounted to withstand the wind loads for the place of installation\nin accordance with the New York State Uniform Fire Prevention and\nBuilding Code."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "All communication facilities shall be constructed and maintained\nin conformance with all building, electrical, fire prevention and\nother applicable codes adopted by the Town."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "All communication facilities shall be in conformity with any\nother construction or performance standards (including approved fastening\ndevices and techniques that ensure proper mounting, approved materials\nand methods for electrical connections, adequate structural support,\netc.)."
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "All communication facilities shall be in conformance with the\nrules and regulations of any governmental entity having jurisdiction\nover such communication facilities and uses, antenna and/or supporting\nstructures and towers, including, without limitation, the FCC and\nFAA."
												}
											]
										},
										{
											"number": "(6) ",
											"content": [
												{
													"text": "All communication facilities shall be operated and maintained\nby an FCC licensee only."
												}
											]
										},
										{
											"number": "(7) ",
											"content": [
												{
													"text": "All communication facilities shall be shown to be necessary\nto provide coverage to an area of Town which currently is proven to\ninclude inadequate coverage and that any related communication tower\nor antenna is proposed at the minimum height and aesthetic intrusion\npossible to provide that necessary coverage. The applicant seeking\nto locate a communication facility in the Town of Lewisboro shall\ndemonstrate the need for new or additional antennas or communication\ntowers. Such a demonstration shall include a verifiable list of complaints\nlevied against the FCC-licensed telecommunications service provider\nto the Public Service Commission for interruptions which have occurred\nin the territory within the Town of Lewisboro targeted for service\nenhancement. Service interruptions shall not constitute an acceptable\ndemonstration of need for service enhancements in the Town of Lewisboro\nif they occur:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "Within the confines of Town parks, county parks, reservoirs\nor designated critical environmental areas located within the boundaries\nof the Town of Lewisboro."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "In an area of the Town able to benefit from service enhancements\nbeing performed or proposed in another political jurisdiction."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "Less frequently than three per month for each month during a\nfull year, as indicated in the complaint log maintained by the New\nYork State Public Service Commission."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(8) ",
											"content": [
												{
													"text": "All communication facilities, if proposed for placement on a\nlot that is within or abuts a residential district, shall prove that\nadequate coverage cannot be achieved by siting the facility on a lot\nwhich is not or does not abut a residential district."
												}
											]
										},
										{
											"number": "(9) ",
											"content": [
												{
													"text": "All communication facilities must meet or exceed current standards\nand regulations of the FAA, the FCC and any other agency of the state\nor federal government with the authority to regulate communication\ntowers and antennas. If such standards and regulations are revised\nor amended, then the owners of the communication facility governed\nby this chapter shall have 30 days to bring such communication facility\ninto compliance with such revised or amended standards and regulations.\nFailure to bring the communication facility into compliance with such\nrevised or amended standards and regulations in the time frame specified\nshall constitute grounds for the removal of the tower or antenna at\nthe owner's expense."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Communication facility siting."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "No antenna installation shall be permitted in, or to project\ninto, any required landscape buffer area as required by this chapter."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "The siting of a communication facility on property owned by\nthe Town of Lewisboro may be allowed."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "The collocation and sharing of existing or proposed communication\nfacilities and communication towers for mounting of antennas or related\nequipment is encouraged and shall be preferred to the construction\nof new communication facilities and communication towers. When an\napplicant proposes collocation of proposed antennas and communication\nfacilities on an existing communication tower, building or structure,\nthe applicant must demonstrate and certify that the existing communication\ntower, building or structure will be properly adapted to the placement\nof additional antennas. The applicant shall identify the capacity\nof the communication tower, building or structure to accommodate additional\nantennas and shall address necessary screening and buffering, landscaping\nand additional safety measures necessitated by collocation. Any communication\nfacility which is not collocated shall present and certify evidence\nas to why collocation is not possible, including evidence such as\nfollows:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "That no feasible host sites or existing communication facilities,\ncommunication towers and buildings or structures are located within\nthe geographic area which meet the applicant's engineering system\nand service requirements."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "That existing communication facilities, communication towers\nand buildings or structures are not of sufficient height to meet the\napplicant's engineering system and service requirements."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "That existing communication facilities, communication towers\nand buildings or structures do not have sufficient structural strength\nto support the applicant's proposed communication facility equipment\nor antenna."
																}
															]
														},
														{
															"number": "(d) ",
															"content": [
																{
																	"text": "That there is an inability to use existing sites in a technologically\nfeasible manner consistent with the applicant's engineering system\nand service requirements."
																}
															]
														},
														{
															"number": "(e) ",
															"content": [
																{
																	"text": "That the applicant's proposed antenna would cause electromagnetic\ninterference with any antenna on the existing communication towers,\nbuildings or structures, or the antenna on the existing communication\ntowers or structures would cause interference with the applicant's\nantenna."
																}
															]
														},
														{
															"number": "(f) ",
															"content": [
																{
																	"text": "That the fees, costs or contractual provisions required by the\nowner in order to share an existing communication tower, building\nor structure, or to adapt existing communication towers, buildings\nor structures for purposes of collocation and sharing, are unreasonable.\nCosts exceeding new tower development are presumed to be unreasonable."
																}
															]
														},
														{
															"number": "(g) ",
															"content": [
																{
																	"text": "That the applicant has demonstrated that there are other limiting\nfactors that render existing communication towers, buildings or structures\nunsuitable."
																}
															]
														},
														{
															"number": "(h) ",
															"content": [
																{
																	"text": "That the applicant has demonstrated that alternative technology\nor communication facilities which do not require the use of towers\nare unsuitable. Costs of such alternative technology or communication\nfacilities which exceed new tower or antenna development shall not\nbe presumed to render the alternative technology or communication\nfacilities unsuitable."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "All antennas shall be mounted in the rear yard or on the roof\nof a principal building, unless reception is proven to be inhibited\nor where visibility would be increased, and shall comply with the\nfollowing, in descending order:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "Unless wall-mounted on an existing roof-mounted mechanical enclosure\nor similar appurtenance, any antenna mounted on a roof shall be located\nto the rear of the roof center line so that visibility of the installation\nis limited to the greatest extent practicable when viewed from the\nfront yard but in no case shall the height of the antenna exceed the\nheight of the roof at the point of installation by more than seven\nfeet in a residential district or 15 feet in a nonresidential district.\nAn antenna which is wall-mounted on a roof-mounted mechanical enclosure\nor similar appurtenance shall not exceed the height of the appurtenance\nat the point of installation."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "An antenna located in the rear yard shall be mounted on a secure\nsupporting structure and shall not exceed 12 feet in total height\nin a residential district and 25 feet in height in a nonresidential\ndistrict, unless the support structure abuts the principal structure\nin which case the total height shall not exceed the height of the\nroof at the point of installation by more than seven feet in a residential\ndistrict and 15 feet in a nonresidential district."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "If roof or rear yard installation is proven to inhibit reception,\nwall mounting shall be permitted in the side yards at least 15 feet\nfrom the front yard, provided that the height of the antenna shall\nnot exceed the height of the roof line at the point of installation\nby more than seven feet in a residential district or 15 feet in a\nnonresidential district. Wall mounting in the front yard, and in the\nside yard within 15 feet of the front yard, shall be permitted, provided\nthat the height of the antenna does not exceed the height of the roof\nor parapet. A wall-mounted antenna shall be at least 20 feet above\nground level and not project more than two feet into the front yard."
																}
															]
														},
														{
															"number": "(d) ",
															"content": [
																{
																	"text": "If the above provisions are proven to inhibit reception and/or transmission, a monopole or antenna tower may be considered, subject to the design requirements set forth in Subsection E. No new communication tower shall be permitted unless the applicant demonstrates to the reasonable satisfaction of the approving agency that no existing tower, structure or alternative technology, that does not require the use of towers or structures, can accommodate the applicant's proposed antenna."
																}
															]
														}
													]
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "Application requirements."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "A full environmental assessment form (EAF), including a visual\nEAF addendum, shall be provided. Following review of the EAF and visual\nEAF addendum, a visual impact analysis study may be required by the\napproving agency to further assess the potential visual and aesthetic\nimpacts incurred by implementation of the proposed action. The methodology\nand scope of study for any visual analysis shall be approved by the\napproving agency and shall address potential impacts on nearby viewsheds,\nridgelines, scenic features, historic sites and structures, and community\ncompatibility issues with nearby land uses."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "A service coverage map and report shall be provided. The service\ncoverage map shall show and describe all existing and proposed areas\nof service coverage relating to the proposed communication facility.\nThe service coverage map shall locate all existing sites in the Town\nand in bordering communities which contain communication towers or\nrelated facilities. A detailed report shall accompany the service\ncoverage map and shall indicate why the proposed communication tower,\nequipment and facility is necessary. The report shall identify locations\nwithin the proposed project site service coverage area which are not,\nand could not be, served by either existing facilities, by collocation\nor by other development alternatives such as development of facilities\non Town-owned properties, or utilization of alternative technology,\nor an alternative tower structure."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "A long-range communication facilities plan shall be provided,\nevidencing that the proposed location of the communication facility\nand supporting buildings and equipment have been planned to result\nin the fewest number of communication transmission tower locations\nwithin the Town of Lewisboro. The plan shall indicate how the applicant\nintends to provide service throughout the Town, and how the applicant\nplans to coordinate with all other providers of wireless communication\nservices in the Town of Lewisboro. The plan shall address the applicants\nplanned and possible location of additional tower sites, additional\nantennas, related service area coverage and alternative long-range\nplan scenarios that illustrate the potential effects of multiple towers\nand tower height, community intrusion impacts and visual and aesthetic\nimpacts."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "Documentation sufficient to demonstrate that the proposed communication\ntower height and bulk is the minimum height and bulk necessary to\nprovide licensed communication services to locations within the Town\nof Lewisboro which the applicant is not able to serve with existing\nfacilities in the project site area shall be provided, including evidence\nthat visual, aesthetic and community character intrusion impacts have\nbeen minimized to the greatest extent practicable. Documentation regarding\nheight and bulk should address any variations in height and bulk necessary\nto accommodate collocation of additional antennas and related equipment\nand facilities."
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "In addition to all other applicable site plan requirements specified\nin this chapter, all applications shall include the following:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "A scaled site plan, including elevations and construction details,\nshowing existing and proposed communication facilities, buildings\nand structures."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "Height, width, depth, location and configuration of communication\ntowers and any supporting guy wires or other supporting or anchoring\ndevices."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "Material types, colors and lighting."
																}
															]
														},
														{
															"number": "(d) ",
															"content": [
																{
																	"text": "Number and type of antennas, including receiving and/or transmitting\nequipment."
																}
															]
														},
														{
															"number": "(e) ",
															"content": [
																{
																	"text": "Legal description of the subject property or lot and that of\nany leased parcel."
																}
															]
														},
														{
															"number": "(f) ",
															"content": [
																{
																	"text": "Information about collocated or future communication facilities,\nequipment, buildings and structures, or other related facilities,\nincluding the relationship of the height of the communication tower\nto the feasibility of collocation of additional communication facilities."
																}
															]
														},
														{
															"number": "(g) ",
															"content": [
																{
																	"text": "A written description of the existing setting and how the elements\nof the proposed communication facility, communication tower and antenna\nare blended into that setting; the design of buildings and related\nstructures shall use materials, colors, textures, screening and landscaping\nwhich blend them into the existing natural setting and surrounding\nbuildings and structures."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(6) ",
											"content": [
												{
													"text": "A structural engineering safety and compliance report and certification,\nprepared by a New York State licensed professional engineer specializing\nin structural engineering, shall be provided. The report shall certify\nthe structural integrity of the proposed communication tower, antenna\nand related equipment and facilities. The report shall demonstrate\nthe compliance of all structures with all applicable standards and\nrequirements and shall describe the capacity of that structure, including\nwind load and the number and type of antennas it can accommodate.\nIllustrations shall be utilized as necessary. In the case of antennas\nbeing mounted on an existing tower or structure, the equivalent of\nthe above-required information shall be provided about the existing\ntower or structure."
												}
											]
										},
										{
											"number": "(7) ",
											"content": [
												{
													"text": "An emissions safety and compliance report and certification,\nprepared by a New York State licensed professional engineer specializing\nin electrical engineering with expertise in radio and cellular telecommunications\nregulations, technology and facilities, shall be provided. The report\nshall certify the safety of all emissions of the proposed facility\nand shall include documentation to address the following:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "Evidence of an FCC license/permit to the grantee/applicant,\nincluding information regarding all related permitting standards and\nspecifications."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "A copy of the Town of Lewisboro application form."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "The location of the nearest residential structures adjacent\nto each property line."
																}
															]
														},
														{
															"number": "(d) ",
															"content": [
																{
																	"text": "The location of the nearest occupied structures adjacent to\neach property line."
																}
															]
														},
														{
															"number": "(e) ",
															"content": [
																{
																	"text": "The location, size, height, construction and operating specifications\nof all proposed and existing communication uses and facilities, including:"
																},
																{
																	"content": [
																		{
																			"number": "[1] ",
																			"content": [
																				{
																					"text": "The quantity, type (make, model and manufacturer)\nand design of any antenna proposed and the basis for the calculations\nof capacity."
																				}
																			]
																		},
																		{
																			"number": "[2] ",
																			"content": [
																				{
																					"text": "The frequency, modulation and class of service\nof all communications equipment."
																				}
																			]
																		},
																		{
																			"number": "[3] ",
																			"content": [
																				{
																					"text": "Transmission and maximum effective radiated power\nof any antenna."
																				}
																			]
																		},
																		{
																			"number": "[4] ",
																			"content": [
																				{
																					"text": "Direction of maximum lobes and associated radiation\nof any antenna."
																				}
																			]
																		},
																		{
																			"number": "[5] ",
																			"content": [
																				{
																					"text": "A description of the proposed antenna and all related\nfixtures, structures, appurtenances and apparatus, including height\nabove grade, materials, color and lighting."
																				}
																			]
																		},
																		{
																			"number": "[6] ",
																			"content": [
																				{
																					"text": "A map depicting and listing all existing sites\nin the Town and bordering communities containing transmitting antenna\nused by the operator, owner or applicant."
																				}
																			]
																		},
																		{
																			"number": "[7] ",
																			"content": [
																				{
																					"text": "Elevation drawings depicting the front, side and\nrear of the property, illustrating any proposed antenna, mounting\ndevice and supporting or related structure and building, if any, on\nwhich said antenna is to be mounted or sited."
																				}
																			]
																		}
																	]
																}
															]
														},
														{
															"number": "(f) ",
															"content": [
																{
																	"text": "Certification that the NIER levels are within threshold levels\nadopted by the FCC or any subsequent superseding emission standard\nadopted by the FCC, based on the maximum equipment output."
																}
															]
														},
														{
															"number": "(g) ",
															"content": [
																{
																	"text": "Certification that any antenna will not cause interference with\nexisting communication devices."
																}
															]
														},
														{
															"number": "(h) ",
															"content": [
																{
																	"text": "An industry-approved propagation model using applicable contour\nbiases."
																}
															]
														},
														{
															"number": "(i) ",
															"content": [
																{
																	"text": "If collocation is not proposed, certification that collocation is not feasible as set forth in Subsection C."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(8) ",
											"content": [
												{
													"text": "The location and configuration of all existing and proposed\nsite access driveways, including the construction details indicating\nthe length, width, grading, drainage and driveway profile and proposed\nsurface material, shall be described and mapped. Any fence or gate\nrelated to the site access driveway shall be shown, including provision\nfor police, fire or emergency vehicle access to the site and facilities."
												}
											]
										},
										{
											"number": "(9) ",
											"content": [
												{
													"text": "A detailed landscape plan shall be provided showing existing\nand proposed vegetation, including areas to remain undisturbed; specimen\ntrees of six inches in diameter at breast height (dbh) or larger;\nthe height of the surrounding tree line; vegetation to be removed;\nwalls and fences; the location, quantity, type (scientific and common\nname), installation size and root conditions of proposed plantings;\nand installation details of all proposed plantings. The landscape\nplan shall illustrate how proposed plantings, fences and walls will\nprovide required screening and buffering."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "Design requirements for all communication towers, antenna towers\nor monopoles."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Height and service coverage. Any proposal for a communication\ntower, antenna tower or monopole shall prove that the height is the\nminimum necessary for adequate reception and transmission to meet\nthe applicant's service coverage needs and does not exceed 120\nfeet.[Amended 7-14-2008 by L.L. No. 1-2008]"
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Alternatives. No fewer than three alternatives for providing effective service coverage shall be presented. Proposals that incorporate use of existing towers, structures or existing utility lines shall be considered a collocated facility, as set forth in Subsection C. Any proposal which minimizes visual impacts shall be considered a preferred alternative. An applicant shall have the responsibility to prove that an alternative which reduces impacts is not feasible."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Provision for additional antennas. The approving agency may\nrequire that a communication tower, antenna tower or monopole be designed\nstructurally, electrically and in all respects to accommodate both\nthe applicant's antenna and comparable antennas for at least\ntwo additional users or service providers. All such communication\ntowers must be designed to allow for future rearrangement of the antennas\nlocated upon the tower and to accept antennas mounted at varying heights."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "Setbacks. All communication towers, antenna towers or monopoles\nshall be set back and separated from all property boundary lines of\nthe lot on which they are located by a distance equal to the height\nof the tower plus the distance of the corresponding minimum yard setback\n(from street center line and front, side and rear lot lines) as set\nforth in the Schedule of Dimensional and Bulk Regulations for Residential\nand Nonresidential Districts.[2] The separation area shall be landscaped to provide effective\nall-season screening and buffering which reduces visual, aesthetic\nand community character intrusion impacts on adjacent properties,\nthe surrounding neighborhood, and on distant viewsheds and scenic\nareas. Alternative tower structures shall be utilized where possible\nand shall be preferred to typical tower installations.[Amended 7-14-2008 by L.L. No. 1-2008]"
												},
												{
													"footnote": "[2]\nEditor's Note: The schedules are included at the end of this\nchapter.\n"
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "Landscaping. All communication facilities shall provide landscaping\nas follows:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "All communication towers shall be located and designed to have\nthe least possible adverse visual and aesthetic effect on the environment."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "The area surrounding the installation, other than the area necessary\nto maintain a clear line of site to the signal source, shall be landscaped\nand maintained with trees, shrubs and ground cover to maximize screening\nand visual buffering. An existing natural vegetative buffer which\nmeets or exceeds the above requirements may be substituted or enhanced\nfor said requirements."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "Screening and buffering utilizing trees of a minimum height\nof 15 feet at planting and at a density that will, over time, reduce\nvisual impacts resulting from the installation of said facility shall\nbe provided."
																}
															]
														},
														{
															"number": "(d) ",
															"content": [
																{
																	"text": "The outside of security fencing shall be screened with evergreen\nshrubs, trees or climbing evergreen material on the fencing."
																}
															]
														},
														{
															"number": "(e) ",
															"content": [
																{
																	"text": "The base of any communication tower and any accessory structure\nshall be effectively screened using primarily vegetative screening,\nincluding a continuous evergreen screen planted in a natural setting\nand consisting of native plant species. Existing vegetation shall\nbe preserved to the maximum extent practicable. Additional plantings\nshall be required, as necessary, to screen, and buffer all structures\nfrom nearby properties or important viewsheds or scenic areas. All\nlandscaping shall be properly maintained to ensure continued screening\nand buffering."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(6) ",
											"content": [
												{
													"text": "Security and safety fencing. Security and safety fencing shall\nbe located around all communication towers, equipment and related\nfacilities to restrict unauthorized access. Access to all structures\nshall be through a locked gate or principal building. Fencing shall\nbe designed to minimize visual and aesthetic impacts and shall be\nequipped with appropriate anti-climbing devices. Failure to maintain\nsaid security and safety fencing in an appropriate manner shall be\ngrounds for immediate revocation of all permits and certificates of\nuse by the Building Inspector. In addition:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "All communication towers, antenna towers or monopoles and other\nsupporting structures shall be made inaccessible to nonauthorized\npersons, particularly children, and shall be constructed or shielded\nin such a manner that they cannot be climbed."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "All transmitter controls that could cause the transmitter to\ndeviate from its authorized operating parameters shall be designed\nand installed in such a manner that they are readily accessible only\nto persons authorized by the licensee to operate or service them."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "All transmitters used with in-building radiation systems shall\nbe designed in such a manner that, in the event that an unauthorized\nperson does gain access, that person can not cause the transmitter\nto deviate from its authorized operating parameters in such a way\nas to cause interference to other stations."
																}
															]
														},
														{
															"number": "(d) ",
															"content": [
																{
																	"text": "All transmitters (other than hand-carried or pack-carried mobile\ntransmitters) and control points shall be equipped with a visual means\nof indicating when the control circuitry has been put in a condition\nthat should cause the transmitter to radiate."
																}
															]
														},
														{
															"number": "(e) ",
															"content": [
																{
																	"text": "All transmitters shall be designed in such a manner that they\ncan be turned off independently of any remote control circuits."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(7) ",
											"content": [
												{
													"text": "Coloring and marking. Unless otherwise required by the FAA or\nFCC, all communication facilities, including antenna and communication\ntowers, shall be colored, camouflaged and/or shielded to blend with\nsurrounding areas, provided that such coloring, camouflage or shielding\ndoes not inhibit their effectiveness. The painting or marking of such\nfacilities shall have a finish or coloring which will minimize visual\nand aesthetic impacts. Towers and all appendages shall generally have\na galvanized finish and shall be painted gray or blue gray, or some\nother finish or color that is shown to be visually unobtrusive."
												}
											]
										},
										{
											"number": "(8) ",
											"content": [
												{
													"text": "Signals and lights. No communication tower, antenna tower or\nmonopole shall include any signals, lights or illumination unless\nrequired by the FAA or other applicable authority. The applicant shall\nprovide evidence mandating any requirement for lighting. If lighting\nis required, said lighting shall be shown to cause the least disturbance\nto surrounding properties and views. Any lighting necessary for accessory\nstructures or buildings shall be minimized and shall be properly shielded\nto prevent light emission and glare onto adjacent properties."
												}
											]
										},
										{
											"number": "(9) ",
											"content": [
												{
													"text": "Signage. No signs, including advertising signs, shall be permitted\non any antenna, communication tower, antenna tower or monopole or\nantenna support structure, except as follows:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "Signs specifically required by a federal, state or local agency."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "Each site shall include a sign containing the name of the owner\nand operator of any antenna present, including an emergency phone\nnumber. In addition, any door having access to a roof-mounted antenna\nand all entrances to the fenced enclosure shall be similarly signed."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "Any signage permitted above shall comply with Chapter 185, Signs, of the Town Code of the Town of Lewisboro."
																}
															]
														}
													]
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "F. ",
							"content": [
								{
									"text": "Operational certification."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Within 45 days of initial operation or modification of a communication facility, communication tower, antenna tower or monopole, the owner or operator shall submit to the Building Inspector a written certification by a professional engineer, with the qualifications set forth in Subsection D, that the operating facility is in compliance with the application submitted, any conditions imposed and all other provisions of this chapter, in order to continue operations past the forty-five-day period."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "The Town may confirm and periodically reconfirm compliance as\nnecessary to ensure that the provisions of this chapter, including\nNIER level thresholds, are in compliance."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "If any approved communication facility is found not to be in\ncompliance, said communication facility shall immediately cease operation."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "A yearly inspection on emissions and structural soundness shall\nbe submitted in writing to the Antenna Advisory Board and the Building\nInspector."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "G. ",
							"content": [
								{
									"text": "Interference."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "No permit shall be issued for any transmitting antenna which\ninterferes with the reception or transmission of any preexisting FCC-approved\ncommunication device or antenna which complies with current FCC standards\nand requirements."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "If interference results from the operation of any newly approved\ntransmitting antenna, the owner or operator of that most recently\ninstalled antenna shall immediately eliminate the interference or\ncease operation of the facility."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Failure to correct or eliminate the interference shall be subject\nto the immediate revocation of any and all operating permits, including\nany special permit, as issued by the Town of Lewisboro."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "H. ",
							"content": [
								{
									"text": "Alterations, amendments and waiver of application requirements.[Amended 7-14-2008 by L.L. No. 1-2008]"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Alterations. Alterations to an approved communication facility\nor communication tower may, at the discretion of the Planning Board,\nbe considered exempt from the requirements for special permit approval,\nprovided the following criteria are met and a building permit is obtained:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "Existing approved antennas and other related equipment may be\nupgraded, replaced or added to, provided:"
																},
																{
																	"content": [
																		{
																			"number": "[1] ",
																			"content": [
																				{
																					"text": "The upgrade, replacement or addition of antennas\nor other equipment onto an existing approved communication tower does\nnot result in any increase in the total height of said tower, including\nthe height of any approved antenna protruding above said tower structure."
																				}
																			]
																		},
																		{
																			"number": "[2] ",
																			"content": [
																				{
																					"text": "The combined bulk (or physical volume) of all antennas\nor other equipment shall be reduced, equal to, or result in an increase\nof less than 5%. Bulk (or \"volume\") shall be calculated in appropriate\ncubic (three-dimensional) units, such as cubic inches or cubic feet,\nand shall be compared to the total bulk last approved for the tower\nstructure."
																				}
																			]
																		}
																	]
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "Existing approved communication facility ground equipment may\nbe upgraded, replaced or added to, provided same can be accommodated\nwithin an approved fenced-in facility compound, building or structure.\nA facility alteration under this exemption shall not include the construction\nof any new accessory buildings, structures greater than eight feet\nin height, fencing, or other site improvements involving grading,\nvegetation removal or new land disturbances."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "Special permit approval exemption shall not be permitted or\ngranted where alteration of an approved communication facility and/or\ncommunication tower would result in displacement of or the inability\nfor collocation by an additional service provider."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Amendments. Applications amending an approved communication\nfacility or communication tower involving the added collocation to\nan approved communication facility or onto an approved communication\ntower, determined to be consistent with the structural, safety and\nvisual aspects of the approved facility or tower, shall be processed\nin an expedited manner."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Waiver. The Planning Board may waive, upon the request of the\napplicant and subject to appropriate circumstances, the application\nsubmission requirements which, in its judgment of the specific circumstances\nof a particular application or site, are not requisite in the interest\nof the public health, safety and general welfare, or are determined\nto be unnecessary or unrelated to the instant application."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "I. ",
							"content": [
								{
									"text": "Registration."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "The Town of Lewisboro Building Department shall maintain a list\nof the names and addresses of all operators and the type and maximum\nemissions of all communication facilities and all other antennas granted\na special permit or variance."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "If the name or address of the owner or operator of any communication\nfacility or communication tower is changed, the Building Department\nshall be notified in writing by the operator of the change within\n30 days of said change."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "J. ",
							"content": [
								{
									"text": "Removal."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Any antenna, communication facility, communication tower, antenna\ntower or monopole, including any supporting structure and related\nappurtenances, or part thereof that is not used for a period of six\nmonths in any twelve-month period shall be removed by, and at the\nexpense of, the owner of the property or the operator of said facility."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "An extension of an additional six months may be granted by the\nBuilding Inspector upon submittal of a written request for said extension,\nincluding proof as determined reasonable by the Building Inspector\nthat the owner is actively engaged in the marketing of the property\nfor sale or rent."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "K. ",
							"content": [
								{
									"text": "Exemptions."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "The following devices and sources of nonionizing electromagnetic\nradiation are exempt from the above provisions and shall be permitted\nin all residential and nonresidential zones:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "Machines and equipment designed and marketed as consumer products,\nsuch as walkie-talkies, remote control toys and cellular telephones."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "Hand-held, mobile, marine and portable radio communication transmitters\nand/or receivers."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "Two-way radio utilized for temporary or emergency service communications."
																}
															]
														},
														{
															"number": "(d) ",
															"content": [
																{
																	"text": "Two-way radio utilized for governmental service communications."
																}
															]
														},
														{
															"number": "(e) ",
															"content": [
																{
																	"text": "Maintenance or repair of a conforming or legal nonconforming\nantenna, provided that such action is in compliance with this chapter."
																}
															]
														},
														{
															"number": "(f) ",
															"content": [
																{
																	"text": "Backup wireless transmitters connected to an alarm monitoring\nservice that transmits to a remote monitoring center in the event\nof an emergency when the telephone lines are inoperable."
																}
															]
														},
														{
															"number": "(g) ",
															"content": [
																{
																	"text": "Towers and antennas for amateur radio services, state and Town\nof Lewisboro Police and Highway Department, and Town emergency services,\nfire and ambulance, which are constructed, installed and in service\nat the time of the adoption of these regulations. Any modifications\nto said installations shall be subject to the provisions set forth\nherein."
																}
															]
														},
														{
															"number": "(h) ",
															"content": [
																{
																	"text": "Provided that the applicant has met all preliminary requirements to be able to submit to the Town of Lewisboro Planning Board, and provided there is an application pending before the Planning Board for approval of a cell tower, then in such case temporary communication facilities, including, without limitation, a cell-on-wheels or cell-on-light-truck, shall be permitted by the applicant that submitted such application to the Planning Board on the subject parcel, in accordance with this section. If the applicant desires to install a temporary communication facility, then the applicant shall submit an application to the Town Board for a temporary communication facility, and the Town Board shall then determine whether the applicant has demonstrated a significant need for a temporary communication facility. If the Town Board determines that there is a significant need for the temporary facility, then the applicant may apply for a building permit under § 220-75 hereof and shall require no other permits therefor. The Town Board may impose such conditions as it deems necessary with respect to such temporary facility, which may include requirements relating to safety, fencing, access, noise, interference and appearance. However, the Town Board, prior to making a determination, may refer the matter to the Planning Board if the applicant proposes substantial physical alterations to the subject property in connection with the temporary facility, in which case Planning Board approval shall be required for such alterations to the parcel, which approval shall be required prior to the applicant's eligibility to place a temporary facility on the parcel pursuant to this section. The cell-on-wheels or cell-on-light-truck shall be permitted to remain for a period of six months, which period may be extended for an additional six months upon approval and determination by the Town Board that the significant need is continuing, and upon an extension of any permits issued by the Town of Lewisboro relating to such temporary facility. It is further required that in order to obtain any extensions of time hereunder, the application before the Planning Board has been diligently pursued by the applicant. For the purposes of this section, \"significant need\" may include the need to provide continuous wireless telephone service to any area of the Town, whether caused by an existing lack of coverage or area of inadequate coverage, a special event or circumstance, or repair or modification of an existing wireless telephone communication system. However, purely economic convenience shall not be considered a viable factor in making this determination.[Added 10-25-2010 by L.L. No. 2-2010]"
																}
															]
														},
														{
															"number": "(i) ",
															"content": [
																{
																	"text": "Upon a determination by the Supervisor of an emergency status, a temporary communication facility, including, without limitation, a cell-on-wheels or cell-on-light-truck, shall be permitted by issuance of a building permit under § 220-75 hereof, which use shall not exceed 30 days unless extended by the Town Board for further thirty-day periods upon a finding of continued emergency status. An emergency status shall be as defined in the Town of Lewisboro Comprehensive Emergency Management Plan, as amended from time to time by the Lewisboro Town Board.[Added 10-25-2010 by L.L. No. 2-2010]"
																}
															]
														}
													]
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "L. ",
							"content": [
								{
									"text": "Existing installations."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "The current operator of any communication facility or communication tower, antenna tower or monopole existing at the time that these regulations take effect shall be permitted to remain in operation, provided that the operator submits proof within six months of the enactment of these regulations that a valid building permit was issued for the facility and that the facility complies with current emission standards as recommended by the FCC, as certified by a professional engineer with the qualifications set forth in Subsection D."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Any legal nonconforming communication facility or communication tower shall be permitted to remain until such time as said use and facility is altered as defined in Subsection H."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Any facility for which emission and security compliance documentation\nis not received, shall cease operation within six months of the enactment\nof these regulations and shall be immediately removed thereafter."
												}
											]
										}
									]
								}
							]
						}
					]
				},
				{
					"footnote": "[1]\nEditor's Note: This local law also provided that limits\nfor maximum possible exposure (MPE) shall comply with FCC standards.\n"
				}
			]
		},
		{
			"paragraph": "§ 220-42",
			"title": "Agency-operated boarding homes or group homes.",
			"content": [
				{
					"text": "In accordance with the purposes of this chapter, as set forth in Article I hereof, and in furtherance of the policy of the State of New York to deinstitutionalize those persons cared for in their natural homes which are designed to give an outwardly similar appearance to other one-family dwellings, the following regulations shall apply to agency-operated boarding homes or group homes:"
				},
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Minimum lot area. The minimum lot area required for the establishment\nof an agency-operated boarding home shall be the same as that required\nfor other dwellings in the district in which it is located. For a\ngroup home, the minimum lot area requirement shall be increased by\n15% for each person in excess of six, up to the maximum permitted\nnumber of 12."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Spacing. For purposes of furthering the state's dispersal and\ndeinstitutionalization policy, to prevent the undue concentration\nof agency-operated boarding homes and group homes in any one area\nand to preserve the social as well as the physical character of one-family\nresidential neighborhoods, no new agency-operated boarding home or\ngroup home shall be established within two miles of any existing agency-operated\nboarding home or group home."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Off-street parking. A minimum of one off-street parking space shall\nbe provided for each staff member on the premises, plus two off-street\nparking spaces for visitors, plus such additional off-street parking\nspace as may be deemed appropriate by the Zoning Board of Appeals."
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "Other information. In addition to all other normally required items\nof information, the following additional documentation shall also\nbe submitted with the special permit application:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "A copy of the operating certificate issued by the New York State\nBoard of Social Welfare or the Department of Mental Hygiene, including\nany conditions and requirements attached hereto."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Copies of all correspondence between the applicant and the State\nof New York with respect to the proposed facility."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "A complete statement of the proposed type, number, age and permanency\nof residence of the persons to be cared for and the number and qualifications\nof both resident and nonresident adult supervisory personnel."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "A complete statement of the applicant's plans for the social\nand economic integration of the projected residents into the community,\nincluding their educational, employment and recreational needs, transportation\nand service requirements and any other such information as may be\nrelevant to the application and determined necessary by the Zoning\nBoard of Appeals."
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "A vicinity map indicating the location of the proposed facility in\nrelation to other existing agency-operated boarding homes, group homes\nor other similar types of care facilities within a radius of two miles\nof the subject site."
												}
											]
										},
										{
											"number": "(6) ",
											"content": [
												{
													"text": "Evidence of approval from the Westchester County Health Department."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "Changes. Any change in the nature, size or type of operation from\nthat originally approved shall be subject to a complete new application\nto the Board of Appeals in accordance with the same standards and\nprocedures as required for the original application."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 220-43",
			"title": "Limited-service carry-out restaurants with more than 10 seats.\n                                                                              [1]",
			"content": [
				{
					"text": "In addition to all other applicable standards and requirements\nas set forth in this chapter, limited-service carry-out restaurant\nestablishments with more than 10 seats shall only be permitted upon\nproperty within either the RB Retail Business District or GB General\nBusiness District, provided that:"
				},
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "The total building floor area shall not exceed 2,000 square feet\nin gross floor area."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "The exterior and interior architectural and physical design of the\nestablishment, including but not limited to the facade, signage, and\nfixtures, shall not include standardized decor elements, coloring,\nmotifs or layouts."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "The floor area devoted to food and beverage preparation shall not\nexceed 25% of the total gross floor area."
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "The total floor area devoted to customer service and interior seating\nshall not exceed 50% of the total gross floor area."
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "Drive-up or walk-up window service facilities shall not be permitted."
								}
							]
						},
						{
							"number": "F. ",
							"content": [
								{
									"text": "Internally illuminated signage shall not be permitted."
								}
							]
						},
						{
							"number": "G. ",
							"content": [
								{
									"text": "If located on a multitenant property, all exterior architectural\nelements, signage and lighting shall be integrated in a consistent\nand coordinated style, design and construction."
								}
							]
						},
						{
							"number": "H. ",
							"content": [
								{
									"text": "Properly designed and maintained refuse and recycling containers\nshall be provided within and on the exterior of the establishment\nby the operator. Said containers shall be maintained at all times\nto keep all areas free and clear from garbage, trash and other debris.\nSuch containers shall be of an appropriately durable material and\nof a design which is aesthetically consistent with the prevailing\ndesign theme of the premises and neighboring properties. Appropriate\nodor, insect and vector controls shall be employed. The containers\nshall be emptied on a regular basis, and exterior containers shall\nbe moved indoors at the end of each business day."
								}
							]
						}
					]
				},
				{
					"footnote": "[1]\nEditor's Note: Former § 220-43, Helistops,\nwas repealed 12-12-1995 by L.L. No. 7-1995.\n"
				}
			]
		},
		{
			"paragraph": "§ 220-43.1",
			"title": "Professional offices.",
			"content": [
				{
					"text": "The purpose of this section is to help create a more gradual transition from Retail Business and General Business Districts to specified residential districts by allowing certain limited types of professional offices as principal uses in existing buildings on appropriate sites, provided that they are designed in a manner which will help to preserve and enhance the residential character of such areas. Professional office uses which will not harmonize with or would be detrimental to the residential character of these areas are not to be permitted. The following specific standards would apply to such uses, in addition to the general criteria in Article V:"
				},
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Professional offices as principal uses in residence districts shall\nbe limited to uses meeting the Zoning Ordinance definition of a professional\noffice,[1] with the following exceptions:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Veterinarians' offices are expressly prohibited due to\nthe potential for adverse noise, odor and other impacts upon residential\nareas."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Real estate offices are expressly prohibited due to the potential\nfor adverse traffic impact and the likelihood of intensity of use\non weekends in residential areas."
												}
											]
										}
									]
								},
								{
									"footnote": "[1]\nEditor's Note: See § 220-2B.\n"
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Such professional office uses shall be permitted only when the following\nsite conditions are met:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "There must be a distance of not more than 100 feet between the lot upon which the use is proposed to be located and the boundary of a Retail Business (RB) or General Business (GB) District. This includes lots located across a New York State highway. This distance shall be measured on the Town of Lewisboro Tax Maps from the property line of the subject site closest to the RB or GB District and the zoning district boundary as shown on the Zoning Map of the Town of Lewisboro, New York.[2] Where uncertainty exists, § 220-5 of this chapter, Interpretation of district boundaries, shall be utilized."
												},
												{
													"footnote": "[2]\nEditor's Note: The Zoning Map is included at the end of this chapter.\n"
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "The lot must have frontage upon and have an existing driveway\nonto a New York State highway."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "The residential zoning district in which the lot is located\nmust be contiguous to a Retail Business or General Business District."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "The lot area must meet the minimum requirements for the residence\ndistrict in which it is located."
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "The structure in which the proposed professional office is to\nbe located must be the principal residential structure on a site.\nThe professional office as a principal use may not in any circumstances\nbe located in an accessory building or outbuilding such as a barn,\nkennel, garage or shed."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "The professional office use must be located in a building which existed prior to September 1, 1991. The exterior character of the building and design of the site shall be such that it will harmonize with the residential character of the district in which it is located. Buffer area requirements found in § 220-15B of this chapter shall apply to all applications for this use."
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "The following requirements for the existing driveway onto a New York\nState highway must be met:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "The driveway onto a New York State highway must have existed\non September 1, 1991. It is the express intent of this requirement\nthat absolutely no new driveways are established onto New York State\nhighways."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Existing sight distance must be determined as part of the application.\nAny deficiency in existing sight distance as determined by the Planning\nBoard, Highway Superintendent, Town Engineer or New York State Department\nof Transportation must be resolved to the satisfaction of the Planning\nBoard. In reviewing needed improvements to obtain adequate sight distance,\nthe Planning Board must consider the aesthetic impacts such improvements\nwould have on the character of the site and the neighborhood."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "The slope, length and condition of the existing drive shall\nbe reviewed by the Planning Board in determining the appropriateness\nof approving a professional office use. The Planning Board may require\nimprovements to the drive as a condition of the special use permit."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "Generally, the driveway should be an individual driveway with\nno separate easement, common driveway agreement or shared right-of-way\nfor any other lot. The Planning Board may allow exceptions to this\nrequirement if the following conditions are met:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "The professional office use will harmonize with the use of the\nadjoining properties using the common driveway or right-of-way."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "The applicant provides sufficient information on any agreement\nor easement providing right of access, including the number of users,\nmaintenance provisions and restrictions on limitations of use contained\ntherein, to enable the Planning Board to evaluate the effects of the\nproposed professional office."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "Any input of the landowners sharing the right-of-way or easement\nshall be duly considered by the Planning Board prior to granting a\nspecial permit for a professional office for a structure to be accessed\nvia a common or shared driveway, easement or right-of-way."
																}
															]
														}
													]
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "The following off-street parking requirements shall be met:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "The schedule of parking requirements for office, for business or for professional use (other than accessory to residential use) in § 220-56C of this chapter shall be met. Any applicable requirements for specific uses as listed in § 220-56D of this chapter shall also be met."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "All off-street parking shall be provided to the rear of the\nbuilding in which the professional office use is located, except that,\nwhere determined appropriate by the Planning Board based upon existing\nbuilding setbacks, topography and/or screening, some or all of the\nrequired parking may be located in a side or front yard."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "All off-street parking areas shall be screened from neighboring\nresidential properties to the extent determined appropriate by the\nPlanning Board."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "F. ",
							"content": [
								{
									"text": "There shall be no external evidence of the professional office except for signage in accordance with Chapter 185, Signs.[Amended 2-23-1993 by L.L. No. 5-1993]"
								}
							]
						},
						{
							"number": "G. ",
							"content": [
								{
									"text": "The proposed extent of alteration of a structure, including any changes\nnecessary to comply with the New York State Uniform Fire Prevention\nand Building Code, shall be presented to the Planning Board. Structures\nare not to be significantly enlarged, expanded or otherwise significantly\naltered externally. The Planning Board will consider the following\ncriteria in reviewing applications that would involve interior or\nexterior alterations:[Amended 3-10-1992 by L.L. No. 2-1992]"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "The extent to which the external appearance of the site will\nchange."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "The potential impact upon the residential character of the structure\nand immediate vicinity."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "The extent to which alterations are required to meet Building\nCode requirements."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "The increases in traffic generation and intensity of use likely\nto be experienced."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "H. ",
							"content": [
								{
									"text": "The proposed structure must be found by the Planning Board to be\nprincipally oriented towards a New York State highway, rather than\nan existing residential street, or otherwise be removed from a New\nYork State highway neighborhood."
								}
							]
						},
						{
							"number": "I. ",
							"content": [
								{
									"text": "In approving the issuance of a special permit for a professional\noffice use, the Planning Board may limit the hours of operation and\nmay establish such other requirements which would control intensity\nof use or which it determines to be necessary or appropriate to minimize\nthe potential impact of such use upon neighboring residential properties\nand public streets."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 220-43.2",
			"title": "Private nature preserves.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Findings and purpose."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "The Town hereby finds that the preservation of open space in\nits natural condition and the promotion of public understanding, awareness\nand appreciation of the natural environment make important contributions\nto the quality of life in the Town, and the Town welcomes the contribution\nto the achievement of that goal made by private not-for-profit efforts\nsupplementing those of public agencies."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "The Town finds further that it is necessary to achieve compatibility\nbetween the activities normally carried on by organizations entrusted\nwith the task of running nature preserves and providing related environmental\nand agricultural education programs and the residential uses in their\nvicinity."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Site standards. The following site standards shall apply to all private\nnature preserves:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Minimum lot size. No lot consisting of fewer than 10 acres of\nland shall qualify for a private nature preserve."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Access. A lot containing a private nature preserve may be located on a public or private street, provided that said street has direct access to a state highway or major street, as defined under § 195-11 of the Town's Subdivision Regulations, or collector road, as defined in the Town's Master Plan."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Permitted accessory uses: any accessory use determined by the\nPlanning Board to be customarily incidental to a private nature preserve.\nCustomary incidental accessory uses shall include, but are not limited\nto, administration buildings, maintenance buildings, education and\nresearch areas, animal enclosures, storage buildings, and dwelling\nunits for the founder, manager, or for employees of the private nature\npreserve, except that no more than two dwelling units per 10 acres\nof land shall be permitted."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "Fencing, landscaping, and buffers. The Planning Board shall\ndetermine appropriate forms of fencing, landscaping or other buffering\ntechniques to mitigate noise, glare, visual, and other potential adverse\nimpacts."
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "All wetlands shall be delineated or verified in accordance with Chapter 217 of the Code of the Town of Lewisboro and the applicant shall demonstrate how the waste of those animals under care will not impact groundwater and wetlands, watercourses, or water bodies located on or adjacent to the site."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Traffic controls. At a minimum, the Planning Board shall consider\nthe following:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Preserve staff to provide for the control of traffic coming\nto and leaving the site during functions that produce traffic in excess\nof customary daily traffic conditions."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "The use of buses and/or vans to provide transportation to and\nfrom the site. The Planning Board shall consider and may regulate\nthe quantity, type and size of vehicles entering and exiting the site."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "The Planning Board may recommend to the Town Board that on-street\nparking in the vicinity of the private nature preserve be limited,\nreduced, or eliminated."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "The location and design of off-street parking spaces shall be consistent with Article VII of this chapter; however, the number of spaces required shall be determined by the Planning Board. In determining the minimum spaces to be provided, the Planning Board may require the applicant to submit a parking needs study."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "Approvals required. The Planning Board may condition its approval\nupon the applicant's obtaining all other required local, county,\nstate, and/or federal permits or approvals, including, but not limited\nto, any approvals or permits from the United States Department of\nAgriculture, the New York State Department of Environmental Conservation,\nDivision of Fish, Wildlife and Marine Resources, and the United States\nFish and Wildlife Service."
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "Conditions of operation."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Programs. The Planning Board may establish conditions, including,\nbut not necessarily limited to, hours of operation, maximum number\nof visitors, maximum number of programs per day, minimum time interval\nbetween programs and/or the starting times thereof, traffic controls,\nand notification requirements."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "All activities shall be operated pursuant to Code of the Town\nof Lewisboro and the conditions of the special use permit. Upon failure\nto do so, the special use permit may be rescinded by the Planning\nBoard, after a public hearing thereon, at which time the permit holder\nshall have an opportunity to be heard."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "F. ",
							"content": [
								{
									"text": "Inspection. The Planning Board or its representatives shall be entitled,\nupon reasonable notice to the permit holder, to conduct inspections\nof the facility to ensure compliance with the special use permit."
								}
							]
						},
						{
							"number": "G. ",
							"content": [
								{
									"text": "Term of permit; renewal and amendment. The special use permit shall\nbe issued for an initial term of two years and shall thereafter be\nrenewed every five years. The special use permit may be renewed or\namended by the Planning Board any time prior to the expiration of\nsaid permit upon receipt of a written request from the permit holder\nor the owner of land. Renewals and/or amendments shall be acted upon\nby the Planning Board in the same manner as would be required for\na new special use permit. A renewal shall not be granted if the Planning\nBoard finds that the permit holder has not substantially complied\nwith the originally approved special use permit."
								}
							]
						},
						{
							"number": "H. ",
							"content": [
								{
									"text": "Records. Program registration and scheduling records, in either paper\nor digital form, shall be maintained by the permit holder for a minimum\nof five years and shall be available for inspection by the Town or\nits representatives upon reasonable notice to the permit holder and\nduring normal business hours."
								}
							]
						},
						{
							"number": "I. ",
							"content": [
								{
									"text": "Following the effective date of this section, any existing private\nnature preserve that requires a special use permit as a result of\nthe adoption of this section shall have 90 days within which to apply.\nAny application duly filed and diligently pursued by the applicant\nshall stay the enforcement of any proceeding by the Town with respect\nto the use of the property which is the subject of the application."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 220-43.3",
			"title": "Bed-and-breakfast establishments.\n                                                                              [1]",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Purpose. It is the specific purpose and intent of this provision\nto address the need of residents to locate convenient accommodation\nfor visitors, to provide local accommodation for short-term visitors\nto the community, to encourage preservation of large older dwellings\nby providing a cost-effective alternate or adaptive use that can relieve\nthe maintenance burden on the owners of such buildings and to encourage\nthe preservation of large residential lots and their open space character\nby permitting an alternative use consistent with the residential character\nof the community. Furthermore, it is the purpose and intent of this\nprovision to provide economic support for present resident families,\nto protect and preserve property values, to ensure healthy and safe\nliving conditions and to have more effective regulation and control\nof Town growth and development. In furtherance of these purposes,\nspecific conditions are set forth herein for bed-and-breakfast establishments."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Bed-and-breakfast establishments shall be special uses as follows:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "In addition to the specific requirements set forth herein, the\nproperty and the principal and accessory structures located thereon\nshall conform to the lot area, yard and other requirements for the\nzoning district in which the property and structures are located unless\na variance therefor shall have been granted by the Board of Appeals."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "The building housing a bed-and-breakfast establishment shall\nbe an existing, detached single-family dwelling, and its use as a\nbed-and-breakfast establishment shall not conflict with its appearance\nor function as such."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "The minimum lot size on which a bed-and-breakfast establishment\nmay be located is two acres. A bed-and-breakfast establishment may\nbe permitted on a lot with a smaller area only if such lot is located\nin a nonresidential district, the Planning Board finds that a bed-and-breakfast\nestablishment can be adequately accommodated within the existing principal\ndwelling building, that it will not overburden the property, and that\nit will be a use compatible with the surrounding properties."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "The owner of the lot upon which the bed-and-breakfast establishment\nis to operate shall occupy and maintain the bed-and-breakfast establishment\nas his/her primary legal residence. The owner of the lot must reside\nin the premises at the time rooms are being used by guests."
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "The maximum number of bedrooms that may be available to overnight\nguests shall be three bedrooms. The Planning Board shall be responsible\nfor determining and limiting the number of bedrooms in each dwelling\nin connection with its review of the special use permit application."
												}
											]
										},
										{
											"number": "(6) ",
											"content": [
												{
													"text": "Guests in such bed-and-breakfast establishment may reside in\nsuch establishment for a maximum of three nights. The maximum occupancy\nof each guest room in the bed-and-breakfast establishment shall be\ntwo adults and their minor children, as long as such occupancy is\nin compliance with the New York State Uniform Fire Prevention and\nBuilding Code."
												}
											]
										},
										{
											"number": "(7) ",
											"content": [
												{
													"text": "Meal service shall be limited to a morning meal served to overnight\nguests of the bed-and-breakfast establishment only."
												}
											]
										},
										{
											"number": "(8) ",
											"content": [
												{
													"text": "There shall be one price per night for overnight guests of the\nbed-and-breakfast establishment, which price shall include the morning\nmeal."
												}
											]
										},
										{
											"number": "(9) ",
											"content": [
												{
													"text": "No fewer than one off-street parking space shall be provided\nper bedroom designated as available for overnight guests. Said parking\nshall be in addition to the parking required by this chapter for the\nsingle-family dwelling use. The Planning Board shall be responsible\nin connection with its review of the special use permit application\nfor determining that the required number of parking spaces can be\nprovided in a safe manner on the subject lot so as to not establish\na nuisance or burden for adjacent and surrounding lots."
												}
											]
										},
										{
											"number": "(10) ",
											"content": [
												{
													"text": "Evidence of the approval of the proposed method and adequacy\nof water supply and sewage disposal shall be obtained from the Westchester\nCounty Department of Health."
												}
											]
										},
										{
											"number": "(11) ",
											"content": [
												{
													"text": "The special use permit shall be granted for a period of three\nyears and may be renewed for additional three-year periods. An application\nfor, and a renewal of, the special use permit shall be made to the\nBuilding Department on a form provided by the Building Department\nfor such purpose, and by payment of a fee in an amount set forth in\na fee schedule as adopted and as may be amended from time to time\nby resolution of the Town Board. The Building Department, after receiving\nthe completed application and fee, shall reissue the special use permit\nif inspection of the premises finds it to be in compliance with all\napplicable codes including the New York State Uniform Fire Prevention\nand Building Code, the requirements of this section and the provisions\nof the original special use permit approval. If the Building Department\nfinds that the property is not in compliance with all applicable codes\nincluding the New York State Uniform Fire Prevention and Building\nCode, the requirements of this section and the provisions of the original\nspecial use permit approval, then the Building Department shall refer\nthe application to the Planning Board for action."
												}
											]
										},
										{
											"number": "(12) ",
											"content": [
												{
													"text": "Each property for which a special permit has been issued for\nuse as a bed-and-breakfast establishment is subject to periodic inspections\nby the Building Department and Fire Inspector to ensure continued\ncompliance with all applicable codes, including the New York State\nUniform Fire Prevention and Building Code, the requirements of this\nsection and the provisions of the original special use permit approval.\nSuch inspections shall be conducted at least annually, and may be\nconducted more frequently if the Building Department or Fire Inspector\nreasonably suspects that more frequent inspections are necessary to\nensure the safety of the bed-and-breakfast establishment."
												}
											]
										},
										{
											"number": "(13) ",
											"content": [
												{
													"text": "If any inspection of the property and dwelling by the Building\nDepartment or Fire Inspector for the purpose of ensuring compliance\nwith the provisions of this section is refused by the owner, when\nsaid inspection occurs at any reasonable time during daylight hours,\nor if the continuing conditions of the special use permit are violated,\nthe special permit shall be subject to revocation after a hearing\nby the Planning Board at which the permit holder is provided an opportunity\nto be heard."
												}
											]
										},
										{
											"number": "(14) ",
											"content": [
												{
													"text": "When during the review of an application the Planning Board\nfinds that significant site work will be required to increase parking\nareas, to enlarge subsurface sewage disposal areas or to otherwise\nalter the physical site conditions, the Planning Board shall require\nthe submission of a site plan which shall be processed concurrently\nwith the application for a special use permit. In all other situations,\nsite plan approval by the Planning Board shall not be required."
												}
											]
										},
										{
											"number": "(15) ",
											"content": [
												{
													"text": "In addition to the special standards described above, bed-and-breakfast establishments shall comply with any other requirements of this chapter and any special requirements deemed appropriate by the approving agency in accordance with the requirements of § 220-32 herein."
												}
											]
										}
									]
								}
							]
						}
					]
				},
				{
					"footnote": "[1]\nEditor’s Note: Former § 220-43.3, Riding academies,\nadded 7-29-2013 by L.L. No. 7-2013, was repealed 11-7-2013 by L.L.\nNo. 10-2013.\n"
				}
			]
		},
		{
			"paragraph": "§ 220-43.4",
			"title": "Construction or placement of accessory building on lot located proximate to or across street from principal building.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Purpose. The purpose and intent of this section is to allow an accessory\nbuilding, specifically a private garage or shed, to be constructed\nor placed on a lot located proximate to or across the street from\nthe principal building to which it shall serve. This section is intended\nto provide some relief to homeowners when it is determined that the\nprincipal building lot cannot reasonably accommodate an accessory\nbuilding."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "The construction or placement of an accessory building on a lot located\nproximate to or across the street from a principal building shall\nrequire a special use permit and shall only be authorized when all\nof the following conditions are satisfied:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "The principal and accessory building lots shall be in the same\nownership and shall be accompanied with a deed restriction establishing\nthat the accessory building lot can only be conveyed with the parcel\non which the principal building is located."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "The location of the accessory building lot shall meet one of\nthe following criteria:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "The accessory building lot shall be located immediately opposite\nand across the street from the principal building lot. For the purposes\nof this section, \"immediately opposite\" shall mean that a straight\nor diagonal line can be drawn through the street line of both lots\nwithout intersecting another lot, other than that associated with\nthe street right-of-way."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "The accessory building lot shall be located not more than 20\nfeet from the principal building lot. This provision shall only apply\nwhen the two building lots are separated by one or more lots that\nare under different ownership and therefore cannot be merged."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Both the accessory building lot and the principal building lot\nshall be located within a residential district."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "The construction or placement of an accessory building on a\nlot located proximate to or across the street from the principal building\nshall only be permitted when it is demonstrated that the principal\nbuilding lot does not presently contain or cannot reasonably accommodate\nthe accessory building."
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "Accessory buildings authorized under this section shall be limited to private garages and sheds, subject to § 220-23D, Permitted accessory uses, of this chapter."
												}
											]
										},
										{
											"number": "(6) ",
											"content": [
												{
													"text": "A maximum of one accessory building shall be allowed on the\naccessory building lot."
												}
											]
										},
										{
											"number": "(7) ",
											"content": [
												{
													"text": "The accessory building and accessory building lot shall be suitably\ndeveloped to complement the principal building and principal building\nlot."
												}
											]
										},
										{
											"number": "(8) ",
											"content": [
												{
													"text": "The use of the accessory building shall be clearly incidental to and customarily found in conjunction with the primary residential building to which it serves. The use of the accessory building shall not include any activity commonly conducted for gain, with the exception of home occupation, subject to § 220-23D(1)."
												}
											]
										},
										{
											"number": "(9) ",
											"content": [
												{
													"text": "The outdoor storage of vehicles, trailers, boats, campers, motor\nhomes, equipment, materials, or refuse shall be prohibited on the\naccessory building lot; all matter shall be stored within a fully\nenclosed building."
												}
											]
										},
										{
											"number": "(10) ",
											"content": [
												{
													"text": "In cases of private garages intended for the indoor parking\nof vehicles, no garage shall be approved where the vehicle must back\nout into a street to exit; provisions shall be made so that the vehicle\ncan turn around on the accessory building lot before exiting the lot."
												}
											]
										},
										{
											"number": "(11) ",
											"content": [
												{
													"text": "The accessory building shall not contain a bathroom nor shall\nit contain plumbing facilities; the accessory building lot shall not\ncontain a well that is subject to Westchester County Department of\nHealth rules and regulations."
												}
											]
										},
										{
											"number": "(12) ",
											"content": [
												{
													"text": "All proposed utilities serving the accessory building shall\nbe installed underground."
												}
											]
										}
									]
								}
							]
						}
					]
				}
			]
		}
	]
}