{
	"url": "http://ecode360.com/6196171",
	"paras": [
		{
			"paragraph": "§ 196",
			"title": "Table of Dimensional Regulations",
			"content": [
				{
					"text": "The following regulations apply in an A-4 district:"
				},
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Lot Area(square feet) minimum: 43,500"
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Lot coverage maximum by main and accessory buildings and structures: 25%"
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Lot Width minimum(feet): 125"
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "Street Frontage minimum(feet): 125"
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "Height maximum(feet): 32"
								}
							]
						},
						{
							"number": "F. ",
							"content": [
								{
									"text": "Yards, prinicpal building minimum(feet), Front: 40"
								}
							]
						},
						{
							"number": "G. ",
							"content": [
								{
									"text": "Yards, prinicpal building minimum(feet). Side, mimimum for one: 25"
								}
							]
						},
						{
							"number": "H. ",
							"content": [
								{
									"text": "Yards, prinicpal building minimum(feet), Side, total for both on interior lot: 50"
								}
							]
						},
						{
							"number": "I. ",
							"content": [
								{
									"text": "Yards, prinicpal building minimum(feet), Side, abutting side street on corner lot: 40"
								}
							]
						},
						{
							"number": "J. ",
							"content": [
								{
									"text": "Yards, prinicpal building minimum(feet), Rear: 50"
								}
							]
						},
						{
							"number": "K. ",
							"content": [
								{
									"text": "Yards, accessory buildings and structures, Minimum distance from street(feet): 40"
								}
							]
						},
						{
							"number": "L. ",
							"content": [
								{
									"text": "Yards, accessory buildings and structures, Minimum distance from side and rear lot lines(feet): 25"
								}
							]
						},
						{
							"number": "M. ",
							"content": [
								{
									"text": "Yards, accessory buildings and structures, Minimum living quarters space(square feet of floor area): 925"
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 196-46",
			"title": "Height of certain structures.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "The height of a chimney may exceed the maximum height limitation\nset forth in the Table of Dimensional Regulations,[1] provided that the height of such chimney is not more than\nfive feet above the highest point of the highest roof."
								},
								{
									"footnote": "[1]\nEditor's Note: The Table of Dimensional Regulations is\nincluded at the end of this chapter.\n"
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "The maximum height limitation set forth in the Table of Dimensional\nRegulations shall not apply to church steeples, cupolas on public\nbuildings, flagpoles and electronic antennas."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 196-47",
			"title": "Height of certain buildings.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "The height of a building with a pitched roof may exceed the maximum\nheight limitation set forth in the Table of Dimensional Regulations,[1] provided that:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "The height of such building shall not exceed 35 feet."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "The highest point of any flat roof shall not exceed 32 feet in height."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "The highest point of any mansard roof shall not exceed 32 feet in\nheight."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "The highest point of the highest pitched roof shall not exceed 35\nfeet in height, and the highest point of any other pitched roof shall\nnot exceed 35 feet in height."
												}
											]
										}
									]
								},
								{
									"footnote": "[1]\nEditor's Note: The Table of Dimensional Regulations is\nincluded at the end of this chapter.\n"
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "In the case of a building with a pitched roof where the provisions of Subsection A above are applicable, the height of a structure on the pitched roof may exceed the maximum height limitation set forth in the Table of Dimensional Regulations, provided that the height of such structure shall not exceed 35 feet."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Relief for certain one-family dwellings.[Added 2-20-2009 by L.L. No. 2-2009]"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "In the case of a one-family dwelling which is required to be elevated to the base flood level pursuant to the requirements of Chapter 95 and which is required to be further elevated above the base flood level pursuant to the freeboard requirement of the New York State Residential Code, the Zoning Administrator is hereby authorized to grant height relief permitting the height of such dwelling to exceed the maximum height limitation which would otherwise be applicable (which would be applicable in the absence of such relief) by not more than two feet."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "This relief provision (Subsection C) may be repealed at any time by resolution of the Board of Trustees."
												}
											]
										}
									]
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 196-48",
			"title": "Height of portions of one-family dwellings within required yards.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "The highest point of any portion of a one-family dwelling within\na required yard shall not exceed 16 feet in height."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "The authority of the Zoning Board of Appeals to grant a yard (setback)\nvariance for any portion of a one-family dwelling proposed to be located\nwithin a required yard shall be subject to the following limitation,\nto wit, the highest point of such portion shall not exceed 16 feet\nin height."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "It is the intent of Subsections A and B above that, if the highest point of any portion of a one-family dwelling to be located within a required yard is proposed to exceed 16 feet in height, then the application to the Zoning Board of Appeals must expressly request and address both yard and height variances, and the burden of proof shall be on the applicant to show that such multiple variances are warranted."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 196-49",
			"title": "Maximum gross floor area of one-family dwellings.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "The maximum gross floor area of a one-family dwelling shall be 12%\nof the lot area of the lot, plus 1,200 square feet."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "In the case of a lot where the maximum gross floor area limitation calculated pursuant to Subsection A above would permit a one-family dwelling having more than 16,000 square feet of gross floor area, the maximum gross floor area limitation applicable to such lot shall be 16,000 square feet. It is the intent of this provision that, notwithstanding Subsection A above, the gross floor area of a one-family dwelling shall not exceed 16,000 square feet under any circumstance."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "As used herein, the term \"gross floor area\" shall include the total\ngross horizontal area of all floors of a dwelling measured to the\nexterior of the outside walls, including the horizontal floor area\nof any garage which is part of the dwelling, the horizontal floor\narea of any enclosed breezeway which is part of the dwelling, and\nthe horizontal floor area of any enclosed porch, but excluding the\nfollowing:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "The floor area of a basement or cellar shall be excluded in calculating\nthe gross floor area, provided that the basement or cellar has more\nthan 1/2 of its height (measured from floor to ceiling) below finished\ngrade."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "The floor area of spaces with ceiling heights (measured from floor\nto ceiling) of less than five feet shall be excluded in calculating\nthe gross floor area. The floor area of attic space (to wit, unfinished\nspace between the ceiling joists of the top story and the roof rafters)\nshall be excluded in calculating the gross floor area."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Any floor area under the roof of a roofed porch or similar roofed\nstructure attached to the dwelling shall be excluded in calculating\nthe gross floor area, provided that the roofed porch or similar roofed\nstructure is not enclosed."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "In the case of an oceanfront lot, the portion of the lot situate\nbetween the ocean and the crest of the first rank of ocean beach dunes\nshall be excluded in calculating the lot area of such lot for the\npurpose of computing the maximum gross floor area of a one-family\ndwelling on such lot."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 196-50",
			"title": "through § 196-53. (Reserved)",
			"content": []
		},
		{
			"paragraph": "§ 196-54",
			"title": "Required lot lines in Residence A-4 District.",
			"content": [
				{
					"text": "Every lot hereafter created in the Residence A-4 District shall\nhave as its easterly line the westerly line of Old Main Road and as\nits westerly line the easterly line of Quantuck Creek, except as follows:\nThe Board of Trustees may, after public hearing, modify the foregoing\nrequirement by the issuance of a special permit, as a special exception\nuse, granting permission for a lot to front upon an interior private\nor public road, one terminus of which is the westerly line of Old\nMain Road, provided that a permit for such residential development\nis obtained from the Department of Environmental Conservation."
				}
			]
		},
		{
			"paragraph": "§ 196-55",
			"title": "North and south lines of certain lots.",
			"content": [
				{
					"text": "Except as modified by the Board of Trustees by the issuance of a special permit as a special exception use, permitting lots to front upon an interior private or public road as set forth in § 196-56, every lot hereafter created in the area bounded on the west by the westerly Village boundary line, north by Quantuck Bay, Quogue Canal and Shinnecock Bay, east by the easterly Village boundary line and south by the northerly boundary line of Dune Road shall have as its southerly line the northerly line of Dune Road and as its northerly line Quantuck Bay, Quogue Canal and/or Shinnecock Bay."
				}
			]
		},
		{
			"paragraph": "§ 196-56",
			"title": "Modification of required lot lines.",
			"content": [
				{
					"text": "Anything in § 196-55 above to the contrary notwithstanding, the Board of Trustees may, after public hearing, modify the provisions of said § 196-55, as a special exception use, by granting permission for lots created in that portion of the area adjacent to Dune Road as may be zoned Residence A-8 District and which have received a permit for residential development from the Department of Environmental Conservation to have their frontage on a public or private interior road, one terminus of which is the northerly line of Dune Road."
				}
			]
		}
	]
}