{
	"url": "http://ecode360.com/7203802",
	"paras": [
		{
			"paragraph": "§ 250-44",
			"title": "Applicability.",
			"content": [
				{
					"text": "The Board of Trustees may rezone any property\nin the C Residence District to CA Residence District if and only if\nsuch property measures at least 13,500 square feet in contiguous area\nand was not developed in whole or part with any residential uses for\na continuous period of not less than 10 years immediately prior to\nthe effective date of this chapter. In a CA Residence District, the\nfollowing regulations shall apply."
				}
			]
		},
		{
			"paragraph": "§ 250-45",
			"title": "Permitted uses.",
			"content": [
				{
					"text": "A building may be erected, altered or used and\na lot or premises may be used for the following purposes, and for\nno other:"
				},
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Single-family townhouses, including the office, studio\nor occupational room of a professional person, such as a physician,\ndentist, lawyer, artist, architect, real estate broker, engineer or\naccountant or other similar uses that may be authorized by the Board\nof Zoning Appeals when located in the same apartment or suite of rooms\nin which the practitioner resides and incidental to such residential\nuse, and provided that there is no display of goods or advertising\nother than a sign not larger than six inches by 12 inches attached\nto the building and bearing only the name and occupation (words only)\nof the practitioner."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 250-46",
			"title": "Height.",
			"content": [
				{
					"text": "No building shall be greater than 2 1/2\nstories and 33 feet in height to peak."
				}
			]
		},
		{
			"paragraph": "§ 250-47",
			"title": "Lot coverage.",
			"content": [
				{
					"text": "The lot coverage shall not exceed 35% of the\nlot area."
				}
			]
		},
		{
			"paragraph": "§ 250-48",
			"title": "Front yards.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "The required front yard depth shall be a minimum of\n25 feet."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "In the case of a corner lot, a front yard shall be\nrequired on each street."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 250-49",
			"title": "Side yards.",
			"content": [
				{
					"text": "There shall be two side yards, one on each side\nof the main building, each having a minimum width of at least 20 feet,\nexcept that where there are two or more main buildings upon the plot,\nthe minimum side yard requirement of 20 feet shall apply only along\nthe side property lines of the entire plot."
				}
			]
		},
		{
			"paragraph": "§ 250-50",
			"title": "Rear yards.",
			"content": [
				{
					"text": "There shall be a rear yard, the depth of which\nshall be at least 25 feet."
				}
			]
		},
		{
			"paragraph": "§ 250-51",
			"title": "Permitted encroachments.",
			"content": [
				{
					"text": "Cornices, eaves, gutters or bay windows projecting\nnot more than 24 inches are hereby permitted as encroachments."
				}
			]
		},
		{
			"paragraph": "§ 250-52",
			"title": "Accessory buildings, structures and uses.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Accessory buildings may occupy no greater than 40%\nof the area of the rear yard, with a maximum height of no greater\nthan 12 feet. The yard area occupied by such accessory buildings shall\nbe included in computing the maximum percentage of the lot area which\nmay be built upon. An accessory building shall not be nearer to any\nfront property line than 45 feet and must be at least two feet from\nthe rear and side property lines, except that accessory garages may\nhave a party wall."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Outdoor or indoor pools shall be considered accessory\nstructures and subject to the following requirements:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Site plan. All pools shall be shown on the site plan\nand may be permitted by the Board of Trustees of the Village of Atlantic\nBeach as a special exception only upon making a finding as part of\nthe resolution granting said special exception that the proposed pool\nand ancillary equipment or facilities:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "Will not adversely affect the public health,\nsafety and general welfare;"
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "Will be limited to use by the residents and\nguests of the subject single-family townhouse;"
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "Will not tend to depreciate the value of the\nproperty in the area immediately adjoining the land being so used;"
																}
															]
														},
														{
															"number": "(d) ",
															"content": [
																{
																	"text": "Will not tend to alter the essential character\nof the neighborhood; and"
																}
															]
														},
														{
															"number": "(e) ",
															"content": [
																{
																	"text": "Will not be visible to a significant extent\nfrom adjoining residential properties nor interfere with the use and\nenjoyment of adjoining properties."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "No aboveground pools are permitted."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "In order to ensure the health and safety of the community,\nand particularly the children thereof, the following specific conditions\nhereby are imposed on all swimming pools of permanent construction:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "Any electric wiring for lighting or other use,\nother than for lighting which is part of and enclosed in the pool\nstructures, shall not be maintained closer than 15 feet to said pool."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "The pool shall be located no nearer than 20\nfeet to any cesspool or dry well (excluding roof leader dry wells)\non its own or adjacent property."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "Any water from a public water supply shall be\nintroduced into a swimming pool by means of a permanent rigid system\nof piping and shall in every manner conform to the New York State\nSanitary Code."
																}
															]
														},
														{
															"number": "(d) ",
															"content": [
																{
																	"text": "No swimming pool shall have a water capacity\nin excess of 7,500 gallons without a recirculating and filtering system\nof sufficient capacity to meet good and accepted public health and\nengineering practice."
																}
															]
														},
														{
															"number": "(e) ",
															"content": [
																{
																	"text": "A permit, when issued, also may have endorsed\nthereon any such reasonable rules and regulations for the operation,\nmaintenance and use of such pool as may be promulgated by the Building\nInspector."
																}
															]
														},
														{
															"number": "(f) ",
															"content": [
																{
																	"text": "A fence meeting the requirements of Article XI of this chapter shall be provided."
																}
															]
														},
														{
															"number": "(g) ",
															"content": [
																{
																	"text": "No part of any pool shall be located within\n50 feet of any external property line nor within 100 feet of any residence\ndistrict boundary."
																}
															]
														},
														{
															"number": "(h) ",
															"content": [
																{
																	"text": "The fence referred to in Subsection B(3)(f) above shall be erected at least eight feet from the edge of the pool. Said fence shall be at least 45 feet from any property line unless the Board of Trustees or the Building Inspector shall direct otherwise as part of site plan approval."
																}
															]
														},
														{
															"number": "(i) ",
															"content": [
																{
																	"text": "A walkway of at least eight feet in width shall\nbe built on all sides of the pool."
																}
															]
														},
														{
															"number": "(j) ",
															"content": [
																{
																	"text": "All lighting accessory to said pool shall be\nlocated at a distance of at least two feet therefrom and shall not\nthrow any rays beyond property lines. Underwater lighting may be part\nof the pool structure where so designated on the plans submitted to\nthe Board of Trustees."
																}
															]
														},
														{
															"number": "(k) ",
															"content": [
																{
																	"text": "No permission shall be granted for the installation of any swimming pool unless the plans meet the requirements of Article XI of this chapter, and/or such other requirements imposed by the Board of Trustees or the Building Inspector."
																}
															]
														},
														{
															"number": "(l) ",
															"content": [
																{
																	"text": "All applications and the plans submitted in\nconnection therewith shall indicate the approval of any governmental\nagency having jurisdiction of the local water supply."
																}
															]
														},
														{
															"number": "(m) ",
															"content": [
																{
																	"text": "Application. The following information shall\nbe submitted at the time of the application for a permit for the entire\ndevelopment or may be submitted at a later date as part of a request\nfor a separate swimming pool permit:"
																},
																{
																	"content": [
																		{
																			"number": "[1] ",
																			"content": [
																				{
																					"text": "The location and size of the swimming pool area."
																				}
																			]
																		},
																		{
																			"number": "[2] ",
																			"content": [
																				{
																					"text": "The location of all structures and improvements."
																				}
																			]
																		},
																		{
																			"number": "[3] ",
																			"content": [
																				{
																					"text": "The location of the site in relation to adjacent\nproperties and buildings."
																				}
																			]
																		},
																		{
																			"number": "[4] ",
																			"content": [
																				{
																					"text": "The location of all cesspools within 50 feet\nof the pool or pool dry wells."
																				}
																			]
																		},
																		{
																			"number": "[5] ",
																			"content": [
																				{
																					"text": "The size of the pool, including dimensions,\ndesign and elevation thereof, drainage, sewerage, sanitary facilities,\nsafety walkway around the pool, fences and location thereof in relation\nto said pool and property lines."
																				}
																			]
																		},
																		{
																			"number": "[6] ",
																			"content": [
																				{
																					"text": "The location of all electrical wiring and lines."
																				}
																			]
																		},
																		{
																			"number": "[7] ",
																			"content": [
																				{
																					"text": "The breakdown of estimated costs used in the\napplication."
																				}
																			]
																		}
																	]
																}
															]
														},
														{
															"number": "(n) ",
															"content": [
																{
																	"text": "All heaters and filters used in or in connection\nwith the operation of the pool shall be located and placed not closer\nthan 75 feet to any and all residence boundaries."
																}
															]
														},
														{
															"number": "(o) ",
															"content": [
																{
																	"text": "Any outdoor pool shall be constructed in such\nmanner so as to permit the pool to be securely covered during such\ntime as the use of said pool has been seasonally discontinued. The\ncovering of such pool shall be by cloth or other substance of sufficient\nstrength to prevent the same from tearing or ripping when a weight\nof not more than 175 pounds is placed on any part thereof."
																}
															]
														},
														{
															"number": "(p) ",
															"content": [
																{
																	"text": "No change in the location of the pool or any\nof its equipment, fixtures or appurtenances as shown on the application\nas granted shall be made without the express written consent and approval\nof the Board of Trustees or the Building Inspector."
																}
															]
														}
													]
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "In the case of a single-family townhouse, there shall\nbe provided on the premises such parking or garage facilities adequate\nto accommodate two automobiles for each dwelling."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 250-53",
			"title": "Population density.",
			"content": [
				{
					"text": "No property in the CA Residence District shall\nbe utilized for greater than one living unit per 2,500 square feet\nof lot area."
				}
			]
		},
		{
			"paragraph": "§ 250-54",
			"title": "Sewage disposal.",
			"content": [
				{
					"text": "No single-family townhouse shall be permitted\nunless provided with municipal sewage disposal facilities or unless\nan independent sewerage system or installation approved by the Nassau\nCounty Department of Health is constructed for the sanitary disposal\nof the sewage of such buildings."
				}
			]
		},
		{
			"paragraph": "§ 250-55",
			"title": "Fences.",
			"content": [
				{
					"text": "A fence, not exceeding six feet in height, shall\nbe permitted on the rear lot line and side lot lines; provided, however,\nthat said fence along the rear lot lines and side lot lines shall\nnot exceed a greater distance frontward to the street than the street\nside building line of buildings constructed pursuant to regulations\nof this article; and with respect to all other lot lines, any fence\nshall not exceed five feet in height except when authorized by the\nBoard of Trustees. In every case, the finished or \"good\" side of the\nfence shall face outward from the property."
				}
			]
		},
		{
			"paragraph": "§ 250-56",
			"title": "Procedure.",
			"content": [
				{
					"text": "Any rezoning of eligible property to the CA Residence District shall proceed in compliance with the disclosure provisions of Article XII. The Board of Trustees shall ensure that any such hearing shall also be on at least 10 days' written notice to each residence in the Village. There shall be compliance with the hearing procedure applicable to amendments under Article XIV. The process shall start with the filing of a petition to the Board of Trustees setting forth the proposed development, accompanied by a site plan indicating the proposed placement of structures and buildings on the site. Such site plan shall conform to the requirements of Article XV, § 250-112, and shall set forth such additional information as may be required by the Building Inspector or Board of Trustees. If the Board of Trustees shall determine to grant the rezoning, it shall have the power to vary any regulations set forth in this article, as part of its site plan approval process under Article XV, § 250-112, except that it shall not have the authority to vary the applicability standards of § 250-44 of this article. Upon the grant of rezoning, and the processing and approval of a building permit application, the property may be developed in compliance with the approved site plan and any and all conditions imposed by the Board of Trustees and Building Inspector. The time limits shall be as set forth at Article XII, §§ 250-90 and 250-91."
				}
			]
		},
		{
			"paragraph": "§ 250-57",
			"title": "Approval of new construction by Board of Trustees.",
			"content": [
				{
					"text": "After property has been rezoned to CA Residence District, every subsequent application for a building permit for new buildings or building expansion in the CA Residence District shall be subject to the preparation of a new site plan and the conduct of a public hearing before the Board of Trustees, as set forth under Article XV, § 250-112, of this chapter. Such approval shall be in addition to any variances or special exceptions which may be required from the Board of Zoning Appeals."
				}
			]
		}
	]
}