{
	"url": "http://ecode360.com/29146766",
	"paras": [
		{
			"paragraph": "ยง 300-7",
			"title": "Residence Districts.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Permitted principal uses. The permitted principal uses in the Residence\nR-3A, R-2A and R-1A Districts are as follows:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Single-family detached dwellings."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Farms."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Special permit uses. The following uses are permitted upon issuance\nof a special permit by the Planning Board:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Water towers."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Educational institutions, subject to the provisions of Article VI, ยง 300-22D."
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "Primary or secondary schools."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "Nonprofit educational institutions under the supervision of\nthe New York State Department of Education or an educational institution\nchartered by the Regents of the University of the State of New York,\nsubject to the following standards and conditions:"
																},
																{
																	"content": [
																		{
																			"number": "[1] ",
																			"content": [
																				{
																					"text": "Building area. Shall not cover more than 10% of the area of\nthe lot."
																				}
																			]
																		},
																		{
																			"number": "[2] ",
																			"content": [
																				{
																					"text": "Height. The height of any building shall not exceed 35 feet\nor two stories."
																				}
																			]
																		},
																		{
																			"number": "[3] ",
																			"content": [
																				{
																					"text": "Yards. Each lot shall have front, side and rear yards not less\nthan the depths and widths following:"
																				},
																				{
																					"content": [
																						{
																							"number": "[a] ",
																							"content": [
																								{
																									"text": "Front yard depth: 110 feet."
																								}
																							]
																						},
																						{
																							"number": "[b] ",
																							"content": [
																								{
																									"text": "Side yard width: Each fifty foot for a one-story principal building,\neach 70 feet for a two-story building; however, when a side yard abuts\nupon a street line, the width shall be 110 feet."
																								}
																							]
																						},
																						{
																							"number": "[c] ",
																							"content": [
																								{
																									"text": "Rear yard depth: 50 feet for a one-story building; 70 feet for\na two-story principal building."
																								}
																							]
																						}
																					]
																				}
																			]
																		},
																		{
																			"number": "[4] ",
																			"content": [
																				{
																					"text": "Parking area. Off-street parking on the lot shall be provided\nin a paved area equal in area to one times the building area. Such\nparking area may extend into the side and rear yards, but shall be\ndistant not less than 30 feet from any lot line and 20 feet from any\nstreet line."
																				}
																			]
																		},
																		{
																			"number": "[5] ",
																			"content": [
																				{
																					"text": "Screen. Where a parking area abuts a property line, a screen\nof evergreen shrubs four feet in height and 20 feet in width shall\nbe installed along said lines."
																				}
																			]
																		},
																		{
																			"number": "[6] ",
																			"content": [
																				{
																					"text": "Marginal roadway. A marginal roadway 50 feet in width in the\nfront yard and in any side yard abutting a street shall be provided.\nSaid marginal roadway shall extend from the road or street line into\nthe front and side yard; shall be separated from the street by a mall\n10 feet in width; not more than two openings in the mall for access\nshall be made on any one street; the mall shall be curbed; the pavement\nin the roadway shall be 30 feet in width; a sidewalk four feet in\nwidth shall be constructed along the inner side of the marginal roadway.\nAll work and construction hereinabove set forth shall be in accordance\nwith Village specifications and regulations."
																				}
																			]
																		},
																		{
																			"number": "[7] ",
																			"content": [
																				{
																					"text": "Plan. The plot plan required to be submitted with the application for the building permit shall in addition show the requirements set forth herein together with the estimated cost of the improvements required in Subsection B(2)(b)[4], [5] and [6] hereof."
																				}
																			]
																		},
																		{
																			"number": "[8] ",
																			"content": [
																				{
																					"text": "Bond. If the improvements provided in Subsection B(2)(b)[4], [5] and [6] have not been completed prior to the application for a certificate of occupancy, a performance bond for not more than one year may be accepted by the Village in an amount estimated by the Village Engineer necessary to complete the improvements, which bond shall be a surety company bond in such form as shall be approved by the Village Attorney. On the acceptance and filing of such bond, the Building Inspector shall be authorized to issue the certificate of occupancy, and further provided that the area of the lot shall not be less than 50 acres, and notwithstanding any contrary provisions of this chapter, the following uses on the same lot or any other premises in the Village used in connection with such permitted uses are expressly prohibited."
																				},
																				{
																					"content": [
																						{
																							"number": "[a] ",
																							"content": [
																								{
																									"text": "Dormitories and sleeping quarters, except a single-family dwelling\nunit for one caretaker and his or her family."
																								}
																							]
																						},
																						{
																							"number": "[b] ",
																							"content": [
																								{
																									"text": "The erection of any structure for the use of spectators."
																								}
																							]
																						},
																						{
																							"number": "[c] ",
																							"content": [
																								{
																									"text": "Outdoor swimming pool."
																								}
																							]
																						},
																						{
																							"number": "[d] ",
																							"content": [
																								{
																									"text": "Athletic contests and games with other institutions, schools\nor organizations."
																								}
																							]
																						},
																						{
																							"number": "[e] ",
																							"content": [
																								{
																									"text": "Any use for which an admission is charged, gratuity, donation\nor subscription is accepted."
																								}
																							]
																						},
																						{
																							"number": "[f] ",
																							"content": [
																								{
																									"text": "Any equipment or structures used for extracurricular activities."
																								}
																							]
																						}
																					]
																				}
																			]
																		}
																	]
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "Educational institutions for the physically handicapped."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Playgrounds and parks, provided that they are a part of and incidental\nto a permitted educational institution or that they serve the needs\nof the inhabitants of the Village and are not operated for profit."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "Churches."
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "Incorporated golf or tennis clubs, subject to the conditions that it be a bona fide membership private club, operated by a corporation organized under the Membership Corporation Law or Not-For-Profit Corporation Law of the State of New York and qualifying for federal tax exemption under the Internal Revenue Code. A golf club shall be on a plot at least 125 acres. A tennis club shall be on a plot of at least 20 acres. The site plan and size of membership of a golf or tennis club shall be approved by the Planning Board after a public hearing. The Planning Board shall be guided by the following standards in addition to those contained in ยง 300-20D. In case of a conflict, the higher standards shall apply."
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "All structures including outdoor courts, swimming pools, cabanas\nand caddy houses and the main clubhouse shall have a setback of no\nless than 100 feet from every street line and no less than 150 feet\nfrom each and every other boundary line of the lot."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "The construction of any structure to provide indoor tennis facilities\nis expressly prohibited."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "Parking spaces shall be provided at the ratio of no less than\none parking space for every three members. A parking space is defined\nas a space no less than 300 square feet per car. Each parking space\nshall be set back a distance of no less than 75 feet from each and\nevery boundary line of the lot."
																}
															]
														},
														{
															"number": "(d) ",
															"content": [
																{
																	"text": "Any outdoor illumination shall be as prescribed by the Planning\nBoard; provided, however, that no outdoor illumination shall be provided\nso as to permit the use of any outdoor facilities other than during\ndaylight hours."
																}
															]
														},
														{
															"number": "(e) ",
															"content": [
																{
																	"text": "The extent and kind of screening, planting and fencing shall\nbe as prescribed by the Planning Board."
																}
															]
														},
														{
															"number": "(f) ",
															"content": [
																{
																	"text": "The location of ingress and egress shall be so located as to\navoid the creation of traffic hazards."
																}
															]
														},
														{
															"number": "(g) ",
															"content": [
																{
																	"text": "The installation of such drainage facilities as may be recommenced\nby the Village Engineer to prevent the overflow of water onto adjoining\nproperties or to any road abutting upon the subject premises shall\nbe required."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(6) ",
											"content": [
												{
													"text": "Executive headquarters."
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "Purpose. The purpose of this subsection is to preserve one or\nmore buildings or structures:"
																},
																{
																	"content": [
																		{
																			"number": "[1] ",
																			"content": [
																				{
																					"text": "Which have extraordinary architectural or aesthetic value, or\nwhich have a relationship to and association with notable personages,\nfamilies, historic events, any of which contribute to the cultural\nheritage of the Village;"
																				}
																			]
																		},
																		{
																			"number": "[2] ",
																			"content": [
																				{
																					"text": "The use of such buildings, or one or more of them, as single-family\nresidences is no longer feasible, due to their excessive size for\nsuch use, the cost of or inability to secure services and staff necessary\nfor the physical maintenance and use of such buildings and the grounds\nupon which it or they are located, by reason of which such buildings\nhave become obsolete and anachronisms, and in great danger of deterioration,\ndecay, and eventual demolition and loss;"
																				}
																			]
																		},
																		{
																			"number": "[3] ",
																			"content": [
																				{
																					"text": "Those tangible assets which provide a sense of identity with\nthe area as it once was should be conserved, protected, restored,\nperpetuated, and enhanced for the benefits which their restored existence\nwould confer upon the Village, in harmony with a Comprehensive Plan\nand policies thereof, and the promotion of the general welfare;"
																				}
																			]
																		},
																		{
																			"number": "[4] ",
																			"content": [
																				{
																					"text": "There is little or no possibility of their conservation, restoration,\nor perpetuation, if limited to single-family residential use as they\nformerly were used; and"
																				}
																			]
																		},
																		{
																			"number": "[5] ",
																			"content": [
																				{
																					"text": "The Village Board finds that limited, quasi-commercial uses\nof those of such properties which are on sufficiently large parcels\nof land to safeguard the properties of adjoining owners, in the manner\nhereinafter set forth, will be in harmony with the spirit and intent\nof this chapter and Comprehensive Plan, and the most suitable alternative\nto destruction and continuing deterioration of such properties."
																				}
																			]
																		}
																	]
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "Premises which may be converted. Any existing building or structure which shall be found by the Planning Board to possess historical, outstanding aesthetic, architectural, cultural, or other value set forth in Subsection B(6)(a) and which is no longer used or capable of being used as a single-family residence, by virtue of the matters set forth in such preambles, and which building is:"
																},
																{
																	"content": [
																		{
																			"number": "[1] ",
																			"content": [
																				{
																					"text": "Centrally located on a parcel of land at least 50 acres in size\nfronting on a state or county road;"
																				}
																			]
																		},
																		{
																			"number": "[2] ",
																			"content": [
																				{
																					"text": "Was constructed in 1930 or earlier;"
																				}
																			]
																		},
																		{
																			"number": "[3] ",
																			"content": [
																				{
																					"text": "Contains a minimum of 40 rooms or contains a minimum of 450,000\ncubic feet, when approved by the Planning Board, after a public hearing,\nmay be used, operated, and maintained as executive headquarters, including\nthe reception and extension of hospitality to persons connected therewith,\nvisitors and dignitaries. As accessory and incidental thereto, such\nproperty may contain guest facilities for the temporary accommodation\nof visiting executives, business visitors and dignitaries, in existing\nwings, buildings or facilities, subject to the discretion of the Planning\nBoard."
																				}
																			]
																		}
																	]
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "Procedure. In passing upon an application for the conversion\nof such properties to such use, the Planning Board shall give consideration\nto, among other matters as provided in this chapter, the following:"
																},
																{
																	"content": [
																		{
																			"number": "[1] ",
																			"content": [
																				{
																					"text": "Whether the size, extent and intensity of the use will prevent\nthe orderly and reasonable use of adjacent properties, or properties\nin the immediately surrounding area, or will materially affect the\nvalue thereof."
																				}
																			]
																		},
																		{
																			"number": "[2] ",
																			"content": [
																				{
																					"text": "Whether the effect of the proposed use will be to create or\nunduly increase traffic congestion upon the roads giving access to\nit."
																				}
																			]
																		},
																		{
																			"number": "[3] ",
																			"content": [
																				{
																					"text": "Whether the use of the structures to be used therefor will cause\nan undue concentration of population thereon."
																				}
																			]
																		},
																		{
																			"number": "[4] ",
																			"content": [
																				{
																					"text": "Whether, in connection with the foregoing, and all the aspects\nof use on a particular parcel, the proposed use, subject to such reasonable\nconditions as may be necessary or desirable to mitigate any adverse\nimpacts thereof, furnishes a reasonable alternative to the existing\ncondition of the premises, or to the conversion thereof to any other\nuse, in conformity with the general purposes and intent of this chapter."
																				}
																			]
																		}
																	]
																}
															]
														},
														{
															"number": "(d) ",
															"content": [
																{
																	"text": "Conditions. Such use, if granted, shall be subject to the following\nconditions:"
																},
																{
																	"content": [
																		{
																			"number": "[1] ",
																			"content": [
																				{
																					"text": "Offices and areas used for the conduct of any operations of\na business nature, including record storage, location of business\nmachinery, furniture and equipment, and staff operations shall not\nexceed 45% of the total interior space, figured on a cubic-foot basis,\nor 50% of the total square footage of interior floor space."
																				}
																			]
																		},
																		{
																			"number": "[2] ",
																			"content": [
																				{
																					"text": "No change, modification or alteration shall be made to the interior\nor exterior of the principal building, nor to the interior or exterior\nof any existing accessory building, without prior approval of the\nPlanning Board."
																				}
																			]
																		},
																		{
																			"number": "[3] ",
																			"content": [
																				{
																					"text": "The uses permitted hereunder may be carried on solely in the existing principal building, with existing accessory buildings, if any, being used solely for accessory uses specified in Subsection C(5) and/or for storage of equipment and materials or parking of vehicles."
																				}
																			]
																		},
																		{
																			"number": "[4] ",
																			"content": [
																				{
																					"text": "There shall be permitted no more than 75 officers and employees."
																				}
																			]
																		},
																		{
																			"number": "[5] ",
																			"content": [
																				{
																					"text": "In granting approval hereunder, the Planning Board further shall\ngive careful consideration to the preservation of original or existing\nlandscaping, the necessity of additional landscaping, the location\nand use of accessory buildings, the extent and manner in which the\nbuildings, furnishings and grounds are intended to be repaired and\nrestored, and shall impose reasonable conditions with respect to the\nforegoing and to the hours during which the activities may be conducted\nupon the premises."
																				}
																			]
																		}
																	]
																}
															]
														},
														{
															"number": "(e) ",
															"content": [
																{
																	"text": "Residential use. No residential use may be made of the premises\nexcept as set forth above and except for such use as may be necessary\nfor persons employed in the premises in a security or maintenance\ncapacity together with their families."
																}
															]
														},
														{
															"number": "(f) ",
															"content": [
																{
																	"text": "Waivers and modifications; additional conditions. The Planning\nBoard shall have the power to waive or modify in a particular case\nany of the conditions with respect to size of the plot, date of construction,\nor size of principal building, in furtherance of the purposes hereof,\nand to impose such other, further and additional conditions upon its\ngrant of approval as may be reasonable and in furtherance of the purposes\nhereof and in harmony with the spirit and intent of these provisions."
																}
															]
														}
													]
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Accessory uses. Accessory uses of buildings and land which are customarily\nincidental to the permitted principal use or special permit use and\nlocated on the same lot are hereby permitted; provided, however, that\nno such accessory buildings capable of use as a dwelling or dwelling\nunit such as guest houses and servants quarters shall result in any\ntype of continuous or permanent occupancy or for any occupancy resulting\nin rental income. The following accessory uses are specifically permitted\nsubject to the conditions hereinafter provided:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Agriculture."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Dairying."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Keeping of poultry."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "Keeping of dogs, game and birds."
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "Horticulture, including noncommercial greenhouses."
												}
											]
										},
										{
											"number": "(6) ",
											"content": [
												{
													"text": "Keeping of horses or livestock, subject to the following conditions:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "Occupants of a single-family detached principal dwelling shall,\nas an accessory use only, be permitted to keep horses or livestock\nfor their personal use, provided there is compliance with the following\nstandards and conditions:"
																},
																{
																	"content": [
																		{
																			"number": "[1] ",
																			"content": [
																				{
																					"text": "No such use shall be permitted on lots having less than two\nacres of land."
																				}
																			]
																		},
																		{
																			"number": "[2] ",
																			"content": [
																				{
																					"text": "The number of horses and livestock permitted on each lot shall\nnot exceed the following:"
																				},
																				{
																					"content": [
																						{
																							"number": "[a] ",
																							"content": [
																								{
																									"text": "Two horses or livestock (in any aggregate combination) for the\nfirst two acres of lot area, plus one additional horse or livestock\nfor each additional acre of lot area. In no event shall the total\nnumber of horses and livestock (in any aggregate combination) permitted\non any one lot, irrespective of its area, exceed seven. Upon application\nto the Planning Board, the aforesaid limitation may be varied, and\nthat Board shall impose such conditions as it deems necessary for\nthe public health, safety and welfare, provided it finds that the\nnumber of horses is an accessory use. In acting upon an application\nunder this subsection, the Planning Board shall exercise the powers\ngranted to it by this chapter and by the Village Law."
																								}
																							]
																						}
																					]
																				}
																			]
																		},
																		{
																			"number": "[3] ",
																			"content": [
																				{
																					"text": "Any such horse or livestock shall be beneficially owned in fact,\nas well as in title, solely by the resident-occupants of the lot,\nwho shall, upon written request of the Building Inspector, produce\na sworn affidavit and other reasonable evidence of said ownership."
																				}
																			]
																		},
																		{
																			"number": "[4] ",
																			"content": [
																				{
																					"text": "The boarding or keeping of horses or livestock owned by or for\nthe use or benefit of persons other than those who are the resident-occupants\nof any lot is strictly prohibited."
																				}
																			]
																		},
																		{
																			"number": "[5] ",
																			"content": [
																				{
																					"text": "All grain-type feed shall be kept in rodentproof metal containers."
																				}
																			]
																		},
																		{
																			"number": "[6] ",
																			"content": [
																				{
																					"text": "No manure shall be stored or permitted to accumulate within\n75 feet from any boundary line or within 25 feet from a dwelling on\nthe same lot, or within 125 feet from a dwelling on any adjacent or\nother lot. The Building Inspector shall approve the storage area for\nmanure, and it shall be stored and treated in such a manner so that\nit shall not create any odor or attract or harbor any rodents, flies\nor other insects."
																				}
																			]
																		},
																		{
																			"number": "[7] ",
																			"content": [
																				{
																					"text": "The stables, barns, sheds, or other accessory buildings or structures\nused in connection with or for sheltering horses or livestock pursuant\nto this subsection shall meet the following requirements:"
																				},
																				{
																					"content": [
																						{
																							"number": "[a] ",
																							"content": [
																								{
																									"text": "The number of such structures and buildings shall not exceed\nthose reasonably necessary to accommodate the permitted number of\nhorses and livestock."
																								}
																							]
																						},
																						{
																							"number": "[b] ",
																							"content": [
																								{
																									"text": "No such building or structure shall be located nearer the street\nline than the rear line of the principal dwelling, nor be closer than\n75 feet to any street line.[Amended 5-20-1985 by L.L. No. 4-1985]"
																								}
																							]
																						},
																						{
																							"number": "[c] ",
																							"content": [
																								{
																									"text": "The building area of all such buildings and structures devoted\nto this accessory use shall not in the aggregate cover more than 2,000\nsquare feet, regardless of the area of the lot."
																								}
																							]
																						},
																						{
																							"number": "[d] ",
																							"content": [
																								{
																									"text": "The yard area occupied by such buildings or structures shall\nbe included in computing the maximum percent of the lot area which\nmay be utilized for building area (all buildings).[Amended 5-20-1985 by L.L. No. 3-1985]"
																								}
																							]
																						},
																						{
																							"number": "[e] ",
																							"content": [
																								{
																									"text": "All such buildings or structures shall, except as otherwise herein specifically provided, be subject to the setback requirements for a principal building as set forth in Subsection D, and in addition, shall be set back 125 feet from any principal dwelling on any adjacent lots, except that any private riding ring, private paddock, corral fencing or other roofless enclosure for horses and livestock and any unenclosed area for their unattended maintenance shall be located not less than 20 feet from any side or rear boundary line, 75 feet from any front boundary line, and 125 feet from any dwelling on any adjacent lot."
																								}
																							]
																						},
																						{
																							"number": "[f] ",
																							"content": [
																								{
																									"text": "No such building or structure shall hereafter be erected, altered\nor enlarged to a height in excess of 25 feet."
																								}
																							]
																						}
																					]
																				}
																			]
																		},
																		{
																			"number": "[8] ",
																			"content": [
																				{
																					"text": "The maintenance of structures and hygienic conditions connected\nwith the accessory use here permitted shall be under the supervision\nof the Village by its Building Inspector and by the Nassau County\nDepartment of Health, to the extent necessary. If conditions are found\nto exist which are dangerous to the health, safety, and welfare of\nhumans, horses or livestock, or if any of the requirements of this\nor any other provision of this chapter or any condition attached to\nany special use permit granted in connection with this accessory use\nare not complied with by the resident-occupants, the accessory use\nhere permitted may upon application of the Building Inspector, be\nordered by the Planning Board to cease and discontinue, after public\nhearing, until such time as the conditions complained of are remedied\nto the satisfaction of said Board."
																				}
																			]
																		},
																		{
																			"number": "[9] ",
																			"content": [
																				{
																					"text": "The land devoted to this accessory use shall have suitable drainage\nself-contained within the lot and the topography, and soil conditions\nshall be such that no effluents shall be discharged or be drained\nor permitted to run off into any adjacent streets, roadways or lots,\nor create any odor, or otherwise be detrimental to the public health,\nsafety and welfare. The Building Inspector shall approve such drainage\nand topography in accordance with the foregoing standards, and no\nbuilding permit for any accessory buildings or structures connected\nwith such accessory use shall be granted unless and until any such\nconditions have been corrected and approved by said Building Inspector."
																				}
																			]
																		},
																		{
																			"number": "[10] ",
																			"content": [
																				{
																					"text": "The final approval of a subdivision or partitioning of the property,\nany part of which is devoted to the accessory use and buildings herein\npermitted, shall terminate such use. In said event, no such structure\nor building used for these purposes shall be converted or used as\na principal building or accessory building for any purpose in connection\nwith said subdivision or partition, unless said building complies\nwith all requirements of this chapter as an accessory building on\na single lot resulting from such subdivision or partitioning."
																				}
																			]
																		}
																	]
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(7) ",
											"content": [
												{
													"text": "Home occupation."
												}
											]
										},
										{
											"number": "(8) ",
											"content": [
												{
													"text": "Real estate activities of an owner or of his or her duly authorized\nagent, in connection with his or her property within the Village."
												}
											]
										},
										{
											"number": "(9) ",
											"content": [
												{
													"text": "The office or studio of a physician, surgeon, architect, dentist, teacher, painter or sculptor, musician, lawyer or engineer residing in the dwelling unit in which such office or studio is located, provided that there is no display or advertising on the premises in connection with such use, except for a professional nameplate not over one square foot in area, and said nameplate shall comply with the provisions of ยง 300-12, Signs, Subsection B, of this chapter; that no such studio or office shall occupy more space than the equivalent of 1/3 of the area of one floor of such dwelling, and that such use is merely incidental to the use of such dwelling unit primarily for residential purposes; that any such musician's studio is equipped and used in such a manner that sounds therefrom are not unduly annoying to other persons on nearby premises or public places; that no assistants, whether paid or not, may participate in such use, except that one assistant may be employed if the nature of the profession is such as to require an assistant; that no such use shall be made of more than one building and that such use by a painter, sculptor, or musician shall not be deemed to include the right to engage in wholesale or retail trade, as such is ordinarily understood."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "Lot area, height, setback, front lot line, building size and lot\ncoverage. In all residence districts, all buildings and structures\nshall conform to the following lot area, height, setback, front lot\nline, building size and lot coverage regulations."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "All lots in the R-3 A District shall have minimum net lot areas of\nnot less than three acres. All lots in the R-2A District shall have\nminimum net lot areas of not less than two acres. All lots in the\nR-1 A District shall have minimum net lot areas of not less than one\nacre."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "The maximum height for any building other than accessory buildings\nshall be 35 feet, and no building shall exceed 2 1/2 stories.\nIn no case may the highest point of a roof be higher than 40 feet\nabove the finished grade at the perimeter of the building extending\nat least 10 feet in width around the perimeter of the building. The\nmaximum height for any accessory building shall be 18 feet and at\nno point higher than 26 feet above the finished grade at the perimeter\nof the building extending at least 10 feet in width around the perimeter\nof the building."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "In all residence districts, all lots shall have a minimum lot width\nequal to 75% of the minimum required front lot line. Such minimum\nlot width shall be maintained to at least the minimum required front\nsetback."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "Principal buildings. No principal building or structure shall hereafter\nbe erected on any lot in any residence district except in compliance\nwith the below table. Generators, HVAC and similar equipment shall\nbe subject to the side and rear setbacks for principal buildings or\nstructures where possible as determined by the Building Inspector\nor else within 10 feet of the principal dwelling setback. Maximum lot coverage shall not exceed 25% of net lot area. Maximum Permitted Floor Area shall not exceed 12% of lot area"
												},
												{
													"content": [
														{
															"number": "(1) ",
															"content": [
																{
																	"text": "Lot Area(square feet): 40,000      Maximum Permitted Floor Area(square feet): 4,800  Minimum Setback(feet) Front/Side/Rear:  50/30/50"
																}
															]
														},
														{
															"number": "(2) ",
															"content": [
																{
																	"text": "Lot Area(square feet): 50,000      Maximum Permitted Floor Area(square feet): 5,700 Minimum Setback(feet) Front/Side/Rear:  56/34/56"
																}
															]
														},
														{
															"number": "(3) ",
															"content": [
																{
																	"text": "Lot Area(square feet): 60,000      Maximum Permitted Floor Area(square feet): 6,050  Minimum Setback(feet) Front/Side/Rear:  61/37/61"
																}
															]
														},
														{
															"number": "(4) ",
															"content": [
																{
																	"text": "Lot Area(square feet): 70,000      Maximum Permitted Floor Area(square feet): 6,400  Minimum Setback(feet) Front/Side/Rear:  66/40/66"
																}
															]
														},
														{
															"number": "(5) ",
															"content": [
																{
																	"text": "Lot Area(square feet): 80,000      Maximum Permitted Floor Area(square feet): 6,750  Minimum Setback(feet) Front/Side/Rear:  71/48/71"
																}
															]
														},
														{
															"number": "(6) ",
															"content": [
																{
																	"text": "Lot Area(square feet): 90,000      Maximum Permitted Floor Area(square feet): 7,100  Minimum Setback(feet) Front/Side/Rear:  75/51/75"
																}
															]
														},
														{
															"number": "(7) ",
															"content": [
																{
																	"text": "Lot Area(square feet): 100,000     Maximum Permitted Floor Area(square feet): 7,450  Minimum Setback(feet) Front/Side/Rear:  79/54/79"
																}
															]
														},
														{
															"number": "(8) ",
															"content": [
																{
																	"text": "Lot Area(square feet): 110,000     Maximum Permitted Floor Area(square feet): 7,800  Minimum Setback(feet) Front/Side/Rear: 83/56/83"
																}
															]
														},
														{
															"number": "(9) ",
															"content": [
																{
																	"text": "Lot Area(square feet): 120,000     Maximum Permitted Floor Area(square feet): 8,150  Minimum Setback(feet) Front/Side/Rear:  87/59/87"
																}
															]
														},
														{
															"number": "(10) ",
															"content": [
																{
																	"text": "Lot Area(square feet): 130,000     Maximum Permitted Floor Area(square feet): 8,500  Minimum Setback(feet) Front/Side/Rear:  90/72/90"
																}
															]
														},
														{
															"number": "(11) ",
															"content": [
																{
																	"text": "Lot Area(square feet): 140,000     Maximum Permitted Floor Area(square feet): 8,850  Minimum Setback(feet) Front/Side/Rear:  105/75/105"
																}
															]
														},
														{
															"number": "(12) ",
															"content": [
																{
																	"text": "Lot Area(square feet): 150,000     Maximum Permitted Floor Area(square feet): 9,200  Minimum Setback(feet) Front/Side/Rear:  108/77/108"
																}
															]
														},
														{
															"number": "(13) ",
															"content": [
																{
																	"text": "Lot Area(square feet): 160,000     Maximum Permitted Floor Area(square feet): 9,550  Minimum Setback(feet) Front/Side/Rear:  112/80/112"
																}
															]
														},
														{
															"number": "(14) ",
															"content": [
																{
																	"text": "Lot Area(square feet): 170,000     Maximum Permitted Floor Area(square feet): 9,900  Minimum Setback(feet) Front/Side/Rear:  115/82/115"
																}
															]
														},
														{
															"number": "(15) ",
															"content": [
																{
																	"text": "Lot Area(square feet): 180,000    Maximum Permitted Floor Area(square feet): 10,250  Minimum Setback(feet) Front/Side/Rear:  119/85/119"
																}
															]
														},
														{
															"number": "(16) ",
															"content": [
																{
																	"text": "Lot Area(square feet): 190,000    Maximum Permitted Floor Area(square feet): 10,600  Minimum Setback(feet) Front/Side/Rear:  122/87/122"
																}
															]
														},
														{
															"number": "(17) ",
															"content": [
																{
																	"text": "Lot Area(square feet): 200,000    Maximum Permitted Floor Area(square feet): 10,950  Minimum Setback(feet) Front/Side/Rear:  125/89/125"
																}
															]
														},
														{
															"number": "(18) ",
															"content": [
																{
																	"text": "Lot Area(square feet): 250,000    Maximum Permitted Floor Area(square feet): 12,050  Minimum Setback(feet) Front/Side/Rear:  140/100/140"
																}
															]
														},
														{
															"number": "(19) ",
															"content": [
																{
																	"text": "Lot Area(square feet): 300,000    Maximum Permitted Floor Area(square feet): 13,150 Minimum Setback(feet) Front/Side/Rear:  153/110/153"
																}
															]
														},
														{
															"number": "(20) ",
															"content": [
																{
																	"text": "Lot Area(square feet): 350,000    Maximum Permitted Floor Area(square feet): 14,250  Minimum Setback(feet) Front/Side/Rear:  166/118/166"
																}
															]
														},
														{
															"number": "(21) ",
															"content": [
																{
																	"text": "Lot Area(square feet): 400,000    Maximum Permitted Floor Area(square feet): 15,350  Minimum Setback(feet) Front/Side/Rear:  177/126/177"
																}
															]
														},
														{
															"number": "(22) ",
															"content": [
																{
																	"text": "Lot Area(square feet): 500,000    Maximum Permitted Floor Area(square feet): 17,550  Minimum Setback(feet) Front/Side/Rear:  198/141/198"
																}
															]
														},
														{
															"number": "(23) ",
															"content": [
																{
																	"text": "Lot Area(square feet): 600,000    Maximum Permitted Floor Area(square feet): 19,750  Minimum Setback(feet) Front/Side/Rear:  217/155/217"
																}
															]
														},
														{
															"number": "(24) ",
															"content": [
																{
																	"text": "Lot Area(square feet): 700,000    Maximum Permitted Floor Area(square feet): 21,950  Minimum Setback(feet) Front/Side/Rear:  234/167/234"
																}
															]
														},
														{
															"number": "(25) ",
															"content": [
																{
																	"text": "Lot Area(square feet): 800,000    Maximum Permitted Floor Area(square feet): 24,150  Minimum Setback(feet) Front/Side/Rear:  250/179/250"
																}
															]
														},
														{
															"number": "(26) ",
															"content": [
																{
																	"text": "Lot Area(square feet): 1,000,000  Maximum Permitted Floor Area(square feet): 28,550  Minimum Setback(feet) Front/Side/Rear:  280/200/280"
																}
															]
														},
														{
															"number": "(26) ",
															"content": [
																{
																	"text": "Lot Area(square feet): 1,200,000  Maximum Permitted Floor Area(square feet): 32,950  Minimum Setback(feet) Front/Side/Rear:  307/219/307"
																}
															]
														},
														{
															"number": "(28) ",
															"content": [
																{
																	"text": "Lot Area(square feet): 1,400,000  Maximum Permitted Floor Area(square feet): 37,350  Minimum Setback(feet) Front/Side/Rear:  311/237/311"
																}
															]
														},
														{
															"number": "(29) ",
															"content": [
																{
																	"text": "Lot Area(square feet): 1,600,000  Maximum Permitted Floor Area(square feet): 41,750  Minimum Setback(feet) Front/Side/Rear:  354/253/354"
																}
															]
														},
														{
															"number": "(30) ",
															"content": [
																{
																	"text": "Lot Area(square feet): 2,000,000  Maximum Permitted Floor Area(square feet): 50,550  Minimum Setback(feet) Front/Side/Rear:  396/283/396"
																}
															]
														}
													]
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "For corner lots, the minimum front setback shall be provided\nfrom every street line."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "No principal building shall be erected on any lot in any residence\ndistrict with a floor area of less than 2,500 square feet."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "Accessory buildings and lot coverage. No accessory building shall\nhereafter be erected on any lot in any residence district and no lot\nshall have a lot coverage except in compliance with the following\ntable:"
												},
												{
													"content": [
														{
															"number": "(1) ",
															"content": [
																{
																	"text": "Lot Area(square feet): 40,000      Maximum Permitted Floor Area(square feet): 960  Minimum Setback(feet) Front/Side/Rear:  50/20/20"
																}
															]
														},
														{
															"number": "(2) ",
															"content": [
																{
																	"text": "Lot Area(square feet): 50,000      Maximum Permitted Floor Area(square feet): 1,140 Minimum Setback(feet) Front/Side/Rear:  56/22/22"
																}
															]
														},
														{
															"number": "(3) ",
															"content": [
																{
																	"text": "Lot Area(square feet): 60,000      Maximum Permitted Floor Area(square feet): 1,210  Minimum Setback(feet) Front/Side/Rear:  61/24/24"
																}
															]
														},
														{
															"number": "(4) ",
															"content": [
																{
																	"text": "Lot Area(square feet): 70,000      Maximum Permitted Floor Area(square feet): 1,280  Minimum Setback(feet) Front/Side/Rear:  66/26/26"
																}
															]
														},
														{
															"number": "(5) ",
															"content": [
																{
																	"text": "Lot Area(square feet): 80,000      Maximum Permitted Floor Area(square feet): 1,350  Minimum Setback(feet) Front/Side/Rear:  71/28/28"
																}
															]
														},
														{
															"number": "(6) ",
															"content": [
																{
																	"text": "Lot Area(square feet): 90,000      Maximum Permitted Floor Area(square feet): 1,420  Minimum Setback(feet) Front/Side/Rear:  75/30/30"
																}
															]
														},
														{
															"number": "(7) ",
															"content": [
																{
																	"text": "Lot Area(square feet): 100,000     Maximum Permitted Floor Area(square feet): 1,490  Minimum Setback(feet) Front/Side/Rear:  79/32/32"
																}
															]
														},
														{
															"number": "(8) ",
															"content": [
																{
																	"text": "Lot Area(square feet): 110,000     Maximum Permitted Floor Area(square feet): 1,560  Minimum Setback(feet) Front/Side/Rear: 83/33/33"
																}
															]
														},
														{
															"number": "(9) ",
															"content": [
																{
																	"text": "Lot Area(square feet): 120,000     Maximum Permitted Floor Area(square feet): 1,630  Minimum Setback(feet) Front/Side/Rear:  87/35/35"
																}
															]
														},
														{
															"number": "(10) ",
															"content": [
																{
																	"text": "Lot Area(square feet): 130,000     Maximum Permitted Floor Area(square feet): 1,700  Minimum Setback(feet) Front/Side/Rear:  90/36/36"
																}
															]
														},
														{
															"number": "(11) ",
															"content": [
																{
																	"text": "Lot Area(square feet): 140,000     Maximum Permitted Floor Area(square feet): 1,770  Minimum Setback(feet) Front/Side/Rear:  105/42/42"
																}
															]
														},
														{
															"number": "(12) ",
															"content": [
																{
																	"text": "Lot Area(square feet): 150,000     Maximum Permitted Floor Area(square feet): 1,840  Minimum Setback(feet) Front/Side/Rear:  108/43/43"
																}
															]
														},
														{
															"number": "(13) ",
															"content": [
																{
																	"text": "Lot Area(square feet): 160,000     Maximum Permitted Floor Area(square feet): 1,910  Minimum Setback(feet) Front/Side/Rear:  112/45/45"
																}
															]
														},
														{
															"number": "(14) ",
															"content": [
																{
																	"text": "Lot Area(square feet): 170,000     Maximum Permitted Floor Area(square feet): 1,980  Minimum Setback(feet) Front/Side/Rear:  115/46/56"
																}
															]
														},
														{
															"number": "(15) ",
															"content": [
																{
																	"text": "Lot Area(square feet): 180,000    Maximum Permitted Floor Area(square feet):  2,050  Minimum Setback(feet) Front/Side/Rear:  119/48/48"
																}
															]
														},
														{
															"number": "(16) ",
															"content": [
																{
																	"text": "Lot Area(square feet): 190,000    Maximum Permitted Floor Area(square feet):  2,120  Minimum Setback(feet) Front/Side/Rear:  122/49/49"
																}
															]
														},
														{
															"number": "(17) ",
															"content": [
																{
																	"text": "Lot Area(square feet): 200,000    Maximum Permitted Floor Area(square feet):  2,190  Minimum Setback(feet) Front/Side/Rear:  125/50/50"
																}
															]
														},
														{
															"number": "(18) ",
															"content": [
																{
																	"text": "Lot Area(square feet): 250,000    Maximum Permitted Floor Area(square feet):  2,410  Minimum Setback(feet) Front/Side/Rear:  140/56/56"
																}
															]
														},
														{
															"number": "(19) ",
															"content": [
																{
																	"text": "Lot Area(square feet): 300,000    Maximum Permitted Floor Area(square feet):  2,630 Minimum Setback(feet) Front/Side/Rear:  153/61/61"
																}
															]
														},
														{
															"number": "(20) ",
															"content": [
																{
																	"text": "Lot Area(square feet): 350,000    Maximum Permitted Floor Area(square feet):  2,850  Minimum Setback(feet) Front/Side/Rear:  166/66/66"
																}
															]
														},
														{
															"number": "(21) ",
															"content": [
																{
																	"text": "Lot Area(square feet): 400,000    Maximum Permitted Floor Area(square feet):  3,070  Minimum Setback(feet) Front/Side/Rear:  177/71/71"
																}
															]
														},
														{
															"number": "(22) ",
															"content": [
																{
																	"text": "Lot Area(square feet): 500,000    Maximum Permitted Floor Area(square feet):  3,510  Minimum Setback(feet) Front/Side/Rear:  198/79/79"
																}
															]
														},
														{
															"number": "(23) ",
															"content": [
																{
																	"text": "Lot Area(square feet): 600,000    Maximum Permitted Floor Area(square feet):  3,950  Minimum Setback(feet) Front/Side/Rear:  217/87/87"
																}
															]
														},
														{
															"number": "(24) ",
															"content": [
																{
																	"text": "Lot Area(square feet): 700,000    Maximum Permitted Floor Area(square feet):  4,390  Minimum Setback(feet) Front/Side/Rear:  234/94/94"
																}
															]
														},
														{
															"number": "(25) ",
															"content": [
																{
																	"text": "Lot Area(square feet): 800,000    Maximum Permitted Floor Area(square feet):  4,830  Minimum Setback(feet) Front/Side/Rear:  250/100/100"
																}
															]
														},
														{
															"number": "(26) ",
															"content": [
																{
																	"text": "Lot Area(square feet): 1,000,000  Maximum Permitted Floor Area(square feet):  5,710  Minimum Setback(feet) Front/Side/Rear:  280/112/112"
																}
															]
														},
														{
															"number": "(26) ",
															"content": [
																{
																	"text": "Lot Area(square feet): 1,200,000  Maximum Permitted Floor Area(square feet):  6,590  Minimum Setback(feet) Front/Side/Rear:  307/123/123"
																}
															]
														},
														{
															"number": "(28) ",
															"content": [
																{
																	"text": "Lot Area(square feet): 1,400,000  Maximum Permitted Floor Area(square feet):  7,470  Minimum Setback(feet) Front/Side/Rear:  311/133/133"
																}
															]
														},
														{
															"number": "(29) ",
															"content": [
																{
																	"text": "Lot Area(square feet): 1,600,000  Maximum Permitted Floor Area(square feet):  8,350  Minimum Setback(feet) Front/Side/Rear:  354/142/142"
																}
															]
														},
														{
															"number": "(30) ",
															"content": [
																{
																	"text": "Lot Area(square feet): 2,000,000  Maximum Permitted Floor Area(square feet): 10,110  Minimum Setback(feet) Front/Side/Rear:  396/158/158"
																}
															]
														}
													]
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "Notwithstanding the minimum front setbacks as set forth in the\nforegoing table, no accessory building shall be located between the\nfront wall of the principal building and the front lot line. The total\naggregate lot coverage of all accessory buildings shall not exceed\n150% of the maximum floor area permitted for an accessory building\nas set forth in the foregoing table."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "For corner lots, the minimum front setback for principal buildings\nshall be provided from every street line for accessory buildings."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(6) ",
											"content": [
												{
													"text": "Governing limits and dimensions."
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "Wherever the limitations set forth in this ยง 300-7D are more restrictive than the regulations of any other section of Article III of the Zoning Code of Old Brookville, the limitations set forth in this ยง 300-7D shall govern and control."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "Any building legally existing on the effective date of this\nsection with respect to the setbacks of such building may be altered\nor enlarged in such a manner that does not increase the nonconforming\nsetback subject to compliance with the other provisions of this chapter."
																}
															]
														}
													]
												}
											]
										}
									]
								}
							]
						}
					]
				}
			]
		}
	]
}