{
	"url": "http://ecode360.com/8316336",
	"paras": [
		{
			"paragraph": "§ 195-10",
			"title": "Residence A District.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Building height. No building shall exceed 2 1/2\nstories, with a maximum height of 30 feet.[Amended 9-11-1995 by L.L. No. 1-1995; 11-3-2003 by L.L. No.\n2-2003]"
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Front yards. Front yards shall be not less than 20\nfeet in depth."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Side yards. Side yards shall be not less than 10 feet\nin width."
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "Rear yards. Rear yards shall not be less than 20 feet\nin depth."
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "Accessory buildings. Accessory buildings may be located only in the rear yard and shall not be nearer than three feet to any rear or inside lot line or side lot line, or nearer than 10 feet to any part of the dwelling on another lot; provided, however, that accessory buildings may be located adjacent to a side or rear lot line, provided that a single party wall is erected and maintained by private agreement between the owners of such adjacent lots. This subsection shall not apply to swimming pools as regulated by § 195-21F, or exterior air-conditioning units as regulated by § 195-26.1.[Amended 1-5-1998 by L.L. No. 1-1998; 5-5-2008 by L.L. No.\n2-2008]"
								}
							]
						},
						{
							"number": "F. ",
							"content": [
								{
									"text": "No principal building, including the accessory building\nincident thereto, shall occupy a lot of less than 5,000 square feet,\nnor shall there be more than one principal building to each 5,000\nsquare feet, except as herein provided in relation to present existing\nbuildings."
								}
							]
						},
						{
							"number": "G. ",
							"content": [
								{
									"text": "Maximum gross floor area. The maximum gross floor\narea of the principal building shall be equal to 5,800 square feet\nplus [(lot area in square feet minus 20,000 square feet) times 0.1].[Added 11-3-2003 by L.L. No. 2-2003]"
								}
							]
						},
						{
							"number": "H. ",
							"content": [
								{
									"text": "Lot width and street frontage. Lot width and public\nstreet frontage shall not be less than 50 feet in length.[Added 9-6-2005 by L.L. No. 3-2005]"
								}
							]
						},
						{
							"paragraph": "§ 195-14",
							"title": "Accessory buildings and uses.",
							"content": [
								{
									"text": "The following additional provisions shall apply\nto accessory buildings and uses:"
								},
								{
									"content": [
										{
											"number": "A. ",
											"content": [
												{
													"text": "The accessory building or use must be located on the\nsame lot as the principal building or use to which it is accessory\nor on a lot immediately adjoining it. If it is located on a lot immediately\nadjoining the lot on which the principal building or use is located,\nand the lots are severed, the accessory use shall cease."
												}
											]
										},
										{
											"number": "B. ",
											"content": [
												{
													"text": "The accessory use shall not be carried on by any person\nother than the occupant of the principal building, or, in case of\nvacant property, by the owner or lessee of the lot."
												}
											]
										},
										{
											"number": "C. ",
											"content": [
												{
													"text": "The area occupied by accessory buildings shall be\nincluded in computing the maximum portion of the lot area which may\nbe built upon in any given district. The area occupied by accessory\nbuildings shall not exceed 8% of the area of the lot."
												}
											]
										},
										{
											"number": "D. ",
											"content": [
												{
													"text": "No accessory building constructed in a residence zone\nshall exceed one story or 15 feet in height.[Added 6-2-1980 by L.L. No. 1-1980;\namended 6-1-2009 by L.L. No. 1-2009]"
												}
											]
										},
										{
											"number": "E. ",
											"content": [
												{
													"text": "No accessory building in a residence zone shall be\nused for living quarters.[Added 6-2-1980 by L.L. No. 1-1980]"
												}
											]
										}
									]
								}
							]
						},
						{
							"paragraph": "§ 195-15",
							"title": "Professional offices.",
							"content": [
								{
									"text": "Where a lot or premises in a residence district\nis permitted to be used in part as the office of a professional person,\nthe following additional regulations and conditions shall apply:"
								},
								{
									"content": [
										{
											"number": "A. ",
											"content": [
												{
													"text": "The professional person shall be the owner or beneficially\ninterested in the ownership of the premises."
												}
											]
										},
										{
											"number": "B. ",
											"content": [
												{
													"text": "Such use shall include, but not be limited to, lawyers,\ndoctors, realtors, writers, artists or, in addition, offices of persons\nengaged in other occupations where the product is delivered, sold\nor provided off the premises."
												}
											]
										},
										{
											"number": "C. ",
											"content": [
												{
													"text": "No manufacturing or other industrial use shall be\npermitted within the Village."
												}
											]
										},
										{
											"number": "D. ",
											"content": [
												{
													"text": "No external signs of regular business activity being\nconducted on the premises shall be permitted, except for the name\nof the professional person or person and letters or abbreviations\nindicating the nature of the profession not to exceed two feet in\nlength or six inches in height."
												}
											]
										},
										{
											"number": "E. ",
											"content": [
												{
													"text": "Such office must be located in and be a part of the\nprincipal dwelling and may not be housed in a separate building."
												}
											]
										},
										{
											"number": "F. ",
											"content": [
												{
													"text": "In no case may the practice of a profession be permitted\nas a principal use."
												}
											]
										}
									]
								}
							]
						},
						{
							"paragraph": "§ 195-16",
							"title": "Private garages.",
							"content": [
								{
									"text": "A private garage is permitted only as an accessory\nuse and subject to the following conditions:"
								},
								{
									"content": [
										{
											"number": "A. ",
											"content": [
												{
													"text": "No business, service or industry may be carried on\ndirectly or indirectly in or in connection therewith."
												}
											]
										},
										{
											"number": "B. ",
											"content": [
												{
													"text": "No private garage shall be permitted within the front\nyard."
												}
											]
										},
										{
											"number": "C. ",
											"content": [
												{
													"text": "A garage for more than two motor vehicles shall not\nbe permitted as an accessory building."
												}
											]
										},
										{
											"number": "D. ",
											"content": [
												{
													"text": "When attached to or forming part of the principal\nbuilding, no garage shall be designed for use by more than two motor\nvehicles, except for a garage whose doors face a side yard, in which\ncase said garage shall not be designed for use by more than three\nmotor vehicles."
												}
											]
										}
									]
								}
							]
						},
						{
							"paragraph": "§ 195-17",
							"title": "Encroachments in required yards.",
							"content": [
								{
									"text": "No building or part of a building shall be erected\nin, upon or over or shall project into a required yard, with the following\nexceptions:"
								},
								{
									"content": [
										{
											"number": "A. ",
											"content": [
												{
													"text": "Cornices, eaves, gutters, chimneys or flues, projecting\nnot more than 18 inches, or window sills, belt courses or other ornamental\nfeatures projecting not more than four inches."
												}
											]
										},
										{
											"number": "B. ",
											"content": [
												{
													"text": "One-story uncovered porches may project into the required\nrear yard not more than six feet."
												}
											]
										},
										{
											"number": "C. ",
											"content": [
												{
													"text": "Subsurface structures may be constructed beneath the\nsurface of the ground of a required rear yard or a required side yard,\nprovided that no part of such subsurface structure shall project above\nthe surface of the ground in any such yard, and further provided that,\nin cases where the surface of the ground has been raised above its\nnatural state by fill, grading, terracing or otherwise, no part of\nsuch subsurface structure shall be constructed or maintained more\nthan three feet above the level of the ground in its natural state."
												}
											]
										},
										{
											"number": "D. ",
											"content": [
												{
													"text": "A swimming pool may be constructed in the rear yard,\nprovided that all rear yard requirements of the district regulations\nfor the district in which the property lies are complied with."
												}
											]
										}
									]
								}
							]
						},
						{
							"paragraph": "§ 195-18",
							"title": "Corner lots.",
							"content": [
								{
									"text": "In the case of a corner lot in any district,\na building shall be required to comply with the front yard restrictions\non both streets, and each of such yards shall be deemed a front yard\nfor the purposes of this chapter.[1]"
								},
								{
									"footnote": "[1]\nEditor's Note: Former Section 1.506, Height of buildings, which immediately followed this section, was deleted at time of adoption of Code (see Ch. 1, General Provisions, Art. I).\n"
								}
							]
						},
						{
							"paragraph": "§ 195-19",
							"title": "Computation of size of lot.\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t[1]",
							"content": [
								{
									"content": [
										{
											"number": "A. ",
											"content": [
												{
													"text": "In the case of a parcel of land connected with a public\nstreet by a driveway and having no other street frontage, the portion\nof the parcel of land occupied by such driveway shall be excluded\nfor the purpose of computing the size of the lot, the building area\nand the location and size of the front, rear and side yards. In such\na case, the size of the lot and the building area shall be computed,\nand the yards shall be located and their required size shall be determined,\nin the same manner as if the driveway did not exist and as if the\nline of the lot nearest the public street with which the driveway\nconnected had been the front line of the lot."
												}
											]
										},
										{
											"number": "B. ",
											"content": [
												{
													"text": "For the purpose of computing the building area, the\nsize of the lot, the rear yards, front yards and side yards, any proposed\nstreet or streets shown on any official map or plan of the Village\nor any amendment or modification thereof now or hereafter duly adopted\nby the Planning Board or Planning Commission or Board of Trustees\nof the Village of Hewlett Neck, shall be considered a public street\nwith the same force and effect as if the same had been duly opened\nand improved and made available for public use."
												}
											]
										}
									]
								},
								{
									"footnote": "[1]\nEditor's Note: Amended at time of adoption of Code (see Ch. 1, General Provisions, Art. I).\n"
								}
							]
						},
						{
							"paragraph": "§ 195-20",
							"title": "Lot coverage and volume requirements.\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t[1]",
							"content": [
								{
									"content": [
										{
											"number": "A. ",
											"content": [
												{
													"text": "The footprint areas occupied by all buildings and\nstructures and accessory uses which extend three feet or more above\nthe grade of the property shall not exceed the following percentage\nof the lot area in the indicated district:"
												},
												{
													"content": [
														{
															"number": "(1) ",
															"content": [
																{
																	"text": "Residence A (5,000 square feet building zones): 40%\n(maximum 2,000 square foot footprint)."
																}
															]
														},
														{
															"number": "(2) ",
															"content": [
																{
																	"text": "Residence B (15,000 square feet building zones): 20%\n(maximum 3,000 square foot footprint)."
																}
															]
														},
														{
															"number": "(3) ",
															"content": [
																{
																	"text": "Residence C (30,000 square feet building zones): 15%\n(maximum 4,500 square foot footprint)."
																}
															]
														},
														{
															"number": "(4) ",
															"content": [
																{
																	"text": "Residence D (40,000 square feet building zones) 12.5%\n(maximum 5,000 square foot footprint)."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "B. ",
											"content": [
												{
													"text": "The areas occupied by all decks and structures and\naccessory uses which extend less than three feet above the grade of\nthe property shall not exceed the following percentage of the lot\narea in the indicated district:"
												},
												{
													"content": [
														{
															"number": "(1) ",
															"content": [
																{
																	"text": "Residence A (5,000 square feet building zones) 20%\n(maximum 1,000 square foot footprint)."
																}
															]
														},
														{
															"number": "(2) ",
															"content": [
																{
																	"text": "Residence B (15,000 square feet building zones) 10%\n(maximum 1,500 square foot footprint)."
																}
															]
														},
														{
															"number": "(3) ",
															"content": [
																{
																	"text": "Residence C (30,000 square feet building zones) 8%\n(maximum 2,400 square foot footprint)."
																}
															]
														},
														{
															"number": "(4) ",
															"content": [
																{
																	"text": "Residence D (40,000 square feet building zones) 7.5%\n(maximum 3,000 square foot footprint)."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "C. ",
											"content": [
												{
													"text": "No main dwelling shall be erected unless it has a\nhabitable floor area of at least 1,600 square feet, and a minimum\nfootprint area of 1,000 square feet."
												}
											]
										},
										{
											"number": "D. ",
											"content": [
												{
													"text": "No building shall exceed 2 1/2 stories, with\na maximum height of 30 feet.[Amended 11-3-2003 by L.L. No. 2-2003[2]]"
												},
												{
													"footnote": "[2]\nEditor's Note: This local law also repealed\nSubsection E, pertaining to volume calculation.\n"
												}
											]
										}
									]
								},
								{
									"footnote": "[1]\nEditor's Note: Added at time of adoption of Code (see Ch. 1, General Provisions, Art. I).\n"
								}
							]
						},
						{
							"paragraph": "§ 195-20.1",
							"title": "Height/setback standards.",
							"content": [
								{
									"text": "The following height/setback standards shall\npertain to the respective districts and yards shown in the table below:"
								}
							]
						},
						{
							"paragraph": "§ 195-20.2",
							"title": "Maximum permitted impervious surface.",
							"content": [
								{
									"text": "The maximum permitted impervious surface on\na lot shall be calculated in accordance with the table below. In addition,\nnot more than 25% of any front yard may be comprised of impervious\nsurface."
								}
							]
						},
						{
							"paragraph": "§ 195-21",
							"title": "Swimming pools.",
							"content": [
								{
									"content": [
										{
											"number": "A. ",
											"content": [
												{
													"text": "For the purpose of computing the building area, the\nrequired yards and the distances from the lines of the lot, the pool\napron or platform along the side or end of a swimming pool, the base\nfor the springboard or diving platform and foundation for the purifying\napparatus, if any, shall be included."
												}
											]
										},
										{
											"number": "B. ",
											"content": [
												{
													"text": "No swimming pool or part thereof shall be constructed\nin the front yard or side yard."
												}
											]
										},
										{
											"number": "C. ",
											"content": [
												{
													"text": "All swimming pools shall be constructed in accordance\nwith the standard practice."
												}
											]
										},
										{
											"number": "D. ",
											"content": [
												{
													"text": "In no case may the contents of the pool be permitted\nto discharge, directly or indirectly, into a street or in, upon or\nunder the land of another person without the written consent of such\nother person or in such a way as to adversely affect the functioning\nof the house drains or house sewer of another property."
												}
											]
										},
										{
											"number": "E. ",
											"content": [
												{
													"text": "All connections with the public water supply shall\nbe made by a duly licensed plumber in conformity with the Plumbing\nCode and the rules and regulations of the Long Island Water Corporation.\nSuch connections shall be made in such a way as to prevent any water\nfrom entering the public water supply system. In times of drought\nor water shortages, the Board of Trustees may direct that the use\nof the swimming pool be discontinued and that all connections with\nthe public water supply system be broken until further order."
												}
											]
										},
										{
											"number": "F. ",
											"content": [
												{
													"text": "Fences."
												},
												{
													"content": [
														{
															"number": "(1) ",
															"content": [
																{
																	"text": "Every swimming pool shall be enclosed by a fence,\nat least four feet in height, approved by the Building Inspector,\nsufficient to prevent the accidental entry or unauthorized use of\nthe pool by a child or children. Such fence shall be erected so as\nto completely enclose the pool itself or the particular yard area\nin which the pool is situated or the entire property back of the building.\nSaid fence shall have self-closing and self-locking gates.[Amended 1-5-1998 by L.L. No. 1-1998]"
																}
															]
														},
														{
															"number": "(2) ",
															"content": [
																{
																	"text": "Every swimming pool installed in accordance with the\nprovisions of this chapter shall be not less than 15 feet from the\nrear property line."
																}
															]
														},
														{
															"number": "(3) ",
															"content": [
																{
																	"text": "If, in compliance with the foregoing requirements,\na fence would be required along a waterfront property line, the fence\nalong the waterfront may be eliminated on condition that the portion\nof the fence along the side lines be extended to the waterline and\nprovided with guards to prevent passing around the ends.[1]"
																},
																{
																	"footnote": "[1]\nEditor's Note: Former Section 1.508(g), which\nregulated the type of fencing required around swimming pools and immediately\nfollowed this section, was deleted 1-5-1998 by L.L. No. 1-1998. Fencing\nrequirements for swimming pools are located in the New York State\nUniform Fire Prevention and Building Code, Parts 720 and 744.\n"
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "G. ",
											"content": [
												{
													"text": "If the use of the swimming pool should be discontinued\nor if the swimming pool should, at any time, be in bad condition,\nthe owner will, on demand, fill in the pool and excavation to grade\nand will not restore the pool to use except, upon a further application\nfor a building permit."
												}
											]
										},
										{
											"number": "H. ",
											"content": [
												{
													"text": "This section, as amended so as to read as above stated,\nshall apply to all swimming pools whenever constructed, including\nswimming pools constructed after the adoption of Ordinance No. 78\non May 10, 1962, and swimming pools constructed prior to that date\nwhich were required to comply with the provisions of said ordinance\nafter May 15, 1963, without prejudice, however, to any variances granted\nby the Board of Appeals."
												}
											]
										},
										{
											"number": "I. ",
											"content": [
												{
													"text": "The provisions of this section, shall also apply to\na portable or removable wading or swimming pools which contains, or\nis designed to contain, water having a depth of 18 inches or more\nin any part thereof, with the following exception: in the case of\nsuch a pool, the exterior wall or side of the pool, to the extent\nthat it is located above the surface of the ground and had the height\nspecified in the New York State Uniform Fire Prevention and Building\nCode, may be considered as part of the fence or wall required by this\nsubdivision. Any stairway or ladder giving access to the pool will\nbe considered as an opening for ingress and egress and must comply\nwith the provisions of the New York State Uniform Fire Prevention\nand Building Code in respect to gates and other requirements.[2]"
												},
												{
													"footnote": "[2]\nEditor's Note: Former Subsection (k), which\nrequired the annual inspections and renewal of permits for pools and\nimmediately followed this subsection, was repealed 6-6-1988 by L.L.\nNo. 1-1988.\n"
												}
											]
										},
										{
											"number": "J. ",
											"content": [
												{
													"text": "This section shall apply only to the location, construction\nand maintenance of outdoor swimming pools."
												}
											]
										}
									]
								}
							]
						},
						{
							"paragraph": "§ 195-22",
							"title": "Fences and walls.",
							"content": [
								{
									"content": [
										{
											"number": "A. ",
											"content": [
												{
													"text": "No fence or wall above four feet in height shall be\nconstructed, installed or erected without first being approved by\nthe Building Inspector."
												}
											]
										},
										{
											"number": "B. ",
											"content": [
												{
													"text": "Any person or persons, corporation, firm or association\nintending to erect a fence shall, before any work is commenced, make\napplication to the Village Building Inspector on a form provided by\nthe Building Inspector. Said application shall be accompanied by a\nplan or sketch showing the proposed location of any fence and the\nmaterials proposed to be used therein, which must be in accordance\nwith this chapter and any other pertinent local law regulating construction\nwithin the Village and be accompanied by a permit fee as hereinafter\nset forth. Upon approval by the Village Building Inspector, a permit\nshall be issued which will be in effect for a period of six months\nafter the date therein. Said permit shall be available on the job\nduring the progress of the work so that it may be inspected by proper\nVillage officials, including but not limited to the Village Building\nInspector, Mayor and Trustees."
												}
											]
										},
										{
											"number": "C. ",
											"content": [
												{
													"text": "Living fences. Living fences are subject to all of\nthe provisions of this chapter, except that they shall be exempt from\nthe permit provisions of this chapter. In addition, no living fence\nshall be placed nearer than two feet to any sidewalk in existence,\nany prospective sidewalk or party line. There are no height limitations\non living fences. Living fences must be maintained in a neatly trimmed\ncondition and shall not interfere with the visibility of vehicular\nand pedestrian traffic."
												}
											]
										},
										{
											"number": "D. ",
											"content": [
												{
													"text": "Applicability. The permit provisions of this chapter\nshall apply to fences in residential zones of the Village of Hewlett\nNeck. No fence shall be erected in the Village in excess of the height\nlimitations as set forth herein."
												}
											]
										},
										{
											"number": "E. ",
											"content": [
												{
													"text": "Height limitations."
												},
												{
													"content": [
														{
															"number": "(1) ",
															"content": [
																{
																	"text": "Rear yards. No constructed fence shall be more than\nsix feet in height at the rear of homes and buildings, nor shall it\nextend forward of the rear building line of any existing or proposed\ndwelling."
																}
															]
														},
														{
															"number": "(2) ",
															"content": [
																{
																	"text": "Front yards. No constructed fence shall be higher\nthan 48 inches in any front yard from the mean height of the roadway\nin front of the premises."
																}
															]
														},
														{
															"number": "(3) ",
															"content": [
																{
																	"text": "Side yards. No constructed fence shall be more than\nsix feet in height at the side of homes and buildings, nor shall it\nextend forward of the side building line of any existing or proposed\ndwelling."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "F. ",
											"content": [
												{
													"text": "Location restriction. Any fence erected under this chapter shall be placed at least six inches back from any property line. Any constructed fence erected in a front yard shall be placed at least two feet back from the property line. Living fences shall be placed in accordance with Subsection C of this section."
												}
											]
										},
										{
											"number": "G. ",
											"content": [
												{
													"text": "Materials and composition."
												},
												{
													"content": [
														{
															"number": "(1) ",
															"content": [
																{
																	"text": "Any fence, wall or similar structure, as well as shrubbery,\nwhich unduly cuts off light or air or which may cause a nuisance,\na fire hazard or a dangerous condition, is hereby expressly prohibited.\nFurther, no fence shall be erected in a residential zone or along\na public right-of-way unless the fence is uniformly less than 50%\nsolid."
																}
															]
														},
														{
															"number": "(2) ",
															"content": [
																{
																	"text": "The following fences and fencing materials are specifically\nprohibited on property perimeters:"
																},
																{
																	"content": [
																		{
																			"number": "(a) ",
																			"content": [
																				{
																					"text": "Barbed wire."
																				}
																			]
																		},
																		{
																			"number": "(b) ",
																			"content": [
																				{
																					"text": "Pointed fences under three feet in height."
																				}
																			]
																		},
																		{
																			"number": "(c) ",
																			"content": [
																				{
																					"text": "Canvas fences."
																				}
																			]
																		},
																		{
																			"number": "(d) ",
																			"content": [
																				{
																					"text": "Cloth fences."
																				}
																			]
																		},
																		{
																			"number": "(e) ",
																			"content": [
																				{
																					"text": "Electrically charged fences."
																				}
																			]
																		},
																		{
																			"number": "(f) ",
																			"content": [
																				{
																					"text": "Poultry fences."
																				}
																			]
																		},
																		{
																			"number": "(g) ",
																			"content": [
																				{
																					"text": "Turkey wire."
																				}
																			]
																		},
																		{
																			"number": "(h) ",
																			"content": [
																				{
																					"text": "Temporary fences, such as snow fences, unless\non construction sites with Village Board permission."
																				}
																			]
																		},
																		{
																			"number": "(i) ",
																			"content": [
																				{
																					"text": "Expandable fences and collapsible fences, except\nduring construction of a building."
																				}
																			]
																		},
																		{
																			"number": "(j) ",
																			"content": [
																				{
																					"text": "Chain link, cyclone-type or wire fences."
																				}
																			]
																		},
																		{
																			"number": "(k) ",
																			"content": [
																				{
																					"text": "Vinyl or plastic woven fences; provided, however,\nthat this prohibition shall not be construed to prevent fences made\nprimarily out of PVC or similar material.[Amended 1-7-2002 by L.L. No. 2-2002]"
																				}
																			]
																		}
																	]
																}
															]
														},
														{
															"number": "(3) ",
															"content": [
																{
																	"text": "All entrances or gates shall open onto the property."
																}
															]
														},
														{
															"number": "(4) ",
															"content": [
																{
																	"text": "Any fence of wood and any stockade or other type of\nfence shall have the smooth side or finished side facing to the outside\nof the property of the owner installing the fence. Fence posts will\nbe placed on the inside of the fence."
																}
															]
														},
														{
															"number": "(5) ",
															"content": [
																{
																	"text": "All fences or walls must be erected within the property\nline, and none shall be erected so as to encroach upon a public right-of-way\nor interfere with vehicular or pedestrian traffic or interfere with\nthe visibility of vehicular or pedestrian traffic."
																}
															]
														},
														{
															"number": "(6) ",
															"content": [
																{
																	"text": "All fences must be maintained in good repair at all\ntimes."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "H. ",
											"content": [
												{
													"text": "Powers and duties of Village Building Inspector."
												},
												{
													"content": [
														{
															"number": "(1) ",
															"content": [
																{
																	"text": "The Village Building Inspector shall have the authority\nto direct the immediate repair and maintenance of all fences."
																}
															]
														},
														{
															"number": "(2) ",
															"content": [
																{
																	"text": "The Village Building Inspector shall have the authority\nto direct, in writing, the removal, trimming or modification, within\nfive days, of any shrubs, bushes, plants, trees, flowers or other\nvegetation, fence, wall, hedge or other structure on private or public\nproperty, wherever the same shall interfere with adequate visibility\nfor operators of motor vehicles at street intersections or curbs."
																}
															]
														},
														{
															"number": "(3) ",
															"content": [
																{
																	"text": "Any person who shall refuse or neglect to comply with\nthe written direction of the Village Building Inspector shall be guilty\nof a violation under the terms of this chapter."
																}
															]
														},
														{
															"number": "(4) ",
															"content": [
																{
																	"text": "If the property owner feels aggrieved by any decision\nof the Building Inspector, he or she shall have a right of appeal\nto the Village Board, provided that said appeal is accomplished in\nwriting within 10 days of the written notification from the Building\nInspector. Said appeal shall be filed with the Village Clerk."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "I. ",
											"content": [
												{
													"text": "On any corner lot, no wall, fence or other structure\nshall be erected or altered, and no hedge, tree, shrub or other growth\nshall be maintained at a height greater than 21/2 feet at any point\nwithin a radius of 30 feet of the point formed by any intersecting\nroads or highways, and provided, further, that such height shall be\nmeasured from the existing elevation of the center line of such highway\nopposite such wall, fence, other structure, hedge, tree or shrub."
												}
											]
										}
									]
								},
								{
									"footnote": "[1]\nEditor's Note: Amended at time of adoption of Code (see Ch. 1, General Provisions, Art. I).\n"
								}
							]
						},
						{
							"paragraph": "§ 195-23",
							"title": "Storage of vehicles, boats and trailers.",
							"content": [
								{
									"text": "A registered motor home, trailer, boat, personal\nwatercraft and other vessel may be stored in the rear yard of any\nresidential property, provided that it is at least 10 feet from any\nside or rear property line."
								}
							]
						},
						{
							"paragraph": "§ 195-24",
							"title": "Signs.",
							"content": [
								{
									"content": [
										{
											"number": "A. ",
											"content": [
												{
													"text": "No sign shall be erected or maintained in a residence\ndistrict of the Village, except:"
												},
												{
													"content": [
														{
															"number": "(1) ",
															"content": [
																{
																	"text": "Signs stating the name of the premises or the name\nof the owner or occupant thereof and, in the case of a duly licensed\nprofessional person, the letters or symbol designating such profession."
																}
															]
														},
														{
															"number": "(2) ",
															"content": [
																{
																	"text": "Signs stating the street and number of the building\nor premises where the sign is located."
																}
															]
														},
														{
															"number": "(3) ",
															"content": [
																{
																	"text": "In the case of public buildings or facilities, signs\nstating the name of the building or of the organization, the nature\nof its activity and such other symbols, displays, information and\nannouncements, as may be in accordance with their customs, practices\nand usages."
																}
															]
														},
														{
															"number": "(4) ",
															"content": [
																{
																	"text": "Directional warning or security signs for the convenience\nof persons desiring to enter the premises, such as \"tradesmen,\" \"deliveries,\"\n\"entrance,\" \"private,\" \"children,\" \"beware of dog,\" \"no peddling allowed,\"\n\"security\" and the like."
																}
															]
														},
														{
															"number": "(5) ",
															"content": [
																{
																	"text": "\"For sale\" signs which may include the name and telephone\nnumber of a real estate broker."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "B. ",
											"content": [
												{
													"text": "The size of signs in the residence districts shall\nconform to the following requirements:[Amended 1-5-1998 by L.L. No. 1-1998]"
												},
												{
													"content": [
														{
															"number": "(1) ",
															"content": [
																{
																	"text": "Signs permitted under Subsection A(1), (2) and (3) above shall not exceed eight inches in height, two feet in length, except as provided in § 195-15C for signs designating home occupations."
																}
															]
														},
														{
															"number": "(2) ",
															"content": [
																{
																	"text": "Signs permitted under Subsection A(4) and (5) above shall not exceed two square feet in area."
																}
															]
														},
														{
															"number": "(3) ",
															"content": [
																{
																	"text": "Professional signs shall be governed by § 195-15 of this chapter."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "C. ",
											"content": [
												{
													"text": "Location of signs in yards."
												},
												{
													"content": [
														{
															"number": "(1) ",
															"content": [
																{
																	"text": "Signs permitted by Subsection A(1), (2) and (3) above may be erected and maintained on the face of the residence or within the required front yard, required side yard or required rear yard, provided that the highest point of the sign is not more than four feet above the level of the ground where it is located."
																}
															]
														},
														{
															"number": "(2) ",
															"content": [
																{
																	"text": "Signs permitted by Subsection A(4) and (5) above shall be located not closer than 15 feet from the front property line of any property except \"security\" signs which may be placed at any location in the front yard of any property."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "D. ",
											"content": [
												{
													"text": "Each property shall be limited to one sign permitted under Subsection A(5) of this section."
												}
											]
										},
										{
											"number": "E. ",
											"content": [
												{
													"text": "No sign shall have any form of illumination or motion."
												}
											]
										},
										{
											"number": "F. ",
											"content": [
												{
													"text": "No sign shall be affixed to a tree."
												}
											]
										},
										{
											"number": "G. ",
											"content": [
												{
													"text": "Any billboard, sign, advertisement, display or similar\nstructure erected or maintained in violation of any of the provisions\nof this Code is hereby declared to be a public nuisance, and the Mayor\nor the Village Clerk are hereby authorized and empowered to cause\nthe same to be removed without notice, and the cost or expense thereof\nshall be assessed against the property upon which the same may be\nsituated and/or charged against the owner or occupant of such property.\nRight of entry upon such property is hereby granted for the purpose\nof such removal.[Added 1-5-1998 by L.L. No. 1-1998]"
												}
											]
										},
										{
											"number": "H. ",
											"content": [
												{
													"text": "No person shall post any bills, notices or advertising\nmaterial of any character whatsoever upon any trees or posts, poles,\nfences, buildings or other structures within or upon any streets,\nparkways, parks or other public property in the Village of Hewlett\nNeck. It shall be a rebuttable presumption concerning all signs that\nthe sign shall have been erected by the person deemed to benefit therefrom.\nThe Village shall have the authority to remove any such signs, and\nthe costs of such removal shall be placed on the tax rolls of the\nperson so designated.[Added 1-5-1998 by L.L. No. 1-1998]"
												}
											]
										},
										{
											"number": "I. ",
											"content": [
												{
													"text": "It shall be unlawful to use any sidewalk, street,\nhighway or public place of the Village for the purpose of displaying\nany sign, advertisement or posting any bill on or along the same without\nwritten permission therefor first being obtained from the Mayor of\nthe Village.[Added 1-5-1998 by L.L. No. 1-1998]"
												}
											]
										}
									]
								}
							]
						},
						{
							"paragraph": "§ 195-25",
							"title": "Private tennis courts.",
							"content": [
								{
									"content": [
										{
											"number": "A. ",
											"content": [
												{
													"text": "Restrictions. A tennis court complying with the provisions\nof this section shall only be permitted in a residential district\nas an accessory use to a dwelling for the residents of such dwelling\nand their guests."
												}
											]
										},
										{
											"number": "B. ",
											"content": [
												{
													"text": "Issuance of building permit. No tennis court shall\nbe constructed unless a building permit shall be issued by the Building\nInspector. Every application for a permit shall be accompanied by\na dimensioned site plan, drawn to scale and showing locations of all\ndetails, duly certified by a licensed professional engineer or architect,\nwhich site plan shall have been submitted to and approved by the Village\nBuilding Inspector."
												}
											]
										},
										{
											"number": "C. ",
											"content": [
												{
													"text": "Yard and setback limitations. Tennis courts shall\nbe constructed only in the rear yard of a dwelling and shall be located\nentirely within the setback limits of the district, but shall not,\nin any event, be located closer than 20 feet to the nearest property\nline."
												}
											]
										},
										{
											"number": "D. ",
											"content": [
												{
													"text": "Fences and enclosures."
												},
												{
													"content": [
														{
															"number": "(1) ",
															"content": [
																{
																	"text": "Every tennis court shall be enclosed by a fence of\na design approved by the Village Building Inspector."
																}
															]
														},
														{
															"number": "(2) ",
															"content": [
																{
																	"text": "Notwithstanding the provisions of this chapter to\nthe contrary, such fence may be not less than four feet but not more\nthan 10 feet in height, subject to the site approval of the Village\nBuilding Inspector."
																}
															]
														},
														{
															"number": "(3) ",
															"content": [
																{
																	"text": "Nothing herein shall be deemed to permit any type\nof cover or enclosure over a tennis court."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "E. ",
											"content": [
												{
													"text": "Landscaping. All tennis courts shall be completely\nscreened from adjoining properties by a living screen of coniferous\ntrees. Said trees shall be of a height, when planted, not less than\ntwo feet below the top of the adjacent fence and shall be planted\nfive feet on center and not more than 10 feet away from the fence\nsurrounding the tennis court, on all sides of the court not facing\nthe dwelling on the same lot. Said coniferous screening shall consist\nof Canadian hemlock, or an alternate approved by the Village Building\nInspector, and shall be maintained so long as the tennis court remains\nin existence."
												}
											]
										},
										{
											"number": "F. ",
											"content": [
												{
													"text": "Grade; drainage."
												},
												{
													"content": [
														{
															"number": "(1) ",
															"content": [
																{
																	"text": "The height of the playing surface of the tennis court\nshall not be above the existing mean level of the ground immediately\nsurrounding the tennis court area prior to construction of the tennis\ncourt."
																}
															]
														},
														{
															"number": "(2) ",
															"content": [
																{
																	"text": "No tennis court shall be constructed or maintained\nso as to permit any drainage water to flow onto adjoining properties."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "G. ",
											"content": [
												{
													"text": "Use of lights; hours."
												},
												{
													"content": [
														{
															"number": "(1) ",
															"content": [
																{
																	"text": "The use of a tennis court before 8:00 a.m. or after\n9:00 p.m. is prohibited."
																}
															]
														},
														{
															"number": "(2) ",
															"content": [
																{
																	"text": "No lighting shall be erected, operated or maintained\nin connection with a tennis court in such a manner as to create an\nannoyance or nuisance to surrounding properties. All lights over tennis\ncourts shall be shielded so as to prevent their shining upon the property\nof any adjacent property owner."
																}
															]
														},
														{
															"number": "(3) ",
															"content": [
																{
																	"text": "No tennis court may be used for commercial purposes,\nfor hire or for the purpose of giving lessons to persons not a resident\nof the property."
																}
															]
														}
													]
												}
											]
										}
									]
								}
							]
						},
						{
							"paragraph": "§ 195-26",
							"title": "Recreational facilities.",
							"content": [
								{
									"content": [
										{
											"number": "A. ",
											"content": [
												{
													"text": "No person shall use or operate or cause to be used\nor operated any recreational facility on his or her property, whether\nheretofore existing or hereafter installed, between the hours of 9:00\np.m. and 8:00 a.m. on any day."
												}
											]
										},
										{
											"number": "B. ",
											"content": [
												{
													"text": "No artificial lighting of any nature in excess of\n15 feet in height may be installed or used in connection with any\nrecreational facility. No such lighting facility shall be directed\ntoward any adjacent property."
												}
											]
										},
										{
											"number": "C. ",
											"content": [
												{
													"text": "No recreational facility shall be constructed or maintained\nto permit any drainage water to flow onto adjacent property or onto\na public street."
												}
											]
										},
										{
											"number": "D. ",
											"content": [
												{
													"text": "This section is intended to protect the health, welfare\nand safety of the residents of the Village of Hewlett Neck."
												}
											]
										}
									]
								}
							]
						},
						{
							"paragraph": "§ 195-26.1",
							"title": "Exterior air-conditioning units and exterior permanent standby electrical generators.",
							"content": [
								{
									"content": [
										{
											"number": "A. ",
											"content": [
												{
													"text": "Permit\nrequired. A building permit shall be required for the construction,\ninstallation, placement or alteration of an exterior air-conditioning\nunit which is designed and intended to provide central air conditioning\nfor one or more buildings on the lot or an exterior permanent standby\nelectrical generator which is designed to provide electricity for\none or more buildings on the lot. An application for a building permit\nfor an exterior air-conditioning unit or an exterior permanent standby\nelectrical generator shall contain a statement of the full name and\nresidence of each of the persons having an interest as owner, tenant\nor otherwise and of the use to, which the building is to be put and\nsuch other information as the Board of Trustees may require. Said\napplication shall be accompanied by plans and drawings showing the\nsize and proposed location of the exterior air-conditioning unit or\nthe exterior permanent standby electrical generator, and a survey\nshowing the location of all existing buildings located on the property.\nThe application shall be filed with the Village Clerk, together with\na fee established by the Board of Trustees."
												}
											]
										},
										{
											"number": "B. ",
											"content": [
												{
													"text": "Yard\nand setback restrictions. Exterior air-conditioning units and exterior\npermanent standby electrical generators may be located in a side yard\nor rear yard only and shall be located within the following setback\nrequirements for each district:"
												},
												{
													"content": [
														{
															"number": "(1) ",
															"content": [
																{
																	"text": "Residence A District: not less than five feet from any side lot line\nand not less than 15 feet from the rear lot line."
																}
															]
														},
														{
															"number": "(2) ",
															"content": [
																{
																	"text": "Residence B District: not less than 15 feet from any side lot line\nand not less than 15 feet from the rear lot line."
																}
															]
														},
														{
															"number": "(3) ",
															"content": [
																{
																	"text": "Residence C District: not less than 15 feet from any side lot line\nand not less than 25 feet from the rear lot line."
																}
															]
														},
														{
															"number": "(4) ",
															"content": [
																{
																	"text": "Residence D District: not less than 15 feet from any side lot line\nand not less than 25 feet from the rear lot line."
																}
															]
														}
													]
												}
											]
										}
									]
								}
							]
						},
						{
							"paragraph": "§ 195-27",
							"title": "Off-street parking; curb cut construction.",
							"content": [
								{
									"content": [
										{
											"number": "A. ",
											"content": [
												{
													"text": "General. Off-street parking spaces shall be provided\nand kept available as an accessory use to all permitted and special\nexception uses of buildings, structures and lots in amounts not less\nthan those specified in this section."
												}
											]
										},
										{
											"number": "B. ",
											"content": [
												{
													"text": "Method of determining off-street parking space requirements."
												},
												{
													"content": [
														{
															"number": "(1) ",
															"content": [
																{
																	"text": "The requirement for a single use (e.g., a one-family\ndwelling) shall be determined directly from the schedule of such requirements\nwhich is a part of this section."
																}
															]
														},
														{
															"number": "(2) ",
															"content": [
																{
																	"text": "When the required number of spaces is determined to\nresult in a fraction, it shall be increased to the next highest whole\nnumber."
																}
															]
														},
														{
															"number": "(3) ",
															"content": [
																{
																	"text": "If the use is not specifically listed in the schedule\nof such requirements, the requirement shall be the same as for the\nmost similar use listed."
																}
															]
														},
														{
															"number": "(4) ",
															"content": [
																{
																	"text": "A garage or carport may be used to meet the requirements\nof this section. A driveway may only be used to meet the requirements\nof this section where it serves a one-family dwelling."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "C. ",
											"content": [
												{
													"text": "Schedule of off-street parking space requirements\nfor residential uses."
												}
											]
										},
										{
											"number": "D. ",
											"content": [
												{
													"text": "Schedule of off-street parking space requirements\nfor nonresidential uses.[Amended 12-6-1999 by L.L. No. 13-1999]"
												}
											]
										},
										{
											"number": "E. ",
											"content": [
												{
													"text": "Supplemental parking regulations for private garage\nor off-street parking areas in residence districts.[Added 12-5-2011 by L.L. No. 7-2011; 1-5-2015 by L.L. No. 1-2015]"
												},
												{
													"content": [
														{
															"number": "(1) ",
															"content": [
																{
																	"text": "In\nany residence district, driveways and off-street parking areas may\nnot be rented for use by persons who do not reside on the premises."
																}
															]
														},
														{
															"number": "(2) ",
															"content": [
																{
																	"text": "Not\nmore than one commercial vehicle shall be housed and must be parked\nin a private garage. Such commercial vehicle shall not exceed a gross\nmotor vehicle weight of 10,000 pounds or 25 feet in length."
																}
															]
														},
														{
															"number": "(3) ",
															"content": [
																{
																	"text": "Location\nof required spaces. In any residence district, required off-street\nautomobile parking spaces shall only be provided in the front yard\nof the same lot as the building to which such spaces are incidental.\nNothing contained herein shall prevent the normal and customary use\nof driveways, provided that such use as a driveway shall be considered\nto meet the requirements for off-street parking."
																}
															]
														},
														{
															"number": "(4) ",
															"content": [
																{
																	"text": "Motor\nvehicles shall not be parked on a premises other than in a private\ngarage or on an approved driveway or parking area."
																}
															]
														},
														{
															"number": "(5) ",
															"content": [
																{
																	"text": "Unregistered\nmotor vehicles and trailers shall not be parked or stored on a premises,\nexcept in a private garage."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "F. ",
											"content": [
												{
													"text": "Access driveway requirements."
												},
												{
													"content": [
														{
															"number": "(1) ",
															"content": [
																{
																	"text": "Every separate entrance or exit driveway shall have\na minimum unobstructed width of 12 feet on the street. Every combined\nentrance and exit driveway shall have a minimum unobstructed width\nof 24 feet on the street, except for one-family residences, where\nthe minimum shall be 10 feet."
																}
															]
														},
														{
															"number": "(2) ",
															"content": [
																{
																	"text": "The intersection of a separate or combined exit and entrance driveway of a public parking area with the public street shall have the same corner clearance as prescribed for intersecting streets in § 195-22 of this chapter."
																}
															]
														},
														{
															"number": "(3) ",
															"content": [
																{
																	"text": "The gradient of driveways shall be such as to facilitate\nentrance and exit traffic flow."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "G. ",
											"content": [
												{
													"text": "Driveway, curb and sidewalk construction."
												},
												{
													"content": [
														{
															"number": "(1) ",
															"content": [
																{
																	"text": "No driveway, curb cut, curb return or sidewalk will\nbe constructed connecting the abutting property to a Village street\nwithout a permit therefor, as hereinafter provided, and except in\nconformity with the provisions of this section. The filing fee for\nsuch applications shall be as set forth in the Village Schedule of\nFees."
																}
															]
														},
														{
															"number": "(2) ",
															"content": [
																{
																	"text": "Driveways crossing curblines and sidewalks shall not\nbe less than 10 feet."
																}
															]
														},
														{
															"number": "(3) ",
															"content": [
																{
																	"text": "Not more than one curb cut shall be permitted for\neach parcel, except that one additional curb cut may be permitted\nfor a parcel which has at least 120 feet of frontage on a Village\nstreet."
																}
															]
														},
														{
															"number": "(4) ",
															"content": [
																{
																	"text": "Application for a permit to construct a driveway,\ncurb cut, curb return or sidewalk shall be made to the Building Inspector\nof the Village and shall contain such information as the Building\nInspector shall require, including a description of the proposed construction\nand its location."
																}
															]
														},
														{
															"number": "(5) ",
															"content": [
																{
																	"text": "All driveways, curb cuts, curb returns and sidewalks\nand similar improvements shall be constructed at the total expense\nof the abutting property owner. The surface between the property line\nand the pavement of the Village street shall be designed to prevent\ndriveway material from scattering onto the Village streets."
																}
															]
														},
														{
															"number": "(6) ",
															"content": [
																{
																	"text": "In any case where a circular driveway is proposed\nto be constructed for nonresidential use, no permit shall be issued\ntherefor unless the plans therefor include a parking area for the\noff-street parking as required by this chapter so that the circular\ndriveway shall not serve as the required off-street parking area."
																}
															]
														},
														{
															"number": "(7) ",
															"content": [
																{
																	"text": "The owner of the premises responsible for such construction\nof a driveway, curb cut, curb return or sidewalk, without a permit\nor otherwise in conformity with a permit, may be required to remove\nthe same; and, upon failure to do so, the same may be removed by the\nVillage, and the cost thereof certified to the Board of Trustees,\nby the Building Inspector, and assessed against the property of such\nowner or collected by the Village from such owner by other legal proceedings."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "H. ",
											"content": [
												{
													"text": "Design requirements for nonresidential parking."
												},
												{
													"content": [
														{
															"number": "(1) ",
															"content": [
																{
																	"text": "The physical improvements of off-street parking and\ntruck loading areas shall include:"
																},
																{
																	"content": [
																		{
																			"number": "(a) ",
																			"content": [
																				{
																					"text": "Curbs, paving, sidewalks and drainage facilities\ncomplying with the standards established in municipal ordinances,\nregulations or specifications."
																				}
																			]
																		},
																		{
																			"number": "(b) ",
																			"content": [
																				{
																					"text": "Adequate lighting in public parking areas to\nassure the general safety and convenience of the public."
																				}
																			]
																		},
																		{
																			"number": "(c) ",
																			"content": [
																				{
																					"text": "Appropriate screening for the protection of\nadjacent properties, particularly along district boundary lines."
																				}
																			]
																		}
																	]
																}
															]
														},
														{
															"number": "(2) ",
															"content": [
																{
																	"text": "All aisles within parking areas shall have a minimum\nwidth of 24 feet when the parking spaces are at a ninety-degree angle\nwith the aisle, 18 feet when the parking spaces are at a sixty-degree\nangle and 12 feet when the parking spaces are at a forty-five-degree\nangle."
																}
															]
														},
														{
															"number": "(3) ",
															"content": [
																{
																	"text": "Aisles and turning areas shall provide good internal\ncirculation with adequate radii to assure ease of mobility, ample\nclearance and convenient access. All aisles not adjacent to parking\nstalls and permitting two-way traffic flow shall have a minimum width\nof 24 feet. All aisles not adjacent to parking stalls and permitting\nonly one-way traffic flow shall have a minimum width of 12 feet."
																}
															]
														},
														{
															"number": "(4) ",
															"content": [
																{
																	"text": "Center-line gradients of aisles shall not exceed 8%."
																}
															]
														},
														{
															"number": "(5) ",
															"content": [
																{
																	"text": "Accessory off-street parking areas shall be marked\noff into parking spaces either with a minimum width of nine feet and\na minimum length of 19 feet or with a minimum width of 10 feet and\na minimum depth of 18 feet or, in the case of parking spaces for trucks\nor special equipment, parking spaces of a minimum size to be determined\nby the municipality, based on the nature of the parked vehicle."
																}
															]
														}
													]
												}
											]
										}
									]
								}
							]
						}
					]
				}
			]
		}
	]
}