{
	"url": "http://ecode360.com/6311769",
	"paras": [
	    {
			"paragraph": "§ 215-11",
			"title": "Regulations for Residential R-3 District.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "No building shall be erected, altered or used and\nno premises shall be used for any purpose other than those set forth\nin this section."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "No building permit shall be used for uses permitted\nin the R-3 District unless the applicant shall first have obtained\nbuilding and site plan approval as required by law."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Permitted principal uses shall be limited to the following:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Residential single-family detached dwellings on plots\nof no less than 20,000 square feet.[Amended 11-25-1985 by L.L. No. 10-1985[1]]"
												},
												{
													"footnote": "[1]\nEditor's Note: This local law also provided\nthat it shall take effect on January 1, 1986; provided, however, that\nany structure shown on a final site plan, or waiver of final site\nplan, application approved by vote of the Planning Board on or before\nthat date may be erected, provided that the building permit is issued\nno later than January 1, 1989, even though any said structure would\nnot be permitted pursuant to this law.\n"
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Religious uses, subject to the provisions of this\nchapter and with the permission of the Board of Trustees.[Amended 6-28-1995 by L.L. No. 6-1995]"
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "On sites developed or approved for development before\nJanuary 1, 1990, residential single-family attached or detached cluster\ndwellings, with total average density not to exceed two units per\nacre.[Amended 2-11-1981 by L.L. No. 3-1981; 6-17-1985 by L.L. No.\n6-1985; 3-28-1990 by L.L. No. 2-1990]"
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "Noncommercial membership clubs, subject to the requirements\napplicable in an R-1 District and with the permission of the Board\nof Trustees.[Amended 6-28-1995 by L.L. No. 6-1995]"
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "Governmental facilities.[2]"
												},
												{
													"footnote": "[2]\nEditor's Note: Former Subsection C(6), regarding open space residential subdivisions, added 6-17-1985 by L.L. No. 6-1985, which immediately followed this subsection, was deleted at time of adoption of Code (see Ch. 1, General Provisions, Art. II.\n"
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "Residential detached dwelling units shall conform\nto the following regulations:[Amended 6-22-1983 by L.L. No. 12-1983; 11-25-1985 by L.L. No. 10-1985[3]]"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "The minimum lot area shall be 20,000 square feet."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "The minimum lot width shall be 115 feet."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "The minimum street frontage shall be 50 feet."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "The minimum front yard setback shall be 50 feet, except\nthat the Planning Board may, at the time of approval of a site plan,\npermit a minimum front yard setback of no less than 45 feet if the\naverage of all front yard setbacks on the site is no less than 50\nfeet and the maximum front yard setback on the site is no more than\n20 feet greater than the minimum front yard setback on the site."
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "The side yard setbacks shall total at least 50 feet,\nand the minimum side yard setback shall be 20 feet where the principal\ndwelling is a one- or one-and-one-half-story structure; the side yard\nsetback shall total at least 60 feet, and the minimum side yard setback\nshall be 25 feet where the principal dwelling is a two- or two-and-one-half-story\nstructure."
												}
											]
										},
										{
											"number": "(6) ",
											"content": [
												{
													"text": "The minimum rear yard setback shall be 50 feet."
												}
											]
										},
										{
											"number": "(7) ",
											"content": [
												{
													"text": "No building shall exceed 2 1/2 stories or 30\nfeet in height in the case of a flat roof or 35 feet in height in\nthe case of any other roof.[Amended 11-15-2006 by L.L. No. 3-2006]"
												}
											]
										},
										{
											"number": "(8) ",
											"content": [
												{
													"text": "The minimum floor area shall be 1,500 square feet."
												}
											]
										},
										{
											"number": "(9) ",
											"content": [
												{
													"text": "The maximum building coverage shall be 20% where the\nprincipal dwelling is a one- or one-and-one-half-story structure and\n15% where the principal dwelling is a two- or two-and-one-half-story\nstructure."
												}
											]
										},
										{
											"number": "(10) ",
											"content": [
												{
													"text": "Each dwelling unit shall have at least three\non-site parking spaces, at least two of which shall be enclosed."
												}
											]
										},
										{
											"number": "(11) ",
											"content": [
												{
													"text": "No structure or accessory use may be located\nin a front yard."
												}
											]
										},
										{
											"number": "(12) ",
											"content": [
												{
													"text": "Accessory uses shall be limited to those uses permitted by § 215-25 of this Code. All accessory uses shall require a permit from the Board of Zoning Appeals, except that the Planning Board may grant a permit for an accessory use (other than a sign or home occupation) shown on a subdivision or site plan approved by the Planning Board."
												}
											]
										}
									]
								},
								{
									"footnote": "[3]\nEditor's Note: This local law also provided\nthat it shall take effect on January 1, 1986; provided, however, that\nany structure shown on a final site plan, or waiver of final site\nplan, application approved by vote of the Planning Board on or before\nthat date may be erected, provided that the building permit is issued\nno later than January 1, 1989, even though any said structure would\nnot be permitted pursuant to this law.\n"
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "Residential cluster dwelling units shall conform to\nthe following regulations:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "The area of any site shall be at least eight acres,\nto preserve open space, to facilitate the adequate and economical\nprovision of streets and utilities and to encourage high quality and\ncreativity in the design and construction of such development."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Existing structures may be incorporated into the overall\ndesign."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Every dwelling unit shall have pedestrian access to\na street, court, walkway or equivalent, for public use."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "At least 40% of the total area of the site shall be\nopen space."
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "No building shall contain more than three dwelling\nunits, except that the Planning Board may permit buildings to contain\nfour units where a site plan is being approved pursuant to applicable\nlaw."
												}
											]
										},
										{
											"number": "(6) ",
											"content": [
												{
													"text": "The minimum floor area per unit shall be 875 square\nfeet."
												}
											]
										},
										{
											"number": "(7) ",
											"content": [
												{
													"text": "The front yard setback of each building from the road\nshall be at least 30 feet."
												}
											]
										},
										{
											"number": "(8) ",
											"content": [
												{
													"text": "The maximum height of each building shall be 2 1/2\nstories or 30 feet."
												}
											]
										},
										{
											"number": "(9) ",
											"content": [
												{
													"text": "The maximum building coverage shall be 20% of the\nsite."
												}
											]
										},
										{
											"number": "(10) ",
											"content": [
												{
													"text": "The minimum distance between buildings shall\nbe 40 feet."
												}
											]
										},
										{
											"number": "(11) ",
											"content": [
												{
													"text": "At least three off-street parking spaces shall\nbe provided per dwelling unit, of which at least two shall be enclosed."
												}
											]
										},
										{
											"number": "(12) ",
											"content": [
												{
													"text": "No structures or accessory uses shall be permitted\nin the front yard."
												}
											]
										},
										{
											"number": "(13) ",
											"content": [
												{
													"text": "Accessory uses shall be limited to those permitted\nin an R-1 District."
												}
											]
										},
										{
											"number": "(14) ",
											"content": [
												{
													"text": "Deed restrictions, in a form approved by the\nVillage Attorney, shall be recorded as to all open space and amenities\nto require such open space and amenities to remain open space and\nnot be further subdivided."
												}
											]
										}
									]
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 215-12",
			"title": "Incentives and bonuses in the R-3 District.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Findings. Pursuant to the authority vested in it by\nVillage Law § 7-703, and utilizing the definitions of terms\ncontained in that law (which definitions are incorporated herein by\nreference) and after evaluation of the effects of potential incentives\nwhich are possible by virtue of the provision of community amenities,\nthe Board of Trustees of the Village of North Hills hereby finds that\nthe R-3 District contains adequate resources, environmental quality\nand public facilities (including adequate transportation, water supply,\nwaste disposal and fire protection) to permit the authorization of\nthe incentives or bonuses hereinafter specified for property located\nin said zoning district. The Board of Trustees hereby further finds\nthat there will be no significant environmentally damaging consequences\nif incentives or bonuses are awarded as provided herein and that such\nincentives or bonuses are compatible with the development otherwise\npermitted in the R-3 District. The Board of Trustees further finds\nthat the provision of the system of zoning incentives or bonuses provided\nfor in this section will not have any impact upon the potential development\nof affordable housing gained by the provision of any such incentive\nor bonus afforded to an applicant or lost in the provision to the\nVillage by an applicant of any community amenity."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Designation of district. The Board of Trustees hereby\ndesignates the R-3 District as the zoning district in which incentives\nor bonuses may be awarded, as provided in this section."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Procedure for applications for award of incentives\nor bonuses."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Applications for award of incentives or bonuses shall\nbe made to the Board of Trustees in writing, on a form designated\nby the Village, on or before January 1, 1997. Such applications shall\ncontain, at a minimum:[Amended 5-15-1996 by L.L. No. 7-1996]"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "A statement of the name, address and telephone\nnumber of the owner and the applicant."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "The street address and tax map designation of\nthe property which is the subject of the application."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "An identification of the zoning district of\nthe subject property."
																}
															]
														},
														{
															"number": "(d) ",
															"content": [
																{
																	"text": "A statement as to the existing and proposed\nuses of the subject property."
																}
															]
														},
														{
															"number": "(e) ",
															"content": [
																{
																	"text": "A statement identifying each of the incentives\nand bonuses which are being requested by the applicant pursuant to\nthis section."
																}
															]
														},
														{
															"number": "(f) ",
															"content": [
																{
																	"text": "A map of the subject property, drawn to scale,\nshowing the existing and proposed lots and rights-of-way and any other\nproposed changes from the previously approved subdivision or site\nplans."
																}
															]
														},
														{
															"number": "(g) ",
															"content": [
																{
																	"text": "Any other documentation which may be required\nby law."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Each applicant for an incentive or bonus shall comply\nwith the requirements of Article 8 of the Environmental Conservation\nLaw, including the preparation of an environmental assessment form\nor, if required by the Board of Trustees, a draft environmental impact\nstatement and/or a supplemental and/or final environmental impact\nstatement, if necessary. In the event that the lead agency has prepared\nor caused to be prepared a generic environmental impact statement\n(GEIS) in connection with the adoption of this section, the lead agency\nmay require that the applicant pay a proportionate share of the cost\nof preparing such GEIS pursuant to applicable provisions of the regulations\nenacted pursuant to Article 8 of the Environmental Conservation Law."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "Permitted incentives or bonuses. After a public hearing\nas required by law, the Board of Trustees, in a proper case, may grant\none or more of the following incentives or bonuses, notwithstanding\nany other provision of this chapter to the contrary:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "An increase in the permitted building coverage of\na site to not more than 18% of the entire site (which coverage shall\nbe exclusive of swimming pools, decks, patios, tennis courts, gazebos,\nwhirlpools, hot tubs, reflective pools, children's play equipment,\nchildren's sandboxes, paddle tennis courts and trellises)."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Fences with a height not to exceed six feet may be constructed in the rear and side yards, and fences and decorative garden walls with a height not to exceed four feet may be constructed in the front yards, of lots designated on the approved plan, with a building permit from the Building Department, and no other permit shall be required notwithstanding the provisions of Village Code § 215-33. Except as otherwise provided in this subsection, such fences shall comply with the requirements of Village Code § 215-33A(1)."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Wherever the approved subdivision plan indicates the\nlocation of proposed semi-attached homes, detached homes may be constructed\nnotwithstanding the minimum requirements for distances between buildings,\nprovided that the detached homes are each located within the indicated\nbuilding lots."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "Notwithstanding any other provision in this Code,\nthe open space areas of the site may include tennis courts, kiddy\npools, hot tubs, lap pools, gazebos, reflective ponds, children's\nplay equipment, children's sandboxes, paddle tennis courts, trellises\nand other structures accessory to principal structures, provided that\nthe location of all such uses and structures shall be approved as\npart of the approval for a building permit for such structures, and\nfurther provided that the total amount of open space on the site may\nnot be less than 30%."
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "Notwithstanding the provisions of Village Code § 215-35C, a reduction or waiver of the requirements for off-street common parking spaces per dwelling unit.[Added 7-2-1996 by L.L. No. 10-1996]"
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "Community benefits or amenities which may be accepted\nfrom the applicant by the Village."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "The community benefits or amenities which the Board\nof Trustees may determine shall be provided by any such applicant\nupon the granting of any such application for an award of incentives\nor bonuses and which the Village may accept from an applicant are\nland, buildings or improvements, alterations or renovations to land\nor buildings, to provide open space or parks, elder care or day care,\npublic community centers or recreation centers, including such centers\nspecifically designed for the young or the elderly, educational or\nlibrary facilities, swimming pools and other recreational facilities\nand such other specific physical or cultural amenities as the Board\nof Trustees may determine to be of benefit to the residents of the\ncommunity."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Where the Board of Trustees determines that a suitable\ncommunity amenity or benefit is not immediately feasible or otherwise\nnot practical, the Board of Trustees may require, in lieu thereof,\nin whole or in part, a payment to the Village of a sum of money, at\na time or times to be determined by the Board of Trustees. Where the\nBoard of Trustees determines that such sum should be accepted in lieu\nof other community benefit or amenity, such sum shall be maintained\nby the Village in a trust fund to be used by the Board of Trustees\nexclusively for one or more specific community benefits as are or\nmay be authorized by the Board of Trustees."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "F. ",
							"content": [
								{
									"text": "Additional community benefits or amenities which the\nVillage may accept from the applicant. (Reserved)"
								}
							]
						},
						{
							"number": "G. ",
							"content": [
								{
									"text": "Criteria for approval."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "The granting of an application for incentives or bonuses\nshall be in the sole discretion of the Board of Trustees. Where the\nBoard of Trustees determines to approve such an application, the Board\nmay do so in whole or in part and upon reasonable terms and conditions\nas may be determined by the Board of Trustees."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "No such application shall be granted, in whole or\nin part, except where the entire site of the project where such award\nis to be made consists of at least 50 contiguous acres."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "No such application may be granted, in whole or in\npart, except upon a determination by said Board that such approval\nwill be:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "In the best interests of the Village of North\nHills and its residents."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "Compatible with the surrounding uses of properties."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "Such that there will be no significant adverse\nenvironmental impacts which will result from the use of the incentives\nor bonuses."
																}
															]
														},
														{
															"number": "(d) ",
															"content": [
																{
																	"text": "Such that there will be no gain or loss resulting\ntherefrom upon potential affordable housing or, if there will be such\ngain or loss, that there is approximate equivalence between potential\naffordable housing lost or gained or that the Village has taken or\nwill take reasonable action to compensate for any negative impact\nupon the availability or potential development of affordable housing."
																}
															]
														},
														{
															"number": "(e) ",
															"content": [
																{
																	"text": "Upon such terms and conditions as may be prescribed\nby the Board of Trustees, including such conditions as, in the sole\njudgment of said Board, will fully mitigate any adverse environmental\nimpacts which may result from the use of the incentives or bonuses."
																}
															]
														},
														{
															"number": "(f) ",
															"content": [
																{
																	"text": "Upon such terms and conditions as may be prescribed\nby the Board of Trustees to ensure, in the opinion of said Board,\nthat the community benefits and amenities to be provided in exchange\nfor such incentives or bonuses have a value fairly proportionate to\nthe value of the incentives or bonuses being granted by the Board\nof Trustees."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "The determination by the Board of Trustees whether\nto grant bonuses or incentives shall be final and conclusive."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "H. ",
							"content": [
								{
									"text": "Changes. If, after the provision and acceptance by\nthe Village of the community benefits or amenities to be provided\nby the applicant pursuant to an application approved under this section\nor after the payment of sums of money in lieu of such community benefits\nand amenities, any action is commenced by any person other than the\napplicant, or a person or entity acting for or on behalf of the applicant,\nand as a result of the final determination of said action the applicant\nis required to forego, withhold or forfeit some or all of the rights\ngranted by such incentives or bonuses, then the Village shall make\nrestitution to the applicant for the community benefits or amenities\nprovided or money paid in lieu thereof. Such restitution shall be\nin proportion to the value of the incentives or bonuses of which the\napplicant is deprived by reason of such final determination."
								}
							]
						},
						{
							"number": "I. ",
							"content": [
								{
									"text": "Where an incentive zoning approval has been granted\npursuant to this section, the Code Enforcement Officer may, in his\ndiscretion, permit the owner of the property to locate authorized\naccessory buildings or structures, including swimming pools, whirlpools,\ndecks, patios, gazebos, kiddy pools, hot tubs and lap pools, on any\nlot, except in any front yard.[Added 9-23-1998 by L.L. No. 3-1998]"
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 215-13",
			"title": "Residential R-3 incentive development.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "In the R-3 District, the Board of Trustees may, in\nits sole discretion, and after a public hearing held as provided in\nthis section, permit a lot or premises to be developed and used for\nR-3 incentive development, as an incentive use pursuant to Village\nLaw § 7-703, and for no other use except as otherwise provided\nherein, if the said use is located on a lot having a total area not\nless than 18 acres."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Nothing contained herein shall be construed to give\nany right or presumption of right to an incentive use permit to any\napplicant."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "No incentive use permit shall be issued pursuant to\nthis section unless the Board of Trustees has made a determination\nthat such a permit is authorized and warranted under the standards\nset forth herein. Such incentive use permit shall not be considered\na special use permit, nor a conditional use permit, for the purposes\nof determining the standards to be applied in judicial review of any\ndetermination to deny or grant such a permit, and shall instead be\nsolely within the discretion of the Board of Trustees."
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "Applications."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "An applicant for an incentive use permit for an R-3\nincentive development permitted by this section shall provide to the\nBoard such information as would be required of an applicant for a\nchange of zone."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "An application for an incentive use permit pursuant\nto this section shall be made no later than September 1, 2001. An\napplication for such permit made prior to the effective date of this\nsection may be considered by the Board of Trustees in the same manner\nas such an application made on or after such effective date. An application\nfor such permit made prior to September 1, 2001, may be amended after\nthat date, but only with respect to the same property which was the\nsubject of the initial application."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "Buildings and land in the R-3 District used for an\nR-3 incentive development use shall conform to all requirements for\nthe R-3 District, and also may be used for one or more accessory uses\nauthorized by this Code for such zoning district. Notwithstanding\nthe foregoing, at the time of granting an R-3 incentive development,\nthe Board of Trustees, as a condition of such permit, may:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Allow development of such property for single-family\nattached residences in accordance with the provisions applicable in\nthe R-7 District."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Require the owner of the property, on its own behalf\nand on behalf of its successors and assigns, to waive and relinquish\nany right to seek or obtain any variance of the zoning regulations\nor conditions applicable to such property."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "F. ",
							"content": [
								{
									"text": "Further authority of the Board of Trustees. At the\ntime of approval of an incentive use permit, or within four years\nafter the approval of an incentive use permit pursuant to this section,\nand upon the written application of the property owner or the authorized\nagent of such owner, the Board of Trustees may also exercise the following\npowers and authority with respect to any property which is the subject\nof such incentive use permit:[Amended 9-29-2004 by L.L. No. 2-2004]"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "To remove, cancel, modify or amend, or consent to\nthe removal, cancellation, modification or amendment of, any existing\neasements, covenants and restrictions, or prior approvals or conditions\nof prior approvals of development on the site, provided that such\nremoval, cancellation, modification or amendment shall not authorize\nany development, building, structure or use except that which is authorized\npursuant to the zoning regulations of the Village, including any use\nor development authorized pursuant to an incentive zoning permit pursuant\nto this section. To the extent that any such prior approval may have\nvested the authority to grant any such removal, cancellation, modification\nor amendment in the Planning Board, such power and authority also\nshall be vested in the Board of Trustees."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "To modify or amend any subdivision or site plan approval\ngranted with respect to such property, either prior to the approval\nof an incentive use permit or subsequent thereto."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "To exercise with respect to any property which is\nthe subject of an incentive use permit granted pursuant to this section,\nand any buildings or structures located or proposed to be located\nthereon, all of the powers otherwise vested in the Planning Board\nor the Architectural Review Board or either of them."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "To grant such subdivision, site plan or architectural\nreview approvals as may otherwise be vested within the authority of\nthe Planning Board or Architectural Review Board, including waivers\nas may be within the authority of either such Board."
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "To grant such variances of the zoning regulations\notherwise applicable with respect to locations of buildings on sites,\nas may be granted by the Board of Appeals."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "G. ",
							"content": [
								{
									"text": "Provisions for public amenities."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "An applicant for an incentive permit for an R-3 incentive\ndevelopment may apply for such permit by providing to the Board, in\naddition to any other plans for the development of property for which\nsuch permit is proposed, a proposal for the provision of public amenities,\nincluding facilities for public use, and whether by transfer, gift,\nlease, easement or otherwise, to the extent that the same may be acceptable\nto the Board of Trustees, and feasible and adequate. The determination\nwhether any such plan is acceptable, feasible, adequate or in a form\nacceptable to the Village shall rest in the sole and unfettered discretion\nof the Board of Trustees."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "If the Board of Trustees, after public hearing, finds\nsaid plan to be feasible and acceptable and finds that said plan shall\nnot result in any additional or excessive expense to the Village,\nthen the Board of Trustees may grant incentives in the form of permission\nfor an incentive use authorized by this section."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "In connection with the grant of incentive rights under\nthis section, the Board of Trustees may impose any additional terms\nand conditions which it finds necessary and appropriate to effectively\nsecure for the Village the benefit of one or more community amenities,\nor cash in lieu thereof."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "H. ",
							"content": [
								{
									"text": "Public hearing. No incentive use permit shall be granted\npursuant to this section except after a public hearing before the\nBoard of Trustees. The said public hearing shall be held and conducted\nin the same manner as if it were a public hearing on an application\nto the Board of Trustees for a change of zone."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 215-14",
			"title": "Incentive development in the R-3 District (2004).",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "In the R-3 District, the Board of Trustees may, in its sole discretion,\nand after a public hearing held as provided in this section, allow\none or more buildings to be erected, altered or used and a lot or\npremises to be developed and used for enhanced development, as an\nincentive use, and for no other use except as otherwise provided herein,\nif said use is located on a lot having a total area not less than\n10 acres, with at least 500 feet of frontage on a state or county\nroad. The Board of Trustees also may, in its sole discretion and after\na public hearing, permit amendment of any incentive zoning development\npermit previously issued pursuant to this section, to grant any additional\nor different approvals for a development which are authorized pursuant\nto this section but which are not included in the previously granted\napproval."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Nothing contained herein shall be construed to give any right or\npresumption of right to an incentive use permit or amendment to any\napplicant. Such incentive use permit shall not be issued or amended\nunless the Board of Trustees has made a determination that such a\npermit is authorized and warranted under the standards set forth herein.\nSuch incentive use permit shall not be considered a special use permit\nor a conditional use permit for the purposes of determining the standards\nto be applied in judicial review of any determination to deny or grant\nsuch a permit and shall instead be solely within the discretion of\nthe Board of Trustees."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "An applicant for an incentive use permit for development permitted\nby this section or for an amendment of any such incentive use permit\nshall provide to the Board such information as would be required of\nan applicant for a change of zone."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "An application for an incentive use permit pursuant to this section\nshall be made no later than July 1, 2004. An application for such\npermit made prior to that date may be amended after that date, but\nonly with respect to the same property which was the subject of the\ninitial application. An application for amendment of an incentive\nuse permit previously issued pursuant to this section shall be made\nat any time after approval of a permit or amended permit."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Buildings and land in the R-3 District used for an incentive development\npursuant to this section shall conform to all requirements for the\nR-3 District or as permitted pursuant to this section, and also may\nbe used for one or more accessory uses authorized by this Code for\nsuch zoning district. Notwithstanding the foregoing, in approving\nan incentive development permit pursuant to this law, or in approving\nan amendment to a previously approved incentive development permit\nissued pursuant to this section, the Board of Trustees, as a condition\nof such approval, may:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Allow the minimum site area to be reduced to not less than 10 acres\nand permit subdivision of the property into lots, plots, blocks, sites\nand/or units."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Allow the minimum open space on the site to be reduced to not less\nthan 40%."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Establish the maximum permitted density at not more than 15 units\nper acre."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "Allow the use of such property for the principal use of residential\nsingle-family attached or detached cluster dwellings, with total average\ndensity not to exceed 15 units per acre, and with total number of\nunits permitted in any one building not to exceed 30 units; provided,\nhowever, that so long as an amendment does not increase the previously\nauthorized total number of units, a previously approved plan may be\namended to permit an allocation of units such that no more than 32\nunits are located in any individual building."
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "Require a minimum floor area per unit not less than 1,500 square\nfeet."
												}
											]
										},
										{
											"number": "(6) ",
											"content": [
												{
													"text": "Require a minimum front setback from the inside curb of any road,\nother than a state road, of not less than 15 feet and, in the case\nof a state road, a minimum setback of not less than 100 feet."
												}
											]
										},
										{
											"number": "(7) ",
											"content": [
												{
													"text": "Establish maximum building coverage at not more than 30%."
												}
											]
										},
										{
											"number": "(8) ",
											"content": [
												{
													"text": "Permit a minimum distance between buildings of not less than 30 feet."
												}
											]
										},
										{
											"number": "(9) ",
											"content": [
												{
													"text": "Establish the minimum number of parking spaces to be provided at\nnot less than two per dwelling unit. All parking spaces in the project\nshall be underground or fully enclosed within a principal residential\nbuilding (except for necessary ingress and egress points). With the\npermission of the Board of Trustees, and subject to conditions determined\nby the Board of Trustees, outdoor short-term convenience parking spaces\nmay be provided."
												}
											]
										},
										{
											"number": "(10) ",
											"content": [
												{
													"text": "Require minimum width of private street rights-of-way within\nthe site of not less than 32 feet and paved portions not less than\n20 feet curb to curb."
												}
											]
										},
										{
											"number": "(11) ",
											"content": [
												{
													"text": "Allow sidewalks with minimum width not less than five feet."
												}
											]
										},
										{
											"number": "(12) ",
											"content": [
												{
													"text": "Waive any requirement for payment to the park and recreation\nfund."
												}
											]
										},
										{
											"number": "(13) ",
											"content": [
												{
													"text": "Permit storage of topsoil off site."
												}
											]
										},
										{
											"number": "(14) ",
											"content": [
												{
													"text": "Permit a building height not to exceed four residential stories\nand 60 feet in overall height. No part of any residential unit shall\nexceed the sixty-foot height limitation, whether or not such part\nis intended for occupancy and whether or not such part consists of\nopen space."
												}
											]
										},
										{
											"number": "(15) ",
											"content": [
												{
													"text": "Grant such area variances and permits as may be granted by the\nBoard of Appeals."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "Provisions for public amenities."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "An applicant for an incentive permit or amendment of a permit previously\napproved pursuant to this section may apply for such permit or amendment\nby providing a plan to the Board for the provision of public amenities,\nincluding facilities for public use, and whether by transfer, gift,\nlease, easement or otherwise, to the extent that the same may be acceptable\nto the Board of Trustees, and feasible and adequate. The determination\nwhether any such plan is acceptable, feasible, adequate, or in a form\nacceptable to the Village shall rest in the sole and unfettered discretion\nof the Board of Trustees."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "If the Board of Trustees, after public hearing, finds said plan to\nbe feasible and acceptable and finds that said plan shall not result\nin any additional or excessive expense to the Village, then the Board\nof Trustees may grant incentives in the form of permission for an\nincentive use authorized by this section or amendment of a prior such\napproval."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "In connection with the grant of incentive rights under this section\nor amendment of a prior grant of such rights, the Board of Trustees\nmay impose any additional terms and conditions which it finds necessary\nand appropriate to effectively secure for the Village the benefit\nof one or more community amenities, or cash in lieu thereof."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "Public hearing. No incentive use permit or amendment to a previously\napproved incentive zoning permit shall be granted pursuant to this\nsection except after a public hearing before the Board of Trustees.\nSaid public hearing shall be held and conducted in the same manner\nas if it were a public hearing on an application to the Board of Appeals\nfor a change of zone."
								}
							]
						},
						{
							"number": "F. ",
							"content": [
								{
									"text": "Requirement for Planning Board approval. An incentive use permit application, or an amendment of a previously approved application, for development pursuant to this section may include a subdivision plan, or amendment to a previously approved subdivision plan, in accordance with the requirements of Chapter 179 of this Code. In such event, the requirements of Chapter 179 for sketch plan and preliminary plat approval may be waived by the Board of Trustees. In approving such an application for an incentive use permit or amendment of a prior such permit, the Board of Trustees shall have the powers of the Planning Board with respect to final plan approval, and amendment of final plan approval, and all other related matters with respect to the uses and development shown on said plan(s). In addition, with respect to the incentive development of property pursuant to this section, and until such time as a certificate of occupancy has been issued for all buildings and structures shown in the plan approved as part of the incentive zoning permit, the Board of Trustees shall have the powers of the Architectural Review Board with respect to any such buildings or structures."
								}
							]
						}
					]
				}
			]
		}
	]
}	