{
	"url": "http://ecode360.com/10591486",
	"paras": [
	    {
			"paragraph": "ยง 240-9",
			"title": "Residence R-3 District.",
			"content": [
				{
					"text": "In a Residence R-3 District the following regulations\nshall apply:"
				},
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "No building or structure shall be erected, altered, remodeled, used or maintained and no lot or premises shall be used except for a detached single-family dwelling with a one-, two- or three-car private noncommercial garage used exclusively for residential purposes or for one or more of the other purposes set forth in ยง 240-7A of this chapter, excluding Subsection A(1) thereof."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "No building shall be constructed on a lot with an\narea of less than 18,000 square feet, except that nothing herein contained\nshall be construed to make a previously conforming building lot, situate\nin an R-3 District, nonconforming by reason of the adoption of this\nsection.[Amended 11-6-2000 by L.L. No. 3-2000]"
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "The maximum lot coverage shall not exceed 20% of the\nlot area. The maximum floor area ratio shall be 0.24. The sky exposure\nplane shall be 1.33.[1][Amended 11-6-2000 by L.L. No. 3-2000; 6-7-2004 by L.L. No.\n5-2004]"
								},
								{
									"footnote": "[1]\nEditor's Note: See the Sky Exposure Plane Diagrams included at the end of this chapter.\n"
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "There shall be a front yard, the depth of which shall\nbe at least 85% of the average setback of two adjoining properties\nto each side of the property line plus five houses across the street\nand in no case less than 40 feet.[Amended 11-6-2000 by L.L. No. 3-2000]"
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "There shall be a rear yard, the depth of which, except\nas otherwise provided in this section, shall not be less than 25 feet."
								}
							]
						},
						{
							"number": "F. ",
							"content": [
								{
									"text": "There shall be two side yards, one on each side of\nthe main or accessory building, the aggregate width of which shall\nbe at least 30 feet. Neither side yard shall be less than 10 feet.\nIn the case of a corner lot, a building shall be required to comply\nwith the front yard restrictions on both street fronts.[Amended 11-6-2000 by L.L. No. 3-2000]"
								}
							]
						},
						{
							"number": "G. ",
							"content": [
								{
									"text": "No building shall exceed 30 feet in height or 2 1/2\nstories."
								}
							]
						},
						{
							"number": "H. ",
							"content": [
								{
									"text": "No building shall be erected on any lot having a street\nfrontage of less than 100 feet."
								}
							]
						},
						{
							"number": "I. ",
							"content": [
								{
									"text": "Accessory buildings and structures."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Accessory buildings and structures must be located\nin a rear yard, and any such building or structure:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "Must not be less than 10 feet from each side\nlot line."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "Must not exceed 12 feet in height at its highest\npoint when measured from the lowest point of the surrounding ground."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "Must not be less than 10 feet from the rear\nlot line."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Accessory buildings (but not accessory structures)\nmust not be nearer than 10 feet to the main building."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "J. ",
							"content": [
								{
									"text": "A private swimming pool shall be permitted in the rear yard of the premises, limited to the personal use of the family of the owner of the principal building or occupant thereof and its house servants and guests, said swimming pool not to be installed, maintained or used except in conformity with the provisions of Chapter 201, Swimming Pools."
								}
							]
						}
					]
				}
			]
		}
	]
}	