{
	"url": "http://ecode360.com/10591518",
	"paras": [
	    {
			"paragraph": "§ 240-11",
			"title": "Residence R-5 District.",
			"content": [
				{
					"text": "In a Residence R-5 District the following regulations\nshall apply:"
				},
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "No building or structure shall be erected, altered, remodeled, used or maintained and no lot or premises shall be used except for a detached single-family dwelling with a one-, two- or three-car private noncommercial garage used exclusively for residential purposes or for one or more of the other purposes set forth in § 240-7A of this chapter, excluding Subsection A(1) thereof."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "No building shall be constructed on a lot with an\narea of less than 12,500 square feet."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "The maximum lot coverage shall not exceed 30% of the\nlot area. The maximum floor area ratio shall be 0.32. The sky exposure\nplane shall be 2.0.[1][Amended 11-6-2000 by L.L. No. 3-2000; 6-7-2004 by L.L. No.\n7-2004]"
								},
								{
									"footnote": "[1]\nEditor's Note: See the Sky Exposure Plane Diagrams included at the end of this chapter.\n"
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "There shall be a front yard, the depth of which shall\nbe at least 85% of the average setback of two adjoining properties\nto each side of the property line plus five houses across the street\nand in no case less than 30 feet.[Amended 11-6-2000 by L.L. No. 3-2000]"
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "There shall be a rear yard, the depth of which, except\nas otherwise provided in this section, shall not be less than 25 feet."
								}
							]
						},
						{
							"number": "F. ",
							"content": [
								{
									"text": "There shall be two side yards, one on each side of\nthe main or accessory building, the aggregate width of which yards\nshall be at least 30 feet. Neither side yard shall be less than 10\nfeet wide. In the case of a corner lot, a building shall be required\nto comply with the front yard restrictions on both street fronts."
								}
							]
						},
						{
							"number": "G. ",
							"content": [
								{
									"text": "No building shall exceed 30 feet in height or 2 1/2\nstories."
								}
							]
						},
						{
							"number": "H. ",
							"content": [
								{
									"text": "No building shall be erected on any lot having a street\nfrontage of less than 75 feet."
								}
							]
						},
						{
							"number": "I. ",
							"content": [
								{
									"text": "Accessory buildings and structures."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Accessory buildings and structures must be located\nin a rear yard, and any such building or structure:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "Must not be less than 10 feet from each side\nlot line."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "Must not exceed 12 feet in height at its highest\npoint when measured from the lowest point of the surrounding ground."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "Must not be less than 10 feet from the rear\nlot line."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Accessory buildings (but not accessory structures)\nmust not be nearer than 10 feet to the main building."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "J. ",
							"content": [
								{
									"text": "A private swimming pool shall be permitted in the rear yard of the premises, limited to the personal use of the family of the owner of the principal building or occupant thereof and its house servants and guests, said swimming pool not to be installed, maintained or used except in conformity with the provisions of Chapter 201, Swimming Pools."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 240-21",
			"title": "Area computation.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "The area occupied by accessory buildings and structures\nof whatsoever kind, nature or description shall be included in computing\nthe maximum percentage of the lot area which may be built upon in\nany given district, except where otherwise specifically provided."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "No part of a front yard or rear yard having a depth\nor width which is less than 40 feet in the Residence R-1 District,\n35 feet in the Residence R-2 District, 30 feet in the Residence R-3,\nR-4, R-5 or R-6 District or 20 feet in the Residence R-7 District\nshall be included in the calculation of the area of a lot.[Amended 11-10-1999 by L.L. No. 3-1999]"
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 240-22",
			"title": "Continuation of prior work.",
			"content": [
				{
					"text": "Nothing herein contained shall require any change\nin the plans of buildings the construction of which has proceeded\nto the completion of foundations and the setting of the first floor\nbeams at the time of the adoption of this chapter and the construction\nof which shall be diligently prosecuted within a year of the date\nof the passage hereof and shall be completed within such year. The\nBoard of Appeals may, in its discretion, extend the date of completion\nbeyond the one year above fixed."
				}
			]
		},
		{
			"paragraph": "§ 240-23",
			"title": "Restoration of buildings.",
			"content": [
				{
					"text": "Nothing in this chapter shall prevent the restoration of a building destroyed by fire, explosion, act of God or the public enemy to the extent of not more than 50% of the fair market value of the building, exclusive of land on which it is erected; or prevent the continuance of the use of such building or part thereof as such use existed at the time of such destruction; or prevent a change of such existing use under the limitations and restrictions imposed by Article III of this chapter, but any building destroyed in the manner aforesaid to an extent exceeding 50% of the fair market value of the building at the time of its destruction may be reconstructed and thereafter used only in such a manner as to conform to all the provisions of this chapter."
				}
			]
		},
		{
			"paragraph": "§ 240-24",
			"title": "Front yard requirements.",
			"content": [
				{
					"text": "The depth of all front yards will be reckoned\nfrom existing street lines. Where the street has been widened or is\nproposed to be widened and this new width has been duly authorized\nand recorded on a duly filed map, the depth of front yards shall be\nreckoned from the new street lines."
				}
			]
		},
		{
			"paragraph": "§ 240-25",
			"title": "Corner lot requirements.",
			"content": [
				{
					"text": "On any corner lot, no wall, fence or other structure\nshall be erected or altered and no hedge, tree, shrub or other growth\nshall be maintained which may cause danger to traffic on a street\nby obscuring the view."
				}
			]
		},
		{
			"paragraph": "§ 240-26",
			"title": "Application for amendment or change of zone.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "All applications to the Board of Trustees for an amendment\nto the Official Map or any change of zone shall be made by filing\nwith the Village Clerk or Village Clerk-Treasurer a written application\nin triplicate upon the form supplied by the Village Clerk or Village\nClerk-Treasurer, completely filled out, wherein there shall be set\nforth all the pertinent information required in said form and a concise\nstatement of the changes sought. Each application shall have annexed\nto it all the surveys, drawings and site plans, complete with elevations,\ndimensions and distances plainly marked thereon, and/or other exhibits\nnecessary for the proper consideration and determination of the application."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "In addition to the payment of the proper fees and costs set forth in Chapter A243, Fees, Charges and Deposits, the applicant shall file with the Village Clerk or Village Clerk-Treasurer either:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "The written consents of the owners of all of the land\nincluded in such proposed change, all of the land within 200 feet\nof each property line of the land included in such proposed change\nand all of the land directly opposite thereto, extending 200 feet\nfrom the street frontage of such opposite land; or"
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "In lieu of such contents, written proof that said owners described in Subsection B(1) have each been notified by the applicant, by registered or certified mail with return receipts, as to the date of the public hearing or other meeting on such application, including a statement of the amendment to the Official Map or rezoning requested. Such written proof, together with the return receipts of the mailing by registered or certified mail, shall be filed with the Village Clerk or Village Clerk-Treasurer not less than 10 days prior to the date set for public hearing or other meeting on such application."
												}
											]
										}
									]
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 240-26.1",
			"title": "Building code violations; penalties for exceeding scope of permit.",
			"content": [
				{
					"text": "All building permit applications which have received approval\nor authorization by Building Department personnel, but are now deemed\nby the Building Department to be outside the scope of the Zoning Code,\nshall be hereby authorized for approval, provided a variance is granted\nto legalize either excess square footage (gross floor area), insufficient\nsetback, sky exposure plane encroachment or excess height and the\nfollowing penalties are paid:"
				},
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Square footage (gross floor area), setback, sky plane and height.\nA structure in excess of the maximum permitted under the Zoning Code\nshall be deemed authorized on the condition that the applicant pay\nadditional permit fees as set forth in the following schedule:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "For square footage beyond the maximum allowed under the Zoning\nCode: $200 per square foot."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "For square footage more than 100 square feet above the maximum\nallowed under the Zoning Code: an additional $255 per square foot."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Setback. A structure that has less than the minimum allowed setback\nunder the Zoning Code shall be deemed authorized on the condition\nthat the applicant pay an additional permit fee of $1,500 per three\ninches beyond the setback authorized under the Zoning Code."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Sky plane. A structure that penetrates the allowed sky plane under\nthe Zoning Code and contains no height violation shall be deemed authorized\non the condition that the applicant pay additional permit fees as\nset forth in the following schedule:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Per foot of encroachment beyond the sky plane authorized under\nthe Zoning Code: $10,000."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "Height: A structure that exceeds the allowed height under the Zoning\nCode shall be deemed authorized on the condition that the applicant\npay additional permit fees as set forth in the following schedule:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Per inch beyond the height authorized under the Zoning Code:\n$5,000."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "All measurement calculations are to be set by the Building Department\nand shall be rounded upward for purposes of permit fee costs."
								}
							]
						},
						{
							"number": "F. ",
							"content": [
								{
									"text": "All penalties are subject to change by resolution of the Board of\nTrustees."
								}
							]
						}
					]
				}
			]
		}
	]
}	