{
	"url": "http://ecode360.com/6432381",
	"paras": [
		{
			"paragraph": "§ 575-7",
			"title": "Applicability.",
			"content": [
				{
					"text": "Unless otherwise noted the following regulations\napply to all zoning districts."
				}
			]
		},
		{
			"paragraph": "§ 575-8",
			"title": "Visibility at intersections.",
			"content": [
				{
					"text": "At all street intersections, no obstruction\nto vision (other than existing buildings, posts, columns or trees)\nexceeding 30 inches in height above street level shall be erected\nor maintained on any lot within the triangle formed by the street\nlines of such lot and a line drawn between points along such street\nlines 40 feet distant from their point of intersection."
				}
			]
		},
		{
			"paragraph": "§ 575-9",
			"title": "Trailers.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "The storage or parking and use of a trailer by any person or persons, except as hereinafter provided, is prohibited in each and all districts enumerated in Article II herein, except that storage or parking of such trailers may be conducted in garages, provided such trailer is not placed in use and the doors thereof are kept securely locked."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "A temporary permit for the placing and use of a trailer\non a lot may be issued by the Director of City Services in connection\nwith any construction for which a building permit has been issued.\nSuch permit shall be for a period of not more than six months but\nmay be renewed at the discretion of the Director of City Services\nif work on said construction is proceeding diligently. A fee, as designated\nin the City fee schedule,[1] shall accompany the application for a temporary permit.\nIn addition thereto, the applicant shall furnish a letter of credit,\nother liquid asset, or a cash deposit in the amount of $500, to the\nsatisfaction of the Corporation Counsel and City Comptroller, conditioned\non the removal of said trailer by the applicant on or before the expiration\ndate of the permit and any extension thereof.[Amended 5-13-2002 by L.L. No. 1-2002]"
								},
								{
									"footnote": "[1]\nEditor's Note: See Ch. 275, Fees.\n"
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 575-10",
			"title": "Automobile facilities and public garages.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Separating distances."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "No automobile facility or public garage shall be located\nwithin 400 feet as measured along the street line or the boundary\nline of any residence district or of any school, place of worship,\npark, playground, hospital or public library or any place of public\nassembly designed for the simultaneous use of 100 persons or more."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "No automobile gasoline service station and no gasoline\nor oil pump or auto service appliance, unless within a building, shall\nbe permitted on a lot that is within 800 feet, as measured from the\nclosest property line of each, of another lot on which there is an\nexisting automobile gasoline service station or outdoor gasoline or\noil pump or auto service appliance, or of another lot for which a\nbuilding permit has been issued for the erection of such a station,\npump or service appliance."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "No building which houses an automobile facility shall\nbe within 50 feet of any street line. No gasoline or oil pump or service\nappliance shall be within 20 feet of any street line. No access point\nshall be within 50 feet of an intersection of two streets."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "Where storage of such materials is permitted, all\nautomobile parts, wrecked or damaged motor vehicles or similar articles\nshall be stored within a building. In no case shall any vehicle requiring\nrepair be stored outdoors for a period exceeding two days. All repair\nwork shall be conducted fully within an enclosed building."
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "No building which houses an automobile facility shall\nbe located closer than 30 feet to a residential property line or residential\nzone district boundary."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Minimum lot size; minimum lot dimensions."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "No automobile facility or public garage shall be permitted\non a lot with lot size or dimensions less than that required for the\ndistrict in which the lot is located."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Multiple uses on a lot. When more than one automobile\nfacility is located on one lot, the minimum square footage for the\ndistrict shall be required for each use. For facilities located in\nthe C-1, C-1A, M-2 and M-3 Districts, the minimum areas are prescribed\nbelow."
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "Regardless of the minimum lot area required\nfor the district, the minimum area designated for each minor auto\nrepair facility shall be 10,000 square feet for the first bay and\n5,000 square feet per bay for each additional bay."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "Regardless of the minimum lot area required\nfor the district, the minimum area designated for each major auto\nrepair facility and auto body and paint shop shall be 10,000 square\nfeet per bay for each bay."
																}
															]
														}
													]
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Landscaping and screening requirements."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Front yard landscaping. Automobile facilities shall\nhave a front landscaped strip for 2/3 of the street frontage consisting\nof at least one street tree and planted with no more than 25% of grassy\narea."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Side and rear yard landscaping and screening. A fifteen-foot\nlandscaped buffer will be required for all automobile facilities abutting\nresidential uses and/or residential zone districts. The landscaped\nisland will include:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "A decorative fence of no less than six feet\nin height which will screen at a minimum all parking areas, pumps\nand outdoor displays."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "Trees planted along the fence of no less than\ntwo-and-one-half-inch caliper deciduous or evergreens five feet in\nheight and planted no more than 15 feet on center."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "A planting strip other than grassed area with\na minimum 10 feet in width and properly curbed to protect the plantings\nand fence."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Foundation planting. A raised planter with a minimum\ndepth of five feet shall be installed on all sides of the building\nwhich are exposed to the street or visible from adjacent residential\nproperties, but exclusive of entryways."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "All dumpsters and refuse storage areas shall be fully\nscreened from the street and adjacent properties."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "Internal circulation and vehicle reservoir capacity."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "The paved areas on the site for automobile facilities\nshall be laid out so as to provide for automobile circulation and\nloading sufficiently free as to preclude vehicles waiting on the street\nor blocking the right-of-way before gaining entrance."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Parking shall be provided as per § 575-33G(2) of these regulations."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "A minimum of four stacking spaces per pump island\nside will be required for automobile gasoline service stations."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "Convenience stores as accessory use to an automobile\ngasoline service station."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Convenience stores as defined in § 575-60 may be permitted as an accessory use to automobile gasoline service stations if the applicant can demonstrate to the satisfaction of the Planning Commission that it meets the following minimum standards:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "In addition to other parking requirements, one\nparking space per 300 square feet of retail space shall be provided\non site."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "No video games are included within the proposed\nvideo store."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "Hours of operation shall be from 6:00 a.m. to\n12:00 p.m.; however, the Planning Commission, at its sole discretion,\nmay further limit the hours of operation to limit potential impacts\non adjoining uses."
																}
															]
														},
														{
															"number": "(d) ",
															"content": [
																{
																	"text": "No more than 1/3 of the gross floor area of\nthe building shall be used for the convenience store."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Convenience stores shall not be permitted as an accessory\nuse unless the property meets the minimum bulk requirements for the\nzoning district in which it is located."
												}
											]
										}
									]
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 575-11",
			"title": "Minimum livable floor area.",
			"content": [
				{
					"text": "In a One-Family Residence R-1 District the minimum\nlivable floor area for one-family houses shall be 1,200 square feet,\nand in a One-Family Residence R-2 District such area shall be 1,000\nsquare feet. In all other residence districts the minimum livable\nfloor area for one-family houses shall be 1,000 square feet. For two-,\nthree- or four-family houses in any district, the minimum livable\nfloor area shall be 600 square feet per unit."
				}
			]
		},
		{
			"paragraph": "§ 575-12",
			"title": "Off-street parking.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Off-street parking."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Wherever an off-street parking area of three or more\nspaces faces a street or a property line in a residential district,\na planting area of a minimum width of three feet with plantings at\nleast three feet high planted three feet on center shall be provided\nbetween the parking area and the sidewalk, or where no sidewalk exists,\nsuch planting strip shall be provided between the parking lot and\nthe property line. The planting plan for this strip shall be approved\nby the Planning Commission as part of the site plan review."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Further, not more than 12 parking spaces shall be\npermitted in a continuous row and not more than 20 spaces shall be\npermitted in a single parking area without being interrupted by landscaping\napproved by the Planning Commission."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Two or more uses on the same lot. Except as specified\nhereinafter, where two or more different uses occur on a single lot,\nthe total amount of parking facilities to be provided shall be the\nsum of the requirements, if any, for each individual use on the lot.\nIn the case of two or more establishments on the same lot or on contiguous\nlots, the Planning Commission may approve the joint use of parking\nspace, the total capacity of which is less than the sum of the spaces\nrequired for each and using the same driveways giving access thereto,\nprovided that said Commission finds that the capacity to be provided\nwill substantially meet the intent of the requirements by reason of\nvariation in the probable time of maximum use by patrons or employees\namong such establishments, and provided that such approval of such\njoint use shall be automatically terminated upon the termination of\nthe operation of any such establishments."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Layout and location of off-street parking facilities."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "The plans for any new building or enlargement of floor\narea in an existing building shall show specifically the location\nand size of the off-street parking facilities required to comply with\nany applicable requirements hereof and the means of access to such\nspace from the public streets or highways."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Each required space, exclusive of drives and aisles,\nshall be not less than 18 feet long nor less than nine feet wide.\nEach parking space shall have access from a public way or private\ndriveway. Except as may be otherwise provided, required off-street\nparking facilities may be enclosed in a structure or may be located\nin the open, provided that all required parking facilities shall be\ngraded, surface-drained and maintained to the extent necessary to\navoid nuisances of dust, erosion or excessive water from entering\npublic ways. Upon a determination by the Planning Commission that\nthe required number of parking spaces would be greatly in excess of\nthe need therefor of a particular use on a given lot, said Commission\nmay waive the requirement that such spaces be surfaced to the extent\nthat it may deem the number required to exceed the actual need therefor."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "Location and ownership of required accessory parking\nfacilities. Required accessory parking spaces, open or enclosed, may\nbe provided upon the same lot as the use to which they are accessory\nor anywhere within 500 feet walking distance of such lot. In all cases\nsuch parking spaces shall conform to all the regulations of the district\nin which they are located, and in no event shall such parking spaces\nbe located in any district in which nonaccessory off-street parking\nlots are not specifically permitted. Such spaces shall be in the same\nownership as the use to which they are accessory and shall be subject\nto deed restriction, filed with the County Clerk, binding the owner\nand his heirs and assigns to maintain the required number of spaces\navailable either throughout the existence of the use to which they\nare accessory or until such spaces are provided elsewhere."
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "Operation and maintenance of off-street parking facilities.\nRequired off-street parking facilities shall be maintained throughout\nthe life of any use or structure which said facilities are designed\nto serve. Required parking areas developed for specific structures\nand uses shall be reserved at all times for the use of those persons\nwho are employed at or making use of such structures and uses, except\nwhen dedicated to and accepted by the City as public parking areas."
								}
							]
						},
						{
							"number": "F. ",
							"content": [
								{
									"text": "Effect of parking requirements on existing uses. Structures\nand land uses in existence or for which building permits shall have\nbeen approved on the effective date of this chapter shall not be subject\nto the requirements for off-street parking spaces set forth in this\nchapter, provided that any parking facilities not existing to serve\nsuch structures or uses shall not, in the future, be reduced, except\nwhere they exceed such requirements, in which case they shall not\nbe reduced below such requirements. Required parking facilities for\nsuch structures or uses, as well as any future enlargement or extension\nthereof, shall, however, be provided as a condition for the issuance\nof any building permit for such enlargement or extension. In case\nof practical difficulty or unnecessary hardship arising out of this\nrequirement, the Zoning Board of Appeals shall require only such degree\nof compliance as it may deem reasonable for that part of the structure\nor use that is legally nonconforming, but shall not waive any part\nof the requirement for the part of the structure or use that constitutes\nan enlargement or extension and shall not permit reduction or elimination\nof whatever quantity of parking may already be in existence unless\nit is in excess of such requirements, provided that nothing herein\nshall be deemed to limit any power of said Board that is conferred\nby law. Required off-street parking facilities which, after development,\nare dedicated to and accepted by the City shall be deemed to continue\nto serve the uses or structures for which they were originally provided."
								}
							]
						},
						{
							"number": "G. ",
							"content": [
								{
									"text": "In order to prevent any increase of traffic congestion\non City streets, to provide adequate space for off-street parking\nand maneuvering, to encourage the use of off-street parking space\nby automobile operators and for the purpose of assuring that space\ndesigned for off-street parking does not adversely affect abutting\nproperties or the surrounding neighborhood, the following regulations\nshall apply in all residential districts, and on all lots in any other\ndistrict used for residential purposes:[Added 6-9-2003 by L.L. No. 9-2003; amended 5-14-2007 by Ord. No. 3-2007; 5-12-2008 by L.L. No. 7-2008; 5-26-2009 by L.L. No. 12-2009; 12-14-2009 by L.L. No.\n20-2009; 12-27-2010 by L.L. No. 2-2011]"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Driveways and other off-street parking areas shall be well defined\nand constructed of asphalt, concrete, brick pavers, stone pavers or\ngravel. Additionally, surface or subsurface water shall not be directed\nto adjacent parcels for all driveways and/or parking areas."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Each lot shall contain no more than one curb cut constructed pursuant to § 505-10."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "All driveways shall be laid out and constructed as directly as possible\nfrom the curb cut to the residential structure, the side yard as permitted\nbelow, or garage."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "The following regulations shall apply to new driveways and parking\nareas to be constructed (pursuant to a building permit) on vacant\nparcels as part of the construction of a new residential structure\non or after the effective date of this subsection. The design for\na new driveway or parking area shall incorporate the most current\nstormwater management regulations in place at the time of application."
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "The driveway shall be no wider than 10 feet wide."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "All driveways must lead directly to a garage."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "Where an attached garage is provided the driveway shall be no wider than 10 feet wide per garage bay, with a maximum of two bays and, except as is provided in Subsection G(8)(a) below for additional off-street parking, shall not extend past the side of the residential structure."
																}
															]
														},
														{
															"number": "(d) ",
															"content": [
																{
																	"text": "Where a detached garage is provided the driveway shall be no\nwider than 10 feet, but may be increased to the width of the garage\n20 feet in front of the front wall of the garage structure (maximum\nof two bays)."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "The following regulations shall apply to all improved parcels in\nexistence on the effective date of this subsection and do not currently\nhave off-street parking. The applicant shall design off-street parking\nusing one of the options listed below as follows:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "Not more than 400 square feet of a rear yard, not to exceed\n50% thereof, may be paved with asphalt, concrete, brick pavers, or\nstone pavers for a parking area. The 400 square feet of parking area\nshall be located no closer than two feet from a side or rear property\nline."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "Paving in a side yard may not be more than 10 feet wide for\na parking area."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "If parking cannot be achieved in accordance with Subsection G(5)(a) and (b) above, then not more than 200 square feet of a front yard may be paved with brick pavers or stone pavers or other decorative material that is acceptable to the City. This parking area may be increased by an additional 200 square feet with the addition of a four-foot planting strip to provide adequate screening from adjacent parcels."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(6) ",
											"content": [
												{
													"text": "The provisions of Subsection G(5) above shall not be applied to any nonconforming driveway or parking area that was in existence on the effective date of this subsection unless and until such driveway or parking area shall be reconfigured or expanded, at which time the driveway or parking area shall be reconfigured or expanded in compliance with Subsection G(5) above."
												}
											]
										},
										{
											"number": "(7) ",
											"content": [
												{
													"text": "All driveways and additional parking areas are considered to be impervious\nsurfaces and shall be included in calculating the area of total impervious\nsurfaces located on a lot regardless of the materials of which they\nare constructed."
												}
											]
										},
										{
											"number": "(8) ",
											"content": [
												{
													"text": "One additional off-street parking space as defined in § 575-60 beyond that provided on a permitted driveway may also be provided in the following locations:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "On the side of the main garage structure provided that an attached\ngarage or a garage going under the residential structure has been\nconstructed; such space shall be no closer to the street than the\nfront plane of the residential structure with access from the driveway,\nbut no such additional parking area shall encroach into any required\nside yard."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "In the rear yard as either an extension of any additional side yard parking area allowed under Subsection G(5)(b) above or as a one-space bump out of a driveway leading to a detached garage located in the rear of the main residential structure."
																}
															]
														}
													]
												}
											]
										}
									]
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 575-13",
			"title": "Landscaping.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "For all uses other than one-, two- or three-family\nhouses, the entire lot, except areas covered by buildings or surfaced\nas parking or service areas, but in no case less than 10% of the lot\narea (except in the C-2 District), shall be suitably landscaped. In\nlandscaped areas, not less than 25% shall be planted with growth other\nthan grass. Where lot lines coincide with one residence district boundary,\nthere shall be planted evergreen trees of such type and spacing as\nmay be required by the Planning Commission, of an initial height of\nnot less than five feet and adequate ultimately to screen all operations\non the lot from the view of properties in the adjoining residence\ndistrict. All landscaping shall be properly maintained throughout\nthe life of any use on any lot. Existing walls or trees with a diameter\nof eight inches as measured three feet from the base of the trunk\nwithin 30 feet of any street line or 50 feet of any residence district\nboundary shall not be removed except with the approval of the Planning\nCommission."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "A landscaping plan prepared by a landscape architect\nor qualified landscaper shall be submitted as part of the site plan."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 575-14",
			"title": "Open-front stores, outdoor vending machines and outdoor storage, display or sales.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Except as specified hereinafter, no open-front store\nor other open-front place of business or outdoor vending machine or\noutdoor display, storage or sales of groceries, foodstuffs, building\nmaterials, vehicles, machinery or other substances or products shall\nbe maintained, conducted or used in the City of Peekskill, and all\nbusinesses, services and processes shall be conducted wholly within\ncompletely enclosed buildings. The provisions of this section shall\nnot apply to the following uses if such uses are otherwise permitted\nin a district:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "The sale of automobile fuel, lubricants and accessories\nat automobile service stations."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "The operation of lumber- or building supply yards."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "The storage and sale of coal and fuel in duly conducted\ncoal and fuel supply yards."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "Off-street parking of passenger automobiles or trucks\nof not more than 2 1/2 tons' capacity."
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "Off-street loading."
												}
											]
										},
										{
											"number": "(6) ",
											"content": [
												{
													"text": "Horticultural nurseries."
												}
											]
										},
										{
											"number": "(7) ",
											"content": [
												{
													"text": "Ice machines."
												}
											]
										},
										{
											"number": "(8) ",
											"content": [
												{
													"text": "Sidewalk cafe."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "In appropriate cases and in accordance with the requirements set forth in § 575-57C hereof, the Common Council may issue a special permit permitting any open use otherwise prohibited under the terms of this section in a commercial or manufacturing district and outdoor vending machines in a commercial district, provided that under no circumstances will a vending machine be permitted to be placed on a public sidewalk or in any location where the use of said machine by motorists would, in the opinion of the Common Council, create a traffic hazard or impediment to the free flow of traffic on any street.[1]"
								},
								{
									"footnote": "[1]\nEditor's Note: See also Art. X of Ch. 505, Streets and Sidewalks.\n"
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 575-15",
			"title": "Location of accessory buildings on lot.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Accessory uses shall conform to rear, side and front\nyards as are provided for accessory uses in each district. In the\nevent that, due to topographic conditions, practical difficulties\nwould be caused by this requirement with respect to the location of\ngarages, the Zoning Board of Appeals may authorize the issuance of\na variance for the erection of such garages within not less than 10\nfeet of the street line where the natural slope of the ground within\n25 feet of the street line is between 12% and 20% and within not less\nthan five feet of the street line where such slope within 25 feet\nof said line exceeds 20%."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "However, in no case, notwithstanding the foregoing\nprovisions, shall a garage or accessory building be permitted to be\nlocated closer than 20 feet to the street line of a county road or\nstate highway."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 575-16",
			"title": "Exceptions to yard requirements.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Cornices or cantilevered roofs may project not more\nthan two feet, and belt courses, windowsills and other ornamental\nfeatures may project not more than six inches, into a required yard.\nGarages so designed as to allow the use of the roof thereof as part\nof the grounds may be erected in side or rear yards, not nearer than\nfour feet to any property line, provided the average height of such\nwall or walls thereof which face a side lot line or a rear lot line\nis not in excess of 6 1/2 feet above the average level of such\nlot line. The side yard provision may be eliminated, but not reduced,\nalong any portion of one lot line where a building erected on an adjoining\nlot is built to the lot line, provided that in such event the second\nside yard shall be increased to a minimum width of two times the width\notherwise required."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Paved terraces, platforms, stoops, steps and walls\nshall not project within 10 feet of a street line or four feet of\na property line.[Amended 12-12-1988]"
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 575-17",
			"title": "Frontage.",
			"content": [
				{
					"text": "In all residential districts other than the\nPlanned Residential Development District, each lot and structure thereon\nshall face a public street and shall have a minimum frontage not less\nthan 2/3 of the minimum lot width. Lots in the Planned Residential\nDevelopment District shall be required to be related to existing or\nproposed public streets or highways as determined by the Planning\nCommission."
				}
			]
		},
		{
			"paragraph": "§ 575-18",
			"title": "Prohibited uses.",
			"content": [
				{
					"text": "Any use not specifically listed in this chapter\nas a permitted use or as a use permitted by special permit in a particular\nzone shall be prohibited in that zone."
				}
			]
		},
		{
			"paragraph": "§ 575-19",
			"title": "Local waterfront revitalization program.",
			"content": [
				{
					"text": "In addition to the requirements set forth in this Chapter 575 of the Code of the City of Peekskill, the City of Peekskill Local Waterfront Revitalization Program, adopted December 14, 2015, as it may be amended from time to time, shall apply to all properties located within the City of Peekskill Local Waterfront Revitalization Program boundaries, and compliance with the City of Peekskill Local Waterfront Revitalization Program Consistency Law, Chapter 365 of the Peekskill City Code, is required. A copy of the City of Peekskill Local Waterfront Revitalization Program is available in the office of the Peekskill City Clerk."
				}
			]
		},
		{
			"paragraph": "§ 575-19.1",
			"title": "Outdoor accessory recreation.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Outdoor accessory recreation requires a minimum lot size of one acre,\nsubject to the following:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Such recreation shall be deemed to be a structure and shall\nnot be located less than 30 feet from the side and rear lot lines."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Such recreation shall be located in the side or rear yards."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "No illumination of the facility of any kind shall be allowed."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "Screening of the recreation use shall be provided from the view\nof adjacent properties."
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "No loudspeaker or amplifying device shall be permitted."
												}
											]
										}
									]
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 575-20",
			"title": "Intent.",
			"content": [
				{
					"text": "The residence districts established in this\nchapter are designed to promote and protect public health, safety\nand general welfare. These general goals include, among others, the\nfollowing specific purposes:"
				},
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "To provide sufficient space in appropriate locations\nfor residential development to meet the housing needs of the City's\npresent and expected future population with due allowance for the\nneed for a choice of sites."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "To protect residential areas against fire, explosions,\ntoxic and noxious matter, radiation and other hazards, and against\noffensive noise, vibration, smoke and other particulate matter, odorous\nmatter, heat, humidity, glare and other objectionable influences."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "To protect residential areas, as far as possible,\nagainst heavy traffic and against through traffic of all kinds."
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "To protect residential areas against congestion, as\nfar as possible, by regulating the density of population and the bulk\nof buildings in relation to the land around them and to one another,\nand by providing for off-street parking spaces; to require the provision\nof open space in residential areas wherever practicable; and to encourage\nthe provision of additional open space by permitting moderately higher\nbulk and density with better standards of open space in order to open\nup residential areas to light and air, to provide open areas for rest\nand recreation, to break the monotony of continuous building bulk\nand thereby to provide a more desirable environment for urban living."
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "To protect the character of certain designated areas\nof historic and architectural interest where the scale of building\ndevelopment is important."
								}
							]
						},
						{
							"number": "F. ",
							"content": [
								{
									"text": "To provide for access of light and air for windows\nand for privacy, as far as possible, by controls over the spacing\nand height of buildings and other structures."
								}
							]
						},
						{
							"number": "G. ",
							"content": [
								{
									"text": "To provide appropriate space for those educational,\nreligious, recreational, health and similar facilities which serve\nthe needs of the nearby residents, which generally perform their own\nactivities more effectively in a residential environment and which\ndo not create objectionable influences."
								}
							]
						},
						{
							"number": "H. ",
							"content": [
								{
									"text": "To promote the most desirable use of land and direction\nof building development in accord with a well-considered plan; to\npromote stability of residential development; to protect the character\nof the district and its peculiar suitability for particular uses;\nto conserve the value of land and buildings; and to protect the City's\ntax revenues."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 575-21",
			"title": "Purposes of specific residence districts.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "R-1A and R-1B One-Family Detached Residence Districts.\nThese districts are designed to provide a suitable open character\nfor single-family detached dwellings at low densities. These districts\nalso include community facilities and open uses which serve the residents\nof these districts or are benefited by an open residential environment."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "R-1C One-Family Detached Residence District. This\ndistrict is designed to provide a suitable open character for single-family\ndetached dwellings at medium densities, while preserving open space\nto the greatest extent practicable and preventing excessive on-street\nparking."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "R-2 One- and Two-Family Residence District. This district\nis designed to provide a suitable open character for single-family\ndetached dwellings at medium densities, while providing limited opportunities\nfor two-family structures on lots large enough to accommodate adequate\noff-street parking and suitable open space."
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "R-3 One-, Two- and Three-Family Residence District.\nThis district is designed to provide a suitable open character for\nsingle-family detached dwellings at medium densities, while providing\nlimited opportunities for two- and three-family structures on lots\nlarge enough to accommodate off-street parking and open space."
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "R-4, R-5 and R-6 Residence Districts. These districts\nare designed to provide for all types of residential buildings in\norder to permit a broad range of housing types, with appropriate standards\nfor each district on density, open space and spacing of buildings.\nThe various districts are mapped in relation to a desirable future\nresidential density pattern with emphasis upon accessibility to transportation\nfacilities and to various community facilities and upon the character\nof existing development. These districts also include community facilities\nand open uses which serve residents of these districts or are benefited\nby an open residential character."
								}
							]
						},
						{
							"number": "F. ",
							"content": [
								{
									"text": "Planned Residential Development District. This district\nis designed to permit a range of housing types mixed together at a\nmoderate density on large sites for which flexibility in the regulations\nfor building bulk and placement is desirable due to the nature of\nthe topography, configuration of the site and the desirability for\nthe preservation of natural features, scenic areas, historic sites\nand/or open spaces. This district will be located based upon accessibility\nto transportation facilities and to various community facilities."
								}
							]
						}
					]
				},
				{
					"footnote": "[1]\nEditor's Note: This ordinance also repealed\nformer § 300-20, Purposes of specific residence districts.\n"
				}
			]
		},
		{
			"paragraph": "§ 575-28",
			"title": "Planned Residential Development District.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Purpose. This district is created to encourage and\npromote planned residential development where appropriate in location,\ncharacter and timing based on the Land Use Plan and Housing Plan.\nThe creation of this district is a desirable objective due to the\nlimited land resources within the City suitable for further residential\ndevelopment and a pressing regional need for additional housing to\nsupport economic development. The provision of this district is designed\nto achieve the following objectives:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Protect the character and property values of adjoining\nland uses."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Permit a range of housing types with a flexibility\nin the regulations with respect to building bulk and placement."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Protect the natural features and open space character\nof the district."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Permitted uses. No building or premises shall be used,\nand no building or part of a building shall be erected which is arranged,\nintended or designed to be used, in whole or in part, for any purpose\nexcept the following:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "One-family dwelling, not to exceed one such dwelling\non each lot."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Clustered dwellings, in accordance with the standards and procedures set forth in § 575-29."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Municipal parks and playgrounds, including customary\nrecreational, refreshment and service buildings, and, without limitation,\nany other proprietary or governmental use of the City of Peekskill."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Lot area and building requirements for permitted uses."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Lot area, width and depth. The lot area shall not\nbe less than 7,500 square feet and the lot width not less than 75\nfeet. All lots shall have a minimum depth of 100 feet, except that\nsuch depth of the lot may be decreased to 90 feet if the average depth\nof the lot equals at least 100 feet."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Yards. Except as otherwise permitted or required,\nthe following yards shall be provided on each lot:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "Front yard. There shall be a front yard along\neach street line with a depth of not less than 25 feet, except that\nwhere the planes of all walls of a building facing the street intersect\nthe street line at a minimum angle of 25° or more, such building\nmay project to within 20 feet of said line."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "Side yard. There shall be a side yard along\neach lot line with a width of not less than 10 feet, except that in\nthe case of a dwelling erected without a garage, one side yard shall\nbe not less than 22 feet wide. In the case of corner lots (all of\nwhich are deemed to have two front yards, two side yards and no rear\nyard), one side yard shall be not less than 30 feet wide and the other\nnot less than 10 feet wide, except that in the case of a dwelling\nerected without a garage, the lesser side yard shall be not less than\n22 feet wide. Where the planes of all walls of a building facing a\nside lot line intersect such line at a minimum angle of 25° or\nmore, such building may project within eight feet of said lot line."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "Rear yard. There shall be a rear yard having\na depth of not less than 50 feet."
																}
															]
														}
													]
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "Accessory uses are limited to the following: the same\nas permitted in the R-1A District."
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "Uses subject to the issuance of a special permit.[Amended 5-29-2012; 9-12-2016 by L.L. No. 6-2016]"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "An applicant may increase the density of development for the following permitted residential uses, subject to the issuance of a special permit by the Director of Planning upon authorization by the Common Council in accordance with the provisions of this section and Article XI herein and subsequent approval by the Planning Commission of a site plan in accordance with the provisions of § 575-56 herein:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "Dwelling units of all types: single-family detached, semi-detached,\nattached, either in clustered or conventional layouts, and garden\nand mid-rise apartments."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "The following nonresidential uses may be attendant to a planned residential\ndevelopment pursuant to this section:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "Professional office uses where such uses are scaled primarily\nto serve the residents of the district."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "Public and quasi-public, institutional and recreational uses,\nincluding passive and active recreation and conservation areas."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "Adaptive reuse of existing historic structures by a use and\nin a manner approved by the Common Council."
																}
															]
														},
														{
															"number": "(d) ",
															"content": [
																{
																	"text": "Amenities intended for use by residents of a proposed development\nand/or residents of surrounding areas."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "General requirements. The following criteria shall be considered\nbasic requirements for the issuance of a special permit to allow planned\nresidential development. Failure of an applicant to supply adequate\nevidence that these criteria are met shall constitute adequate grounds\nfor denial of the special permit."
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "The applicant must submit a traffic analysis which indicates\nthat the proposed development will generate peak hour traffic flows\nwhich can be handled by the existing street system and/or proposed\nimprovements to the street system at satisfactory levels of service."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "Minor streets outside the planned residential development shall\nnot be used for site access, except where necessary to provide primary\nmeans of vehicular access to the Planned Residential Development district,\nand where street and/or sidewalk improvements are planned that accommodate\nthe proposed level of use, consistent with the health, safety and\nwelfare of the occupants within the Planned Residential Development\ndistrict."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "The applicant must submit an engineer's report which certifies\nthat existing systems, together with improvements to be constructed\nin conjunction with the development, will have sufficient capacity\nto provide the following:"
																},
																{
																	"content": [
																		{
																			"number": "[1] ",
																			"content": [
																				{
																					"text": "Water fire flows sufficient to meet fire and safety standards\nfor the scale and type of development proposed."
																				}
																			]
																		},
																		{
																			"number": "[2] ",
																			"content": [
																				{
																					"text": "Sanitary sewer service connected to the existing City system\nwhich complies with City and county regulations."
																				}
																			]
																		},
																		{
																			"number": "[3] ",
																			"content": [
																				{
																					"text": "A drainage system which will not adversely impact existing development\nwithin the same drainage basin."
																				}
																			]
																		},
																		{
																			"number": "[4] ",
																			"content": [
																				{
																					"text": "The ability for emergency responders to access the site."
																				}
																			]
																		}
																	]
																}
															]
														},
														{
															"number": "(d) ",
															"content": [
																{
																	"text": "The City school district must have sufficient capacity to absorb\nthe projected population of the proposed development."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "Residential density and standards."
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "Parcel density shall not exceed nine dwelling units per net\nparcel acreage."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "For purposes for computing net parcel acreage, the following\nareas are to be excluded from the gross area of the development:"
																},
																{
																	"content": [
																		{
																			"number": "[1] ",
																			"content": [
																				{
																					"text": "Twenty percent as an allowance for rights-of-way, or where more\nthan 50% of the proposed site will be considered conservation or dedication\nto the City, the actual area devoted to rights-of-way and accessways."
																				}
																			]
																		},
																		{
																			"number": "[2] ",
																			"content": [
																				{
																					"text": "Bodies of water, including streams, ponds and swamps."
																				}
																			]
																		},
																		{
																			"number": "[3] ",
																			"content": [
																				{
																					"text": "Rock outcroppings of more than 200 square feet."
																				}
																			]
																		},
																		{
																			"number": "[4] ",
																			"content": [
																				{
																					"text": "Areas with more than a twenty-five percent slope."
																				}
																			]
																		},
																		{
																			"number": "[5] ",
																			"content": [
																				{
																					"text": "All areas within the required setbacks from the district boundaries."
																				}
																			]
																		}
																	]
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "For purposes of computing maximum parcel density, the net parcel\narea shall be divided by 4,840 square feet."
																}
															]
														},
														{
															"number": "(d) ",
															"content": [
																{
																	"text": "Landscaped open spaces, or open areas left substantially in\ntheir natural state, shall be provided at a ratio of not less than\n1,000 square feet of usable open space for every dwelling unit. The\nPlanning Commission may require that as much as 15% of the total gross\nacreage of such open space be provided in the form of equipped recreation\nareas."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "Bonus density."
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "Subject to the limitations detailed in Subsection E(5)(b) and (c) below, unit densities may be increased where an offer to dedicate a portion of land deemed acceptable to the Common Council for municipal purposes is made. The Common Council reserves the right not to accept all or a portion of such proposed dedications."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "Lands suitable for dedication. The land to be dedicated must\nhave direct access to a usable public right-of-way, or a means of\nmotorized vehicular access acceptable to the Common Council. Additionally,\nsuch lands must have one or more of the following attributes:"
																},
																{
																	"content": [
																		{
																			"number": "[1] ",
																			"content": [
																				{
																					"text": "The capacity to be developed for recreational uses."
																				}
																			]
																		},
																		{
																			"number": "[2] ",
																			"content": [
																				{
																					"text": "The capacity, through their dedication, to preserve the topography\nof a scenic landscape."
																				}
																			]
																		},
																		{
																			"number": "[3] ",
																			"content": [
																				{
																					"text": "Local or national historic significance."
																				}
																			]
																		},
																		{
																			"number": "[4] ",
																			"content": [
																				{
																					"text": "The capacity to be used by the City for the development of affordable\nhousing."
																				}
																			]
																		},
																		{
																			"number": "[5] ",
																			"content": [
																				{
																					"text": "The capacity to be utilized for the development of municipal\nfacilities."
																				}
																			]
																		}
																	]
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "Density increases. Pursuant to the Common Council's acceptance\nof lands for dedication to the City, unit densities may be increased\nby an amount not to exceed one unit per gross parcel acreage, which\nis to include the land that has been dedicated."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(6) ",
											"content": [
												{
													"text": "Office use and standards. A professional office or studio may be\npermitted in a ratio of not more than one for each 50 dwelling units\nor major fraction thereof and shall be located only on the street\nfloor of any building and on the floor immediately above the street\nfloor only if there is access to such office or studio from other\nthan a public hall."
												}
											]
										},
										{
											"number": "(7) ",
											"content": [
												{
													"text": "Off-street parking requirements."
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "Spaces for the parking of passenger automobiles shall be minimally\nprovided as follows:"
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "Parking requirements for uses not listed shall be determined\nby the Planning Commission as appropriate to prevent frequent parking\non the street by persons visiting or connected with each such use."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "One off-street loading space shall be provided for each 20,000\nsquare feet or major fraction thereof of nonresidential space in buildings,\nexclusive of bulk storage and utility areas."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(8) ",
											"content": [
												{
													"text": "Common property. Common property in a planned residential development\nis a parcel or parcels of land, together with all improvements thereon,\nthe use and enjoyment of which are shared by the owners and occupants\nof the individual building sites or dwelling units. Where open space\nexists, the ownership of such property can be either public or private.\nWhere such property is not dedicated to the City of Peekskill or other\npublic agency, the owner shall provide for and establish an organization\nfor the continued ownership and maintenance thereof, consistent with\napplicable state laws and in accordance with § 575-291 herein."
												}
											]
										},
										{
											"number": "(9) ",
											"content": [
												{
													"text": "Site and structure requirements."
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "Natural features, such as streams, rock outcroppings, topsoil,\ntrees and shrubs, shall be preserved and incorporated in the landscaping\nof the development."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "The proposed development must meet the following performance\nstandards for buffer yards along district boundaries:"
																},
																{
																	"content": [
																		{
																			"number": "[1] ",
																			"content": [
																				{
																					"text": "All structures within the district shall comply with the setback\nrequirements in the following table:"
																				}
																			]
																		},
																		{
																			"number": "[2] ",
																			"content": [
																				{
																					"text": "Changes to setback requirements shall be made only on a finding\nthat sufficient screening is provided and that sufficient topographic\nseparation exists between proposed and adjacent uses. Changes to setback\nrequirements may also be considered for developments that utilize\npreviously disturbed or developed lands, or to provide proximity to\nadjacent development, or existing infrastructure. In no event shall\nthe setback be less than 50 feet from the district boundary for any\ndwelling type."
																				}
																			]
																		},
																		{
																			"number": "[3] ",
																			"content": [
																				{
																					"text": "District boundary lines shall be screened at a minimum height\nof five feet using any of the following:"
																				},
																				{
																					"content": [
																						{
																							"number": "[a] ",
																							"content": [
																								{
																									"text": "Preservation of existing vegetation."
																								}
																							]
																						},
																						{
																							"number": "[b] ",
																							"content": [
																								{
																									"text": "Landscaping."
																								}
																							]
																						},
																						{
																							"number": "[c] ",
																							"content": [
																								{
																									"text": "Opaque fencing."
																								}
																							]
																						}
																					]
																				}
																			]
																		}
																	]
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "The standards set forth in the table below shall be used as\ndesign densities for various housing types:"
																}
															]
														},
														{
															"number": "(d) ",
															"content": [
																{
																	"text": "All electrical, telephone, cable television and similar equipment\nshall be installed underground in accordance with the New York State\nPublic Service Commission regulations."
																}
															]
														},
														{
															"number": "(e) ",
															"content": [
																{
																	"text": "Lot sizes and dimensions and structure height and locations\nthereon may be freely disposed and arranged in conformity with the\noverall density standards set forth herein. In reviewing any site\nplan application for a planned residential development, the Planning\nCommission shall be guided by standards set forth elsewhere in this\nchapter and the Land Use Plan for comparable uses. The height of buildings\nin relation to proposed grades must allow for Fire Department and\nemergency access."
																}
															]
														},
														{
															"number": "(f) ",
															"content": [
																{
																	"text": "The right-of-way and pavement widths for internal roads serving\nmultifamily dwellings shall be sufficient in size, location and design\nto accommodate the maximum traffic, parking and loading needs and\naccess by fire-fighting equipment and police or emergency vehicles.\nThe pavement of said roads shall be not less than 24 feet wide. All\nstreets to be dedicated shall be subject to all other applicable City\nordinances and standards."
																}
															]
														},
														{
															"number": "(g) ",
															"content": [
																{
																	"text": "The developer shall provide all necessary on-site water and\nsewer facilities, storm drainage, paved service streets, curbing,\nsidewalks, parking and loading facilities, lighting, fire alarm and\nother necessary support systems, which shall be connected to public\nutility systems at the nearest feasible point, and other necessary\nfacilities, making reasonable provision for utility service or connections\nwith adjoining properties in other ownerships. Such proposed improvements\nshall be subject to revision and approval by the appropriate authorities.\nThe City shall not be obligated to extend existing systems to accommodate\nthe developer."
																}
															]
														},
														{
															"number": "(h) ",
															"content": [
																{
																	"text": "Energy conservation shall be encouraged through the use of southern\nslopes, where feasible, for passive solar access."
																}
															]
														},
														{
															"number": "(i) ",
															"content": [
																{
																	"text": "Any nonresidential or recreational uses within the planned residential\ndevelopment must be located so as to be compatible with nearby residential\nuses. Such uses, including parking and loading areas, must be adequately\nscreened and buffered where adjacent to residential development."
																}
															]
														}
													]
												}
											]
										}
									]
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 575-29",
			"title": "Clustering standards.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Purpose. The purpose of cluster development is to\npermit a procedure for development which will result in improved living\nand working environments; which will promote more economic subdivision\nlayout; which will encourage a variety of types of residential dwellings;\nwhich will encourage ingenuity and originality in total subdivision\nand individual site design; and which can preserve open space to serve\nrecreational, scenic and public service purposes and other purposes\nrelated thereto within the densities established for the cluster net\ntract area."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Authorization and eligibility. Authorization is granted\nto the Planning Commission, pursuant to § 37 of the General\nCity Law, to apply clustering standards to plans of residential development."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Computation of unit density. In any R-1, R-2 and R-3\nDistrict, the Planning Commission may authorize the subdivision of\ntracts or parcels of land into lots for residential clustering use\nin accordance with the density, use, height and parking requirements\nof the particular district."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Application of these standards to R-3 Districts shall\npreserve the maximum density allowable for R-2 Districts."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "For purposes of computing net parcel acreage, the\nfollowing areas are to be excluded from the gross area of the development:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "Twenty percent as an allowance for rights-of-way\n(determined by calculating an average right-of-way consumption in\nsample R-1 and R-2 areas; see Appendix I[1])."
																},
																{
																	"footnote": "[1]\nEditor's Note: Appendix I is attached to the\nordinance adopted 1-25-1982 and on file in the office of the City\nClerk.\n"
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "Bodies of water, including streams, ponds and\nswamps."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "Rock outcroppings of more than 200 square feet\neach."
																}
															]
														},
														{
															"number": "(d) ",
															"content": [
																{
																	"text": "Areas with more than a twenty-percent slope."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "For purposes of computing parcel density, the net\nparcel acreage shall be divided by 7,500 square feet in an R-1 District\nand by 6,000 square feet in an R-2 or R-3 District."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "Subdivision review. Where any development will result\nin a division of land into two or more lots, plots, sites or parcels\nin such a way as to create one or more new streets as defined in the\nCity of Peekskill Subdivision Regulations,[2] subdivision review and application of clustering standards\nby the Planning Commission shall be coordinated through the Department\nof Planning, Development and Code Enforcement."
								},
								{
									"footnote": "[2]\nEditor's Note: See Ch. 510, Subdivision of Land.\n"
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "Application procedure and site plan elements. Application preparation, submission and review shall follow the procedure specified in § 575-56D of this chapter and shall consist of the site plan elements required in § 575-56E. The site plan shall further show:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "The disposition of various land uses and the areas\ncovered by each, in acres."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Delineation of the various residential areas, indicating\nthe number of dwelling units by each housing type: single-family detached\nand semidetached, attached quadraplex or townhouse dwellings, multistory\nmultiple dwellings, etc., plus a calculation of the density in dwelling\nunits per acres."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "The common open space system and a statement as to\nhow it is to be preserved as such throughout the life of any portion\nof the cluster development and how it is to be owned and maintained."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "F. ",
							"content": [
								{
									"text": "General requirements; design objectives and criteria. In reviewing a cluster development, the Planning Commission shall give particular consideration to the objectives set forth in § 575-56C of this chapter and the following design objectives:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Individual lots, buildings, streets and parking areas\nshall be designed and situated to minimize alteration of the natural\nsite features to be preserved."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "The usability of cluster open space intended for recreation\nor public use shall be determined by the size, shape, topographic\nand location requirements of the particular purpose proposed for the\nsite."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Cluster open space shall include irreplaceable natural\nfeatures located in the tract (such as but not limited to stream beds,\nsignificant stands of trees, individual trees of significant size\nand rock outcroppings)."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "Cluster open space intended for a recreation or public\nuse shall be easily accessible to pedestrians, which accessibility\nshall meet the needs of the handicapped and elderly."
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "Diversity and originality in lot layout and individual\nbuilding design shall be encouraged to achieve the best possible relationship\nbetween development and the existing topography."
												}
											]
										},
										{
											"number": "(6) ",
											"content": [
												{
													"text": "Individual lots, buildings, units and parking areas\nshall be situated to avoid the adverse effects of shadows, noise and\ntraffic on the residents of the site. In evaluating the site plan,\nthe standards prescribed in Appendix II[3] shall be used as general guidelines."
												},
												{
													"footnote": "[3]\nEditor's Note: Appendix II is attached to\nthe ordinance adopted 1-25-1982 and on file in the office of the City\nClerk.\n"
												}
											]
										},
										{
											"number": "(7) ",
											"content": [
												{
													"text": "Areas with slopes greater than 15% shall be preserved\nand not disturbed unless means to mitigate adverse environmental effects\nare defined in an engineer's, architect's or landscape architect's\nreport and approved by the Planning Commission."
												}
											]
										},
										{
											"number": "(8) ",
											"content": [
												{
													"text": "Energy conservation shall be encouraged through the\nuse of southern slopes, where feasible, for passive solar access."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "G. ",
							"content": [
								{
									"text": "Utility placement. All electrical, telephone, cable\ntelevision and similar equipment shall be installed underground in\naccordance with the New York Public Service Commission regulations,\nunless waived by the Planning Commission."
								}
							]
						},
						{
							"number": "H. ",
							"content": [
								{
									"text": "On-site improvements. The developer shall provide\nall necessary on-site water and sewer facilities, including but not\nlimited to water storage tanks if necessary, storm drainage, highway\naccess, paved service streets, curbing, sidewalks, parking and loading\nfacilities, lighting, fire alarm and other necessary support systems,\nwhich shall be connected to the City systems at the nearest feasible\npoint, and other necessary facilities, making reasonable provision\nfor utility service or connections with adjoining properties in other\nownerships. Such proposed improvements shall be subject to revision\nand approval by the appropriate City authority. The City shall not\nbe obligated to extend existing systems to accommodate the developer."
								}
							]
						},
						{
							"number": "I. ",
							"content": [
								{
									"text": "Common lands and facilities."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Where a clustering development approved pursuant to\nthis authorization results in the permanent preservation of open spaces\nor the creation of other commonly used lands or facilities, their\nlocation and use shall be approved by the Planning Commission, using\nas a guide the Comprehensive Plan and the concept of creating a coordinated\nsystem of open spaces with public right-of-way between them, as well\nas the purposes set forth herein and in § 37 of the General\nCity Law."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "In cluster developments having more than five acres,\nthe developer may offer at least 25% of the total area of all common\nopen space parcels containing an area greater than one acre each to\nthe City of Peekskill for dedication for public use. The Planning\nCommission shall review such offer of dedication during preliminary\nsite plan review and recommend either acceptance or refusal of a part\nor all of said parcels to the Common Council."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Common lands which are not dedicated in accordance with Subsection I(2) above and any private common facilities shall be owned and maintained by a property owners' association or its successor organization, subject to the following requirements:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "The property owners' association shall be a\nlegal entity authorized by the laws of the State of New York. It shall\nbe created by a trust agreement or certificate of incorporation, approved\nas to form and sufficiency by the Corporation Counsel and designed\nto assure the permanent preservation and protection of the common\nlands and any improvements thereon for their intended purposes. The\nassociation shall be established prior to obtaining a building permit."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "The property owners' association shall be responsible\nfor the continued future maintenance, ownership and use of all such\ncommon lands and facilities."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "The property owners' association shall be perpetual\nand shall not dispose of any common land or any improvements thereon\nor thereunder, by sale or otherwise, except to a successor organization."
																}
															]
														},
														{
															"number": "(d) ",
															"content": [
																{
																	"text": "The instrument establishing the association\nshall provide notice that in the event it or any successor organization\nshall at any time after approval of the development fail to maintain\nthe common land or any improvements thereon in accordance with the\napproved plan, the City Manager may serve certified or personal notice\nupon such legal entity or successor organization and upon the property\nowners as recorded on the assessment rolls within the development,\nsetting forth the manner in which the association has failed to maintain\nthe common land or any improvements thereon, and said notice shall\ninclude a demand that such deficiencies be corrected within 60 days.\nThe City Manager may, upon application and for good cause, extend\nsaid period for additional sixty-day periods. If the deficiencies\nare not so corrected, the City Manager, in order to preserve the taxable\nvalues of the property within the development and to prevent the common\nland and improvements thereon from becoming a public nuisance, may\ndirect that the City enter upon and take possession of said common\nland and improvements and maintain the same until such time as the\nCommon Council shall determine that the property owners' association\nis ready and able to maintain the common land and improvements in\nproper condition. Said entry and maintenance shall not vest in the\npublic any rights to use the common land or improvements. The decision\nof the City Manager with respect to the action described in this subsection\nshall constitute a final administrative decision subject to review\nin accordance with the provisions of Article 78 of the Civil Practice\nLaw and Rules. The cost to the City of any such maintenance shall\nbe assessed against the properties within the cluster development\naffected, and in the event of the failure or refusal of any property\nowner to pay any such charges when levied, the unpaid amount thereof\nshall become a lien against the property and, together with interest,\nallowed by state law from the due date thereof, shall be included\nin the following annual tax levy of the City upon such property for\nthe following fiscal year, and the amount so levied shall be collected\nin the same manner as other City taxes."
																}
															]
														},
														{
															"number": "(e) ",
															"content": [
																{
																	"text": "The property owners' association agreement shall\nrequire that every property owner within the cluster development shall\nautomatically be and become a member of the association and shall\nbe subject to a charge for a proportionate share of expenses of the\nassociation's activities, including but not limited to the maintenance\nand operation of the common land and improvements thereon."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "After final site plan approval and before obtaining a building permit, the developer of the cluster development shall file a performance guarantee in the form of cash, other liquid asset or a letter of credit satisfactory to the Corporation Counsel and City Comptroller to ensure the proper installation of all improvements on common property, as provided in § 575-56D(7) of this chapter.[Amended 5-13-2002 by L.L. No. 1-2002]"
												}
											]
										}
									]
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 575-43",
			"title": "WF Waterfront District.\n                                                                                          [1]",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Purpose. The City of Peekskill waterfront is a unique\nnatural setting that provides water-related recreation opportunities,\nboth passive and active, majestic views, habitat for wildlife, a transportation\ncenter and an opportunity for commercial and residential development.\nThe creation of a waterfront district is intended to encourage the\ncreation and/or maintenance of sound development within the City's\nwaterfront area in a manner that optimizes the locational opportunity\nfor appropriate commercial, residential, service and recreation activities,\nincluding the possible multiple use of sites, which shall be compatible\nwith adjacent uses so as not to cause nuisance or environmental harm,\nand at the same time recognizes and protects the unique natural setting\nand the public investment made in open space and preservation of vistas.\nAny development in the waterfront shall be reviewed by the Planning\nCommission and Common Council, as applicable, with the following public\nobjectives which should be evaluated in a comprehensive manner:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Preservation of open space and recreation opportunities."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Preservation and reclamation of views or vistas of\nPeekskill Bay and the Hudson Highlands."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Attractive rehabilitation of existing buildings."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "Consolidation of transportation uses and services."
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "Provision for and support of water-related services\nand businesses."
												}
											]
										},
										{
											"number": "(6) ",
											"content": [
												{
													"text": "Development of residential dwellings where such development advances the purposes set forth herein and in § 575-20 of this chapter."
												}
											]
										},
										{
											"number": "(7) ",
											"content": [
												{
													"text": "Expansion of public rights-of-way and easements along\nthe water's edge."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Overall district. The Waterfront (WF) Zoning District\nis hereby amended to include all areas delineated \"WF\" on the Zoning\nMap of the City of Peekskill, as amended."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Subareas. The Waterfront District, as established, is hereby divided\ninto four subareas: WF-1, WF-2, WF-3 and WF-PRD. The Common Council\nfinds that each subarea has a distinct character because of topography\nand/or location within the waterfront area. These subareas are established\nas delineated on the Zoning Map of the City of Peekskill.[2][Amended 12-14-2015 by L.L. No. 12-2015]"
								},
								{
									"footnote": "[2]\nEditor's Note: A Table of Zoning Map Amendments is included\nat the end of this chapter.\n"
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "Subarea WF-1.[Amended 12-23-1991; 9-26-1995; 4-14-2008 by L.L. No. 5-2008; 5-29-2012; 9-10-2012 by L.L. No.\n12-2012; 12-14-2015 by L.L. No. 12-2015]"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Permitted uses."
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "Municipal parks."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Special permit uses."
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "For all special permit uses in the WF-1, the Design Guidelines\nfor the WF District are hereby deemed additional criteria to be used\nin evaluating proposals.[3] In reviewing special permit applications, the Planning\nCommission shall make a report to the Common Council regarding consistency\nwith the Design Guidelines. No special permit shall be granted pursuant\nto this section unless the Common Council shall have made an affirmative\nfinding that the project is consistent with the Design Guidelines\nto the maximum extent possible."
																},
																{
																	"footnote": "[3]\nEditor's Note: The Design Guidelines for the Waterfront\nDistrict are included at the end of this chapter.\n"
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "The following uses are permitted in the WF-1 Subarea subject\nto the issuance of a special permit by the Common Council:"
																},
																{
																	"content": [
																		{
																			"number": "[1] ",
																			"content": [
																				{
																					"text": "Marina, boat club, boat launching and sale or rental of marine\nsupplies and boats."
																				}
																			]
																		},
																		{
																			"number": "[2] ",
																			"content": [
																				{
																					"text": "Fully enclosed structures not to exceed 10,000 feet of floor\narea for the repair and manufacture of boats, sails and equipment."
																				}
																			]
																		},
																		{
																			"number": "[3] ",
																			"content": [
																				{
																					"text": "Transportation services, including ferry terminal and commercial\nboat charter."
																				}
																			]
																		},
																		{
																			"number": "[4] ",
																			"content": [
																				{
																					"text": "Restaurant."
																				}
																			]
																		},
																		{
																			"number": "[5] ",
																			"content": [
																				{
																					"text": "Hotels and motels."
																				}
																			]
																		}
																	]
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Lot area and building requirements."
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "Height. No structure shall be erected to a height in excess\nof two stories or 24 feet. This height requirement may be waived by\nthe Planning Commission for structures to be developed at Travis Point;\nhowever, such structure may not exceed four stories and the overall\nheight may not exceed 45 feet."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "Structures shall be set back at least 50 feet from the water's\nedge, except structures which require direct access to the water for\ntheir function and which are not more than one story or 12 feet in\nheight."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "For hotel/motel uses the following standards shall additionally\napply:"
																},
																{
																	"content": [
																		{
																			"number": "[1] ",
																			"content": [
																				{
																					"text": "Minimum of 50 guest rooms must be provided."
																				}
																			]
																		},
																		{
																			"number": "[2] ",
																			"content": [
																				{
																					"text": "The following bulk standards shall apply:"
																				},
																				{
																					"content": [
																						{
																							"number": "[a] ",
																							"content": [
																								{
																									"text": "One thousand square feet of lot area shall be provided\nfor each guest room."
																								}
																							]
																						},
																						{
																							"number": "[b] ",
																							"content": [
																								{
																									"text": "Each guest room shall include a full private bathroom."
																								}
																							]
																						},
																						{
																							"number": "[c] ",
																							"content": [
																								{
																									"text": "Minimum guest room size, including private bathroom,\nshall be 400 square feet."
																								}
																							]
																						},
																						{
																							"number": "[d] ",
																							"content": [
																								{
																									"text": "Maximum floor area ratio (FAR) shall be 0.75."
																								}
																							]
																						},
																						{
																							"number": "[e] ",
																							"content": [
																								{
																									"text": "Gross floor area designated to permitted ancillary\nuses shall not exceed 60% of the gross floor area for all site structures."
																								}
																							]
																						},
																						{
																							"number": "[f] ",
																							"content": [
																								{
																									"text": "Buffering shall be provided as follows: a twenty-foot-wide\nbuffer, planted and maintained to the satisfaction of the Director\nof Planning, shall be provided between both the main building and\nall outdoor recreation areas and all side and rear lot lines; a ten-foot-wide\nbuffer, planted and maintained to the satisfaction of the Director\nof Planning, shall be provided between all parking areas and all side\nand rear lot lines."
																								}
																							]
																						}
																					]
																				}
																			]
																		},
																		{
																			"number": "[3] ",
																			"content": [
																				{
																					"text": "Occupancy shall be limited to transients who shall reside in\nthe hotel for not more than 180 days a year and the minimum rate shall\nbe for a full day; hourly rental rates shall not be permitted."
																				}
																			]
																		}
																	]
																}
															]
														},
														{
															"number": "(d) ",
															"content": [
																{
																	"text": "Hotels and motels able to achieve a U.S. Green Building Council\nLEED Rating of Certified, Silver, Gold or Platinum, subject to the\nfollowing conditions:"
																},
																{
																	"content": [
																		{
																			"number": "[1] ",
																			"content": [
																				{
																					"text": "Minimum of 50 guest rooms must be provided."
																				}
																			]
																		},
																		{
																			"number": "[2] ",
																			"content": [
																				{
																					"text": "The following bulk standards shall apply:"
																				},
																				{
																					"content": [
																						{
																							"number": "[a] ",
																							"content": [
																								{
																									"text": "Seven hundred square feet of lot area shall be\nprovided for each guest room."
																								}
																							]
																						},
																						{
																							"number": "[b] ",
																							"content": [
																								{
																									"text": "Each guest room shall include a full private bathroom."
																								}
																							]
																						},
																						{
																							"number": "[c] ",
																							"content": [
																								{
																									"text": "Minimum guest room size, including private bathroom,\nshall be 325 square feet."
																								}
																							]
																						},
																						{
																							"number": "[d] ",
																							"content": [
																								{
																									"text": "Maximum floor area ratio (FAR) shall be 1.2."
																								}
																							]
																						},
																						{
																							"number": "[e] ",
																							"content": [
																								{
																									"text": "Gross floor area designated to permitted ancillary\nuses shall not exceed 60% of the gross floor area for all site structures."
																								}
																							]
																						},
																						{
																							"number": "[f] ",
																							"content": [
																								{
																									"text": "The following U.S. Green Building Council Materials\nmust be submitted as part of application:"
																								},
																								{
																									"content": [
																										{
																											"number": "[i] ",
																											"content": [
																												{
																													"text": "Proof that the project has been registered on the\nU.S. Green Building Council website."
																												}
																											]
																										},
																										{
																											"number": "[ii] ",
																											"content": [
																												{
																													"text": "A completed U.S. Green Building Council Registered\nProject Checklist."
																												}
																											]
																										},
																										{
																											"number": "[iii] ",
																											"content": [
																												{
																													"text": "A completed U.S. Green Building Council LEED\ncertification application."
																												}
																											]
																										}
																									]
																								}
																							]
																						},
																						{
																							"number": "[g] ",
																							"content": [
																								{
																									"text": "Visual buffering within the site and along the\nperimeter of the site shall be provided, inasmuch as practicable,\nto be determined by the Planning Commission during site plan review."
																								}
																							]
																						},
																						{
																							"number": "[h] ",
																							"content": [
																								{
																									"text": "The Planning Commission shall, as part of site\nplan review, request architectural building elevations and evaluate\nsame for appropriateness, within the context of the setting of the\nsite."
																								}
																							]
																						}
																					]
																				}
																			]
																		},
																		{
																			"number": "[3] ",
																			"content": [
																				{
																					"text": "Occupancy shall be limited to transients who shall reside in\nthe hotel for not more than 180 days a year, and the minimum rate\nshall be for a full day; hourly rental rates shall not be permitted."
																				}
																			]
																		}
																	]
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "Special permit additional criteria."
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "Marinas."
																},
																{
																	"content": [
																		{
																			"number": "[1] ",
																			"content": [
																				{
																					"text": "For marina development within the WF-1, the following criteria\nare requirements for the issuance of a special permit by the Common\nCouncil:"
																				},
																				{
																					"content": [
																						{
																							"number": "[a] ",
																							"content": [
																								{
																									"text": "A traffic analysis must be provided, indicating\nthat peak hour traffic flows can be accommodated at adequate levels\nby the existing street system and/or proposed improvements to the\nexisting street system."
																								}
																							]
																						},
																						{
																							"number": "[b] ",
																							"content": [
																								{
																									"text": "An engineer's report must be provided, certifying\nthat improvements to be constructed in conjunction with the development\nwill not have significant negative impacts on the following:"
																								},
																								{
																									"content": [
																										{
																											"number": "[i] ",
																											"content": [
																												{
																													"text": "The quality of water in Peekskill Bay, defined\nherein as the portion of the Hudson River located between the northern\nand southern boundaries of the City of Peekskill."
																												}
																											]
																										},
																										{
																											"number": "[ii] ",
																											"content": [
																												{
																													"text": "Boating safety and freedom from boat congestion\nin Peekskill Bay due to the number of proposed and preexisting slips\nin Peekskill Bay."
																												}
																											]
																										}
																									]
																								}
																							]
																						},
																						{
																							"number": "[c] ",
																							"content": [
																								{
																									"text": "Sewerage pump-out stations must be provided and\nlocated in convenient locations in accordance with applicable federal,\nstate and local standards and must be available to the general boating\npublic."
																								}
																							]
																						},
																						{
																							"number": "[d] ",
																							"content": [
																								{
																									"text": "Garbage stations must be provided and located in\nconvenient locations in accordance with all applicable federal, state\nand local standards."
																								}
																							]
																						},
																						{
																							"number": "[e] ",
																							"content": [
																								{
																									"text": "Upland support facilities, including but not limited\nto showers, bathrooms and laundromats must be provided for the use\nof marina patrons for marina developments with 100 or more boat slips."
																								}
																							]
																						},
																						{
																							"number": "[f] ",
																							"content": [
																								{
																									"text": "Improved public access to the shoreline through\nboardwalks or other suitable means must be provided."
																								}
																							]
																						},
																						{
																							"number": "[g] ",
																							"content": [
																								{
																									"text": "Not less than 25% of all boat slips must be made\navailable to the public through annual leases."
																								}
																							]
																						},
																						{
																							"number": "[h] ",
																							"content": [
																								{
																									"text": "Acceptable and adequate provision for the off-season\nstorage of boats, whether on site or off site, must be demonstrated\nto the satisfaction of the Common Council. Any such storage which,\nin the determination of the Common Council, results in excessive interference\nof shore sight lines to the river shall be deemed unacceptable."
																								}
																							]
																						}
																					]
																				}
																			]
																		},
																		{
																			"number": "[2] ",
																			"content": [
																				{
																					"text": "The residential use of marinas is strictly prohibited. For the purposes of this Subsection D(4)(a)[2], continuing occupation of any boat by any person for a period of seven days shall be deemed a prohibited residential use."
																				}
																			]
																		}
																	]
																}
															]
														}
													]
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "Subarea WF-2.[Amended 11-29-1994; 9-26-1995; 7-21-1997; 7-10-2000 by L.L. No.\n2-2000; 12-14-2009 by L.L. No. 19-2009; 7-19-2010 by L.L. No. 7-2010; 7-11-2011 by L.L. No. 8-2011; 5-14-2012 by L.L. No. 7-2012; 9-10-2012 by L.L. No. 12-2012; 1-28-2013 by L.L. No. 2-2013; 9-8-2014 by L.L. No. 5-2014; 5-26-2015 by L.L. No. 4-2015; 12-14-2015 by L.L.\nNo. 12-2015]"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Permitted uses."
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "Commercial uses with a maximum floor area of 4,000 square feet\nfor each structure limited to the following uses:"
																},
																{
																	"content": [
																		{
																			"number": "[1] ",
																			"content": [
																				{
																					"text": "Retail stores."
																				}
																			]
																		},
																		{
																			"number": "[2] ",
																			"content": [
																				{
																					"text": "Arts and crafts studios, art and/or antique galleries or museums."
																				}
																			]
																		},
																		{
																			"number": "[3] ",
																			"content": [
																				{
																					"text": "Professional and business offices."
																				}
																			]
																		},
																		{
																			"number": "[4] ",
																			"content": [
																				{
																					"text": "Personal services, including beauty parlors, barbershops, tailors\nand nail shops."
																				}
																			]
																		},
																		{
																			"number": "[5] ",
																			"content": [
																				{
																					"text": "Furniture, cabinetry and musical instrument design, fabrication\nand repair and small appliance repair, provided that items are offered\nfor sale on the premises."
																				}
																			]
																		},
																		{
																			"number": "[6] ",
																			"content": [
																				{
																					"text": "Dance studios, martial arts studios, health clubs, gyms and\nsimilar indoor recreational uses used solely for commercial purposes."
																				}
																			]
																		},
																		{
																			"number": "[7] ",
																			"content": [
																				{
																					"text": "Dry-cleaning stores, except that no dry cleaning may be performed\non the property."
																				}
																			]
																		}
																	]
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "Municipal parks and playgrounds and community/recreational center,\nincluding customary recreational, refreshment or service buildings\nand, without limitation, any other proprietary or governmental use\nof the City of Peekskill."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "Up to two artist lofts in one building subject to the development\nstandards for artist lofts outlined in § 575-43E(2)(b)[k][ii]\nand [iii]."
																}
															]
														},
														{
															"number": "(d) ",
															"content": [
																{
																	"text": "Restaurants with 199 or fewer seats."
																}
															]
														},
														{
															"number": "(e) ",
															"content": [
																{
																	"text": "Farmer's markets."
																}
															]
														},
														{
															"number": "(f) ",
															"content": [
																{
																	"text": "Cultural arts facilities, performing arts centers, theaters\nand museums."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Special permit uses."
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "For all special permit uses in the WF-2, the Design Guidelines\nfor the WF District are hereby deemed additional criteria to be used\nin evaluating proposals.[4] In reviewing Common Council special permit applications,\nthe Planning Commission shall make a report to the Common Council\nregarding consistency with the Design Guidelines. No special permit\nshall be granted pursuant to this section unless the Common Council\nor the Planning Commission shall have made an affirmative finding\nthat the project is consistent with the Design Guidelines to the maximum\nextent possible."
																},
																{
																	"footnote": "[4]\nEditor's Note: The Design Guidelines for the Waterfront\nDistrict are included at the end of this chapter.\n"
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "The following uses are permitted in the WF-2 Subarea subject\nto the issuance of a special permit by the Common Council, or, where\nindicated, by the Planning Commission:"
																},
																{
																	"content": [
																		{
																			"number": "[1] ",
																			"content": [
																				{
																					"text": "Residential uses limited to the following:"
																				},
																				{
																					"content": [
																						{
																							"number": "[a] ",
																							"content": [
																								{
																									"text": "Dwelling units, whether attached or semi-attached, including townhouse, garden apartment, and midrise apartment configurations, in accordance with the standards and guidelines of the WF Zoning District and if located within a special flood hazard area, shall comply with the standards and procedures of Chapter 287, Flood Damage Prevention, of the City Code."
																								}
																							]
																						}
																					]
																				}
																			]
																		},
																		{
																			"number": "[2] ",
																			"content": [
																				{
																					"text": "Nonresidential uses limited to the following:"
																				},
																				{
																					"content": [
																						{
																							"number": "[a] ",
																							"content": [
																								{
																									"text": "Restaurants with a designed indoor seating capacity\nof more than 200 patrons are subject to the issuance of a Planning\nCommission special permit."
																								}
																							]
																						},
																						{
																							"number": "[b] ",
																							"content": [
																								{
																									"text": "Business and professional offices with a floor\narea of greater than 4,000 square feet."
																								}
																							]
																						},
																						{
																							"number": "[c] ",
																							"content": [
																								{
																									"text": "Arts or crafts studios, art galleries and antique\ngalleries, furniture, cabinetry and musical instrument design, fabrication,\nand repair studios with a floor area greater than 4,000 square feet."
																								}
																							]
																						},
																						{
																							"number": "[d] ",
																							"content": [
																								{
																									"text": "Public or private parking lots or structures."
																								}
																							]
																						},
																						{
																							"number": "[e] ",
																							"content": [
																								{
																									"text": "Day-care centers and school-age child care as a\nprincipal use, subject to the following conditions:"
																								},
																								{
																									"content": [
																										{
																											"number": "[i] ",
																											"content": [
																												{
																													"text": "Buffering five feet in width and a six-foot-high\nopaque fence with the finished side facing out shall be required between\nall play areas and all lot lines, subject to Planning Commission full\nor partial waiver of this requirement."
																												}
																											]
																										}
																									]
																								}
																							]
																						},
																						{
																							"number": "[f] ",
																							"content": [
																								{
																									"text": "Houses of worship, subject to the following standards in addition to those identified in §§ 575-56 and 575-57 of this chapter:"
																								},
																								{
																									"content": [
																										{
																											"number": "[i] ",
																											"content": [
																												{
																													"text": "Minimum dimensional standards for a house of worship\nshall be as follows: one-acre minimum lot size; one-hundred-fifty-foot\nminimum lot width; 20% maximum building coverage; 50% maximum impervious\ncoverage; and maximum building height of 50 feet."
																												}
																											]
																										},
																										{
																											"number": "[ii] ",
																											"content": [
																												{
																													"text": "One parking space per four seats."
																												}
																											]
																										},
																										{
																											"number": "[iii] ",
																											"content": [
																												{
																													"text": "Parking area to be buffered from all side and\nrear lot lines by a planted area a minimum of 10 feet in width; no\nparking is permitted in a required front yard."
																												}
																											]
																										},
																										{
																											"number": "[iv] ",
																											"content": [
																												{
																													"text": "Building setbacks for all structures shall be\na minimum of 50 feet from all front lot lines, 15 feet from all side\nlot lines and 30 feet from all rear lot lines, or 1/2 of the building\nheight from each lot line, whichever is greater."
																												}
																											]
																										},
																										{
																											"number": "[v] ",
																											"content": [
																												{
																													"text": "Any facility with maximum capacity of 150 persons\nor more shall prepare a traffic impact analysis, which analysis shall\ninclude proposals for any necessary mitigation measures to be undertaken\nby the applicant, to the satisfaction of the Planning Commission."
																												}
																											]
																										},
																										{
																											"number": "[vi] ",
																											"content": [
																												{
																													"text": "Maximum site-generated light shall not exceed\n1.5 footcandles at the property line, and the source of all exterior\nlighting shall not be visible beyond the property line."
																												}
																											]
																										}
																									]
																								}
																							]
																						},
																						{
																							"number": "[g] ",
																							"content": [
																								{
																									"text": "Libraries."
																								}
																							]
																						},
																						{
																							"number": "[h] ",
																							"content": [
																								{
																									"text": "Bed-and-breakfast hotel, subject to the following\nstandards:"
																								},
																								{
																									"content": [
																										{
																											"number": "[i] ",
																											"content": [
																												{
																													"text": "Each bed-and-breakfast hotel shall be established,\nmaintained and operated so as to preserve and compliment the character\nand integrity of the surrounding area when the facility is established."
																												}
																											]
																										},
																										{
																											"number": "[ii] ",
																											"content": [
																												{
																													"text": "The owner of the bed-and-breakfast hotel must\nreside in and continue to reside in the dwelling as his/her/their\nprincipal residence. The owner will provide an annual sworn statement\nto the City Clerk certifying to such residency."
																												}
																											]
																										},
																										{
																											"number": "[iii] ",
																											"content": [
																												{
																													"text": "Bed-and-breakfast guest rooms shall not be permitted\non the first floor of a building. Office space and living quarters\nfor the owner are permitted on the first floor."
																												}
																											]
																										},
																										{
																											"number": "[iv] ",
																											"content": [
																												{
																													"text": "The bed-and-breakfast hotel shall have a minimum\nof two and a maximum of five guest rooms."
																												}
																											]
																										},
																										{
																											"number": "[v] ",
																											"content": [
																												{
																													"text": "The total number of paying adult guests accommodated\nper night shall not exceed 10. No more than two adult guests are allowed\nper room. Further, no guest shall stay for a period of time in excess\nof 14 consecutive days. Documentation verifying the length of stay\nof each guest, such as a registration ledger or receipts, will be\nmade available to the Code Enforcement Officer or the Building Department\nupon request."
																												}
																											]
																										},
																										{
																											"number": "[vi] ",
																											"content": [
																												{
																													"text": "A site plan and detailed floor plan shall be required\nas a condition of this special permit."
																												}
																											]
																										},
																										{
																											"number": "[vii] ",
																											"content": [
																												{
																													"text": "Parking. The bed-and-breakfast hotel shall provide\na minimum of one off-street parking space for the owner/staff, and\nat least one parking space per guest room."
																												},
																												{
																													"content": [
																														{
																															"number": "[A] ",
																															"content": [
																																{
																																	"text": "Parking for staff may be waived if the owner can demonstrate available nearby parking off site. Pursuant to § 575-43H, the off-street parking requirement may be waived by the Planning Commission."
																																}
																															]
																														}
																													]
																												}
																											]
																										},
																										{
																											"number": "[viii] ",
																											"content": [
																												{
																													"text": "The residence must be issued a certificate of\noccupancy from the Building Inspector as a bed-and-breakfast hotel.\nA fee, consistent with the issuance of a commercial certificate of\noccupancy, is required."
																												}
																											]
																										},
																										{
																											"number": "[ix] ",
																											"content": [
																												{
																													"text": "A smoke detector and carbon monoxide detector\nis required in each guest room."
																												}
																											]
																										},
																										{
																											"number": "[x] ",
																											"content": [
																												{
																													"text": "The Building Inspector (or designee) shall be given\nsuch access to be given access to perform annual inspections to ensure\ncompliance with all federal, state and local codes, rules and regulations,\nincluding the New York State Uniform Fire Prevention and Building\nCode. Such inspections may be made with or without prior notice thereof."
																												}
																											]
																										},
																										{
																											"number": "[xi] ",
																											"content": [
																												{
																													"text": "A single exterior sign or display may be established\non the site of the bed-and-breakfast hotel; said sign or display shall\nnot exceed eight square feet in area. No freestanding sign shall be\nlocated less than 10 feet from the front property line nor less than\nfive feet from the side property line."
																												},
																												{
																													"content": [
																														{
																															"number": "[A] ",
																															"content": [
																																{
																																	"text": "Said sign or display shall be as unobtrusive as reasonably possible and may be externally illuminated, provided it is shielded so as to prevent glare onto adjoining properties. Signs shall adhere to all applicable provisions of Chapter 468, Signs, of the Code of the City of Peekskill."
																																}
																															]
																														}
																													]
																												}
																											]
																										},
																										{
																											"number": "[xii] ",
																											"content": [
																												{
																													"text": "A full, hot breakfast must be served in a designated\ndining area within the bed-and-breakfast hotel, and only to overnight\nguests. Other meals are not permitted."
																												}
																											]
																										},
																										{
																											"number": "[xiii] ",
																											"content": [
																												{
																													"text": "Each special permit shall expire on the third\nanniversary of the issuance of the initial certificate of occupancy\nfrom the Building Department. The applicant must apply for a special\npermit renewal."
																												}
																											]
																										},
																										{
																											"number": "[xiv] ",
																											"content": [
																												{
																													"text": "The bed-and-breakfast must be in compliance with\nall applicable federal, state, and local laws."
																												}
																											]
																										},
																										{
																											"number": "[xv] ",
																											"content": [
																												{
																													"text": "The Planning Commission shall have the right to\nimpose and include additional conditions as it may deem necessary\nto effectuate the purpose of this chapter."
																												}
																											]
																										}
																									]
																								}
																							]
																						},
																						{
																							"number": "[i] ",
																							"content": [
																								{
																									"text": "Artist lofts."
																								},
																								{
																									"content": [
																										{
																											"number": "[i] ",
																											"content": [
																												{
																													"text": "When an action will result in one building containing\nthree or more artist lofts, the artist loft shall be subject to the\nissuance of a special permit by the Planning Commission."
																												}
																											]
																										},
																										{
																											"number": "[ii] ",
																											"content": [
																												{
																													"text": "Development standards."
																												},
																												{
																													"content": [
																														{
																															"number": "[A] ",
																															"content": [
																																{
																																	"text": "An artist loft may exist on the first floor of\nthe structure if all of the following conditions are satisfied:"
																																}
																															]
																														},
																														{
																															"number": "[B] ",
																															"content": [
																																{
																																	"text": "Each artist loft shall be separated from other\nartist lofts or other uses within a particular building. Access to\nartist lofts may be provided from common access areas, halls or corridors."
																																}
																															]
																														},
																														{
																															"number": "[C] ",
																															"content": [
																																{
																																	"text": "Each artist loft must be individually equipped\nwith an enclosed bathroom containing a bathroom sink, water closet,\nshower and appropriate venting."
																																}
																															]
																														},
																														{
																															"number": "[D] ",
																															"content": [
																																{
																																	"text": "Each artist loft must be individually equipped\nwith a kitchen that contains a four-burner stove and oven, with a\nrange hood vented to the exterior of the unit. Each unit must provide\na minimum of five feet of countertop, a kitchen sink and a minimum\nof 10 feet of storage cabinets. Each unit must be served by a garbage\ndisposal unit."
																																}
																															]
																														},
																														{
																															"number": "[E] ",
																															"content": [
																																{
																																	"text": "Each artist loft must contain a livable floor area\nof no less than 800 square feet and no greater than 2,000 square feet.\nThe Planning Commission, upon review, may waive the aforementioned\nmaximum requirement upon a finding that artwork to be created in said\nspace would require greater square feet for production or all of said\nincreased square feet was to be used as work space."
																																}
																															]
																														},
																														{
																															"number": "[F] ",
																															"content": [
																																{
																																	"text": "No more than 49% of the livable floor area of the\nartist loft may be primarily intended for residential uses. In no\nevent may said residential area exceed 980 square feet. Direct internal\naccess between living and working areas must be provided."
																																}
																															]
																														},
																														{
																															"number": "[G] ",
																															"content": [
																																{
																																	"text": "Sprinkler systems must be provided in all common\nhallways and areas of any building containing an artist loft if the\nloft contains only one legal means of egress. Hard-wired smoke detectors\nwith battery back ups must be provided for all units."
																																}
																															]
																														}
																													]
																												}
																											]
																										},
																										{
																											"number": "[iii] ",
																											"content": [
																												{
																													"text": "Other requirements."
																												},
																												{
																													"content": [
																														{
																															"number": "[A] ",
																															"content": [
																																{
																																	"text": "All lofts must comply with New York State Uniform\nFire Prevention and Building Code standards for storage of materials."
																																}
																															]
																														},
																														{
																															"number": "[B] ",
																															"content": [
																																{
																																	"text": "The artist loft must be occupied by at least one\nperson who is registered as an artist by the City of Peekskill."
																																}
																															]
																														},
																														{
																															"number": "[C] ",
																															"content": [
																																{
																																	"text": "The artwork that is to be created within the artist\nloft must be compatible with other uses which occur or are to occur\nwithin the building in which the artist loft is to be located."
																																}
																															]
																														},
																														{
																															"number": "[D] ",
																															"content": [
																																{
																																	"text": "No more than two persons per bedroom of residential\nfloor area may reside within an artist loft."
																																}
																															]
																														},
																														{
																															"number": "[E] ",
																															"content": [
																																{
																																	"text": "Only three nonresident employees may be employed\nwithin an artist loft. This requirement may be waived for artist lofts\nthat occur on the first floor of a structure that provide retail space\non that first floor."
																																}
																															]
																														},
																														{
																															"number": "[F] ",
																															"content": [
																																{
																																	"text": "Other than in a first-floor retail-oriented area,\narticles offered for sale within an artist loft must include those\nproduced by the artist occupying said artist loft and may be offered\nwith other like items."
																																}
																															]
																														},
																														{
																															"number": "[G] ",
																															"content": [
																																{
																																	"text": "Air conditioners, clotheslines and other objects\nor equipment shall be prohibited from projecting from any window that\nis visible from a public street."
																																}
																															]
																														},
																														{
																															"number": "[H] ",
																															"content": [
																																{
																																	"text": "One flush-mounted nonilluminated sign attached\nadjacent to or near the street entrance door to the artist loft may\nbe used to identify the artist. Where two or more artist lofts occur\nwithin the same building, the signs must be placed in an orderly fashion\nin relation to each other."
																																}
																															]
																														},
																														{
																															"number": "[I] ",
																															"content": [
																																{
																																	"text": "Work space and accessory residential space shall\nnot be rented separately or used by persons other than those people\nlegally residing within the artist loft."
																																}
																															]
																														}
																													]
																												}
																											]
																										}
																									]
																								}
																							]
																						},
																						{
																							"number": "[j] ",
																							"content": [
																								{
																									"text": "Mixed-use development containing only those uses\napproved for the WF-2 Subarea. Where residential and nonresidential\nuses are in the same structure, the residential portion of a building\nshall have separate access."
																								}
																							]
																						},
																						{
																							"number": "[k] ",
																							"content": [
																								{
																									"text": "Restaurants' accessory outdoor dining service\non the same parcel as the restaurant or on an adjacent parcel shall\nbe subject to approval by a special permit of the Planning Commission."
																								},
																								{
																									"content": [
																										{
																											"number": "[i] ",
																											"content": [
																												{
																													"text": "Procedures."
																												},
																												{
																													"content": [
																														{
																															"number": "[A] ",
																															"content": [
																																{
																																	"text": "Renewal of special permit. Special permits for\naccessory outdoor dining in the WF-2 District shall be subject to\nannual renewal by the Director of Planning. Such renewal shall be\nbased upon written statements from the Chief of Police and the Building\nInspector that outdoor dining is in conformity with the terms of its\nspecial permit, with the terms of this chapter pertaining to said\nuse, and with all applicable laws and regulations."
																																}
																															]
																														},
																														{
																															"number": "[B] ",
																															"content": [
																																{
																																	"text": "Procedures for the renewal of special permits.\nPrior to the expiration date of the special permit, the owner of the\nrestaurant (or designee) shall file a request for inspection with\nthe Director of Planning, which must be accompanied by an inspection\nfee, the cost of which shall be equal to the cost of obtaining a special\npermit for accessory outdoor dining at the time of the request. If\nthe owner fails to apply for a request for an inspection prior to\nthe date of the expiration of the special permit, the special permit\nshall immediately lapse."
																																}
																															]
																														}
																													]
																												}
																											]
																										},
																										{
																											"number": "[ii] ",
																											"content": [
																												{
																													"text": "Special permit standards."
																												},
																												{
																													"content": [
																														{
																															"number": "[A] ",
																															"content": [
																																{
																																	"text": "All outdoor use or service shall be accessory to\nand used in conjunction with an enclosed restaurant located on the\nsame parcel or an adjacent parcel under legal control by the same\nmanagement."
																																}
																															]
																														},
																														{
																															"number": "[B] ",
																															"content": [
																																{
																																	"text": "Separation of adjacent properties and the right-of-way,\nincluding sidewalks, from customers by landscaping, low walls or fencing."
																																}
																															]
																														},
																														{
																															"number": "[C] ",
																															"content": [
																																{
																																	"text": "All tables, chairs or other seating and activities shall take place entirely on the subject parcel(s). The City right-of-way and sidewalk shall at all times remain clear of the outdoor facility or service activities other than pursuant to an accessory sidewalk cafe permit issued under Chapter 505 of the City Code."
																																}
																															]
																														},
																														{
																															"number": "[D] ",
																															"content": [
																																{
																																	"text": "Sunday through Thursday evening closing time for\noutdoor service shall be no later than 11:00 p.m., and Friday and\nSaturday evening closing time for outdoor service shall be no later\nthan 12:00 midnight."
																																}
																															]
																														},
																														{
																															"number": "[E] ",
																															"content": [
																																{
																																	"text": "Chapter 391, Noise, of the City Code, must be adhered to at all times."
																																}
																															]
																														},
																														{
																															"number": "[F] ",
																															"content": [
																																{
																																	"text": "The outdoor facility or service area shall be kept\nfree of debris and litter."
																																}
																															]
																														},
																														{
																															"number": "[G] ",
																															"content": [
																																{
																																	"text": "Exterior lighting shall be directed onto the accessory\noutdoor dining area and shall not intrude onto the adjoining properties."
																																}
																															]
																														},
																														{
																															"number": "[H] ",
																															"content": [
																																{
																																	"text": "Alcoholic beverages can only be served during times\nwhen food service is available."
																																}
																															]
																														},
																														{
																															"number": "[I] ",
																															"content": [
																																{
																																	"text": "The operator of the accessory outdoor dining area\nshall take whatever steps are necessary to procure the appropriate\nlicense from the State Liquor Authority if it intends to serve alcoholic\nbeverages in the outdoor dining area and shall comply with all other\nlaws and regulations concerning the serving of alcoholic beverages\nin New York."
																																}
																															]
																														}
																													]
																												}
																											]
																										}
																									]
																								}
																							]
																						},
																						{
																							"number": "[l] ",
																							"content": [
																								{
																									"text": "Restaurants having accessory outdoor entertainment\nshall be subject to approval by a special permit of the Planning Commission."
																								},
																								{
																									"content": [
																										{
																											"number": "[i] ",
																											"content": [
																												{
																													"text": "Performance standards:"
																												},
																												{
																													"content": [
																														{
																															"number": "[A] ",
																															"content": [
																																{
																																	"text": "Procedures for renewal of special permit. Special\npermits for accessory outdoor entertainment in the WF-2 District shall\nbe subject to annual renewal by the Director of Planning. Such renewal\nshall be based upon written statements from the Chief of Police and\nthe Building Inspector that outdoor entertainment is in conformity\nwith the terms of its special permit, with the terms of this chapter\npertaining to said use, and with all applicable laws and regulations."
																																}
																															]
																														},
																														{
																															"number": "[B] ",
																															"content": [
																																{
																																	"text": "Accessory outdoor entertainment is only permitted\nin conjunction with accessory outdoor dining, which shall require\na separate special permit under this chapter."
																																}
																															]
																														},
																														{
																															"number": "[C] ",
																															"content": [
																																{
																																	"text": "Accessory outdoor entertainment shall not be allowed\non Mondays through Wednesdays and shall only be allowed on Thursdays\nthrough Sundays at the following hours: Thursdays through Saturdays\nfrom 12:00 noon until 10:00 p.m. and Sundays from 12:00 noon until\n5:00 p.m."
																																}
																															]
																														},
																														{
																															"number": "[D] ",
																															"content": [
																																{
																																	"text": "Noise from accessory outdoor entertainment shall\nbe mitigated to the greatest extent practicable, using measures approved\nby the Planning Commission."
																																}
																															]
																														}
																													]
																												}
																											]
																										}
																									]
																								}
																							]
																						}
																					]
																				}
																			]
																		}
																	]
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Lot area and building requirements."
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "Height. No building shall be erected to a height greater than\nfour stories or 45 feet."
																},
																{
																	"content": [
																		{
																			"number": "[1] ",
																			"content": [
																				{
																					"text": "Chimneys, flues, towers, bulkheads, spires, parapets, skylights and other decorative features shall be exempt from the provisions of this subsection, provided that they occupy not more than 20% of the area of the roof of the building of which they are a part and do not exceed an additional 10 feet above the maximum height set forth in this § 575-43E(3)."
																				}
																			]
																		}
																	]
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "Yards. No side yard or rear yard is required. If a side or rear\nyard is provided, it must be 10 feet."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "Setbacks. Buildings shall be set back 10 feet from the curb\nto create a consistent street wall except in the case of South Street,\nUnion Avenue and Depew Street. On these aforementioned streets, buildings\nmay be built up to the road right-of-way in order to maintain the\nexisting street walls. The Planning Commission may vary this requirement\nto increase or decrease the setback of a building if it is determined\nby the Planning Commission that the building entry space provided\ncreates a usable open space such as a park or plaza or if such space\nprovides an improved alignment with existing adjacent buildings."
																}
															]
														},
														{
															"number": "(d) ",
															"content": [
																{
																	"text": "Residential parking. Parking for residential uses shall not\nbe located within the frontage abutting the street. The Planning Commission\nmay waive this requirement for lots in excess of one acre if the parking\nscheme is deemed appropriate for said residential space."
																}
															]
														},
														{
															"number": "(e) ",
															"content": [
																{
																	"text": "Residential entrances. Main entries to residential uses shall\nbe from the side of the structure that faces the street except in\nthe case of artist lofts where residential entrances may be from the\nside of the structure that does not face the street."
																}
															]
														},
														{
															"number": "(f) ",
															"content": [
																{
																	"text": "Residential unit size. In a multiple-dwelling development containing\nmore than five dwellings, the average size of residential units within\na single parcel shall not be less than 800 square feet of floor area\nper unit. In the case of artist lofts, see § 575-43E(2)(b)[2][k][ii][E]\nand [F] for specific unit size requirements."
																}
															]
														},
														{
															"number": "(g) ",
															"content": [
																{
																	"text": "Bonus height. Additional building height for developments on\nthe east side of Water Street and Railroad Avenue may be granted by\nthe Common Council in the form of one additional story, not to exceed\n55 feet in total height. In addition, on the south side of Central\nAvenue, the Common Council may grant additional building height in\nthe form of two additional stories, not to exceed 65 feet in total\nheight. Such bonus heights may be granted to developments that provide\nthe following."
																},
																{
																	"content": [
																		{
																			"number": "[1] ",
																			"content": [
																				{
																					"text": "Payment into an infrastructure fund as specified in § 275-18.2\nto be managed by the City Manager or his designee, to be used for\nmunicipal improvements within the WF Waterfront District, including\nbut not limited to parking facilities, water and sewer, stormwater\nmanagement and flood control."
																				}
																			]
																		}
																	]
																}
															]
														}
													]
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "E.1. ",
							"content": [
								{
									"text": "Subarea WF-3.[Added 12-14-2015 by L.L.\nNo. 12-2015]"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Permitted uses."
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "All uses permitted in the WF-2 Subarea."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Special permit uses."
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "For all special permit uses in the WF-3, the Design Guidelines\nfor the WF District are hereby deemed additional criteria to be used\nin evaluating proposals. In reviewing Common Council special permit\napplications, the Planning Commission shall make a report to the Common\nCouncil regarding consistency with the Design Guidelines. No special\npermit shall be granted pursuant to this section unless the Common\nCouncil or the Planning Commission shall have made an affirmative\nfinding that the project is consistent with the Design Guidelines\nto the maximum extent possible."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "The following uses are permitted in the WF-3 Subarea subject\nto the issuance of a special permit by the Common Council, or, where\nindicated, by the Planning Commission:"
																},
																{
																	"content": [
																		{
																			"number": "[1] ",
																			"content": [
																				{
																					"text": "All special permit uses permitted in the WF-2 Subarea,\nsubject to the same procedures and standards."
																				}
																			]
																		}
																	]
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Lot area and building requirements. All lot area and building\nrequirements shall be the same as the W-2 Subarea, except for the\nfollowing:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "Height. No building shall be erected to a height greater than\nsix stories or 65 feet."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "Bonus height. Additional building height may be granted by the\nCommon Council in the form of up to two additional stories, not to\nexceed 85 feet in total height. Such bonus height may be granted to\ndevelopments that provide the following:"
																},
																{
																	"content": [
																		{
																			"number": "[1] ",
																			"content": [
																				{
																					"text": "Payment into an infrastructure fund as specified\nin § 275-18.2 to be managed by the City Manager or his designee,\nto be used for municipal improvements within the WF Waterfront District,\nincluding but not limited to parking facilities, water and sewer,\nstormwater management and flood control."
																				}
																			]
																		}
																	]
																}
															]
														}
													]
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "F. ",
							"content": [
								{
									"text": "Subarea WF-PRD.[Amended 4-8-1991; 9-26-1995]"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Permitted uses."
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "One-family residential uses as regulated in\nthe R-1B District."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Special permit uses."
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "For all special permit uses in the WF-PRD, the\nDesign Guidelines for the WF District are hereby deemed additional\ncriteria to be used in evaluating proposals.[5] In reviewing special permit applications, the Planning\nCommission shall make a report to the Common Council regarding consistency\nwith the Design Guidelines. No special permit shall be granted pursuant\nto this section unless the Common Council shall have made an affirmative\nfinding that the project is consistent with the Design Guidelines\nto the maximum extent possible."
																},
																{
																	"footnote": "[5]\nEditor's Note: The Design Guidelines for the\nWaterfront District are included at the end of this chapter.\n"
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "The following uses are permitted in the WF-PRD\nSubarea subject to the issuance of a special permit by the Common\nCouncil:"
																},
																{
																	"content": [
																		{
																			"number": "[1] ",
																			"content": [
																				{
																					"text": "Residential uses limited to the following:"
																				},
																				{
																					"content": [
																						{
																							"number": "[a] ",
																							"content": [
																								{
																									"text": "Dwelling units, whether attached\nor semi-attached, including townhouse, garden apartment, and mid-rise\napartment configurations, in accordance with the requirements of the\nWF Zoning District."
																								}
																							]
																						}
																					]
																				}
																			]
																		},
																		{
																			"number": "[2] ",
																			"content": [
																				{
																					"text": "Nonresidential uses limited to the following:"
																				},
																				{
																					"content": [
																						{
																							"number": "[a] ",
																							"content": [
																								{
																									"text": "Hotels and motels, subject to the\nfollowing conditions:"
																								},
																								{
																									"content": [
																										{
																											"number": "[i] ",
																											"content": [
																												{
																													"text": "Minimum of 50 guest rooms must\nbe provided."
																												}
																											]
																										},
																										{
																											"number": "[ii] ",
																											"content": [
																												{
																													"text": "The following bulk standards shall\napply:"
																												},
																												{
																													"content": [
																														{
																															"number": "[A] ",
																															"content": [
																																{
																																	"text": "One thousand square feet of lot\narea shall be provided for each guest room."
																																}
																															]
																														},
																														{
																															"number": "[B] ",
																															"content": [
																																{
																																	"text": "Each guest room shall include a\nfull private bathroom."
																																}
																															]
																														},
																														{
																															"number": "[C] ",
																															"content": [
																																{
																																	"text": "Minimum guest room size, including\nprivate bathroom, shall be four hundred 400 square feet."
																																}
																															]
																														},
																														{
																															"number": "[D] ",
																															"content": [
																																{
																																	"text": "Maximum floor area ratio (FAR)\nshall be 0.75."
																																}
																															]
																														},
																														{
																															"number": "[E] ",
																															"content": [
																																{
																																	"text": "Gross floor area designated to\npermitted ancillary uses shall not exceed 60% of the gross floor area\nfor all site structures."
																																}
																															]
																														},
																														{
																															"number": "[F] ",
																															"content": [
																																{
																																	"text": "Buffering shall be provided as\nfollows: a twenty-foot-wide buffer, planted and maintained to the\nsatisfaction of the Director of Planning, shall be provided between\nboth the main building and all outdoor recreation areas and all side\nand rear lot lines; a ten-foot-wide buffer, planted and maintained\nto the satisfaction of the Director of Planning, shall be provided\nbetween all parking areas and all side and rear lot lines.[Amended 5-29-2012]"
																																}
																															]
																														}
																													]
																												}
																											]
																										},
																										{
																											"number": "[iii] ",
																											"content": [
																												{
																													"text": "Occupancy shall be limited to\ntransients who shall reside in the hotel for not more than 180 days\na year."
																												}
																											]
																										},
																										{
																											"number": "[iv] ",
																											"content": [
																												{
																													"text": "Minimum rate shall be for a full\nday; hourly rental rates shall not be permitted."
																												}
																											]
																										}
																									]
																								}
																							]
																						},
																						{
																							"number": "[b] ",
																							"content": [
																								{
																									"text": "Hotels and motels achieving a U.S.\nGreen Building Council LEED Rating of Certified, Silver, Gold or Platinum,\nsubject to the following conditions:[Amended 4-14-2008 by L.L. No. 5-2008]"
																								},
																								{
																									"content": [
																										{
																											"number": "[i] ",
																											"content": [
																												{
																													"text": "Minimum of 50 guest rooms must\nbe provided."
																												}
																											]
																										},
																										{
																											"number": "[ii] ",
																											"content": [
																												{
																													"text": "The following bulk standards shall\napply:"
																												},
																												{
																													"content": [
																														{
																															"number": "[A] ",
																															"content": [
																																{
																																	"text": "Seven hundred square feet of lot\narea shall be provided for each guest room."
																																}
																															]
																														},
																														{
																															"number": "[B] ",
																															"content": [
																																{
																																	"text": "Each guest room shall include a\nfull private bathroom."
																																}
																															]
																														},
																														{
																															"number": "[C] ",
																															"content": [
																																{
																																	"text": "Minimum guest room size, including\nprivate bathroom, shall be 325 square feet."
																																}
																															]
																														},
																														{
																															"number": "[D] ",
																															"content": [
																																{
																																	"text": "Maximum floor area ratio (FAR)\nshall be 1.2."
																																}
																															]
																														},
																														{
																															"number": "[E] ",
																															"content": [
																																{
																																	"text": "Gross floor area designated to\npermitted ancillary uses shall not exceed 60% of the gross floor area\nfor all site structures."
																																}
																															]
																														},
																														{
																															"number": "[F] ",
																															"content": [
																																{
																																	"text": "The following U.S. Green Building\nCouncil Materials must be submitted as part of application:"
																																}
																															]
																														},
																														{
																															"number": "[G] ",
																															"content": [
																																{
																																	"text": "Visual buffering within the site\nand along the perimeter of the site shall be provided, inasmuch as\npracticable, to be determined by the Planning Commission during site\nplan review."
																																}
																															]
																														},
																														{
																															"number": "[H] ",
																															"content": [
																																{
																																	"text": "The Planning Commission shall,\nas part of site plan review, request architectural building elevations\nand evaluate same for appropriateness, within the context of the setting\nof the site."
																																}
																															]
																														}
																													]
																												}
																											]
																										},
																										{
																											"number": "[iii] ",
																											"content": [
																												{
																													"text": "Occupancy shall be limited to\ntransients who shall reside in the hotel for not more than 180 days\na year and the minimum rate shall be for a full day; hourly rental\nrates shall not be permitted."
																												}
																											]
																										}
																									]
																								}
																							]
																						},
																						{
																							"number": "[c] ",
																							"content": [
																								{
																									"text": "Convents.[Amended 4-14-2008 by L.L. No. 5-2008]"
																								}
																							]
																						}
																					]
																				}
																			]
																		}
																	]
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Lot area and building requirements."
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "Height. Except as provided in Subsection F(3)(a)[1] and [2] below, no building shall be erected to a height greater than three stories or 38 feet."
																},
																{
																	"content": [
																		{
																			"number": "[1] ",
																			"content": [
																				{
																					"text": "This limitation may be waived by the Planning\nCommission to a height not to exceed 52 feet for buildings located\nadjacent to the existing convent building within an area 325 feet\nin width, the center line of which begins due south of the center\nline of the existing convent building, continuing in a southerly direction\na distance of 400 linear feet."
																				}
																			]
																		},
																		{
																			"number": "[2] ",
																			"content": [
																				{
																					"text": "Chimneys, flues, towers, bulkheads, spires and other decorative features shall be exempt from the provisions of this subsection, provided that they occupy not more than 20% of the area of the roof of the building of which they are a part and do not exceed an additional 10 feet above the maximum height set forth in § 575-43F(3)(a) herein."
																				}
																			]
																		}
																	]
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "Steep slopes. In general, development of areas\nwith a slope of 20% or greater shall be avoided, except for those\nareas of less than 5,000 square feet used for roads."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "Density. The standards set forth in the table below are maximum design densities for various housing types. The overall gross density of any site or site assemblage shall not exceed nine dwelling units per acre; provided, however, that upon award of bonus density pursuant to § 575-43F(3)(d) hereof, such density may be increased not to exceed 11 units per acre."
																},
																{
																	"content": [
																		{
																			"number": "[1] ",
																			"content": [
																				{
																					"text": "Subject to the density limitation in Subsection F(3)(c) above, the following is the maximum density allowed within a given development for each housing configuration:"
																				}
																			]
																		}
																	]
																}
															]
														},
														{
															"number": "(d) ",
															"content": [
																{
																	"text": "Bonus density."
																},
																{
																	"content": [
																		{
																			"number": "[1] ",
																			"content": [
																				{
																					"text": "In the WF-PRD Zone Subarea, an increase in residential\ndensity may be granted by the Common Council upon a finding by the\nCommon Council that the project will provide additional parkland to\nthe City or will otherwise substantially increase public access or\nbeneficial use of the waterfront. In making such a finding, the Common\nCouncil may, in its sole discretion, consider off-site improvements\nto be made by the applicant."
																				}
																			]
																		},
																		{
																			"number": "[2] ",
																			"content": [
																				{
																					"text": "The bonus density granted pursuant to Subsection F(3)(d)[1] shall not exceed one residential unit per acre."
																				}
																			]
																		},
																		{
																			"number": "[3] ",
																			"content": [
																				{
																					"text": "In addition to Subsection F(3)(d)[2] above, an increase in residential density not to exceed one additional unit per acre may be granted by the Common Council upon a finding by the Common Council that the proposed project will result in the rehabilitation and preservation of a building or buildings which the Common Council finds to be of special historic, architectural or design importance to the history and character of the City of Peekskill."
																				}
																			]
																		}
																	]
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "Special permit additional criteria."
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "For special permit applications within WF-PRD, the following criteria are requirements for the issuance of a special permit by the Common Council. No special permit shall be granted pursuant to this section unless the applicant has submitted evidence which, as determined by the Common Council, adequately demonstrates compliance with all of the criteria set forth in this Subsection F(4)(a) and (b)."
																},
																{
																	"content": [
																		{
																			"number": "[1] ",
																			"content": [
																				{
																					"text": "A traffic analysis shall be provided, indicating\nthat peak hour traffic flows generated by the proposed development\ncan be handled at adequate levels of service by the existing street\nsystem and/or proposed improvements to the street system."
																				}
																			]
																		},
																		{
																			"number": "[2] ",
																			"content": [
																				{
																					"text": "An engineer's report shall be provided, which\ncertifies that existing systems, together with improvements to be\nconstructed in conjunction with the development, will have sufficient\ncapacity to provide the following:"
																				},
																				{
																					"content": [
																						{
																							"number": "[a] ",
																							"content": [
																								{
																									"text": "Water fire flows sufficient to\nmeet fire and safety standards for the scale and type of development\nproposed."
																								}
																							]
																						},
																						{
																							"number": "[b] ",
																							"content": [
																								{
																									"text": "Sanitary sewer service connected\nto the existing City system which complies with City and county regulations."
																								}
																							]
																						},
																						{
																							"number": "[c] ",
																							"content": [
																								{
																									"text": "A drainage system which will not\nadversely impact existing development within the same drainage basin."
																								}
																							]
																						}
																					]
																				}
																			]
																		},
																		{
																			"number": "[3] ",
																			"content": [
																				{
																					"text": "For all common property not dedicated to the City of Peekskill or other public agency, the owner shall provide for and establish an organization that will provide for the continued ownership and maintenance thereof, consistent with all applicable state laws and in accordance with § 575-29I herein."
																				}
																			]
																		},
																		{
																			"number": "[4] ",
																			"content": [
																				{
																					"text": "All electrical, telephone, cable television\nand similar equipment shall be installed underground in accordance\nwith the New York State Public Service Commission regulations."
																				}
																			]
																		},
																		{
																			"number": "[5] ",
																			"content": [
																				{
																					"text": "The right-of-way and pavement widths for internal\nroads serving multifamily dwellings shall be sufficient in size, location\nand design to accommodate the maximum traffic, parking and loading\nneeds and access by fire-fighting equipment and police or emergency\nvehicles. The pavement of said roads shall be not less than 24 feet\nwide. All streets to be dedicated shall be subject to all other applicable\nCity ordinances and standards."
																				}
																			]
																		},
																		{
																			"number": "[6] ",
																			"content": [
																				{
																					"text": "The developer shall provide all necessary on-site\nwater and sewer facilities, storm drainage, paved service streets,\ncurbing, sidewalks, parking and loading facilities, lighting, fire\nalarm and other necessary support systems, which shall be connected\nto public utility systems at the nearest feasible point."
																				}
																			]
																		}
																	]
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "Recreational uses and nonresidential uses, including\nbut not limited to parking and loading areas, must be located so as\nto be compatible with nearby residential uses. All such uses must\nbe adequately screened and buffered where adjacent to residential\ndevelopment."
																}
															]
														}
													]
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "G. ",
							"content": [
								{
									"text": "Accessory uses. Accessory uses are limited to the\nfollowing:[Amended 9-26-1995; 7-21-1997]"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Residential uses."
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "Customary home occupations, provided that:"
																},
																{
																	"content": [
																		{
																			"number": "[1] ",
																			"content": [
																				{
																					"text": "No display of goods or signs is visible from\nthe street."
																				}
																			]
																		},
																		{
																			"number": "[2] ",
																			"content": [
																				{
																					"text": "Such occupation is incidental to the residential\nuse of the premises and is carried on in the main building by a resident\nthereof with no more than two assistants or employees who do not reside\non the premises."
																				}
																			]
																		},
																		{
																			"number": "[3] ",
																			"content": [
																				{
																					"text": "Only customary household appliances and equipment\nare used."
																				}
																			]
																		},
																		{
																			"number": "[4] ",
																			"content": [
																				{
																					"text": "Such occupation is conducted in an area not\nexceeding 30% of the total floor area of the residence."
																				}
																			]
																		}
																	]
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "The keeping of not more than three customary\nhousehold pets over six months old, but excluding the commercial breeding\nor keeping of the same."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "Fences or garden walls, limited to four feet\nin height, measured above finished grade. This height restriction\nmay be waived by the Planning Commission for side and rear yard fences\nor garden walls to a height not to exceed 6 1/2 feet if the Planning\nCommission determines that such height will not block views of the\nHudson River."
																}
															]
														},
														{
															"number": "(d) ",
															"content": [
																{
																	"text": "Swimming pools."
																}
															]
														},
														{
															"number": "(e) ",
															"content": [
																{
																	"text": "Off-street parking, including private garages."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Nonresidential uses:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "Off-street parking."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "Enclosed storage."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "Signs, in accordance with the Peekskill Sign\nOrdinance.[6]"
																},
																{
																	"footnote": "[6]\nEditor's Note: See Ch. 468, Signs.\n"
																}
															]
														},
														{
															"number": "(d) ",
															"content": [
																{
																	"text": "Accessory recreation, such as swimming pools\nand tennis courts for use of residents, members or patrons of the\nprincipal use."
																}
															]
														},
														{
															"number": "(e) ",
															"content": [
																{
																	"text": "Fabrication of craft items, such as jewelry,\npottery or woodcraft, provided that retail sales of such items are\nprovided on the premises."
																}
															]
														},
														{
															"number": "(f) ",
															"content": [
																{
																	"text": "Artist lots may have artist galleries or fabrication\nspaces to be used by artist loft occupants, with this space limited\nin size not to exceed 2,500 square feet."
																}
															]
														},
														{
															"number": "(g) ",
															"content": [
																{
																	"text": "Cemetery, accessory to convent, for the residents\nthereof."
																}
															]
														}
													]
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "H. ",
							"content": [
								{
									"text": "Off-street parking.[Amended 9-26-1995; 7-21-1997; 4-14-2008 by L.L. No.\n5-2008; 6-23-2014 by L.L. No. 4-2014; 12-14-2015 by L.L. No. 12-2015]"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Except for the WF-PRD Subarea and for artist lofts in the WF-2 and\nWF-3 Subareas, all parking must be at the side or rear of the building\nit is provided for. Artist loft parking areas may be defined by the\nPlanning Commission."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Minimum requirements."
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "The following minimum off-street parking requirements shall\napply:"
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "All or portions of the off-street parking requirements may be\nwaived by the Planning Commission upon an affirmative finding that\nthe following conditions have been satisfied:"
																},
																{
																	"content": [
																		{
																			"number": "[1] ",
																			"content": [
																				{
																					"text": "The proposed use is within 500 feet for residential or 1,000\nfeet for other uses of a municipally operated off-street parking facility,\nsuch distance to be measured from the midpoint of the front street\nlot line."
																				}
																			]
																		},
																		{
																			"number": "[2] ",
																			"content": [
																				{
																					"text": "The Planning Commission shall, at the time of site plan approval,\ncertify on such plan that the municipally operated off-street parking\nfacility has adequate capacity for storage of passenger vehicles generated\nby activities proposed to be conducted on the subject lot in addition\nto those generated by any other uses already serviced or programmed\nby such off-street parking facility."
																				}
																			]
																		},
																		{
																			"number": "[3] ",
																			"content": [
																				{
																					"text": "On parcels less than 10,000 square feet, if parking adequate\nto meet the standards of this chapter, as determined by the Planning\nCommission, is available within 1,000 feet, a payment in lieu of providing\noff-street parking shall be made to the City in amounts set by the\nCommon Council for each required space that is waived. This payment\nwill be deposited in a special parking fund, to be used solely for\nthe purpose of providing off-street parking in the Waterfront District."
																				}
																			]
																		},
																		{
																			"number": "[4] ",
																			"content": [
																				{
																					"text": "On parcels 10,000 square feet or greater, if parking adequate\nto meet the standards of this chapter, as determined by the Planning\nCommission, is available within 500 feet for residential or 1,000\nfeet for other uses, a maximum of 20% of the required parking can\nbe waived upon payment of a fee in amounts set by the Common Council\nfor each required space that is waived."
																				}
																			]
																		},
																		{
																			"number": "[5] ",
																			"content": [
																				{
																					"text": "Where two or more uses exist on the same lot, the total amount\nof parking space to be provided shall be the sum of the requirements\nfor each individual use on the lot. However, the total parking requirement\nmay be reduced if a shared parking analysis demonstrates to the Planning\nCommission's satisfaction that such shared parking will be adequate\nto service all uses within the site."
																				}
																			]
																		},
																		{
																			"number": "[6] ",
																			"content": [
																				{
																					"text": "The Common Council may waive the above fee requirements if parking\nadequate to meet the standards of this chapter, as determined by the\nPlanning Commission, is provided within 500 feet for a residential\nuse or 1,000 feet for other uses or if other appropriate arrangements,\nas determined by the Planning Commission, can be made for private\noff-site parking within 500 feet for residential use or 1,000 feet\nfor other uses."
																				}
																			]
																		},
																		{
																			"number": "[7] ",
																			"content": [
																				{
																					"text": "The Planning Commission may reduce the off-street parking requirements\nby up to 15% where the development is within one-third of a mile of\nthe Peekskill train station."
																				}
																			]
																		}
																	]
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Bicycle parking. The Planning Commission may require the provision\nof appropriate bicycle parking (secure bicycle storage areas, bike\nlockers, and/or bike racks) for larger residential, commercial, or\nmixed-use projects."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "I. ",
							"content": [
								{
									"text": "Off-street loading requirements. All off-street loading shall take place on the lot of the principal use. Loading units shall be provided in accordance with § 575-22F. None of the loading areas may front on the street, This requirement may be reduced or waived by the Planning Commission where it determines that, as a result of the size of trucks, number of trucks and frequency of deliveries associated with the use, such waiver will have no negative impact upon traffic, parking and pedestrian safety."
								}
							]
						},
						{
							"number": "J. ",
							"content": [
								{
									"text": "Special design district. This district shall constitute\na special design district under § 575-56B(1)(d)."
								}
							]
						},
						{
							"number": "K. ",
							"content": [
								{
									"text": "Site plan review. The Design Guidelines for the Waterfront\nDistrict are hereby deemed additional criteria for the evaluation\nof applications for site plan approval.[7] In reviewing site plans which do not require a special\npermit, pursuant to this section, the Planning Commission shall consider\nthe design guidelines for the WF District, and no site plan shall\nbe approved unless the Planning Commission first makes an affirmative\nfinding that a site plan is consistent with the Design Guidelines\nto the maximum extent possible."
								},
								{
									"footnote": "[7]\nEditor's Note: The Design Guidelines for the\nWaterfront District are included as an attachment to this chapter.\n"
								}
							]
						},
						{
							"number": "L. ",
							"content": [
								{
									"text": "Special permit and site plan application procedures."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "The applicant shall submit a preliminary site plan\nmap at a minimum scale of one inch equals 30 feet to the Director\nof Planning, Development and Code Enforcement. The preliminary site\nplan, which shall be accompanied by a special permit application,\nshall clearly show the following:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "The disposition of various land uses and the\narea covered by each, in acres."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "The general outline of the interior road system\nand all existing and proposed rights-of-way and easements, whether\npublic or private."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "Calculation and delineation of areas covered by bodies of water, slopes of 20% and over and rock outcroppings as defined in § 575-28E(4)(b)."
																}
															]
														},
														{
															"number": "(d) ",
															"content": [
																{
																	"text": "Delineating of the various residential areas,\nindicating the number of dwelling units by each housing type: attached\ndwellings, garden apartments and mid-rise apartments, plus a calculation\nof the parcel density in dwelling units per gross parcel acreage."
																}
															]
														},
														{
															"number": "(e) ",
															"content": [
																{
																	"text": "The interior common open space system and a\nstatement as to how it is to be preserved as such throughout the life\nof any portion of the planned residential development and how it is\nto be owned and maintained."
																}
															]
														},
														{
															"number": "(f) ",
															"content": [
																{
																	"text": "Appropriate site plan elements as specified in § 575-56E."
																}
															]
														},
														{
															"number": "(g) ",
															"content": [
																{
																	"text": "Evidence and documentation demonstrating compliance\nwith the goals and standards of the WF Zoning District."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "The Director of Planning, Development and Code Enforcement\nshall review the preliminary site plan and all related documents and,\nwithin 30 days of its submission, shall certify as to whether the\napplication is complete and whether the proposal meets all the general\nrequirements herein. If the application is not complete or does not\nmeet these general requirements, it shall be returned to the applicant\nwith the deficiencies noted."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Following certification as outlined in Subsection L(2) above, the Director of Planning, Development and Code Enforcement shall forward the application to the Common Council. The Common Council shall refer the application to the Planning Commission for a recommendation on the special permit and review of the preliminary plan. The Planning Commission shall render and issue a report recommending either approval, denial or approval with conditions within 45 days of the date of referral by the Common Council. Upon request of the Planning Commission, the Common Council may extend the time for a report for an additional 45 days."
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "Findings. The report shall, at a minimum, include\nthe following findings:"
																},
																{
																	"content": [
																		{
																			"number": "[1] ",
																			"content": [
																				{
																					"text": "That the proposal conforms to the Comprehensive\nPlan, as amended, duly adopted by the Peekskill Planning Commission."
																				}
																			]
																		},
																		{
																			"number": "[2] ",
																			"content": [
																				{
																					"text": "That the proposal meets all of the general requirements of Subsection L and is consistent to the maximum extent possible with the Design Guidelines."
																				}
																			]
																		},
																		{
																			"number": "[3] ",
																			"content": [
																				{
																					"text": "That the proposal is conceptually sound in that\nit meets community needs in the layout of the proposed functional\nroadway system, in its land use configuration, open space and drainage\nsystems and in the scale of the elements, both absolute and as they\nrelate to one another."
																				}
																			]
																		}
																	]
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "A report recommending denial shall state clearly\nthe reasons therefor."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "Application for final site plan and, where appropriate,\nplat approval shall conform to the requirements described in § 575-28E(11),\n(12), (13) and (14)."
												}
											]
										}
									]
								}
							]
						}
					]
				},
				{
					"footnote": "[1]\nEditor's Note: See also Art. III, Supplementary\nDistrict Regulations.\n"
				}
			]
		}
	]
}