{
	"url": "http://ecode360.com/6432381",
	"paras": [
		{
			"paragraph": "§ 575-7",
			"title": "Applicability.",
			"content": [
				{
					"text": "Unless otherwise noted the following regulations\napply to all zoning districts."
				}
			]
		},
		{
			"paragraph": "§ 575-8",
			"title": "Visibility at intersections.",
			"content": [
				{
					"text": "At all street intersections, no obstruction\nto vision (other than existing buildings, posts, columns or trees)\nexceeding 30 inches in height above street level shall be erected\nor maintained on any lot within the triangle formed by the street\nlines of such lot and a line drawn between points along such street\nlines 40 feet distant from their point of intersection."
				}
			]
		},
		{
			"paragraph": "§ 575-9",
			"title": "Trailers.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "The storage or parking and use of a trailer by any person or persons, except as hereinafter provided, is prohibited in each and all districts enumerated in Article II herein, except that storage or parking of such trailers may be conducted in garages, provided such trailer is not placed in use and the doors thereof are kept securely locked."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "A temporary permit for the placing and use of a trailer\non a lot may be issued by the Director of City Services in connection\nwith any construction for which a building permit has been issued.\nSuch permit shall be for a period of not more than six months but\nmay be renewed at the discretion of the Director of City Services\nif work on said construction is proceeding diligently. A fee, as designated\nin the City fee schedule,[1] shall accompany the application for a temporary permit.\nIn addition thereto, the applicant shall furnish a letter of credit,\nother liquid asset, or a cash deposit in the amount of $500, to the\nsatisfaction of the Corporation Counsel and City Comptroller, conditioned\non the removal of said trailer by the applicant on or before the expiration\ndate of the permit and any extension thereof.[Amended 5-13-2002 by L.L. No. 1-2002]"
								},
								{
									"footnote": "[1]\nEditor's Note: See Ch. 275, Fees.\n"
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 575-10",
			"title": "Automobile facilities and public garages.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Separating distances."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "No automobile facility or public garage shall be located\nwithin 400 feet as measured along the street line or the boundary\nline of any residence district or of any school, place of worship,\npark, playground, hospital or public library or any place of public\nassembly designed for the simultaneous use of 100 persons or more."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "No automobile gasoline service station and no gasoline\nor oil pump or auto service appliance, unless within a building, shall\nbe permitted on a lot that is within 800 feet, as measured from the\nclosest property line of each, of another lot on which there is an\nexisting automobile gasoline service station or outdoor gasoline or\noil pump or auto service appliance, or of another lot for which a\nbuilding permit has been issued for the erection of such a station,\npump or service appliance."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "No building which houses an automobile facility shall\nbe within 50 feet of any street line. No gasoline or oil pump or service\nappliance shall be within 20 feet of any street line. No access point\nshall be within 50 feet of an intersection of two streets."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "Where storage of such materials is permitted, all\nautomobile parts, wrecked or damaged motor vehicles or similar articles\nshall be stored within a building. In no case shall any vehicle requiring\nrepair be stored outdoors for a period exceeding two days. All repair\nwork shall be conducted fully within an enclosed building."
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "No building which houses an automobile facility shall\nbe located closer than 30 feet to a residential property line or residential\nzone district boundary."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Minimum lot size; minimum lot dimensions."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "No automobile facility or public garage shall be permitted\non a lot with lot size or dimensions less than that required for the\ndistrict in which the lot is located."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Multiple uses on a lot. When more than one automobile\nfacility is located on one lot, the minimum square footage for the\ndistrict shall be required for each use. For facilities located in\nthe C-1, C-1A, M-2 and M-3 Districts, the minimum areas are prescribed\nbelow."
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "Regardless of the minimum lot area required\nfor the district, the minimum area designated for each minor auto\nrepair facility shall be 10,000 square feet for the first bay and\n5,000 square feet per bay for each additional bay."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "Regardless of the minimum lot area required\nfor the district, the minimum area designated for each major auto\nrepair facility and auto body and paint shop shall be 10,000 square\nfeet per bay for each bay."
																}
															]
														}
													]
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Landscaping and screening requirements."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Front yard landscaping. Automobile facilities shall\nhave a front landscaped strip for 2/3 of the street frontage consisting\nof at least one street tree and planted with no more than 25% of grassy\narea."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Side and rear yard landscaping and screening. A fifteen-foot\nlandscaped buffer will be required for all automobile facilities abutting\nresidential uses and/or residential zone districts. The landscaped\nisland will include:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "A decorative fence of no less than six feet\nin height which will screen at a minimum all parking areas, pumps\nand outdoor displays."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "Trees planted along the fence of no less than\ntwo-and-one-half-inch caliper deciduous or evergreens five feet in\nheight and planted no more than 15 feet on center."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "A planting strip other than grassed area with\na minimum 10 feet in width and properly curbed to protect the plantings\nand fence."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Foundation planting. A raised planter with a minimum\ndepth of five feet shall be installed on all sides of the building\nwhich are exposed to the street or visible from adjacent residential\nproperties, but exclusive of entryways."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "All dumpsters and refuse storage areas shall be fully\nscreened from the street and adjacent properties."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "Internal circulation and vehicle reservoir capacity."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "The paved areas on the site for automobile facilities\nshall be laid out so as to provide for automobile circulation and\nloading sufficiently free as to preclude vehicles waiting on the street\nor blocking the right-of-way before gaining entrance."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Parking shall be provided as per § 575-33G(2) of these regulations."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "A minimum of four stacking spaces per pump island\nside will be required for automobile gasoline service stations."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "Convenience stores as accessory use to an automobile\ngasoline service station."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Convenience stores as defined in § 575-60 may be permitted as an accessory use to automobile gasoline service stations if the applicant can demonstrate to the satisfaction of the Planning Commission that it meets the following minimum standards:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "In addition to other parking requirements, one\nparking space per 300 square feet of retail space shall be provided\non site."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "No video games are included within the proposed\nvideo store."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "Hours of operation shall be from 6:00 a.m. to\n12:00 p.m.; however, the Planning Commission, at its sole discretion,\nmay further limit the hours of operation to limit potential impacts\non adjoining uses."
																}
															]
														},
														{
															"number": "(d) ",
															"content": [
																{
																	"text": "No more than 1/3 of the gross floor area of\nthe building shall be used for the convenience store."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Convenience stores shall not be permitted as an accessory\nuse unless the property meets the minimum bulk requirements for the\nzoning district in which it is located."
												}
											]
										}
									]
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 575-11",
			"title": "Minimum livable floor area.",
			"content": [
				{
					"text": "In a One-Family Residence R-1 District the minimum\nlivable floor area for one-family houses shall be 1,200 square feet,\nand in a One-Family Residence R-2 District such area shall be 1,000\nsquare feet. In all other residence districts the minimum livable\nfloor area for one-family houses shall be 1,000 square feet. For two-,\nthree- or four-family houses in any district, the minimum livable\nfloor area shall be 600 square feet per unit."
				}
			]
		},
		{
			"paragraph": "§ 575-12",
			"title": "Off-street parking.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Off-street parking."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Wherever an off-street parking area of three or more\nspaces faces a street or a property line in a residential district,\na planting area of a minimum width of three feet with plantings at\nleast three feet high planted three feet on center shall be provided\nbetween the parking area and the sidewalk, or where no sidewalk exists,\nsuch planting strip shall be provided between the parking lot and\nthe property line. The planting plan for this strip shall be approved\nby the Planning Commission as part of the site plan review."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Further, not more than 12 parking spaces shall be\npermitted in a continuous row and not more than 20 spaces shall be\npermitted in a single parking area without being interrupted by landscaping\napproved by the Planning Commission."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Two or more uses on the same lot. Except as specified\nhereinafter, where two or more different uses occur on a single lot,\nthe total amount of parking facilities to be provided shall be the\nsum of the requirements, if any, for each individual use on the lot.\nIn the case of two or more establishments on the same lot or on contiguous\nlots, the Planning Commission may approve the joint use of parking\nspace, the total capacity of which is less than the sum of the spaces\nrequired for each and using the same driveways giving access thereto,\nprovided that said Commission finds that the capacity to be provided\nwill substantially meet the intent of the requirements by reason of\nvariation in the probable time of maximum use by patrons or employees\namong such establishments, and provided that such approval of such\njoint use shall be automatically terminated upon the termination of\nthe operation of any such establishments."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Layout and location of off-street parking facilities."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "The plans for any new building or enlargement of floor\narea in an existing building shall show specifically the location\nand size of the off-street parking facilities required to comply with\nany applicable requirements hereof and the means of access to such\nspace from the public streets or highways."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Each required space, exclusive of drives and aisles,\nshall be not less than 18 feet long nor less than nine feet wide.\nEach parking space shall have access from a public way or private\ndriveway. Except as may be otherwise provided, required off-street\nparking facilities may be enclosed in a structure or may be located\nin the open, provided that all required parking facilities shall be\ngraded, surface-drained and maintained to the extent necessary to\navoid nuisances of dust, erosion or excessive water from entering\npublic ways. Upon a determination by the Planning Commission that\nthe required number of parking spaces would be greatly in excess of\nthe need therefor of a particular use on a given lot, said Commission\nmay waive the requirement that such spaces be surfaced to the extent\nthat it may deem the number required to exceed the actual need therefor."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "Location and ownership of required accessory parking\nfacilities. Required accessory parking spaces, open or enclosed, may\nbe provided upon the same lot as the use to which they are accessory\nor anywhere within 500 feet walking distance of such lot. In all cases\nsuch parking spaces shall conform to all the regulations of the district\nin which they are located, and in no event shall such parking spaces\nbe located in any district in which nonaccessory off-street parking\nlots are not specifically permitted. Such spaces shall be in the same\nownership as the use to which they are accessory and shall be subject\nto deed restriction, filed with the County Clerk, binding the owner\nand his heirs and assigns to maintain the required number of spaces\navailable either throughout the existence of the use to which they\nare accessory or until such spaces are provided elsewhere."
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "Operation and maintenance of off-street parking facilities.\nRequired off-street parking facilities shall be maintained throughout\nthe life of any use or structure which said facilities are designed\nto serve. Required parking areas developed for specific structures\nand uses shall be reserved at all times for the use of those persons\nwho are employed at or making use of such structures and uses, except\nwhen dedicated to and accepted by the City as public parking areas."
								}
							]
						},
						{
							"number": "F. ",
							"content": [
								{
									"text": "Effect of parking requirements on existing uses. Structures\nand land uses in existence or for which building permits shall have\nbeen approved on the effective date of this chapter shall not be subject\nto the requirements for off-street parking spaces set forth in this\nchapter, provided that any parking facilities not existing to serve\nsuch structures or uses shall not, in the future, be reduced, except\nwhere they exceed such requirements, in which case they shall not\nbe reduced below such requirements. Required parking facilities for\nsuch structures or uses, as well as any future enlargement or extension\nthereof, shall, however, be provided as a condition for the issuance\nof any building permit for such enlargement or extension. In case\nof practical difficulty or unnecessary hardship arising out of this\nrequirement, the Zoning Board of Appeals shall require only such degree\nof compliance as it may deem reasonable for that part of the structure\nor use that is legally nonconforming, but shall not waive any part\nof the requirement for the part of the structure or use that constitutes\nan enlargement or extension and shall not permit reduction or elimination\nof whatever quantity of parking may already be in existence unless\nit is in excess of such requirements, provided that nothing herein\nshall be deemed to limit any power of said Board that is conferred\nby law. Required off-street parking facilities which, after development,\nare dedicated to and accepted by the City shall be deemed to continue\nto serve the uses or structures for which they were originally provided."
								}
							]
						},
						{
							"number": "G. ",
							"content": [
								{
									"text": "In order to prevent any increase of traffic congestion\non City streets, to provide adequate space for off-street parking\nand maneuvering, to encourage the use of off-street parking space\nby automobile operators and for the purpose of assuring that space\ndesigned for off-street parking does not adversely affect abutting\nproperties or the surrounding neighborhood, the following regulations\nshall apply in all residential districts, and on all lots in any other\ndistrict used for residential purposes:[Added 6-9-2003 by L.L. No. 9-2003; amended 5-14-2007 by Ord. No. 3-2007; 5-12-2008 by L.L. No. 7-2008; 5-26-2009 by L.L. No. 12-2009; 12-14-2009 by L.L. No.\n20-2009; 12-27-2010 by L.L. No. 2-2011]"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Driveways and other off-street parking areas shall be well defined\nand constructed of asphalt, concrete, brick pavers, stone pavers or\ngravel. Additionally, surface or subsurface water shall not be directed\nto adjacent parcels for all driveways and/or parking areas."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Each lot shall contain no more than one curb cut constructed pursuant to § 505-10."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "All driveways shall be laid out and constructed as directly as possible\nfrom the curb cut to the residential structure, the side yard as permitted\nbelow, or garage."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "The following regulations shall apply to new driveways and parking\nareas to be constructed (pursuant to a building permit) on vacant\nparcels as part of the construction of a new residential structure\non or after the effective date of this subsection. The design for\na new driveway or parking area shall incorporate the most current\nstormwater management regulations in place at the time of application."
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "The driveway shall be no wider than 10 feet wide."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "All driveways must lead directly to a garage."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "Where an attached garage is provided the driveway shall be no wider than 10 feet wide per garage bay, with a maximum of two bays and, except as is provided in Subsection G(8)(a) below for additional off-street parking, shall not extend past the side of the residential structure."
																}
															]
														},
														{
															"number": "(d) ",
															"content": [
																{
																	"text": "Where a detached garage is provided the driveway shall be no\nwider than 10 feet, but may be increased to the width of the garage\n20 feet in front of the front wall of the garage structure (maximum\nof two bays)."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "The following regulations shall apply to all improved parcels in\nexistence on the effective date of this subsection and do not currently\nhave off-street parking. The applicant shall design off-street parking\nusing one of the options listed below as follows:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "Not more than 400 square feet of a rear yard, not to exceed\n50% thereof, may be paved with asphalt, concrete, brick pavers, or\nstone pavers for a parking area. The 400 square feet of parking area\nshall be located no closer than two feet from a side or rear property\nline."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "Paving in a side yard may not be more than 10 feet wide for\na parking area."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "If parking cannot be achieved in accordance with Subsection G(5)(a) and (b) above, then not more than 200 square feet of a front yard may be paved with brick pavers or stone pavers or other decorative material that is acceptable to the City. This parking area may be increased by an additional 200 square feet with the addition of a four-foot planting strip to provide adequate screening from adjacent parcels."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(6) ",
											"content": [
												{
													"text": "The provisions of Subsection G(5) above shall not be applied to any nonconforming driveway or parking area that was in existence on the effective date of this subsection unless and until such driveway or parking area shall be reconfigured or expanded, at which time the driveway or parking area shall be reconfigured or expanded in compliance with Subsection G(5) above."
												}
											]
										},
										{
											"number": "(7) ",
											"content": [
												{
													"text": "All driveways and additional parking areas are considered to be impervious\nsurfaces and shall be included in calculating the area of total impervious\nsurfaces located on a lot regardless of the materials of which they\nare constructed."
												}
											]
										},
										{
											"number": "(8) ",
											"content": [
												{
													"text": "One additional off-street parking space as defined in § 575-60 beyond that provided on a permitted driveway may also be provided in the following locations:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "On the side of the main garage structure provided that an attached\ngarage or a garage going under the residential structure has been\nconstructed; such space shall be no closer to the street than the\nfront plane of the residential structure with access from the driveway,\nbut no such additional parking area shall encroach into any required\nside yard."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "In the rear yard as either an extension of any additional side yard parking area allowed under Subsection G(5)(b) above or as a one-space bump out of a driveway leading to a detached garage located in the rear of the main residential structure."
																}
															]
														}
													]
												}
											]
										}
									]
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 575-13",
			"title": "Landscaping.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "For all uses other than one-, two- or three-family\nhouses, the entire lot, except areas covered by buildings or surfaced\nas parking or service areas, but in no case less than 10% of the lot\narea (except in the C-2 District), shall be suitably landscaped. In\nlandscaped areas, not less than 25% shall be planted with growth other\nthan grass. Where lot lines coincide with one residence district boundary,\nthere shall be planted evergreen trees of such type and spacing as\nmay be required by the Planning Commission, of an initial height of\nnot less than five feet and adequate ultimately to screen all operations\non the lot from the view of properties in the adjoining residence\ndistrict. All landscaping shall be properly maintained throughout\nthe life of any use on any lot. Existing walls or trees with a diameter\nof eight inches as measured three feet from the base of the trunk\nwithin 30 feet of any street line or 50 feet of any residence district\nboundary shall not be removed except with the approval of the Planning\nCommission."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "A landscaping plan prepared by a landscape architect\nor qualified landscaper shall be submitted as part of the site plan."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 575-14",
			"title": "Open-front stores, outdoor vending machines and outdoor storage, display or sales.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Except as specified hereinafter, no open-front store\nor other open-front place of business or outdoor vending machine or\noutdoor display, storage or sales of groceries, foodstuffs, building\nmaterials, vehicles, machinery or other substances or products shall\nbe maintained, conducted or used in the City of Peekskill, and all\nbusinesses, services and processes shall be conducted wholly within\ncompletely enclosed buildings. The provisions of this section shall\nnot apply to the following uses if such uses are otherwise permitted\nin a district:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "The sale of automobile fuel, lubricants and accessories\nat automobile service stations."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "The operation of lumber- or building supply yards."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "The storage and sale of coal and fuel in duly conducted\ncoal and fuel supply yards."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "Off-street parking of passenger automobiles or trucks\nof not more than 2 1/2 tons' capacity."
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "Off-street loading."
												}
											]
										},
										{
											"number": "(6) ",
											"content": [
												{
													"text": "Horticultural nurseries."
												}
											]
										},
										{
											"number": "(7) ",
											"content": [
												{
													"text": "Ice machines."
												}
											]
										},
										{
											"number": "(8) ",
											"content": [
												{
													"text": "Sidewalk cafe."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "In appropriate cases and in accordance with the requirements set forth in § 575-57C hereof, the Common Council may issue a special permit permitting any open use otherwise prohibited under the terms of this section in a commercial or manufacturing district and outdoor vending machines in a commercial district, provided that under no circumstances will a vending machine be permitted to be placed on a public sidewalk or in any location where the use of said machine by motorists would, in the opinion of the Common Council, create a traffic hazard or impediment to the free flow of traffic on any street.[1]"
								},
								{
									"footnote": "[1]\nEditor's Note: See also Art. X of Ch. 505, Streets and Sidewalks.\n"
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 575-15",
			"title": "Location of accessory buildings on lot.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Accessory uses shall conform to rear, side and front\nyards as are provided for accessory uses in each district. In the\nevent that, due to topographic conditions, practical difficulties\nwould be caused by this requirement with respect to the location of\ngarages, the Zoning Board of Appeals may authorize the issuance of\na variance for the erection of such garages within not less than 10\nfeet of the street line where the natural slope of the ground within\n25 feet of the street line is between 12% and 20% and within not less\nthan five feet of the street line where such slope within 25 feet\nof said line exceeds 20%."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "However, in no case, notwithstanding the foregoing\nprovisions, shall a garage or accessory building be permitted to be\nlocated closer than 20 feet to the street line of a county road or\nstate highway."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 575-16",
			"title": "Exceptions to yard requirements.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Cornices or cantilevered roofs may project not more\nthan two feet, and belt courses, windowsills and other ornamental\nfeatures may project not more than six inches, into a required yard.\nGarages so designed as to allow the use of the roof thereof as part\nof the grounds may be erected in side or rear yards, not nearer than\nfour feet to any property line, provided the average height of such\nwall or walls thereof which face a side lot line or a rear lot line\nis not in excess of 6 1/2 feet above the average level of such\nlot line. The side yard provision may be eliminated, but not reduced,\nalong any portion of one lot line where a building erected on an adjoining\nlot is built to the lot line, provided that in such event the second\nside yard shall be increased to a minimum width of two times the width\notherwise required."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Paved terraces, platforms, stoops, steps and walls\nshall not project within 10 feet of a street line or four feet of\na property line.[Amended 12-12-1988]"
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 575-17",
			"title": "Frontage.",
			"content": [
				{
					"text": "In all residential districts other than the\nPlanned Residential Development District, each lot and structure thereon\nshall face a public street and shall have a minimum frontage not less\nthan 2/3 of the minimum lot width. Lots in the Planned Residential\nDevelopment District shall be required to be related to existing or\nproposed public streets or highways as determined by the Planning\nCommission."
				}
			]
		},
		{
			"paragraph": "§ 575-18",
			"title": "Prohibited uses.",
			"content": [
				{
					"text": "Any use not specifically listed in this chapter\nas a permitted use or as a use permitted by special permit in a particular\nzone shall be prohibited in that zone."
				}
			]
		},
		{
			"paragraph": "§ 575-19",
			"title": "Local waterfront revitalization program.",
			"content": [
				{
					"text": "In addition to the requirements set forth in this Chapter 575 of the Code of the City of Peekskill, the City of Peekskill Local Waterfront Revitalization Program, adopted December 14, 2015, as it may be amended from time to time, shall apply to all properties located within the City of Peekskill Local Waterfront Revitalization Program boundaries, and compliance with the City of Peekskill Local Waterfront Revitalization Program Consistency Law, Chapter 365 of the Peekskill City Code, is required. A copy of the City of Peekskill Local Waterfront Revitalization Program is available in the office of the Peekskill City Clerk."
				}
			]
		},
		{
			"paragraph": "§ 575-19.1",
			"title": "Outdoor accessory recreation.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Outdoor accessory recreation requires a minimum lot size of one acre,\nsubject to the following:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Such recreation shall be deemed to be a structure and shall\nnot be located less than 30 feet from the side and rear lot lines."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Such recreation shall be located in the side or rear yards."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "No illumination of the facility of any kind shall be allowed."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "Screening of the recreation use shall be provided from the view\nof adjacent properties."
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "No loudspeaker or amplifying device shall be permitted."
												}
											]
										}
									]
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 575-20",
			"title": "Intent.",
			"content": [
				{
					"text": "The residence districts established in this\nchapter are designed to promote and protect public health, safety\nand general welfare. These general goals include, among others, the\nfollowing specific purposes:"
				},
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "To provide sufficient space in appropriate locations\nfor residential development to meet the housing needs of the City's\npresent and expected future population with due allowance for the\nneed for a choice of sites."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "To protect residential areas against fire, explosions,\ntoxic and noxious matter, radiation and other hazards, and against\noffensive noise, vibration, smoke and other particulate matter, odorous\nmatter, heat, humidity, glare and other objectionable influences."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "To protect residential areas, as far as possible,\nagainst heavy traffic and against through traffic of all kinds."
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "To protect residential areas against congestion, as\nfar as possible, by regulating the density of population and the bulk\nof buildings in relation to the land around them and to one another,\nand by providing for off-street parking spaces; to require the provision\nof open space in residential areas wherever practicable; and to encourage\nthe provision of additional open space by permitting moderately higher\nbulk and density with better standards of open space in order to open\nup residential areas to light and air, to provide open areas for rest\nand recreation, to break the monotony of continuous building bulk\nand thereby to provide a more desirable environment for urban living."
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "To protect the character of certain designated areas\nof historic and architectural interest where the scale of building\ndevelopment is important."
								}
							]
						},
						{
							"number": "F. ",
							"content": [
								{
									"text": "To provide for access of light and air for windows\nand for privacy, as far as possible, by controls over the spacing\nand height of buildings and other structures."
								}
							]
						},
						{
							"number": "G. ",
							"content": [
								{
									"text": "To provide appropriate space for those educational,\nreligious, recreational, health and similar facilities which serve\nthe needs of the nearby residents, which generally perform their own\nactivities more effectively in a residential environment and which\ndo not create objectionable influences."
								}
							]
						},
						{
							"number": "H. ",
							"content": [
								{
									"text": "To promote the most desirable use of land and direction\nof building development in accord with a well-considered plan; to\npromote stability of residential development; to protect the character\nof the district and its peculiar suitability for particular uses;\nto conserve the value of land and buildings; and to protect the City's\ntax revenues."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 575-21",
			"title": "Purposes of specific residence districts.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "R-1A and R-1B One-Family Detached Residence Districts.\nThese districts are designed to provide a suitable open character\nfor single-family detached dwellings at low densities. These districts\nalso include community facilities and open uses which serve the residents\nof these districts or are benefited by an open residential environment."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "R-1C One-Family Detached Residence District. This\ndistrict is designed to provide a suitable open character for single-family\ndetached dwellings at medium densities, while preserving open space\nto the greatest extent practicable and preventing excessive on-street\nparking."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "R-2 One- and Two-Family Residence District. This district\nis designed to provide a suitable open character for single-family\ndetached dwellings at medium densities, while providing limited opportunities\nfor two-family structures on lots large enough to accommodate adequate\noff-street parking and suitable open space."
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "R-3 One-, Two- and Three-Family Residence District.\nThis district is designed to provide a suitable open character for\nsingle-family detached dwellings at medium densities, while providing\nlimited opportunities for two- and three-family structures on lots\nlarge enough to accommodate off-street parking and open space."
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "R-4, R-5 and R-6 Residence Districts. These districts\nare designed to provide for all types of residential buildings in\norder to permit a broad range of housing types, with appropriate standards\nfor each district on density, open space and spacing of buildings.\nThe various districts are mapped in relation to a desirable future\nresidential density pattern with emphasis upon accessibility to transportation\nfacilities and to various community facilities and upon the character\nof existing development. These districts also include community facilities\nand open uses which serve residents of these districts or are benefited\nby an open residential character."
								}
							]
						},
						{
							"number": "F. ",
							"content": [
								{
									"text": "Planned Residential Development District. This district\nis designed to permit a range of housing types mixed together at a\nmoderate density on large sites for which flexibility in the regulations\nfor building bulk and placement is desirable due to the nature of\nthe topography, configuration of the site and the desirability for\nthe preservation of natural features, scenic areas, historic sites\nand/or open spaces. This district will be located based upon accessibility\nto transportation facilities and to various community facilities."
								}
							]
						}
					]
				},
				{
					"footnote": "[1]\nEditor's Note: This ordinance also repealed\nformer § 300-20, Purposes of specific residence districts.\n"
				}
			]
		},
		{
			"paragraph": "§ 575-27",
			"title": "R-6 Central Multiple Residence District.\n                                                                                          [1]",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Permitted uses. No building or premises shall be used,\nand no building or part of a building shall be erected which is arranged,\nintended or designed to be used, in whole or in part, for any purpose\nexcept the following:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Any principal permitted use in the R-4 District, in accordance with the requirements of § 575-25A(1) of said district."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Uses subject to the issuance of a special permit.[Amended 7-29-1996; 7-11-2005 by L.L. No. 15-2005; 1-9-2006 by L.L. No. 1-2006; 5-29-2012]"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "The following uses are permitted subject to the issuance of a special permit by the Director of Planning upon authorization by the Common Council in accordance with the provisions of § 575-57 herein and subsequent approval by the Planning Commission of a site plan in accordance with the provisions of § 575-56 herein:[Amended 10-17-2016 by L.L. No. 7-2016]"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "Housing, congregate care, assisted living residences and nursing\nhome facilities for senior citizens:"
																},
																{
																	"content": [
																		{
																			"number": "[1] ",
																			"content": [
																				{
																					"text": "The site shall be a minimum of two acres, except\nin instances where a senior housing facility is proposed to be developed\non a lot or lots immediately adjacent to a site having an existing\nsenior housing facility or senior citizen congregate care and/or nursing\nhome facility for senior citizens. In such instances, the minimum\nsite shall be one acre or as determined by the Planning Commission."
																				}
																			]
																		},
																		{
																			"number": "[2] ",
																			"content": [
																				{
																					"text": "Maximum permitted density shall not exceed 1.5 patient beds or one dwelling unit or a prorated combination of the above per 2,000 square feet of land area, subject to the bonus density credits set forth in Subsection B(1)(a)[8] herein. A superintendent's unit limited to single-person occupancy shall not be counted towards the maximum permitted density."
																				}
																			]
																		},
																		{
																			"number": "[3] ",
																			"content": [
																				{
																					"text": "Building coverage shall not exceed 25%, and\nimpervious coverage shall not exceed 50%."
																				}
																			]
																		},
																		{
																			"number": "[4] ",
																			"content": [
																				{
																					"text": "Subject to the provisions of § 300-27B(1)(a)[9]\nherein, building setbacks from all property lines for all structures\nshall be a minimum of 50 feet; however, where a senior housing facility\nis proposed to be developed on a lot or lots immediately adjacent\nto a site having an existing senior housing facility or senior citizen\ncongregate care and/or nursing home facility for senior citizens the\nsetback requirement for the shared boundary line shall only require\nthat the principal buildings on the adjacent lots be a distance of\nat least 50 feet from each other, and all setback requirements shall\nbe determined by the Planning Commission, which shall be authorized\nto grant a waiver for such setback requirements."
																				}
																			]
																		},
																		{
																			"number": "[5] ",
																			"content": [
																				{
																					"text": "One parking space shall be provided for each\nperson employed on the maximum shift, including staff doctors, if\nany, plus one parking space per four nursing home or assisted-living\npatient-resident beds, plus one parking space per senior housing dwelling\nunit. The Common Council may waive a portion of the parking requirement\nif, in its sole authority, the Common Council determines, based upon\na showing by the applicant, that such a waiver is warranted due to\nvariation in the probable time of maximum use by employees, residents\nand their guests, the provision of shuttle buses or other site-based\ntransportation or such other evidence as is provided by the applicant\nto the satisfaction of the Common Council."
																				}
																			]
																		},
																		{
																			"number": "[6] ",
																			"content": [
																				{
																					"text": "One loading space shall be provided for the\nfirst 100 nursing home or assisted-living-unit patient-resident beds,\nper 50 unassisted senior housing dwelling units or prorated portions\nthereof, and one additional loading space shall be provided for each\nadditional 100 nursing home or assisted-living patient-resident beds,\nper 50 unassisted senior housing dwelling units, prorated portion\nthereof or major portion thereof."
																				}
																			]
																		},
																		{
																			"number": "[7] ",
																			"content": [
																				{
																					"text": "Subject to the provisions of § 300-26B(1)(a)[9]\nherein, a vegetative buffer at least 20 feet wide shall be provided\nalong all side and rear lot lines."
																				}
																			]
																		},
																		{
																			"number": "[8] ",
																			"content": [
																				{
																					"text": "Bonus density. The Common Council may authorize\nan increase in unit density subject to the limitations detailed in\nSubsection B(1)(a)[8][a] through [e] hereof."
																				},
																				{
																					"content": [
																						{
																							"number": "[a] ",
																							"content": [
																								{
																									"text": "Design. The preservation of buildings\nof local or national historic significance and projects which include\nnoted building style, building materials and the creation of on-site\namenities may receive an increase of density of up to four units per\nacre."
																								}
																							]
																						},
																						{
																							"number": "[b] ",
																							"content": [
																								{
																									"text": "Location. Location of the development\nwithin 1/2 mile of barrier-free sidewalks to a local shopping district\nmay receive an increase of density of up to two units per acre."
																								}
																							]
																						},
																						{
																							"number": "[c] ",
																							"content": [
																								{
																									"text": "Landscaping. The provision of exceptional\nlandscape features, including plantings, benches and walkways, may\nreceive an increase of density of up to four units per acre."
																								}
																							]
																						},
																						{
																							"number": "[d] ",
																							"content": [
																								{
																									"text": "Ancillary facilities. For purposes\nof this subsection, \"ancillary facilities\" shall be defined as additional\nservices, such as a beauty salon, chapel, exercise facility, laundry\nand gift/sundry shop, provided that such ancillary uses shall be solely\nfor the use of residents, employees and invited guests, and further\nprovided that there shall be no exterior announcement, signage or\nother evidence of such facilities. Developments incorporating ancillary\nfacilities may receive an increase of density of up to four units\nper acre."
																								}
																							]
																						},
																						{
																							"number": "[e] ",
																							"content": [
																								{
																									"text": "Senior living campuses. A senior\nhousing facility proposed to be developed on a lot or lots adjacent\nto a site having an existing senior housing facility or senior citizen\ncongregate care and/or nursing home facility for senior citizens may\nreceive an increase of density of up to six units where the proposed\nsenior housing facility and existing senior housing facility or senior\ncitizen congregate care and/or nursing home facility for senior citizens\nshare open space, common ways, parking, and services for seniors and\nprovide for transitional levels of senior citizen housing in such\na manner as to constitute a campus for senior citizen living as determined\nby the Planning Commission."
																								}
																							]
																						}
																					]
																				}
																			]
																		},
																		{
																			"number": "[9] ",
																			"content": [
																				{
																					"text": "The Planning Commission shall be authorized\nto grant waivers from the setback, vegetative buffer, usable open\nspace and impervious surface requirements set forth in this § 300-27."
																				}
																			]
																		}
																	]
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "Houses of worship, subject to the following standards in addition to those identified in §§ 575-56 and 575-57 of this chapter:"
																},
																{
																	"content": [
																		{
																			"number": "[1] ",
																			"content": [
																				{
																					"text": "Minimum dimensional standards for a house of\nworship shall be as follows: one acre minimum lot size; one-hundred-fifty-foot\nminimum lot width; 20% maximum building coverage; 50% maximum impervious\ncoverage; maximum building height of 30 feet; fifty-foot setback from\nall property lines for all playgrounds, ball fields, tracks and similar\nactive recreation areas; and a fifteen-foot-wide vegetative buffer\nshall be provided along all lot lines adjoining a residential district,\nto the satisfaction of the Planning Commission."
																				}
																			]
																		},
																		{
																			"number": "[2] ",
																			"content": [
																				{
																					"text": "One parking space per four seats."
																				}
																			]
																		},
																		{
																			"number": "[3] ",
																			"content": [
																				{
																					"text": "Parking area to be buffered from all side and\nrear lot lines by a planted area a minimum of 10 feet in width; no\nparking is permitted in a required front yard."
																				}
																			]
																		},
																		{
																			"number": "[4] ",
																			"content": [
																				{
																					"text": "Building setbacks for all structures shall be\na minimum of 50 feet from all front lot lines, 15 feet from all side\nlot lines and 30 feet from all rear lot lines, or 1/2 of the building\nheight from each lot line, whichever is greater."
																				}
																			]
																		},
																		{
																			"number": "[5] ",
																			"content": [
																				{
																					"text": "Any facility with maximum capacity of 150 persons\nor more shall prepare a traffic impact analysis, which analysis shall\ninclude proposals for any necessary mitigation measures to be undertaken\nby the applicant, to the satisfaction of the Planning Commission."
																				}
																			]
																		},
																		{
																			"number": "[6] ",
																			"content": [
																				{
																					"text": "Maximum site-generated light shall not exceed\n0.5 footcandle at the property line, and the source of all exterior\nlighting shall not be visible beyond the property line."
																				}
																			]
																		}
																	]
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "Nursery school, kindergarten school and/or standard\nelementary school, junior high school or high school, subject to compliance\nwith the following standards:"
																},
																{
																	"content": [
																		{
																			"number": "[1] ",
																			"content": [
																				{
																					"text": "Minimum dimensional standards for a school shall\nbe as follows: five-acre minimum lot size; one-hundred-fifty-foot\nminimum lot width; 20% maximum building coverage; 50% maximum impervious\ncoverage; maximum building height of 30 feet; fifty-foot setback from\nall property lines for all playgrounds, ball fields, tracks and similar\nactive recreation areas; and a fifteen-foot-wide vegetative buffer\nshall be provided along all lot lines adjoining a residential district,\nto the satisfaction of the Planning Commission."
																				}
																			]
																		},
																		{
																			"number": "[2] ",
																			"content": [
																				{
																					"text": "Parking shall be provided as required below,\nexcept that the Planning Commission may waive a portion of the parking\nrequirement if, in its sole authority, the Planning Commission determines,\nbased upon a showing by the applicant, that such a waiver is warranted\ndue to variation in the probable time of maximum use by employees,\nstudents and visitors or such other evidence as is provided by the\napplicant to the satisfaction of the Planning Commission:"
																				},
																				{
																					"content": [
																						{
																							"number": "[a] ",
																							"content": [
																								{
																									"text": "One parking space shall be provided\nper staff member on the maximum shift plus one parking space per 15\nstudent seats in a nursery, kindergarten, elementary, middle or junior\nhigh school class."
																								}
																							]
																						},
																						{
																							"number": "[b] ",
																							"content": [
																								{
																									"text": "One parking space shall be provided\nper staff member on the maximum shift plus one parking space per four\nhigh school classroom seats."
																								}
																							]
																						}
																					]
																				}
																			]
																		},
																		{
																			"number": "[3] ",
																			"content": [
																				{
																					"text": "Parking area to be buffered from all side and\nrear lot lines by a planted area a minimum of 10 feet in width; no\nparking is permitted in a required front yard."
																				}
																			]
																		},
																		{
																			"number": "[4] ",
																			"content": [
																				{
																					"text": "Building setbacks for all structures shall be\na minimum of 50 feet from all front lot lines, 15 feet from all side\nlot lines and 30 feet from all rear lot lines, or 1/2 of the building\nheight from each lot line, whichever is greater."
																				}
																			]
																		},
																		{
																			"number": "[5] ",
																			"content": [
																				{
																					"text": "Any school with maximum capacity of 150 students\nor more shall prepare a traffic impact analysis, which analysis shall\ninclude proposals for any necessary mitigation measures to be undertaken\nby the applicant, to the satisfaction of the Planning Commission."
																				}
																			]
																		},
																		{
																			"number": "[6] ",
																			"content": [
																				{
																					"text": "Maximum site-generated light shall not exceed\n0.5 footcandle at the property line, and the source of all exterior\nlighting shall not be visible beyond the property line."
																				}
																			]
																		}
																	]
																}
															]
														},
														{
															"number": "(d) ",
															"content": [
																{
																	"text": "Family day-care homes and group family day-care\nhomes as an accessory use to a permitted principal residential use,\nsubject to the following additional standards and requirements:"
																},
																{
																	"content": [
																		{
																			"number": "[1] ",
																			"content": [
																				{
																					"text": "Maximum of six children."
																				}
																			]
																		},
																		{
																			"number": "[2] ",
																			"content": [
																				{
																					"text": "One or more of the residents of the principal\nresidential use shall maintain a majority ownership share in the day-care\nbusiness."
																				}
																			]
																		},
																		{
																			"number": "[3] ",
																			"content": [
																				{
																					"text": "One resident of the principal residential use\nshall be the operator or an employee of the day-care business with\nday-to-day responsibilities over said operation."
																				}
																			]
																		},
																		{
																			"number": "[4] ",
																			"content": [
																				{
																					"text": "Not more than two nonresident employees shall\nbe employed on the premises at any one time."
																				}
																			]
																		},
																		{
																			"number": "[5] ",
																			"content": [
																				{
																					"text": "Lot area and width of the subject site must\nconform with minimum lot area and lot width standards for the district."
																				}
																			]
																		},
																		{
																			"number": "[6] ",
																			"content": [
																				{
																					"text": "The day-care facility's floor area shall be\nlimited to a maximum of 30% of the principal structure's total floor\narea, and the day-care facility's floor area shall be limited to floors\nhaving direct egress to legal open space."
																				}
																			]
																		},
																		{
																			"number": "[7] ",
																			"content": [
																				{
																					"text": "A ten-foot-wide vegetative buffer strip supplemented\nby a six-foot-tall completely opaque fence shall be provided between\nproperty lines and all designated play areas; no designated play area\nshall be permitted between the front lot line and a plane extending\nfrom side lot line to side lot line along the side of the house closest\nto the front lot line."
																				}
																			]
																		}
																	]
																}
															]
														},
														{
															"number": "(e) ",
															"content": [
																{
																	"text": "Cemeteries, including extensions of existing\ncemeteries."
																}
															]
														},
														{
															"number": "(f) ",
															"content": [
																{
																	"text": "Public utility installations, in accordance with § 575-24C(3)."
																}
															]
														},
														{
															"number": "(g) ",
															"content": [
																{
																	"text": "Buildings exclusively used and occupied by community\nvolunteer ambulance corps for the purpose for which organized and\nwhich corps is incorporated under the laws of the State of New York."
																}
															]
														},
														{
															"number": "(h) ",
															"content": [
																{
																	"text": "Bonus density: affordable townhouse developments."
																},
																{
																	"content": [
																		{
																			"number": "[1] ",
																			"content": [
																				{
																					"text": "Purpose and intent."
																				},
																				{
																					"content": [
																						{
																							"number": "[a] ",
																							"content": [
																								{
																									"text": "It is the purpose of this special\npermit to provide the opportunity and encouragement for the creation\nof a development cluster containing a mix of market-rate and affordable\nhousing that is proximate to, and supportive of, neighboring commercial\nareas. The purpose of this subsection is to provide standards for\nregulation of affordable housing units in the R-6 District, including\ndensity computations and development standards."
																								}
																							]
																						},
																						{
																							"number": "[b] ",
																							"content": [
																								{
																									"text": "An increase in residential density\nof up to eight units per acre may be authorized by special permit\nof the Common Council upon a finding by the Common Council that the\nproject will offer at least half of the proposed additional units\nas affordable housing units, as determined by the United States Department\nof Housing and Urban Development standards for Westchester County."
																								}
																							]
																						},
																						{
																							"number": "[c] ",
																							"content": [
																								{
																									"text": "The Common Council may authorize\nthe addition of one unit in all instances where computations yield\nfractional units, so long as the additional unit is offered as affordable."
																								}
																							]
																						}
																					]
																				}
																			]
																		},
																		{
																			"number": "[2] ",
																			"content": [
																				{
																					"text": "Standards for approval. All dwelling units approved\nunder these provisions shall be located within 250 feet of public\nhousing units administered by the City of Peekskill Housing Authority\nand within 250 feet of lands zoned as part of the City's Central Commercial\nDistrict."
																				}
																			]
																		},
																		{
																			"number": "[3] ",
																			"content": [
																				{
																					"text": "Distribution of units."
																				},
																				{
																					"content": [
																						{
																							"number": "[a] ",
																							"content": [
																								{
																									"text": "All affordable units shall be physically\nintegrated into the design of the development."
																								}
																							]
																						},
																						{
																							"number": "[b] ",
																							"content": [
																								{
																									"text": "The units shall consist of one-,\ntwo- and three-bedroom units in a proportion approved by the Common\nCouncil as appropriately related to the housing needs, current or\nprojected, of the City of Peekskill and the surrounding region."
																								}
																							]
																						}
																					]
																				}
																			]
																		},
																		{
																			"number": "[4] ",
																			"content": [
																				{
																					"text": "Design review."
																				},
																				{
																					"content": [
																						{
																							"number": "[a] ",
																							"content": [
																								{
																									"text": "All developments containing units\ndeemed affordable under these provisions shall require approval of\na site plan by the City of Peekskill Planning Commission."
																								}
																							]
																						},
																						{
																							"number": "[b] ",
																							"content": [
																								{
																									"text": "In considering the site plan for\ndevelopments containing affordable units, the Planning Commission\nmust find that the proposed development does not detract from the\nviews of surrounding residential development and is compatible with\nsurrounding development. Appropriate consideration must be given to\nproximity of proposed development to the City's historically designated\ndowntown areas."
																								}
																							]
																						}
																					]
																				}
																			]
																		},
																		{
																			"number": "[5] ",
																			"content": [
																				{
																					"text": "Development standards. All townhouse projects\nsubject to these bonus provisions shall comply with the following\nrequirements. Attached single-family townhouses to be constructed\nin accordance with the bonus provisions, and including affordable\nunits:"
																				},
																				{
																					"content": [
																						{
																							"number": "[a] ",
																							"content": [
																								{
																									"text": "There shall be a minimum parcel\nsize of 25,000 square feet."
																								}
																							]
																						},
																						{
																							"number": "[b] ",
																							"content": [
																								{
																									"text": "The maximum number of townhouses\nper acre shall be 16."
																								}
																							]
																						},
																						{
																							"number": "[c] ",
																							"content": [
																								{
																									"text": "No townhouse shall contain an aggregate\nfloor area of greater than 1,800 square feet."
																								}
																							]
																						},
																						{
																							"number": "[d] ",
																							"content": [
																								{
																									"text": "All market-rate units shall contain\neither one or two bedrooms. All affordable units shall contain a number\nof bedrooms as determined by the Common Council as part of the review\nof the special permit. The proportion of units in the development\n(by number of bedrooms) shall be determined by the Common Council\nas part of the review of the special permit."
																								}
																							]
																						},
																						{
																							"number": "[e] ",
																							"content": [
																								{
																									"text": "The following minimum yard setbacks\nare required. No minimum setback of 10 feet shall be required between\ngroups of townhouses and the nearest property line. A minimum side\nyard of 20 feet shall be required between groups of townhouses."
																								},
																								{
																									"content": [
																										{
																											"number": "[i] ",
																											"content": [
																												{
																													"text": "Front yard: 10 feet."
																												}
																											]
																										},
																										{
																											"number": "[ii] ",
																											"content": [
																												{
																													"text": "Side yard: zero feet."
																												}
																											]
																										},
																										{
																											"number": "[iii] ",
																											"content": [
																												{
																													"text": "Rear yard: 20 feet."
																												}
																											]
																										}
																									]
																								}
																							]
																						},
																						{
																							"number": "[f] ",
																							"content": [
																								{
																									"text": "A maximum contiguous building wall\nof up to 200 feet along the frontage of a street is permitted."
																								}
																							]
																						},
																						{
																							"number": "[g] ",
																							"content": [
																								{
																									"text": "Maximum lot coverage by all principal\nstructures is limited to 65%."
																								}
																							]
																						},
																						{
																							"number": "[h] ",
																							"content": [
																								{
																									"text": "The minimum floor area (living\nspace) per dwelling unit shall not be less than the following:"
																								},
																								{
																									"content": [
																										{
																											"number": "[i] ",
																											"content": [
																												{
																													"text": "One-bedroom: 900 square feet."
																												}
																											]
																										},
																										{
																											"number": "[ii] ",
																											"content": [
																												{
																													"text": "Two-bedroom: 1,100 square feet."
																												}
																											]
																										},
																										{
																											"number": "[iii] ",
																											"content": [
																												{
																													"text": "Three-bedroom: 1,300 square feet."
																												}
																											]
																										}
																									]
																								}
																							]
																						},
																						{
																							"number": "[i] ",
																							"content": [
																								{
																									"text": "Appropriate visitor parking shall\nbe provided, as determined by the City Planning Commission."
																								}
																							]
																						},
																						{
																							"number": "[j] ",
																							"content": [
																								{
																									"text": "For each dwelling unit, there shall\nbe provided 200 square feet of suitably improved and usable recreation\narea and/or open space. sable recreation area and open space may be\nprovided in the following ways, including:"
																								},
																								{
																									"content": [
																										{
																											"number": "[i] ",
																											"content": [
																												{
																													"text": "Outdoor landscaped area."
																												}
																											]
																										},
																										{
																											"number": "[ii] ",
																											"content": [
																												{
																													"text": "Outdoor passive/active recreation\narea."
																												}
																											]
																										},
																										{
																											"number": "[iii] ",
																											"content": [
																												{
																													"text": "Indoor community center with\nappropriate facilities."
																												}
																											]
																										},
																										{
																											"number": "[iv] ",
																											"content": [
																												{
																													"text": "Combination of the above."
																												}
																											]
																										}
																									]
																								}
																							]
																						},
																						{
																							"number": "[k] ",
																							"content": [
																								{
																									"text": "All remaining requirements of the\nLow-Density Multiple-Residence R-4 District not expressly changed\nabove would continue to apply to all townhouse developments proposed\nunder these bonus provisions."
																								}
																							]
																						}
																					]
																				}
																			]
																		}
																	]
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "The following uses are permitted subject to the issuance of a special permit by the Director of Planning upon authorization by the Planning Commission in accordance with the provisions of § 575-57 and subsequent approval by the Planning Commission of a site plan in accordance with the provisions of § 575-56 herein:[Amended 5-29-2012]"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "Two-family structures, subject to all conditions and criteria as in § 575-23B(1)."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "Three-family structures, subject to all conditions and criteria as in § 575-24B(2)."
																}
															]
														}
													]
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Accessory uses are limited to the following:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "The same as permitted and regulated in the R-1 Residence\nDistrict."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Swimming pool accessory to multiple residence for\nuse of occupants thereof."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Restaurant or professional office accessory to a multiple\nresidence, except that in no case shall more than two floors or parts\nthereof of a multiple residence be used for either or both restaurants\nor professional offices. In addition, the following shall apply:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "No restaurant shall have less than 1,000 square\nfeet of patron service area."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "No drive-in, curb-service or window-service\nrestaurant shall be permitted."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "Restaurants or offices shall be accessible by\nother than the public hall leading to the residential portion of the\nbuilding."
																}
															]
														},
														{
															"number": "(d) ",
															"content": [
																{
																	"text": "The total floor area occupied by uses other\nthan dwelling units shall not exceed 1/3 of the total floor area of\neach structure."
																}
															]
														}
													]
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "Lot area and building requirements."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Lot area and depth. The land area provided for each\ndwelling unit on the lot shall not be less than 2,000 square feet.\nNo lot shall have an average depth of less than 100 feet. There shall\nbe a minimum development parcel of 20,000 square feet."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Yards. Except as otherwise permitted or required,\nthe following yards shall be provided on each lot:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "Front yard. There shall be a front yard with\na minimum depth of 25 feet or 1/3 the height of any wall of any building\nfronting thereon, whichever is the greater number."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "Side yard. No building up to 36 feet in height\nshall be erected nearer to any side lot line than a distance equal\nto 1/2 the height of the wall or walls of such building which face(s)\nthe side lot line, but in no case nearer than 12 feet to such lot\nline. No building with a height in excess of 36 feet shall be erected\nnearer to any side lot line than a distance of 25 feet plus 1/4 the\nheight of the wall or walls which face(s) such a line."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "Rear yard. There shall be a rear yard with a\nminimum depth of 30 feet or 1/3 the height of the structure, whichever\nis greater."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Height. Except as provided in Subsection B hereof, no building shall be erected to a height in excess of 100 feet, nor shall the number of stories at any point along the periphery of any building exceed 10. Chimneys, flues, towers, bulkheads, spires and other decorative features shall be exempt from the provisions of this subsection, provided they occupy not more than 20% of the area of the roof of the building of which they are a part."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "Usable open space. For every dwelling unit erected\non any lot or for each four persons occupying an agency community\nresidence or a boarding-, lodging or rooming house, there shall be\nprovided at least 400 square feet of usable open space."
								}
							]
						},
						{
							"number": "F. ",
							"content": [
								{
									"text": "Maximum coverage and floor area ratio. The sum of\nall areas covered by all principal and accessory buildings shall not\nexceed 25% of the area of the lot, except that where the Zoning Board\nof Appeals finds that the provision of the required off-street parking\nspace underneath the principal building or in such a way as to enable\nthe roof thereof to be used as part of the grounds would be impractical,\nsuch Board may authorize accessory garages to cover an additional\n5% of the area of the lot. Further, if 80% of the dwellings are to\nbe housed in four stories or less, coverage may be increased by 10%.\nIn addition, no building shall be erected or enlarged in which the\naggregate floor area shall exceed 1.5 times the area of the lot on\nwhich the building stands."
								}
							]
						},
						{
							"number": "G. ",
							"content": [
								{
									"text": "Length of buildings. No building shall exceed a length\nof 200 feet."
								}
							]
						},
						{
							"number": "H. ",
							"content": [
								{
									"text": "Off-street parking and loading."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Except as provided hereinafter, all uses other than\ndwellings for four or more families shall provide space for the parking\nof passenger automobiles in accordance with the requirements of the\nTwo- or Three-Family Residence R-3 District. For dwellings for four\nor more families, there shall be provided paved off-street parking\nspace or garage space, or both, sufficient in area for not less than\n1 1/2 spaces for each dwelling unit with one bedroom or less\nand 1 3/4 spaces for each dwelling unit with two bedrooms and\ntwo spaces for each dwelling unit with three or more bedrooms. In\naddition, all plans for multiple dwellings shall show additional parking\nareas for guest parking at a minimum of 1/2 space for each unit. All\nrequired open parking spaces shall be individually identified by means\nof pavement markings. Wherever space is provided for the parking of\nfour or more vehicles in the open, such spaces shall be screened by\na substantial solid wall or fence or thick hedge six feet in height\nabove the average finished grade of the parking area. No parking space\nshall be located in any front yard or within three feet of any lot\nline in side or rear yards. The parking of motor vehicles within 15\nfeet of any wall or portion thereof of a four-or-more-family dwelling,\nwhich wall contains legal windows (other than legal bathroom or kitchen\nwindows) with a wall height of less than eight feet above the level\nof said parking space, is prohibited."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Restaurants shall provide one space for each 100 square\nfeet of floor area devoted to patron use."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Off-street loading shall be provided in accordance with the provision of § 575-22F."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "I. ",
							"content": [
								{
									"text": "Other requirements. All uses shall comply with all requirements of the Low-Density Multiple Residence R-4 District as set forth in § 575-25H and I."
								}
							]
						}
					]
				},
				{
					"footnote": "[1]\nEditor's Note: See also Art. III, Supplementary\nDistrict Regulations.\n"
				}
			]
		},
		{
			"paragraph": "§ 575-29",
			"title": "Clustering standards.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Purpose. The purpose of cluster development is to\npermit a procedure for development which will result in improved living\nand working environments; which will promote more economic subdivision\nlayout; which will encourage a variety of types of residential dwellings;\nwhich will encourage ingenuity and originality in total subdivision\nand individual site design; and which can preserve open space to serve\nrecreational, scenic and public service purposes and other purposes\nrelated thereto within the densities established for the cluster net\ntract area."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Authorization and eligibility. Authorization is granted\nto the Planning Commission, pursuant to § 37 of the General\nCity Law, to apply clustering standards to plans of residential development."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Computation of unit density. In any R-1, R-2 and R-3\nDistrict, the Planning Commission may authorize the subdivision of\ntracts or parcels of land into lots for residential clustering use\nin accordance with the density, use, height and parking requirements\nof the particular district."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Application of these standards to R-3 Districts shall\npreserve the maximum density allowable for R-2 Districts."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "For purposes of computing net parcel acreage, the\nfollowing areas are to be excluded from the gross area of the development:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "Twenty percent as an allowance for rights-of-way\n(determined by calculating an average right-of-way consumption in\nsample R-1 and R-2 areas; see Appendix I[1])."
																},
																{
																	"footnote": "[1]\nEditor's Note: Appendix I is attached to the\nordinance adopted 1-25-1982 and on file in the office of the City\nClerk.\n"
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "Bodies of water, including streams, ponds and\nswamps."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "Rock outcroppings of more than 200 square feet\neach."
																}
															]
														},
														{
															"number": "(d) ",
															"content": [
																{
																	"text": "Areas with more than a twenty-percent slope."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "For purposes of computing parcel density, the net\nparcel acreage shall be divided by 7,500 square feet in an R-1 District\nand by 6,000 square feet in an R-2 or R-3 District."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "Subdivision review. Where any development will result\nin a division of land into two or more lots, plots, sites or parcels\nin such a way as to create one or more new streets as defined in the\nCity of Peekskill Subdivision Regulations,[2] subdivision review and application of clustering standards\nby the Planning Commission shall be coordinated through the Department\nof Planning, Development and Code Enforcement."
								},
								{
									"footnote": "[2]\nEditor's Note: See Ch. 510, Subdivision of Land.\n"
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "Application procedure and site plan elements. Application preparation, submission and review shall follow the procedure specified in § 575-56D of this chapter and shall consist of the site plan elements required in § 575-56E. The site plan shall further show:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "The disposition of various land uses and the areas\ncovered by each, in acres."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Delineation of the various residential areas, indicating\nthe number of dwelling units by each housing type: single-family detached\nand semidetached, attached quadraplex or townhouse dwellings, multistory\nmultiple dwellings, etc., plus a calculation of the density in dwelling\nunits per acres."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "The common open space system and a statement as to\nhow it is to be preserved as such throughout the life of any portion\nof the cluster development and how it is to be owned and maintained."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "F. ",
							"content": [
								{
									"text": "General requirements; design objectives and criteria. In reviewing a cluster development, the Planning Commission shall give particular consideration to the objectives set forth in § 575-56C of this chapter and the following design objectives:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Individual lots, buildings, streets and parking areas\nshall be designed and situated to minimize alteration of the natural\nsite features to be preserved."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "The usability of cluster open space intended for recreation\nor public use shall be determined by the size, shape, topographic\nand location requirements of the particular purpose proposed for the\nsite."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Cluster open space shall include irreplaceable natural\nfeatures located in the tract (such as but not limited to stream beds,\nsignificant stands of trees, individual trees of significant size\nand rock outcroppings)."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "Cluster open space intended for a recreation or public\nuse shall be easily accessible to pedestrians, which accessibility\nshall meet the needs of the handicapped and elderly."
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "Diversity and originality in lot layout and individual\nbuilding design shall be encouraged to achieve the best possible relationship\nbetween development and the existing topography."
												}
											]
										},
										{
											"number": "(6) ",
											"content": [
												{
													"text": "Individual lots, buildings, units and parking areas\nshall be situated to avoid the adverse effects of shadows, noise and\ntraffic on the residents of the site. In evaluating the site plan,\nthe standards prescribed in Appendix II[3] shall be used as general guidelines."
												},
												{
													"footnote": "[3]\nEditor's Note: Appendix II is attached to\nthe ordinance adopted 1-25-1982 and on file in the office of the City\nClerk.\n"
												}
											]
										},
										{
											"number": "(7) ",
											"content": [
												{
													"text": "Areas with slopes greater than 15% shall be preserved\nand not disturbed unless means to mitigate adverse environmental effects\nare defined in an engineer's, architect's or landscape architect's\nreport and approved by the Planning Commission."
												}
											]
										},
										{
											"number": "(8) ",
											"content": [
												{
													"text": "Energy conservation shall be encouraged through the\nuse of southern slopes, where feasible, for passive solar access."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "G. ",
							"content": [
								{
									"text": "Utility placement. All electrical, telephone, cable\ntelevision and similar equipment shall be installed underground in\naccordance with the New York Public Service Commission regulations,\nunless waived by the Planning Commission."
								}
							]
						},
						{
							"number": "H. ",
							"content": [
								{
									"text": "On-site improvements. The developer shall provide\nall necessary on-site water and sewer facilities, including but not\nlimited to water storage tanks if necessary, storm drainage, highway\naccess, paved service streets, curbing, sidewalks, parking and loading\nfacilities, lighting, fire alarm and other necessary support systems,\nwhich shall be connected to the City systems at the nearest feasible\npoint, and other necessary facilities, making reasonable provision\nfor utility service or connections with adjoining properties in other\nownerships. Such proposed improvements shall be subject to revision\nand approval by the appropriate City authority. The City shall not\nbe obligated to extend existing systems to accommodate the developer."
								}
							]
						},
						{
							"number": "I. ",
							"content": [
								{
									"text": "Common lands and facilities."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Where a clustering development approved pursuant to\nthis authorization results in the permanent preservation of open spaces\nor the creation of other commonly used lands or facilities, their\nlocation and use shall be approved by the Planning Commission, using\nas a guide the Comprehensive Plan and the concept of creating a coordinated\nsystem of open spaces with public right-of-way between them, as well\nas the purposes set forth herein and in § 37 of the General\nCity Law."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "In cluster developments having more than five acres,\nthe developer may offer at least 25% of the total area of all common\nopen space parcels containing an area greater than one acre each to\nthe City of Peekskill for dedication for public use. The Planning\nCommission shall review such offer of dedication during preliminary\nsite plan review and recommend either acceptance or refusal of a part\nor all of said parcels to the Common Council."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Common lands which are not dedicated in accordance with Subsection I(2) above and any private common facilities shall be owned and maintained by a property owners' association or its successor organization, subject to the following requirements:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "The property owners' association shall be a\nlegal entity authorized by the laws of the State of New York. It shall\nbe created by a trust agreement or certificate of incorporation, approved\nas to form and sufficiency by the Corporation Counsel and designed\nto assure the permanent preservation and protection of the common\nlands and any improvements thereon for their intended purposes. The\nassociation shall be established prior to obtaining a building permit."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "The property owners' association shall be responsible\nfor the continued future maintenance, ownership and use of all such\ncommon lands and facilities."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "The property owners' association shall be perpetual\nand shall not dispose of any common land or any improvements thereon\nor thereunder, by sale or otherwise, except to a successor organization."
																}
															]
														},
														{
															"number": "(d) ",
															"content": [
																{
																	"text": "The instrument establishing the association\nshall provide notice that in the event it or any successor organization\nshall at any time after approval of the development fail to maintain\nthe common land or any improvements thereon in accordance with the\napproved plan, the City Manager may serve certified or personal notice\nupon such legal entity or successor organization and upon the property\nowners as recorded on the assessment rolls within the development,\nsetting forth the manner in which the association has failed to maintain\nthe common land or any improvements thereon, and said notice shall\ninclude a demand that such deficiencies be corrected within 60 days.\nThe City Manager may, upon application and for good cause, extend\nsaid period for additional sixty-day periods. If the deficiencies\nare not so corrected, the City Manager, in order to preserve the taxable\nvalues of the property within the development and to prevent the common\nland and improvements thereon from becoming a public nuisance, may\ndirect that the City enter upon and take possession of said common\nland and improvements and maintain the same until such time as the\nCommon Council shall determine that the property owners' association\nis ready and able to maintain the common land and improvements in\nproper condition. Said entry and maintenance shall not vest in the\npublic any rights to use the common land or improvements. The decision\nof the City Manager with respect to the action described in this subsection\nshall constitute a final administrative decision subject to review\nin accordance with the provisions of Article 78 of the Civil Practice\nLaw and Rules. The cost to the City of any such maintenance shall\nbe assessed against the properties within the cluster development\naffected, and in the event of the failure or refusal of any property\nowner to pay any such charges when levied, the unpaid amount thereof\nshall become a lien against the property and, together with interest,\nallowed by state law from the due date thereof, shall be included\nin the following annual tax levy of the City upon such property for\nthe following fiscal year, and the amount so levied shall be collected\nin the same manner as other City taxes."
																}
															]
														},
														{
															"number": "(e) ",
															"content": [
																{
																	"text": "The property owners' association agreement shall\nrequire that every property owner within the cluster development shall\nautomatically be and become a member of the association and shall\nbe subject to a charge for a proportionate share of expenses of the\nassociation's activities, including but not limited to the maintenance\nand operation of the common land and improvements thereon."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "After final site plan approval and before obtaining a building permit, the developer of the cluster development shall file a performance guarantee in the form of cash, other liquid asset or a letter of credit satisfactory to the Corporation Counsel and City Comptroller to ensure the proper installation of all improvements on common property, as provided in § 575-56D(7) of this chapter.[Amended 5-13-2002 by L.L. No. 1-2002]"
												}
											]
										}
									]
								}
							]
						}
					]
				}
			]
		}
	]
}