{
	"url": "http://ecode360.com/14818889",
	"paras": [
		{
			"paragraph": "§ 91-7",
			"title": "Permitted uses.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "In any residential district, no building or premises shall be used\nand no building shall be erected which is arranged, intended or designated\nto be used for any purpose or use except one or more of the following:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Single-family dwellings."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Churches."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Private garages for the storage of not more than seven motor vehicles."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "Village buildings, including a Village Hall and such other buildings\nas may be necessary in connection with the administration of the affairs\nof the incorporated Village."
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "Private stables for one or more horses owned and used exclusively\nby an individual resident of the Village of Huntington Bay for his\nprivate use."
												}
											]
										},
										{
											"number": "(6) ",
											"content": [
												{
													"text": "Buildings for accessory uses customarily incident to the above uses."
												}
											]
										},
										{
											"number": "(7) ",
											"content": [
												{
													"text": "Beach and bathing membership corporation for the residents of the\nVillage of Huntington Bay when permitted by the Board of Zoning Appeals.\nThe Board of Zoning Appeals, in acting upon any such application for\nsuch permit, shall observe and comply with the following minimum mandatory\nprovisions and requirements which, among such other conditions and\nsafeguards as may be imposed by said Board, shall be set forth and\ncontained in any such permit granted and issued by said Board:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "The premises shall be owned by said membership corporation and\nhave an area of not less than 2 1/2 acres and a water frontage\nof at least 250 feet."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "Water supply, waste disposal and fire and police protection\nwill be available."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "An adequate entrance to said property shall be available from\na public Village road."
																}
															]
														},
														{
															"number": "(d) ",
															"content": [
																{
																	"text": "Sufficient facilities shall be provided for off-street parking\nfor the members, users and employees of said club."
																}
															]
														},
														{
															"number": "(e) ",
															"content": [
																{
																	"text": "Such membership corporation will not be organized or operated\nfor profit."
																}
															]
														},
														{
															"number": "(f) ",
															"content": [
																{
																	"text": "No food or liquor shall be sold on the premises."
																}
															]
														},
														{
															"number": "(g) ",
															"content": [
																{
																	"text": "The membership of said membership corporation shall be limited\nto 100 members, who must be residents of the Village. A person owning\nproperty in the Village of Huntington Bay, either in his name or the\nname of his wife, or both, shall be considered a resident of said\nVillage, provided that said property is of sufficient area to permit\nthe erection of a single-family dwelling in conformity with this chapter."
																}
															]
														},
														{
															"number": "(h) ",
															"content": [
																{
																	"text": "Facilities for changing clothes shall be provided either by\nlockers or bathhouses."
																}
															]
														},
														{
															"number": "(i) ",
															"content": [
																{
																	"text": "Such permit shall not be granted by the Board of Zoning Appeals\nfor such uses, nor shall any such uses on such property be permitted\nor carried on, until detailed site plans and building plans of such\narea and all buildings and structures, sanitary facilities, parking\nareas and such other relevant information as may be required by the\nBoard of Zoning Appeals shall have been submitted to and approved\nby it."
																}
															]
														}
													]
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "In Waterfront Preservation Districts A1, B1, C1 and D1, no building\nor premises shall be used, arranged, intended or designed for any\npurpose or use except one or more of the following:[Amended 8-11-2009 by L.L. No. 5-2009]"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Single-family dwellings."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Private garages for the storage of not more than three motor vehicles."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Accessory buildings customarily incident to a single-family dwelling."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Special activities; approval required; standards. Notwithstanding\nany other provision of this chapter to the contrary, special activities,\nnot necessarily residential in character, may be permitted in any\ndistrict when approved by the Board of Trustees after finding that:[Added 2-13-2006 by L.L. No. 2-2006]"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "The proposed special activity will not be detrimental to the essential\ncharacter, health, safety, morals or general welfare of the community."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Such proposed special activity, together with the location, size\nand topography of the parcel of land involved; the nature, design,\nsize and location of every existing and proposed building, structure,\naccess road, utility line and other improvement; and the provisions\nfor landscaping, screening neighboring property, major planting of\ntrees and shrubs and parking of vehicles, will be, both as a composite\narchitectural scheme and as a functioning establishment, consistent\nwith the Code of the Village in effect at the time that the application\nfor such special activity is filed with the Village Clerk."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "Prohibited activities. Notwithstanding any of the foregoing provisions\nof this chapter, no building or premises shall be used for any purpose\nwhich:[Added 2-13-2006 by L.L. No. 2-2006]"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Is obnoxious or offensive to the surrounding community by reason\nof causing or emitting unreasonable levels of odor, smoke, vapor,\ngas, dust, garbage, refuse matter, glare of lights, radiation, noise\nor vibrations, interference with radio or television reception or\nother physical or electronic disturbance beyond the premises on which\nsuch activity is conducted."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Is dangerous or harmful to the health, peace, comfort or safety of\nthe community."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Tends to disturb or annoy the residents of the Village."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "Involves any radiation or explosive menace or any serious fire hazard."
												}
											]
										}
									]
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 91-8",
			"title": "Accessory uses; permitted home business uses.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Accessory uses. In any residential district, no building or premises\nshall be used for any other than the use specified for which a building\nmay be erected and for the accessory uses customarily incident thereto.\nThe term \"accessory use\" shall not include any building or use not\nlocated on the same lot as the building or use to which it is accessory.\nA private garage for more than seven motor vehicles shall not be deemed\nan accessory use. An accessory apartment shall be deemed an accessory\nuse to the main dwelling on the same lot."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Permitted home business uses."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Permitted home business uses are limited to those satisfying the\nfollowing requirements:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "Regularly involves no persons or employees other than persons\nresiding on the premises;"
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "Is conducted entirely inside the primary single-family dwelling,\nshows no visible evidence from the exterior of the dwelling of the\nconduct of the occupation, business or profession and is not advertised\nby a sign;"
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "Involves an area no larger than 25% of the floor area of the\nprimary dwelling up to a maximum of 500 square feet that may be occupied\nby the home business;"
																}
															]
														},
														{
															"number": "(d) ",
															"content": [
																{
																	"text": "Generates no additional traffic nor the need for off-street\nparking beyond customary needs of the persons residing at the primary\ndwelling;"
																}
															]
														},
														{
															"number": "(e) ",
															"content": [
																{
																	"text": "Is not involved in the manufacturing, production or building\nof goods or keeping of a stock-in-trade on the premises and is not\nengaged in the purchase of goods for resale or sale of goods where\nthe stock-in-trade or goods are kept or stored on the premises at\nany time;"
																}
															]
														},
														{
															"number": "(f) ",
															"content": [
																{
																	"text": "Is conducted in such a manner that the occupation, business\nor profession does not serve at any one time more than one client,\npatient, student, customer or business or professional associate on\nthe premises. One client, patient, student, customer or business or\nprofessional associate shall be defined as one individual or husband\nand wife in cases where a husband and wife are served on the premises\nor brothers and sisters in cases where siblings are served on the\npremises."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Prohibited home business uses include but are not limited to the\nfollowing:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "Home business uses that do not satisfy the requirements of § 91-8B(1);"
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "Home businesses involving on-site sale, manufacturing, production\nor building of goods or outdoor display or storage of any kind."
																}
															]
														}
													]
												}
											]
										}
									]
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 91-9",
			"title": "Lot area and width.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Area of lot. The minimum lot area for each building, together with\nthe accessory buildings appurtenant thereto, shall be as follows:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "In a Residence A District, 1/2 acre."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "In a Waterfront Preservation District A1, 1/2 acre."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "In a Residence B District, 1/4 acre."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "In a Waterfront Preservation District B1, 1/4 acre."
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "In a Residence C District, one acre."
												}
											]
										},
										{
											"number": "(6) ",
											"content": [
												{
													"text": "In a Waterfront Preservation District C1, one acre."
												}
											]
										},
										{
											"number": "(7) ",
											"content": [
												{
													"text": "In a Residence D District, 1/2 acre."
												}
											]
										},
										{
											"number": "(8) ",
											"content": [
												{
													"text": "In a Waterfront Preservation District D1, 1/2 acre."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Width of lot. For buildings hereafter erected The minimum average\nwidth of lot for each building, together with the accessory buildings\nappurtenant thereto, shall be as follows:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "In a Residence A District, 100 feet."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "In a Waterfront Preservation District A1, 100 feet."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "In a Residence B District, 100 feet."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "In a Waterfront Preservation District B1, 100 feet."
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "In a Residence C District, 150 feet."
												}
											]
										},
										{
											"number": "(6) ",
											"content": [
												{
													"text": "In a Waterfront Preservation District C1, 200 feet."
												}
											]
										},
										{
											"number": "(7) ",
											"content": [
												{
													"text": "In a Residence D District, 75 feet."
												}
											]
										},
										{
											"number": "(8) ",
											"content": [
												{
													"text": "In a Waterfront Preservation District D1, 100 feet."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Floor area ratio. The maximum floor area ratio per lot shall be as\nfollows:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "In a Residence A District, 18%."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "In a Waterfront Preservation District A1, 18%."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "In a Residence B District, 30%."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "In a Waterfront Preservation District B1, 30%."
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "In a Residence C District, 14%."
												}
											]
										},
										{
											"number": "(6) ",
											"content": [
												{
													"text": "In a Waterfront Preservation District C1, 14%."
												}
											]
										},
										{
											"number": "(7) ",
											"content": [
												{
													"text": "In a Residence D District, 18%."
												}
											]
										},
										{
											"number": "(8) ",
											"content": [
												{
													"text": "In a Waterfront Preservation District D1, 18%."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "Lot area coverage. The maximum lot area coverage per lot shall be\nas follows:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "In a Residence A District, 26%."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "In a Waterfront Preservation District A1, 26%."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "In a Residence B District, 36%."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "In a Waterfront Preservation District B1, 36%."
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "In a Residence C District, 20%."
												}
											]
										},
										{
											"number": "(6) ",
											"content": [
												{
													"text": "In a Waterfront Preservation District C1, 20%."
												}
											]
										},
										{
											"number": "(7) ",
											"content": [
												{
													"text": "In a Residence D District, 26%."
												}
											]
										},
										{
											"number": "(8) ",
											"content": [
												{
													"text": "In a Waterfront Preservation District D1, 26%."
												}
											]
										}
									]
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 91-10",
			"title": "Yards.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Front yard.[Amended 8-11-2009 by L.L. No. 5-2009]"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "General. Along all frontages, there shall be a front yard of the\nfollowing minimum depth:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "In a Residence A District, 25 feet."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "In a Waterfront Preservation District A1, 50 feet."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "In a Residence B District, 25 feet."
																}
															]
														},
														{
															"number": "(d) ",
															"content": [
																{
																	"text": "In a Waterfront Preservation District B1, 25 feet."
																}
															]
														},
														{
															"number": "(e) ",
															"content": [
																{
																	"text": "In a Residence C District, 25 feet."
																}
															]
														},
														{
															"number": "(f) ",
															"content": [
																{
																	"text": "In a Waterfront Preservation District C1, 200 feet."
																}
															]
														},
														{
															"number": "(g) ",
															"content": [
																{
																	"text": "In a Residence D District, 25 feet."
																}
															]
														},
														{
															"number": "(h) ",
															"content": [
																{
																	"text": "In a Waterfront Preservation District D1, 50 feet."
																}
															]
														},
														{
															"number": "(i) ",
															"content": [
																{
																	"text": "In Waterfront Preservation Districts A1, B1, C1 and D1, the\nfront yard shall be deemed to be the area between the residence and\nHuntington Bay or Huntington Harbor."
																}
															]
														},
														{
															"number": "(j) ",
															"content": [
																{
																	"text": "In the Waterfront Preservation Districts A1, B1, C1 and D1,\nfor lots not fronting on Huntington Bay or Huntington Harbor, the\nfront yard shall be 40 feet."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Corner lots. A corner lot shall have a front yard along its principal frontage of the depth required by the preceding Subsection A(1) of this section. A corner lot shall also have a front yard along the side street frontage of the following minimum depth:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "In a Residence A District, 25 feet."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "In a Waterfront Preservation District A1, 25 feet."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "In a Residence B District, 25 feet."
																}
															]
														},
														{
															"number": "(d) ",
															"content": [
																{
																	"text": "In a Waterfront Preservation District B1, 25 feet."
																}
															]
														},
														{
															"number": "(e) ",
															"content": [
																{
																	"text": "In a Residence C District, 25 feet."
																}
															]
														},
														{
															"number": "(f) ",
															"content": [
																{
																	"text": "In a Waterfront Preservation District C1, 100 feet, with one\nside yard being a minimum of 40 feet."
																}
															]
														},
														{
															"number": "(g) ",
															"content": [
																{
																	"text": "In a Residence D District, 25 feet."
																}
															]
														},
														{
															"number": "(h) ",
															"content": [
																{
																	"text": "In a Waterfront Preservation District D1, 25 feet."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Through lots. A through lot shall have a front yard on each frontage."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "Permitted structures in front yard. The space in a front yard shall\nbe open and unobstructed, and no structures shall be built in a front\nyard, except that in a residence district cornices or eaves on any\nbuilding may project not more than two feet into the front yard."
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "Vision clearance. On any corner lot on which a front yard is required\nby this chapter, no wall, fence or other structure shall be erected\nand no hedge, tree, shrub or other growth shall be maintained in such\nlocation within such required front yard space as to cause danger\nto traffic by obstructing the view."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Side yard.[Amended 8-11-2009 by L.L. No. 5-2009]"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "In the residence districts, every lot shall have a side yard along\neach lot line other than a street line or rear line, the minimum of\nwhich shall be 25 feet in a Residence C District and the minimum of\nwhich shall be 10 feet in Residence A, B and D Districts."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "In the Waterfront Preservation Districts, every lot shall have a\nside yard along each lot line other than a street line or rear line,\nthe minimum of which shall be as follows:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "In a Waterfront Preservation District A1, 20 feet."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "In a Waterfront Preservation District B1, 10 feet."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "In a Waterfront Preservation District C1, 100 feet, with one\nside yard being a minimum of 40 feet."
																}
															]
														},
														{
															"number": "(d) ",
															"content": [
																{
																	"text": "In a Waterfront Preservation District D1, 20 feet."
																}
															]
														}
													]
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Rear yard.[Amended 8-11-2009 by L.L. No. 5-2009]"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "In a Residence C District, every lot shall have a minimum rear yard\nof 25 feet. In A, B and D Residence Districts, the minimum rear yard\nshall be 10 feet."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "In the Waterfront Preservation District C1, every lot shall have\na minimum rear yard of 40 feet. In Waterfront Preservation Districts\nA1, B1 and D1 every lot shall have a minimum rear yard of 25 feet."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "Items permitted in setback areas; compliance of driveways.[Amended 8-11-1997 by L.L. No. 1-1997]"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Notwithstanding any other provision of the Code, fences and mailboxes shall be permitted within yard setback areas. Signs shall be permitted within yard setback areas so long as the requirements of Chapter 71 are satisfied."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Driveways must comply with side and rear yard setback requirements\nbut may cross front or rear yards to provide access to a street."
												}
											]
										}
									]
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 91-11",
			"title": "Dwellings.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "General. The requirements of this section provide minimum standards\nand shall apply to all new dwellings and to reconstructions, alterations\nand conversions of such structures existing prior to the adoption\nof this chapter.[Amended 8-11-2009 by L.L. No. 5-2009]"
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Limitation.[Amended 2-13-2006 by L.L. No. 3-2006; 8-11-2009 by L.L. No. 5-2009]"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Height."
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "In a residence district, dwellings shall not be of a height\nof more than 2 1/2 stories or 35 feet."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "In the Waterfront Preservation Districts, dwellings shall not\nbe of a height of more than 2 1/2 stories or 30 feet."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Minimum size. Every dwelling shall have a ground floor livable area\nof not less than 900 square feet; except that for a dwelling with\nan attached garage the livable area of the ground floor may be reduced\nto 600 square feet, provided that there is a second story with at\nleast 400 square feet of finished livable area. The term \"livable\narea\" shall be construed as applying to space in which persons normally\nlive and shall include only living rooms, dining rooms, bedrooms,\nkitchens, bathrooms, closets containing not more than 15 square feet\nfor each such room and only such rooms as are finished and accessible\ndirectly or by permanent stairs."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Every dwelling shall contain at least a living room, a bedroom, a\nkitchen and a bathroom. Each kitchen shall contain at least a refrigerator,\na stove and a sink. Each bathroom shall contain a tub or shower bath,\na sink and a water closet."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "No existing dwelling shall be changed or altered so that it fails\nto comply with the provisions of this section."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Toilet facilities. In every building where there is continuous human\noccupancy, there shall be at least one bathroom, properly connected\nwith the drainage and vent systems. No bathrooms shall be placed outside\nof a building.[Amended 8-11-2009 by L.L. No. 5-2009]"
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "With every dwelling, there shall be provided an enclosed garage to\nhouse at least one automobile. Said garage may be attached to or form\npart of the dwelling.[Amended 8-11-2009 by L.L. No. 5-2009]"
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "Site plan review.[Amended 5-1-2006 by L.L. No. 5-2006]"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Applicability. Uses and construction requiring site plan approval\nby the Board of Trustees. Site plan approval shall be required for\nall permitted principal uses, special uses, accessory uses and nonresidential\nuses:[Amended 10-16-2006 by L.L. No. 6-2006; 8-11-2009 by L.L. No. 5-2009; 1-5-2012 by L.L. No. 9-2012]"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "Waterfront Preservation Districts. All proposals for development\nin the Waterfront Preservation Districts require site plan review.\nThe visual impact of proposed development shall be minimized in terms\nof views from the site and adjacent roads to Huntington Bay or Huntington\nHarbor and from Huntington Bay or Huntington Harbor to the site. Analysis\nshall consider the materials used, the massing of buildings, the scale\nof development, the view of the water from residences upland of the\nsite and the use of landscaping and natural growth. The possible intrusion\nof new development on the visual setting of the existing dwellings\nand/or historic structures on nearby properties shall also be evaluated,\nas well as the possible impact on wetlands. Site design and construction\nmanagement shall be undertaken in a manner so as to prevent adverse\neffects from erosion, siltation and flooding."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "Village-wide."
																},
																{
																	"content": [
																		{
																			"number": "[1] ",
																			"content": [
																				{
																					"text": "Village-wide (excluding the Waterfront Preservation Districts).\nAll proposals for development elsewhere in the Village require site\nplan review for construction of a new building and/or an enclosed\nstructure in excess of 80 square feet, or for the alteration or reconstruction\nof an existing building or enclosed structure when such alteration\nor reconstruction involves in excess of 20% of the floor area square\nfootage of the buildings or enclosed structures; or"
																				}
																			]
																		},
																		{
																			"number": "[2] ",
																			"content": [
																				{
																					"text": "Village-wide (including the Waterfront Preservation Districts).\nAll proposals for clearing or grading activities when more than 2,000\nsquare feet of area or 20% of the lot area is impacted; where the\nimport or export of 100 cubic yards of soil and/or debris results;\nand where a preexisting drainage condition, including the rerouting\nor blockage of off-site flow through the property, is altered."
																				}
																			]
																		}
																	]
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Required elements. The elements to be included on site plans shall\nconsist of, but are not limited to, the following, where appropriate:\nparking, means of access, screening, signs (to the extent permitted\nelsewhere in the Code), landscaping, location and dimensions of buildings,\nadjacent land uses and owners, physical features meant to protect\nadjacent land uses, existing and proposed drainage structures."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Information to be submitted."
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "Each application for a building permit subject to site plan\nreview shall be submitted to a Village Building Inspector on the prescribed\nform, together with the appropriate fees. In addition to the information\nrequired to be submitted therewith under any other local law, such\napplication shall be accompanied by the following:"
																},
																{
																	"content": [
																		{
																			"number": "[1] ",
																			"content": [
																				{
																					"text": "Three copies of the site plan addressing the relevant criteria."
																				}
																			]
																		},
																		{
																			"number": "[2] ",
																			"content": [
																				{
																					"text": "A survey showing the applicant's entire property and any\nadjacent streets, rights-of-way, if any, or easements. The survey\nshall depict all existing structures and improvements on the property,\nincluding but not limited to buildings, retaining walls, driveways,\ndecks, drainage structures, etc. The survey shall include topographic\ninformation and locate all trees of greater than eight-inch caliber\nmeasured three feet above surrounding grade. The survey must have\nbeen dated and issued within one year of the date of application."
																				}
																			]
																		},
																		{
																			"number": "[3] ",
																			"content": [
																				{
																					"text": "Proof of ownership of the property."
																				}
																			]
																		},
																		{
																			"number": "[4] ",
																			"content": [
																				{
																					"text": "Copies of covenant or deed restrictions applicable to or intended\nto cover the site."
																				}
																			]
																		},
																		{
																			"number": "[5] ",
																			"content": [
																				{
																					"text": "Copies of any legal instruments covering any streets, rights-of-way,\nif any, or easements."
																				}
																			]
																		},
																		{
																			"number": "[6] ",
																			"content": [
																				{
																					"text": "A topographic map."
																				}
																			]
																		},
																		{
																			"number": "[7] ",
																			"content": [
																				{
																					"text": "Village of Huntington Bay environmental assessment form."
																				}
																			]
																		},
																		{
																			"number": "[8] ",
																			"content": [
																				{
																					"text": "Existing and proposed grading, erosion control, landscape and\ndrainage information.[Added 10-16-2006 by L.L. No. 6-2006]"
																				}
																			]
																		}
																	]
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "Waivers.[Amended 10-16-2006 by L.L. No. 6-2006]"
																},
																{
																	"content": [
																		{
																			"number": "[1] ",
																			"content": [
																				{
																					"text": "The Village may waive, in its discretion, the submission of\nany of the foregoing requirements in the case of an application for\na building permit covering alterations or additions to existing structures.\nAll such plans and drawings must bear the signature and seal of a\nNew York State licensed professional."
																				}
																			]
																		},
																		{
																			"number": "[2] ",
																			"content": [
																				{
																					"text": "The Village may waive in its discretion, the submission of any\nof the foregoing requirements in the case of site plan review generated\nby actions identified in § 91-11E(1)(a)[2][b]. The applicant\nmust at a minimum submit a plan detailing the location of grading\nactivity, tree removal, soil import/export for review and supporting\ndocumentation detailing/supporting the requested waiver. The Village\nBuilding Inspector will review the submitted documents, conduct a\nsite visit and determine if a waiver of the site plan process is permissible.\nThe determination of a waiver of process shall be based on a conclusion\nthat the proposed action will not result in significant alteration\nof existing drainage patterns and/or existing visual buffers or view\ncorridors."
																				}
																			]
																		}
																	]
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "General considerations."
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "In reviewing site plans, consideration shall be given to the\npublic health, safety and welfare and to the comfort and convenience\nof the public in general, of the residents of the community at large\nand of the immediate neighborhood in particular."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "In reviewing site plan applications, the Board of Trustees shall\ngive consideration to, but shall not be limited by, the following\nfactors, among others:[Amended 1-5-2012 by L.L. No. 9-2012]"
																},
																{
																	"content": [
																		{
																			"number": "[1] ",
																			"content": [
																				{
																					"text": "That all proposed vehicular and pedestrian accessways are adequate\nin width, grade, alignment and visibility, are not located too near\nstreet corners and other similar design and safety considerations."
																				}
																			]
																		},
																		{
																			"number": "[2] ",
																			"content": [
																				{
																					"text": "That sites are reasonably screened from the view of adjacent\nand/or nearby parcels and streets and that the general landscaping\nand general character of the site is such as to enhance the character\nof the Village and local community and is in character with the neighborhood.\nThe site plan shall include an analysis of existing and proposed additional\nlandscape improvements to comply with the intent of this section."
																				}
																			]
																		},
																		{
																			"number": "[3] ",
																			"content": [
																				{
																					"text": "That all existing trees over eight inches in diameter, measured\nthree feet above the base of the trunk, shall be retained to the maximum\nextent possible. The Board of Trustees may require an applicant to\nsubmit a plan showing all such existing trees and/or all existing\nvegetation. If review pursuant to this section is required, no land\nclearing shall be conducted except pursuant to the approved site plan\nand not until the site plan approval has been filed and a building\npermit issued by the Building Inspector. The site plan shall identify\nall steep slope areas within the property. The site plan shall include\nan analysis of compliance with the Village Steep Slope Ordinance.[1]"
																				},
																				{
																					"footnote": "[1]\nEditor's Note: See Ch. 73, Steep Slopes.\n"
																				}
																			]
																		},
																		{
																			"number": "[4] ",
																			"content": [
																				{
																					"text": "That all outdoor lighting is of such nature and design and arranged\nso as to preclude the diffusion of glare onto adjoining properties\nand streets."
																				}
																			]
																		},
																		{
																			"number": "[5] ",
																			"content": [
																				{
																					"text": "That building facades are compatible with the surrounding area."
																				}
																			]
																		},
																		{
																			"number": "[6] ",
																			"content": [
																				{
																					"text": "That the drainage system and layout proposal will afford an\nadequate solution to any reasonably anticipated drainage problems.\nThe site plan shall provide information regarding the capacity of\nthe existing stormwater drainage facilities on the site. The applicant\nshall provide sufficient drainage to comply with the Village Code.\nIn cases where renovation or expansion of an existing building is\nproposed, the site plan shall provide sufficient drainage volume to\naccommodate all renovated structures and new structures. In the event\nthat the applicant is renovating/expanding more than 50% of the building,\nthe floor area of the entire building shall be considered in the drainage\ncomputation. The site plan shall include provisions for control of\nerosion during the construction process and after construction is\ncomplete. The erosion controls proposed shall be consistent with New\nYork State Department of Environmental Conservation criteria."
																				}
																			]
																		},
																		{
																			"number": "[7] ",
																			"content": [
																				{
																					"text": "That the general health, safety and welfare of the Village and\nthe local community are not negatively affected by the proposed site\nplan."
																				}
																			]
																		},
																		{
																			"number": "[8] ",
																			"content": [
																				{
																					"text": "That the proposed site plan will provide development in harmony\nwith, and which will have a positive influence upon, the community."
																				}
																			]
																		}
																	]
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "Considerations relating to Waterfront Preservation Districts. The\nvisual impact of proposed development shall be minimized in terms\nof views from the site and adjacent roads to Huntington Bay or Huntington\nHarbor and from Huntington Bay or Huntington Harbor to the site. Analysis\nshall consider the materials used, the massing of buildings, the scale\nof development, the view of the water from residences upland of the\nsite and the use of landscaping and natural growth. The possible intrusion\nof new development on the visual setting of the existing dwellings\nand/or historical structures on nearby properties shall also be evaluated,\nas well as the possible impact on wetlands. Site design and construction\nmanagement shall be undertaken in a manner so as to prevent adverse\neffects from erosion, siltation and flooding. All site plans must\nbe prepared by a New York State licensed professional engineer, architect\nor landscape architect.[Amended 8-11-2009 by L.L. No. 5-2009]"
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "F. ",
							"content": [
								{
									"text": "Accessory apartments. Conditions for approval. No premises may be\nused or occupied as an accessory apartment, except in compliance with\nthe following conditions:[Added 3-21-2005 by L.L. No. 3-2005]"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Single-family owner-occupied lots. Accessory apartment facilities\nshall be permitted only on single-family, owner-occupied parcels of\nland. The single-family dwelling must be the principal residence of\nthe owner of the accessory apartment. The principal use of the property\nshall remain that of a single-family residential dwelling."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Permitted occupants.[Amended 2-12-2007 by L.L. No. 1-2007]"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "Occupancy by domestic employees/caretakers. At least one of\nthe occupants of the accessory apartment must be employed substantially\nfull-time as a domestic employee and/or caretaker at the premises\nwhere the accessory apartment is located. The maximum occupancy of\nthe accessory apartment under this subsection is three persons; or"
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "Occupancy by family members. At least one of the occupants of\nthe accessory apartment must be related by blood, marriage, or adoption\nto one of the owners or occupants of the principal dwelling on the\nlot where the accessory apartment is located. The maximum occupancy\nof the accessory apartment under this subsection is three persons."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Location, size and number of units."
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "An accessory apartment may be located in the principal dwelling\nbuilding; provided that such principal building either has a certificate\nof occupancy or qualifies for a certificate of occupancy."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "An accessory apartment may be alternatively located in an accessory\nbuilding such as a barn or garage, provided that such accessory building\neither has a certificate of occupancy or qualifies for a certificate\nof occupancy."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "There shall be no more than one accessory apartment permitted\nper one family building lot. An accessory apartment is not permitted\non any lot where two dwelling units already exist, regardless of whether\none is a prior nonconforming dwelling unit or not."
																}
															]
														},
														{
															"number": "(d) ",
															"content": [
																{
																	"text": "An accessory apartment shall be limited to a gross floor area\nof no more than 400 square feet."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "Design. The architectural treatment of the structure shall be such\nas to maintain the character of the single-family dwelling unit. Only\none main entrance shall be permitted on the front side of the building,\nand all other entrances shall be at the side or in the rear, except\nthat, for a corner lot, there may be a single main entrance on that\nside of the building which has been established as the front side,\nand all other entrances are to be at the rear of the building, if\npossible."
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "Sanitary approval. A certificate of approval shall be obtained from\nthe Suffolk County Department of Health Services as may be applicable,\nfor any required on-site sanitary or water supply system, including,\nas may be applicable, a determination that the existing on-site water\nsupply and sewage disposal facilities are sufficient to accommodate\nthe additional demands of the accessory apartment on any premises\nwhere such conversion is proposed."
												}
											]
										},
										{
											"number": "(6) ",
											"content": [
												{
													"text": "Certificate of occupancy. No premises within the Village may be used\nor occupied as an accessory apartment prior to Building Inspector\napproval and the issuance by the Building Inspector of a certificate\nof occupancy. Before the issuance of a certificate of occupancy, the\nBuilding Inspector shall inspect the structure proposed to be used\nfor an accessory apartment. The inspection shall determine whether\nor not the structure is structurally sound. No certificate of occupancy\nshall be issued without a determination by the Building Inspector\nthat the structure is structurally sound."
												}
											]
										},
										{
											"number": "(7) ",
											"content": [
												{
													"text": "Inspections. Inspections for compliance, as required by the Building\nInspector, will be made and a certificate of occupancy incorporating\nall site plan conditions must be secured prior to the use of the accessory\napartment. Periodic inspections will be made by the Building Inspector\nto verify compliance with the certificate of occupancy. Refusal by\nthe property owner or the tenant of an inspection of the premises\nby the Building Inspector may be grounds for revocation of the certificate\nof occupancy."
												}
											]
										},
										{
											"number": "(8) ",
											"content": [
												{
													"text": "No rentals. Rental of an accessory apartment is prohibited."
												}
											]
										}
									]
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 91-12",
			"title": "Outdoor water pools.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "It shall be unlawful to construct, maintain, install or enlarge any\noutdoor water pool in any residential zone in the Village of Huntington\nBay except in compliance with all of the provisions of this section."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Definitions.[Repealed 2-13-1978 by L.L. No. 3-1978[1]]"
								},
								{
									"footnote": "[1]\nEditor's Note: For current definitions, see § 91-2.\n"
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Terms. Permits for the construction, installation, enlargement or\nalteration of any pool shall be issued by the Building Inspector and\nshall be subject to all applicable provisions of this chapter."
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "Materials of construction. Pool walls and floors shall be constructed\nof any impervious material which shall provide a tight tank and shall\nbe of sufficient strength to contain the water therein."
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "Drawings and plans."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "All drawings and plans for the construction, installation, enlargement\nor alteration of any pool shall be submitted to the Building Inspector\nfor examination and approval as to proper location and construction."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Plans and drawings shall show lot lines and shall include information\npertinent to the pool, fence construction, water supply system, drainage\nwater disposal system and all appurtenances as well as detailed plans\nand vertical elevations. A detailed survey showing proposed location\nof pool, filter and all existing structures, cesspools, septic tanks,\nwaste lines, water service, pool lighting, overhead electrical lines,\nunderground electrical lines, gas main, telephone lines, as well as\nthe four corner elevations of the property, house, street, top of\ncoping of pool and proposed fencing shall be submitted.[Amended 4-12-1976 by L.L. No. 2-1976]"
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Pools, appurtenances, water supply, drainage systems and fences shall\nbe constructed in conformity with the approved plans."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "F. ",
							"content": [
								{
									"text": "Water disposal. All water either overflowing or emptying from the\npool shall be disposed of on the owner's land, and plans submitted\nshall show provisions made for preventing such water from flowing\nonto the land of any adjoining property owner or into any abutting\nstreet."
								}
							]
						},
						{
							"number": "G. ",
							"content": [
								{
									"text": "Fences. All pools shall be completely enclosed by a fence, and all\nfence openings or points of entry into the pool area enclosure shall\nbe equipped with gates. The fence and gates shall be not less than\nfour feet in height above the grade level and shall be constructed\nof any material which has no aperture or opening exceeding six inches\nat any point. All gates shall be equipped with self-closing and self-latching\ndevices placed at the top of the gates and all gates shall be locked\nwhenever the pool is unattended."
								}
							]
						},
						{
							"number": "H. ",
							"content": [
								{
									"text": "Size and location. All pools shall comply with the requirements of\nthis chapter relating to accessory buildings.[Amended 12-10-2007 by L.L. No. 5-2007]"
								}
							]
						},
						{
							"number": "I. ",
							"content": [
								{
									"text": "Lights. All lights used to illuminate the pool or pool area shall\nbe shielded so as to prevent their shining upon the property of any\nadjacent property owner."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 91-12.1",
			"title": "Temporary storage units.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Purpose and intent. The purpose of this section is\nto allow for the temporary placement and use of temporary storage\nunits on properties within the Village of Huntington Bay, subject\nto regulations that the Board of Trustees has determined to be necessary\nto ensure that the placement and use of said temporary storage units\nwill not offend the health, safety and aesthetics objectives of the\nVillage. Accordingly, it is the intent of this section to regulate\nthe placement and use of temporary storage units in order to promote\nthe health and safety of the residents of the Village and to preserve\nthe aesthetic value of its neighborhoods."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Definitions. As used in this section, the following\nterms shall have the meanings indicated:"
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Permit required. No person shall place a temporary\nstorage unit on any property in the Village unless the person that\nowns, rents, occupies, or controls the property first obtains a written\npermit from the Village Clerk to do so."
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "Application; fee."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "An applicant seeking a permit to place a temporary\nstorage unit on his or her property must submit an application, on\na form provided by the Village Clerk, which shall include, but not\nbe limited to, the following information:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "Name and address of the applicant."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "Name and address of the supplier of the temporary\nstorage unit."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "The address of the property where the temporary\nstorage unit will be located."
																}
															]
														},
														{
															"number": "(d) ",
															"content": [
																{
																	"text": "The intended use for the temporary storage unit."
																}
															]
														},
														{
															"number": "(e) ",
															"content": [
																{
																	"text": "A description or diagram of the location where\nthe temporary storage unit will be placed on the property."
																}
															]
														},
														{
															"number": "(f) ",
															"content": [
																{
																	"text": "A physical description of the temporary storage\nunit, including its physical dimensions."
																}
															]
														},
														{
															"number": "(g) ",
															"content": [
																{
																	"text": "The dates when the temporary storage unit will\nbe placed on the property."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "All applications for permits to place a temporary\nstorage unit and extensions thereof shall be accompanied by a fee\nof $50."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "Duration; extensions."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Permits to place a temporary storage unit shall\nbe granted for a period of 30 days. Each property in the Village is\nlimited to a maximum of two permits per calendar year, and a minimum\nof 15 days shall elapse between the end of one permit period and the\nbeginning of another."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "At the expiration of the thirty-day permit period,\na permit may be extended for one additional thirty-day period for\ngood cause shown. Where a valid building permit exists for the premises\nand the temporary storage unit is being used solely to store the personal\nproperty of the owner or occupant of the premises, multiple thirty-day\npermit extensions may be granted for good cause shown. In no event\nshall the duration of a permit, including any and all extensions,\nexceed more than one year from the date of the original permit."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "F. ",
							"content": [
								{
									"text": "Requirements for placement and use of temporary storage\nunits. The following requirements shall apply to the placement and\nuse of temporary storage units:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "It shall be unlawful for any person or entity\nto place or permit the placement of a temporary storage unit on property\nlocated within the Village without obtaining a written permit as provided\nabove."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Only one temporary storage unit shall be located\non any one property at any given time."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Temporary storage units shall be limited to\na maximum size of nine feet in height, 10 feet in width or 20 feet\nin length."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "Temporary storage units shall not be located\nin any portion of the front yard, other than on a driveway or other\npaved surface. When placed on a driveway, temporary storage units\nmust be placed at the farthest accessible point from the street. A\ntemporary storage unit shall not be placed less than 10 feet from\na property line."
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "Temporary storage units are prohibited from\nbeing placed in or on public or private roadways or rights-of-way."
												}
											]
										},
										{
											"number": "(6) ",
											"content": [
												{
													"text": "Temporary storage units shall not be located\nin a manner that blocks the flow or obstructs the vision or sight\nof vehicles and pedestrians traveling on public or private roadways,\nsidewalks or parking lots."
												}
											]
										},
										{
											"number": "(7) ",
											"content": [
												{
													"text": "The applicant, as well as the supplier, shall\nbe responsible for ensuring that the temporary storage unit is installed\nand maintained in a good and safe condition, free from evidence of\ndeterioration, weathering, discoloration, graffiti, rust, ripping,\ntearing or other holes or breaks, or in any way which might create\na hazard to the general public or an unsightly condition on the property."
												}
											]
										},
										{
											"number": "(8) ",
											"content": [
												{
													"text": "Temporary storage units shall be conspicuously\nmarked with the name and address of the supplier and have affixed\nthereon a copy of the written permit authorizing the placement of\nthe temporary storage unit on the property."
												}
											]
										},
										{
											"number": "(9) ",
											"content": [
												{
													"text": "No temporary storage unit shall be used for\nhabitable purposes or to store solid waste, construction debris, demolition\ndebris, recyclable materials, business inventory, commercial goods,\ngoods for use other than at the property where the temporary storage\nunit is located (i.e., used for retail sales) or any other illegal\nor hazardous material. Upon reasonable notice to the applicant, the\nVillage may inspect the contents of any temporary storage unit at\nany reasonable time to ensure that it is not being used for any prohibited\npurpose."
												}
											]
										},
										{
											"number": "(10) ",
											"content": [
												{
													"text": "A temporary storage unit that is not removed\nat the end of the time for which permission has been granted shall\nbe deemed to be an illegal structure and may be removed by the Village\nimmediately, without notice, and the costs and expenses thereof shall\nbe certified to the Board of Trustees, which Board shall then assess\nsuch costs and expenses against the property on which the temporary\nstorage unit was located, which costs shall be collected and enforced\nin the same manner as real property taxes."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "G. ",
							"content": [
								{
									"text": "Revocation of permit. If the applicant or supplier\nfails to comply with the requirements for the placement and use of\ntemporary storage units, the Village Clerk shall revoke the permit.\nUpon revocation of the permit, the temporary storage unit shall be\nremoved from the property within 24 hours."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 91-13",
			"title": "Division of lots; additions.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "No lot or parcel of land shall be sold, divided or set off in such\na manner that either the portion sold, divided or set off or the portion\nremaining shall fail to comply with minimum area, open space, yard\nor other regulations prescribed by this chapter for the district in\nwhich such land is situated."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Whenever a single lot which has been excepted from the area, width\nand yard requirements of a particular district by reason of such lot\nbeing in single and separate ownership on a certain date is joined\nby common ownership to an abutting lot, the greater area, width and\nyard requirements for the particular district shall apply to the increased-size\nlot."
								}
							]
						}
					]
				}
			]
		}
	]
}