{
	"url": "http://ecode360.com/11021032",
	"paras": [
	    {
			"paragraph": "§ 212-20",
			"title": "Residence E District.",
			"content": [
				{
					"text": "In the Residence E District, the following regulations\nshall apply:"
				},
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "No building shall be erected, altered or used, and\nno lot or premises shall be used, except for one or more of the following\npurposes:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Uses permitted in the Residence C-1 District."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Multiple dwellings."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "No building shall be erected or altered which shall have more than two stories or shall exceed the height provisions as enumerated in § 212-39, except multiple dwellings, which shall have no more than three stories or exceed 30 feet in height.[Amended 6-8-1994 by L.L. No. 1-1994; 2-13-2002 by L.L. No. 3-2002]"
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "No building, together with its accessory buildings,\nshall occupy, in the aggregate, more than 30% of the area of the lot."
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "No building shall hereafter be erected or altered\non a lot of less area than 1,500 square feet for each family for which\nthe building was designed, or which is actually housed in said building,\nand in no event on a lot of less area than 9,000 square feet."
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "Every building hereafter erected or altered shall\nhave a front yard of a minimum depth of 50 feet."
								}
							]
						},
						{
							"number": "F. ",
							"content": [
								{
									"text": "Every building hereafter erected or altered shall\nhave a rear yard of a minimum depth of 25 feet."
								}
							]
						},
						{
							"number": "G. ",
							"content": [
								{
									"text": "In the case of a dwelling for one family, two side\nyards shall be provided, the aggregate width of which shall be not\nless than 16 feet. No side yard shall be less than seven feet in width.\nFor other buildings, no side yard shall be less than 20 feet in width."
								}
							]
						},
						{
							"number": "H. ",
							"content": [
								{
									"text": "No building shall be erected on any lot having a street\nfrontage of less than 150 feet."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 212-24",
			"title": "Regulations for accessory buildings and uses.",
			"content": [
				{
					"text": "The following additional provisions shall apply\nto accessory buildings and uses:"
				},
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "The accessory building or use must be located on the\nsame lot as the principal building or use to which it is accessory\nor on a lot immediately adjoining it. If it is located on a lot immediately\nadjoining the lot on which the principal building or use is located\nand the lots are severed, the accessory use shall cease."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "The accessory use shall not be carried on by any person\nother than the occupant of the principal building or, in case of vacant\nproperty, by the owner or lessee of the lot."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "The area occupied by accessory buildings shall be\nincluded in computing the maximum portion of the lot area which may\nbe built upon in any given district. The area occupied by accessory\nbuildings shall not exceed 8% of the area of the lot."
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "Except as otherwise indicated in this chapter, the\nfollowing shall be the minimum distances, by district, between any\naccessory structure or garage and the side and rear property lines\nof the lot on which the accessory structure or garage is situated:[Amended 9-13-2004 by L.L. No. 7-2004]"
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "No accessory building shall be permitted in the Business\nK District.[Added 9-13-2004 by L.L. No. 7-2004]"
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 212-24.1",
			"title": "Professional offices.",
			"content": [
				{
					"text": "Where a lot or premises in a residence district\nis permitted to be used in part as the office of a professional person,\nthe following additional regulations and conditions shall apply:"
				},
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Such\nuse is limited to the office of not more than one practitioner of\nmedicine, osteopathy, physiotherapy, dentistry, podiatry, optometry,\npsychology or chiropractic duly licensed under the Education Law of\nthe State of New York, and the building in which such office is located\nshall be the primary residence of such practitioner and the immediate\nfamily of such practitioner."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Not\nmore than one assistant or associate licensed practitioner and not\nmore than one nurse or assistant or associate worker may be employed\nin such office."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "No display\nof advertising and no sign shall be permitted except the name of the\nprofessional person or persons and letters or abbreviations indicating\nthe nature of his profession. No such sign shall be illuminated except\nby reflector buttons. No such signs shall exceed two feet in length\nor six inches in height."
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "Such\noffice must be located in and as part of the principal dwelling of\nthe practitioner and the immediate family of such practitioner and\nmay not be housed in a separate building."
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "In no\ncase may the practice of a profession be permitted as a principal\nuse."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 212-25",
			"title": "Private garages.",
			"content": [
				{
					"text": "A private garage is permitted only as an accessory\nuse and is subject to the following conditions:"
				},
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "No private garage shall be permitted within a side\nyard or within a rear yard, except under the following conditions:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "When used as accessory to a dwelling for one family\nonly or for not more than two families, a private garage may be constructed\nin a side yard or a rear yard, provided that no part thereof is nearer\nthan 15 feet, in a Residence AA District; 10 feet, in a Residence\nA District; eight feet, in a Residence BB or B District; or four feet,\nin any other residence district, to the nearest property line.[Amended 6-14-2000 by L.L. No. 4-2000]"
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "In a business district, such garage shall accommodate\nnot more than five motor vehicles, and no part of the building shall\nbe nearer than four feet to the side or rear property line; provided,\nhowever, that, in the case of a corner lot, a garage may not be nearer\nto the street line of the street on which the lot has the greater\nfrontage than the front building line established for that street."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "When used as accessory to a building other than a\ndwelling for not over one family or for not over two families, such\ngarage shall be permitted if authorized as a special exception by\nthe Board of Appeals under such conditions as it may impose."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "In the case of a corner lot, a garage may not be nearer\nto the street line of the street on which the lot has the greater\nfrontage than the front building line established for that street."
												}
											]
										}
									]
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 212-35",
			"title": "Encroachments.",
			"content": [
				{
					"text": "No building or part of a building shall be erected\nin, upon or over or shall project into a required yard, with the following\nexceptions:"
				},
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Cornices, eaves, gutters or flues projecting not more\nthan 18 inches, or windowsills, belt courses or other ornamental features\nprojecting not more than four inches."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Chimneys projecting not more than 24 inches."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "One-story uncovered landings may project into the\nrequired rear yard not more than six feet."
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "One-story uncovered landings may project into the\nrequired side yard not more than three feet."
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "A one- or two-story extension or enlargement of a\none- or two-family dwelling may encroach into a required side yard\nno further than any legally existing building nor nearer than 10 feet\nto a side lot line. Said extension or enlargement may have a maximum\nexterior dimension of twenty feet, measured from the existing building\ntoward a rear or front property line, and may encroach above a required\nheight/setback ratio, provided that such extension or enlargement\ncomplies with all of the requirements of this chapter other than the\nregulations as to side yard. Any extension or enlargement toward a\nfront property line may not extend past the nearest front building\nline. Such extension or enlargement shall be permitted only once on\nexisting structures."
								}
							]
						},
						{
							"number": "F. ",
							"content": [
								{
									"text": "A second-story extension or enlargement of a one-\nor two-family dwelling may encroach into a required side yard no further\nthan any legally existing one story upon which the second story is\nextended or enlarged nor nearer than 10 feet to a side lot line and\nmay encroach above a required side yard height/setback ratio, provided\nthat such extension or enlargement complies with all of the requirements\nof this chapter other than regulations as to side yard. Such extension\nor enlargement shall be permitted only once."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 212-36",
			"title": "(Reserved)\n                                                                                          [1]",
			"content": [
				{
					"footnote": "[1]\nEditor's Note: Former § 212-36,\nLocation of swimming pools, was repealed 9-13-1995 by L.L. No. 9-1995.\n"
				}
			]
		},
		{
			"paragraph": "§ 212-37",
			"title": "Finished face of fences and walls.",
			"content": [
				{
					"text": "All stockade, picket, cyclone, chain link and\nsimilar types of fences and walls, wherein fencing, screening and\nwall materials are affixed to supporting structures, shall be placed\nwith the finished fencing or wall facing the street or adjoining property\nowner. "
				}
			]
		},
		{
			"paragraph": "§ 212-38",
			"title": "Corner lots.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "In the case of a corner lot in a Residence AA District,\na building shall be required to comply with the front yard restrictions\non both streets, and each of such yards shall be deemed a front yard\nfor the purposes of this chapter."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "In the case of a corner lot in a residence district\nother than the Residence AA District, a building shall be required\nto comply with the front yard restrictions on the narrower street\nfront only. The depth of the yard from the other street line shall\nbe:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "In a Residence A District: 25% of the width of the\nlot, but need not be more than 30 feet."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "In a Residence BB District: 25% of the width of the\nlot, but need not be more than 30 feet."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "In a Residence B District: 20% of the width of the\nlot, but need not be more than 25 feet."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "In Residence C-1 and C-2 Districts: 20% of the width\nof the lot, but need not be more than 25 feet."
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "In a Residence D District: 15% of the width of the\nlot, but need not be more than 20 feet."
												}
											]
										},
										{
											"number": "(6) ",
											"content": [
												{
													"text": "In a Residence F District: not less than six feet."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "In the case of a corner lot in a Residence E or Residence\nFF District, a building shall be required to comply with the front\nyard restrictions on Central Avenue, Herrick Drive and Lawrence Station\nPlaza only. The depth of yard from the other street lines shall be\nnot less than 25 feet."
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "The yard in the rear of the narrower street front\nshall comply with the restrictions provided for a rear yard. The yard\nin the rear of the wider street front shall comply with the requirements\nprovided for a side yard."
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "In case of a lot, other than a corner lot, adjoining\ntwo or more streets, a front yard is required on each street."
								}
							]
						},
						{
							"number": "F. ",
							"content": [
								{
									"text": "In that portion of the Isle of Wight hereinafter described,\nno front yard need be more than 15 feet in depth, and no rear yard\nneed be more than 15 feet in depth. The area to which this subsection\napplies is bounded on the north by a line 100 feet north of Berkshire\nPlace; on the west by Sage Avenue; on the south by the waterfront;\nand on the east by an irregular line commencing at the intersection\nof the waterfront and the center line of Oxford Place continued southerly,\nrunning thence northerly along the center line of Oxford Place to\nSeaview Avenue, thence westerly along Seaview Avenue to a line 90\nfeet east of Albert Place and thence northerly along a line 90 feet\neast of Albert Place to the northerly boundary line first above mentioned."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 212-39",
			"title": "Building heights.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "The height of a building with a flat roof shall not\nexceed 25 feet.[Amended 1-8-1997 by L.L. No. 1-1997; 12-12-2001 by L.L. No. 4-2001]"
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "The height of a building with a pitched roof shall\nnot exceed 30 feet.[Amended 1-8-1997 by L.L. No. 1-1997; 12-12-2001 by L.L. No. 4-2001]"
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "In the case where a combination of pitched and flat\nroofs exists, the height of a building shalt not exceed 27 feet.[Amended 12-12-2001 by L.L. No. 4-2001]"
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "The provisions of this chapter relating to the height\nof buildings are subject to the following exceptions:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Such height provisions shall not apply to the erection\nof church spires, belfries or chimneys."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "In the business district, bulkheads, elevator enclosures\nand water tanks occupying, in the aggregate, less than 10% of the\narea of the roof on which they are located may extend above such height\nlimit by not more than 10 feet."
												}
											]
										}
									]
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 212-39.1",
			"title": "Attics.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "No attic shall be heated or air-conditioned."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "No attic or portion of an attic may be dormered."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Attics shall be used exclusively for storage and shall\nnot contain any habitable spaces, nonhabitable spaces, recreational\nrooms or bathrooms."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 212-40",
			"title": "Computation of measurements.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "In the case of an irregular lot, the Board of Trustees\nshall have power to determine and designate what portion of such lot\nshall be deemed to be used in connection with the proposed building\nor use and what, if any, portion thereof is not properly to be deemed\nused in connection therewith. For the purpose of computing the size\nof the lot and the building area and the location of the yards and\ntheir required dimensions, only that portion of the parcel which the\nBoard of Trustees deems to be used in connection with the proposed\nbuilding or use shall be taken into consideration."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "In the case of a parcel of land connected with a public\nstreet by a driveway and having no other street frontage, the portion\nof the parcel of land occupied by such driveway shall be excluded\nfor the purpose of computing the size of the lot, the building area\nand the location and size of the front, rear and side yards. In such\na case, the size of the lot and the building area shall be computed,\nand the yards shall be located and their required size shall be determined,\nin the same manner as if the driveway did not exist and the line of\nthe lot nearest the public street with which the driveway connected\nhad been the front line of the lot."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "For the purpose of computing the building area, the\nsize of the lot, the rear yards, front yards and side yards and any\nproposed street or streets shown on any Official Map or plan of the\nVillage, or any amendment or modification thereof now or hereafter\nduly adopted by the Planning Board or Planning Commission or Board\nof Trustees of the Village of Lawrence, shall be considered a public\nstreet with the same force and effect as if the same had been duly\nopened and improved and made available for public use."
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "For the purpose of computing the size of a building\nlot, there shall not be included any marshland or land subject to\ntidal action or land under water."
								}
							]
						}
					]
				}
			]
		}
	]
}	