{
	"url": "http://ecode360.com/11021250",
	"paras": [
	    {
			"paragraph": "ยง 212-22",
			"title": "Residence F District.",
			"content": [
				{
					"text": "In the Residence F District, the following regulations\nshall apply:"
				},
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "No building shall be erected, altered or used, and\nno lot or premises shall be used, except for one or more of the following\npurposes:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Uses permitted in the Residence D District."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Uses accessory to an apartment house or multiple dwelling\nsituated on an adjoining lot where such apartment house or multiple\ndwelling is a permitted use, provided that no access shall be provided\nor permitted to the lot containing such accessory use, except from\nand over the lot on which the apartment house of multiple dwelling\nis situated."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "No building shall be erected or altered which shall have more than two stories or shall exceed the height provisions as enumerated in ยง 212-39.[1][Amended 6-8-1994 by L.L. No. 1-1994]"
								},
								{
									"footnote": "[1]\nEditor's Note: Former Subsection C, which immediately followed this subsection and dealt with lot occupancy, was repealed 1-8-1997 by L.L. No. 1-1997. This local law also redesignated former Subsections D through H as Subsections C through G, respectively.\n"
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "No principal building or use, together with its accessory\nbuildings or uses, shall be erected upon or shall occupy a lot or\npiece of ground having an area of less than 6,000 square feet."
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "Every building hereafter erected or altered shall\nhave a front yard of a minimum depth of 10 feet."
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "Every building hereafter erected or altered shall\nhave a rear yard of a minimum depth of 10 feet."
								}
							]
						},
						{
							"number": "F. ",
							"content": [
								{
									"text": "Two side yards shall be provided on every lot. No\nside yard shall be less than five feet in width."
								}
							]
						},
						{
							"number": "G. ",
							"content": [
								{
									"text": "No building shall be erected on any lot having a street\nfrontage of less than 60 feet."
								}
							]
						}
					]
				}
			]
		}
	]
}	