{
	"url": "http://ecode360.com/11021126",
	"paras": [
	    {
			"paragraph": "§ 212-14",
			"title": "Residence A District.",
			"content": [
				{
					"text": "In the Residence A District, the following regulations\nshall apply:"
				},
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "No building shall be erected, altered or used, and\nno lot or premises shall be used, except for one or more of the following\npurposes:[Amended 1-14-2010 by L.L. No. 1-2010]"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Uses\npermitted in the Residence AA District. "
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "The office of a person practicing one of the professions enumerated in § 212-24.1A, provided that the premises on which such office is situated is owned by the professional or the spouse of such professional, and is used as the primary residence of such professional and such professional's immediate family."
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "In determining whether a premises is the primary residence of a professional or a member of the immediate family of such professional for the purposes of this section or § 212-24.1, the following factors may be considered, in addition to any other relevant factor:"
																},
																{
																	"content": [
																		{
																			"number": "[1] ",
																			"content": [
																				{
																					"text": "The voting residence of such person;"
																				}
																			]
																		},
																		{
																			"number": "[2] ",
																			"content": [
																				{
																					"text": "The address from which such person files income tax returns;"
																				}
																			]
																		},
																		{
																			"number": "[3] ",
																			"content": [
																				{
																					"text": "Whether such person maintains a professional office or residence\nat another location, and the extent to which such person uses such\nother professional office or residence;"
																				}
																			]
																		},
																		{
																			"number": "[4] ",
																			"content": [
																				{
																					"text": "The public school, if any, attended by children of such person;"
																				}
																			]
																		},
																		{
																			"number": "[5] ",
																			"content": [
																				{
																					"text": "The address of such person used for any public filing or licensing,\nincluding, without limitation, professional licenses, driver's licenses,\nand vehicle registrations; and/or"
																				}
																			]
																		},
																		{
																			"number": "[6] ",
																			"content": [
																				{
																					"text": "The residence addresses of other members of the professional's immediate\nfamily."
																				}
																			]
																		}
																	]
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "The determination of the Code Official charged with interpreting\nor enforcing the Village zoning regulations that a professional does\nnot reside at a particular location such as to permit use of such\nlocation as a professional office shall be presumed correct, and it\nshall be the burden of such professional to overcome such presumption\nin any proceeding to review that determination."
																}
															]
														}
													]
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "No building shall be erected or altered which shall have more than two stories or shall exceed the height provisions as enumerated in § 212-39. [1][Amended 6-8-1994 by L.L. No. 1-1994]"
								},
								{
									"footnote": "[1]\nEditor's Note: Former Subsection C, which immediately followed this subsection and dealt with which immediately followed this subsection and dealt with building coverage, was repealed 5-14-1997 by L.L. No. 3-1997. This local law also renumbered former Subsections D through I as Subsections C through H, respectively.\n"
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "No principal building or use, together with its accessory\nbuildings or uses, shall be erected upon or shall occupy a lot or\npiece of ground having an area of less than 20,000 square feet and\nhaving a street frontage of less than 100 feet. No portion of such\nlot which is less in any dimension than 1/2 of the minimum required\nstreet frontage in this district shall be counted toward meeting the\nminimum lot area requirement.[Amended 5-8-1996 by L.L. No. 1-1996; 1-8-1997 by L.L. No. 1-1997[2]]"
								},
								{
									"footnote": "[2]\nEditor's Note: This local law combined the subject matter of former Subsections D, E, F, G and H into current Subsections D and E.\n"
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "Yard regulations.[Amended 1-8-1997 by L.L. No. 1-1997; 3-10-1999 by L.L. No. 3-1999]"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Every building hereafter erected or altered shall\nhave a front yard of not less than 35 feet, a rear yard of not less\nthan 50 feet and an aggregate of not less than 40 feet for both sides,\nneither one of which shall be less than 20 feet."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "No building shall be erected or altered which shall\nhave a height/setback ratio of less than the following:[Amended 12-12-2001 by L.L. No. 4-2001]"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "Front yard: 0.63."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "Rear yard: 0.44."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "Side yard: 1.1."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Notwithstanding the preceding, no such yard shall be less than required in § 212-12.1, Schedule of Dimensional Regulations."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "(Reserved)"
								}
							]
						},
						{
							"number": "F. ",
							"content": [
								{
									"text": "(Reserved)"
								}
							]
						},
						{
							"number": "G. ",
							"content": [
								{
									"text": "(Reserved)"
								}
							]
						},
						{
							"number": "H. ",
							"content": [
								{
									"text": "Every new building lot created subsequent to April\n1, 1996, shall be adequate in shape to totally contain within its\nboundaries a horizontal circle of not less than 100 feet in diameter,\nwhich circle shall be located no farther than the minimum required\nfront yard setback distance from the lot's street frontage and within\nwhich circle the principal building shall be located.[Added 5-8-1996 by L.L. No. 1-1996]"
								}
							]
						}
					]
				}
			]
		}
	]
}	