{
	"url": "http://ecode360.com/11021032",
	"paras": [
		{
			"paragraph": "§ 212-12.1",
			"title": "Schedule of Dimensional Regulations",
			"content": [
				{
					"text": "One- and Two-Family Dwellings and All Uses in Residence AA, A, BB, B, C-1, C-2 and D Districts Village of Lawrence, New York [Amended 3-10-1999 by L.L. No. 3-1999; 10-13-1999 by L.L. No. 6-1999; 12-12-2001 by L.L. No. 4-2001; 1-13-2004 by L.L. No. 3-2004]"
				},
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Maximum Permitted Building Area Coverage: 10%"
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Front Yard: 25 feet"
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "One Side: 15 feet"
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "Aggregate of Two Sides: 30 feet"
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "Rear: 30feet"
								}
							]
						}
					]
				}
			]
		},
	    {
			"paragraph": "§ 212-16",
			"title": "Residence B District.",
			"content": [
				{
					"text": "In the Residence B District, the following regulations\nshall apply:"
				},
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "No building shall be erected, altered or used, and\nno lot or premises shall be used, except for one or more of the following\npurposes:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Uses permitted in the Residence BB District."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Village disposal plant and pumping stations and other\nfacilities in connection with the construction, maintenance and operation\nof the Village sewerage system."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "No building shall be erected or altered which shall have more than two stories or shall exceed the height provisions as enumerated in § 212-39. [1][Amended 6-8-1994 by L.L. No. 1-1994]"
								},
								{
									"footnote": "[1]\nEditor's Note: Former Subsection C, which immediately followed this subsection and dealt with which immediately followed this subsection and dealt with building coverage, was repealed 5-14-1997 by L.L. No. 3-1997. This local law also renumbered former Subsections D through I as Subsections C through H, respectively.\n"
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "No principal building or use, together with its accessory\nbuildings or uses, shall be erected upon or shall occupy a lot or\npiece of ground having an area of less than 9,000 square feet and\nhaving a street frontage of less than 75 feet. No portion of such\nlot which is less in any dimension than 1/2 of the minimum required\nstreet frontage in this district shall be counted toward meeting the\nminimum lot area requirement.[Amended 5-8-1996 by L.L. No. 1-1996; 1-8-1997 by L.L. No. 1-1997[2]]"
								},
								{
									"footnote": "[2]\nEditor's Note: This local law combined the subject matter of former Subsections D, E, F, G and H into current Subsections D and E.\n"
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "Yard regulations.[Amended 1-8-1997 by L.L. No. 1-1997; 3-10-1999 by L.L. No. 3-1999]"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Every building hereafter erected or altered shall\nhave a front yard of not less than 30 feet, a rear yard of not less\nthan 30 feet and an aggregate of not less than 30 feet for both side\nyards, neither one of which shall be less than 15 feet."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "No building shall be erected or altered which shall\nhave a height/setback ratio of less than the following:[Amended 12-12-2001 by L.L. No. 4-2001]"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "Front yard: 0.74."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "Rear yard: 0.74."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "Side yard: 1.5."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Notwithstanding the preceding, no such yard shall be less than required in § 212-12.1, Schedule of Dimensional Regulations."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "(Reserved)"
								}
							]
						},
						{
							"number": "F. ",
							"content": [
								{
									"text": "(Reserved)"
								}
							]
						},
						{
							"number": "G. ",
							"content": [
								{
									"text": "(Reserved)"
								}
							]
						},
						{
							"number": "H. ",
							"content": [
								{
									"text": "Every new building lot created subsequent to April\n1, 1996, shall be adequate in shape to totally contain within its\nboundaries a horizontal circle of not less than 75 feet in diameter,\nwhich circle shall be located no farther than the minimum required\nfront yard setback distance from the lot's street frontage and within\nwhich circle the principal building shall be located.[Added 5-8-1996 by L.L. No. 1-1996]"
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 212-24",
			"title": "Regulations for accessory buildings and uses.",
			"content": [
				{
					"text": "The following additional provisions shall apply\nto accessory buildings and uses:"
				},
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "The accessory building or use must be located on the\nsame lot as the principal building or use to which it is accessory\nor on a lot immediately adjoining it. If it is located on a lot immediately\nadjoining the lot on which the principal building or use is located\nand the lots are severed, the accessory use shall cease."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "The accessory use shall not be carried on by any person\nother than the occupant of the principal building or, in case of vacant\nproperty, by the owner or lessee of the lot."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "The area occupied by accessory buildings shall be\nincluded in computing the maximum portion of the lot area which may\nbe built upon in any given district. The area occupied by accessory\nbuildings shall not exceed 8% of the area of the lot."
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "Except as otherwise indicated in this chapter, the\nfollowing shall be the minimum distances, by district, between any\naccessory structure or garage and the side and rear property lines\nof the lot on which the accessory structure or garage is situated:[Amended 9-13-2004 by L.L. No. 7-2004]"
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "No accessory building shall be permitted in the Business\nK District.[Added 9-13-2004 by L.L. No. 7-2004]"
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 212-24.1",
			"title": "Professional offices.",
			"content": [
				{
					"text": "Where a lot or premises in a residence district\nis permitted to be used in part as the office of a professional person,\nthe following additional regulations and conditions shall apply:"
				},
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Such\nuse is limited to the office of not more than one practitioner of\nmedicine, osteopathy, physiotherapy, dentistry, podiatry, optometry,\npsychology or chiropractic duly licensed under the Education Law of\nthe State of New York, and the building in which such office is located\nshall be the primary residence of such practitioner and the immediate\nfamily of such practitioner."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Not\nmore than one assistant or associate licensed practitioner and not\nmore than one nurse or assistant or associate worker may be employed\nin such office."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "No display\nof advertising and no sign shall be permitted except the name of the\nprofessional person or persons and letters or abbreviations indicating\nthe nature of his profession. No such sign shall be illuminated except\nby reflector buttons. No such signs shall exceed two feet in length\nor six inches in height."
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "Such\noffice must be located in and as part of the principal dwelling of\nthe practitioner and the immediate family of such practitioner and\nmay not be housed in a separate building."
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "In no\ncase may the practice of a profession be permitted as a principal\nuse."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 212-25",
			"title": "Private garages.",
			"content": [
				{
					"text": "A private garage is permitted only as an accessory\nuse and is subject to the following conditions:"
				},
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "No private garage shall be permitted within a side\nyard or within a rear yard, except under the following conditions:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "When used as accessory to a dwelling for one family\nonly or for not more than two families, a private garage may be constructed\nin a side yard or a rear yard, provided that no part thereof is nearer\nthan 15 feet, in a Residence AA District; 10 feet, in a Residence\nA District; eight feet, in a Residence BB or B District; or four feet,\nin any other residence district, to the nearest property line.[Amended 6-14-2000 by L.L. No. 4-2000]"
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "In a business district, such garage shall accommodate\nnot more than five motor vehicles, and no part of the building shall\nbe nearer than four feet to the side or rear property line; provided,\nhowever, that, in the case of a corner lot, a garage may not be nearer\nto the street line of the street on which the lot has the greater\nfrontage than the front building line established for that street."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "When used as accessory to a building other than a\ndwelling for not over one family or for not over two families, such\ngarage shall be permitted if authorized as a special exception by\nthe Board of Appeals under such conditions as it may impose."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "In the case of a corner lot, a garage may not be nearer\nto the street line of the street on which the lot has the greater\nfrontage than the front building line established for that street."
												}
											]
										}
									]
								}
							]
						}
					]
				}
			]
		}
	]
}	