{
	"url": "http://ecode360.com/11021240",
	"paras": [
	    {
			"paragraph": "ยง 212-21",
			"title": "Residence FF District.",
			"content": [
				{
					"text": "In the Residence FF District, the following\nregulations shall apply:"
				},
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "No building shall be erected, altered or used, and\nno lot or premises shall be used, except for one or more of the following\npurposes:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Uses permitted in the Residence E District."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "No building shall be erected or altered which shall have more than two stories or shall exceed the height provisions as enumerated in ยง 212-39, except multiple dwellings, which shall have no more than three stories or exceed 30 feet in height.[Amended 6-8-1994 by L.L. No. 1-1994; 2-8-1995 by L.L. No. 1-1995; 2-13-2002 by L.L. No. 3-2002]"
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "No building, together with its accessory buildings,\nshall occupy, in the aggregate, more than 30% of the area of the lot."
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "No building shall hereafter be erected or altered\non a lot of less area than 2,000 square feet for each family for which\nthe building was designed, or which is actually housed in said building,\nand in no event on a lot of less area than 12,000 square feet."
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "Every building hereafter erected or altered shall\nhave a front yard of a minimum depth of 50 feet."
								}
							]
						},
						{
							"number": "F. ",
							"content": [
								{
									"text": "Every building hereafter erected or altered shall\nhave a rear yard of a minimum depth of 25 feet."
								}
							]
						},
						{
							"number": "G. ",
							"content": [
								{
									"text": "In the case of a dwelling for one family, two side\nyards shall be provided, the aggregate width of which shall be not\nless than 16 feet. No side yards shall be less than seven feet in\nwidth. For other buildings, no side yard shall be less than 20 feet\nin width."
								}
							]
						},
						{
							"number": "H. ",
							"content": [
								{
									"text": "No building shall be erected on any lot having a street\nfrontage of less than 150 feet."
								}
							]
						}
					]
				}
			]
		}
	]
}	