{
	"url": "http://ecode360.com/11021179",
	"paras": [
	    {
			"paragraph": "ยง 212-17",
			"title": "Residence C-1 District.",
			"content": [
				{
					"text": "In the Residence C-1 District, the following\nregulations shall apply:"
				},
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "No building shall be erected, altered or used, and\nno lot or premises shall be used, except for one or more of the following\npurposes:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Uses permitted in the Residence B District."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Municipal parking areas of the Village of Lawrence."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "No building shall be erected or altered which shall have more than two stories or shall exceed the height provisions as enumerated in ยง 212-39. [1][Amended 6-8-1994 by L.L. No. 1-1994]"
								},
								{
									"footnote": "[1]\nEditor's Note: Former Subsection C, which immediately followed this subsection and dealt with which immediately followed this subsection and dealt with building coverage, was repealed 5-14-1997 by L.L. No. 3-1997. This local law also renumbered former Subsections D through I as Subsections C through H, respectively.\n"
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "No principal building or use, together with its accessory\nbuildings or uses, shall be erected upon or shall occupy a lot or\npiece of ground having an area of less than 9,000 square feet and\nhaving a street frontage of less than 70 feet. No portion of such\nlot which is less in any dimension than 1/2 of the minimum required\nstreet frontage in this district shall be counted toward meeting the\nminimum lot area requirement.[Amended 5-8-1996 by L.L. No. 1-1996; 1-8-1997 by L.L. No. 1-1997[2]]"
								},
								{
									"footnote": "[2]\nEditor's Note: This local law combined the subject matter of former Subsections D, E, F, G and H into current Subsections D and E.\n"
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "Yard regulations.[Amended 1-8-1997 by L.L. No. 1-1997; 3-10-1999 by L.L. No. 3-1999]"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Every building hereafter erected or altered shall\nhave a front yard of not less than 25 feet, a rear yard of not less\nthan 30 feet and an aggregate of not less than 25 feet for both side\nyards, neither one of which shall be less than 10 feet."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "No building shall be erected or altered which shall\nhave a height/setback ratio of less than the following:[Amended 12-12-2001 by L.L. No. 4-2001]"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "Front yard: 0.88."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "Rear yard: 0.74."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "Side yard: 2.2."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Notwithstanding the preceding, no such yard shall be less than required in ยง 212-12.1, Schedule of Dimensional Regulations."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "(Reserved)"
								}
							]
						},
						{
							"number": "F. ",
							"content": [
								{
									"text": "(Reserved)"
								}
							]
						},
						{
							"number": "G. ",
							"content": [
								{
									"text": "(Reserved)"
								}
							]
						},
						{
							"number": "H. ",
							"content": [
								{
									"text": "Every new building lot created subsequent to April\n1, 1996, shall be adequate in shape to totally contain within its\nboundaries a horizontal circle of not less than 70 feet in diameter,\nwhich circle shall be located no farther than the minimum required\nfront yard setback distance from the lot's street frontage and within\nwhich circle the principal building shall be located.[Added 5-8-1996 by L.L. No. 1-1996]"
								}
							]
						}
					]
				}
			]
		}
	]
}	