{
	"url": "http://ecode360.com/8082972",
	"paras": [
		{
			"paragraph": "§ 245-32",
			"title": "Tables.",
			"content": [
				{
					"text": "The use and dimensional requirements mandated\nin all districts shall be as set forth in the tables included at the\nend of this chapter.[1] The following regulations apply in an R-40 district:"
				},
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Minimum lot area(square feet): 40,000"
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Minimum lot width (feet): 150"
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Maximum height(stories): 2"
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "Maximum height(feet): 32"
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "Minimum yards (feet) Front: 60"
								}
							]
						},
						{
							"number": "F. ",
							"content": [
								{
									"text": "Minimum yards (feet) Side, minimum for 1: 20"
								}
							]
						},
						{
							"number": "G. ",
							"content": [
								{
									"text": "Minimum yards (feet) Side, total for both on interior: 60"
								}
							]
						},
						{
							"number": "H. ",
							"content": [
								{
									"text": "Minimum yards (feet) Side, abutting side street on corner lot: 60"
								}
							]
						},
						{
							"number": "I. ",
							"content": [
								{
									"text": "Minimum yards (feet) Rear: 70"
								}
							]
						},
						{
							"number": "J. ",
							"content": [
								{
									"text": "Yards, accessory buildings and structures Minimum distance from street(feet): 70"
								}
							]
						},
						{
							"number": "K. ",
							"content": [
								{
									"text": "Yards, accessory buildings and structures Minimum distance from side and rear lot lines (feet): 20"
								}
							]
						},
						{
							"number": "L. ",
							"content": [
								{
									"text": "Total lot coverage maximum (percentage/square feet) (whichever is less): 40% or 29,399"
								}
							]
						},
						{
							"number": "M. ",
							"content": [
								{
									"footnote": "[1]\nEditor’s Note: For use and dimensional requirements\nfor cluster developments, see § 245-71I.\n"
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 245-33",
			"title": "Minimum and maximum floor area requirements.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Minimum floor area (square feet).[Amended 1-14-2008 by L.L. No. 2-2008]"
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Maximum floor area."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "The gross floor area of any dwelling shall not exceed\nthe maximum permitted floor area ratio calculated as follows:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "Lots of 40,000 square feet or less: 2,000 square\nfeet gross floor area plus (lot area minus 10,000 square feet times\n0.100) equals maximum gross floor area."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "Lots greater than 40,000 square feet and less\nthan 80,000 square feet: 5,000 square feet gross floor area plus (individual\nlot area minus 40,000 square feet times 0.050) equals maximum gross\nfloor area."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "Lots 80,000 square feet or greater: 7,000 square\nfeet gross floor area plus (individual lot area minus 80,000 square\nfeet times 0.0325) equals maximum gross floor area, except as limited\nhereinbelow."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "In determining the maximum permitted floor area ratio,\nthe following shall apply:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "Lot area shall include all of that area of a\nlot which is within the definition of \"lot, area of\" as defined in\nthis chapter.[Amended 3-18-2013 by L.L. No. 3-2013]"
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "Gross floor area shall be that area in square\nfeet of all floor levels of any dwelling measured to the exterior\nof the outside walls. Gross floor area shall not include:"
																},
																{
																	"content": [
																		{
																			"number": "[1] ",
																			"content": [
																				{
																					"text": "Unroofed decks, unroofed patios, open terraces,\ntennis courts, unroofed and unenclosed swimming pools, unroofed and\nunenclosed porches and basements, cellars and attics."
																				}
																			]
																		},
																		{
																			"number": "[2] ",
																			"content": [
																				{
																					"text": "Any first floor space used for the placement\nand location of mechanical (heating, ventilation, air conditioning\nand water pumps) systems, not in excess of 200 square feet, provided\nthat regulatory provisions or local flooding conditions prohibit placement\nof these systems below the first floor."
																				}
																			]
																		},
																		{
																			"number": "[3] ",
																			"content": [
																				{
																					"text": "Any roofed and unenclosed porches, roofed garages\nand other roofed storage areas attached to the dwelling, and any detached\nroofed accessory buildings and structures except that the total floor\narea of all the aforesaid attached and detached structures, when added\nto the gross floor area of the dwelling, shall not exceed 115% of\nthe maximum permitted gross floor area of the dwelling.[Amended 10-15-2007 by L.L. No. 26-2007; 12-13-2010 by L.L. No. 10-2010"
																				}
																			]
																		},
																		{
																			"number": "[4] ",
																			"content": [
																				{
																					"text": "Any structure typically consisting of parallel colonnades supporting an open roof of girders and cross rafters or a frame structure typically consisting of posts with a latticework roof, in either case commonly referred to as a pergola, shall not be included in gross floor area calculations if its total lot coverage area from its outermost edges is less than or equal to 300 square feet or its height is less than or equal to 10 feet above grade, and any excess in the lot coverage of a pergola or pergolas greater than 300 square feet and any portion of a pergola or pergolas in excess of 10 feet in height shall be included in gross floor area calculations as if it were a roofed accessory building and subject to the limitations of Subsection B(2)(b)[3] above.[Added 12-13-2010 by L.L. No. 10-2010]"
																				}
																			]
																		}
																	]
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "Any interior space with a floor-to-ceiling height\nin excess of 15 feet shall be counted twice."
																}
															]
														},
														{
															"number": "(d) ",
															"content": [
																{
																	"text": "Any attics with a ceiling height of seven feet or greater shall\nbe included as gross floor area.[Added 2-18-2014 by L.L. No. 2-2014]"
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Notwithstanding the provisions set forth above, in\nno event shall the gross floor area of any dwelling exceed 12,000\nsquare feet, and in no event shall the total gross floor area of the\ndwelling and all attached and detached roofed structures exceed 13,800\nsquare feet.[Amended 10-15-2007 by L.L. No. 26-2007]"
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "In determining maximum lot coverage, whether under\nthe floor area ratio requirement or the percentage of lot coverage\nrestriction in this article, the more restrictive requirement or standard\nshall apply."
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "By way of illustration, if the lot area is 72,360\nsquare feet, the maximum gross floor area is 6,618 square feet (72,360\nminus 40,000 equals 32,360 times 0.050 equaling 1,618 plus 5,000 or\n6,618 square feet), allowing up to an additional 993 square feet (15%\nof 6,618 equals 993) for other attached and detached roofed structures,\nyielding a potential total of 7,611 square feet (6,618 plus 993) for\nstructures that could be under roof or more than 12 inches above grade.[Amended 10-15-2007 by L.L. No. 26-2007]"
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Unbuilt gross floor area. Any provision herein to the contrary notwithstanding, to the extent that a dwelling does not equal and is less than the maximum floor area permitted under Subsection B above, then in such event all or part of said unbuilt gross floor area may be used to enlarge attached and detached structures described above in § 245-33 B(2)(b)[3], provided that any such structure enlarged by said unbuilt gross floor area is in resultant design and use a customary, incidental, subordinate and typical accessory building and/or structure and/or use and provided further that any such application of unbuilt gross floor area shall correspondingly limit any later enlargement of the dwelling.[Amended 12-13-2010 by L.L. No. 10-2010]"
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 245-34",
			"title": "Placement of accessory buildings and uses in all districts.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Accessory off-street parking areas shall not be located\nin a required front yard or side yard and shall be not less than 10\nfeet from any property line in a required rear yard."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "No commercial vehicle, boat or boat trailer or any\nsimilar equipment shall be parked in any front yard or in any required\nside yard or within 10 feet of any property line in a required rear\nyard."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "The height of any accessory building or other structure\nshall not exceed 20 feet."
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "Accessory buildings or other structures to be located\nor constructed in a required rear yard shall not occupy more than\n20% of such required rear yard.[Amended 12-17-2012 by L.L. No. 4-2012]"
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "A residential storage shed shall be permitted in the\nrear yard of a lot if it meets the rear and side yard setbacks for\naccessory structures. Residential storage sheds that are located on\nlots 80,000 square feet and less in all zoning districts, except waterfront\nlots, shall be allowed to have a minimum side and rear yard setback\nof 20 feet. This relief shall be granted for one residential storage\nshed per lot."
								}
							]
						},
						{
							"number": "F. ",
							"content": [
								{
									"text": "A deck, unroofed steps, patio, or terrace abutting\nor attached to a principal dwelling shall be subject to accessory\nstructure setbacks, with the exception of distance from street regulations."
								}
							]
						},
						{
							"number": "G. ",
							"content": [
								{
									"text": "Accessory buildings, including garages, if detached\nfrom a main building or if connected only by an open breezeway-type\nstructure, shall be not less than five feet from the main building."
								}
							]
						},
						{
							"number": "H. ",
							"content": [
								{
									"text": "A private garage may be constructed as a structural\npart of a main building, provided that when so constructed the garage\nwalls shall be regarded as the walls of the main building in applying\nthe front, rear and side yard regulations of this chapter."
								}
							]
						},
						{
							"number": "I. ",
							"content": [
								{
									"text": "No accessory building shall be constructed upon a\nlot or plot unless a main or principal building already exists on\nsaid lot or plot and has a valid certificate of occupancy or a valid\nbuilding permit has been issued and is in effect for the construction\nor erection of a main or principal building. This restriction shall\nnot apply to agricultural or farm buildings."
								}
							]
						},
						{
							"number": "J. ",
							"content": [
								{
									"text": "Accessory buildings and structures, including private\ngarages, shall not be placed within a required front yard, a required\nside yard nor the total required side yard for a principal building,\nexcept as allowed elsewhere in this chapter."
								}
							]
						},
						{
							"number": "K. ",
							"content": [
								{
									"text": "The storage of manure or of odor- or dust-producing\nsubstances as an accessory use shall not be permitted."
								}
							]
						},
						{
							"number": "L. ",
							"content": [
								{
									"text": "All accessory buildings, structures or land used for agriculture or animal husbandry shall conform to the provisions of § 245-35 of this chapter."
								}
							]
						},
						{
							"number": "M. ",
							"content": [
								{
									"text": "The keeping of more than two dogs more than six months old in outdoor shelters or pens or the keeping of any horses or farm livestock on the premises shall conform to the provisions of § 245-35."
								}
							]
						},
						{
							"number": "N. ",
							"content": [
								{
									"text": "Outdoor wood-fired boilers are prohibited in all districts."
								}
							]
						},
						{
							"number": "O. ",
							"content": [
								{
									"text": "Any structure\ndesigned and constructed to resist the lateral pressure of soil when\nthere is a desired change in ground elevation that exceeds the angle\nof repose of the soil, commonly described as a retaining wall, shall\nbe an accessory structure subject to accessory structure setbacks\nas set forth in the Table of Dimensional Regulations[1] and in no event shall exceed a vertical dimension of three\nfeet measured from the average elevation of the existing natural grade\nbefore any fill is placed thereon.[Added 7-19-2010 by L.L. No. 4-2010]"
								},
								{
									"footnote": "[1]\nEditor’s Note: The Table of Dimensional Regulations\nis included as an attachment to this chapter.\n"
								}
							]
						},
						{
							"number": "P. ",
							"content": [
								{
									"text": "All generators,\nair conditioning equipment, compressors, pool equipment and similar\nnoise-producing equipment, to the extent reasonable, shall be enclosed\nso as to attenuate noise to the maximum extent. All such equipment\ngenerating heat shall be enclosed on at least three sides, including\nany side facing an adjacent parcel, and all other equipment shall\nbe enclosed on all sides and shall include a roof. The determination\nof reasonableness shall be within the discretion of the Building Inspector\nand shall attenuate noise to the maximum extent feasible. This subsection\nshall not apply to farm equipment or temporary placement or use of\ngenerators at a time of emergency.[Added 9-19-2011 by L.L. No. 10-2011; amended 11-21-2011 by L.L. No.\n11-2011]"
								}
							]
						},
						{
							"number": "Q. ",
							"content": [
								{
									"text": "A heliport\nor helipad or use of land for the taking off or landing of helicopters,\nexcept in a legitimate emergency, is not an accessory use and is prohibited.[Added 1-20-2015 by L.L. No. 2-2015]"
								}
							]
						},
						{
							"number": "R. ",
							"content": [
								{
									"text": "The installation\nor maintenance of amplifiers, loudspeakers or other machines or devices\ncapable of amplifying or reproducing sound in the exterior of any\npremises is prohibited.[Added 9-21-2015 by L.L.\nNo. 6-2015]"
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 245-35",
			"title": "Agriculture and animal husbandry.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "The following shall apply to the keeping of animals\nin all forms, except the keeping of animals as household pets:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Animal husbandry shall only be permitted on sites\nof seven acres or more."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "All shelters provided for livestock, fowl or fur-\nand wool-bearing animals shall be at least 150 feet from any street\nline and 200 feet from any other property line, except that an existing\nshelter may remain and be added to, provided that the addition shall\nnot encroach on a required yard."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "The disposal of animal wastes shall be provided for\nin such a manner as to prevent any nuisance or sanitary problem."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "In order to minimize soil erosion and optimize use\nof water, fertilizer and crop protectants, agricultural practice should\nadhere to best management practices as periodically revised by the\nCornell Cooperative Extension Service."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Any provision to the contrary notwithstanding the keeping of chickens\nand bantams by a special permit issued by the Board of Trustees shall\nnot be deemed animal husbandry and shall be allowed subject to the\nfollowing conditions:[Added 2-18-2014 by L.L. No. 5-2014]"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "The number of chickens or bantams shall not exceed six per 20,000\nsquare feet of lot area, in no event more than 18 on any parcel;"
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Commercial sale of any chicken, bantam or poultry product is prohibited;"
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Roosters are prohibited;"
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "Any coop structure, exclusive of an outdoor pen, shall not exceed\n200 square feet or 10 feet height, shall be located in a rear yard\nonly and shall maintain a setback to any side or rear yard line of\nnot less than 30 feet;"
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "Any outdoor area used by chickens or bantams shall be fenced so as\nto prohibit harm to the chickens or bantams and so as to limit the\nchickens or bantams to within the fenced area or if the parcel at\nwhich any coop structure is located is fenced at its perimeter or\notherwise then so as to limit the chickens or bantams to said fenced\narea; and"
												}
											]
										},
										{
											"number": "(6) ",
											"content": [
												{
													"text": "Any application for a special permit under this subsection shall\nrequire the applicant to mail by certified mail a notice of said application,\nincluding a plot plan showing any coop or other structure and fenced\nareas to each bounding neighbor at least 14 days prior to any hearing\non said application."
												}
											]
										}
									]
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 245-36",
			"title": "Farm stands.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "It shall be unlawful to sell at retail crops and other\nfarm-related products at a farm stand exceeding 30 square feet in\narea unless the farmer-operator shall apply for and receive a permit\nfrom the Building Inspector."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "The application for a farm stand permit shall contain:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "A written statement describing and listing all crops\ngrown by the farmer applicant which will be eligible for sale at the\nfarm stand and a list of all products intended for sale at the farm\nstand; and"
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "An informal site plan, sketch or survey of the lot\non which the farm stand is to be located, depicting the location and\nsetbacks of all buildings and other structures, displays, signs, off-street\nparking areas, driveways and other significant natural or man-made\nfeatures within 100 feet of the farm stand."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "The Building Inspector may issue a permit for the\nretail sale of crops and other farm-related products for a maximum\nperiod of nine successive months in any twelve-month period; the permit\nshall state its expiration date."
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "A farm stand shall only be an accessory use to the\ngrowing of crops by the farmer applicant consisting of field crops,\nfruits, vegetables and cut flowers on a lot or lots located in the\nVillage aggregating no less than 10 acres where all of the lots are\npart of a single agricultural operation under the control of the farmer\napplicant."
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "A farmer applicant may sell supporting farm products\nand farm products not grown by the farmer applicant from a farm stand,\nprovided that the total area of the farm stand devoted to the sale\nof such products does at no time exceed 20% of the combined area of\nsuch products and the area devoted to the sale of products grown by\nthe farmer, and the portion of the farm on which the farm stand is\nlocated shall be no less than three acres. Supporting farm products\ninclude baked goods, eggs, cheese and milk, preserves, syrup, salad\ndressing, juice, tropical fruits, prepackaged snacks, chips and cookies.\nSupporting farm products shall not include prepackaged grocery items,\nother dairy products, meats or other perishable items, the sale of\nwhich is expressly prohibited at a farm stand. In the event of an\nunanticipated crop failure arising solely by reason of force majeure,\nsubstitute products otherwise the same as those customarily grown\nby the farmer but purchased elsewhere may be sold from a farm stand."
								}
							]
						},
						{
							"number": "F. ",
							"content": [
								{
									"text": "Farm stands shall comply with the following requirements:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "All farm stand buildings, structures and displays\nshall be set back no less than 10 feet from the edge of pavement.\nIn no case shall any part of the farm stand buildings, structures\nand displays encroach on the public right-of-way. Such farm stands\nshall be an open walled structure not exceeding 600 square feet of\ndisplay area."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "An area shall be provided for informal parking of\nat least five vehicles no less than 10 feet from the edge of the pavement."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "A vehicle not exceeding 6,000 pounds' net weight or\na typical farm wagon may be utilized as a permitted farm stand but\nnot any part of a vehicle customarily known as an \"over-the-road tractor-trailer.\""
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "A farm stand may have no more than two temporary ground\nidentification signs for the term of its permit. Such signs shall:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "Not exceed 12 square feet in area and six feet\nin height from the ground;"
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "Be located on the same lot as the farm stand\nnot more than 150 feet from the intersection point of the front property\nline and a line perpendicular thereto to the farm stand;"
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "Not be illuminated or create a hazard to traffic;\nand"
																}
															]
														},
														{
															"number": "(d) ",
															"content": [
																{
																	"text": "Be removed when the farm stand closes for the\nseason or when the permit expires if requested by the Village Board."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "Nothing herein shall preclude the temporary use of\na legally existing agricultural accessory building on a farm for the\nretail sale of crops and other farm-related products, provided that\nsaid building is set back no less than 10 feet from the edge of pavement.\nThe farm stand shall only be permitted in a preexisting agricultural\naccessory structure that has been duly issued a certificate of occupancy\nor a certificate of compliance for an agricultural-related use prior\nto January 1, 2005, or a duly issued certificate of occupancy for\nsaid use by virtue of preexisting status."
												}
											]
										},
										{
											"number": "(6) ",
											"content": [
												{
													"text": "A farm stand shall only be for the use of the farmer\napplicant and his immediate family. In the event that such farm stand\nis used by any other person, company, corporation, business or commercial\nentity, whether rented, leased or permitted in any other way by the\nfarmer applicant, such a use shall not be deemed an accessory use\nand shall be deemed a violation of this article."
												}
											]
										},
										{
											"number": "(7) ",
											"content": [
												{
													"text": "The farmer applicant shall remove all temporary buildings,\nstructures and signs erected under the farm stand permit within 10\ndays of the closing of the farm stand or expiration of the permit.\nThe farmer applicant's failure to remove the farm stand and temporary\nground identification signs after the expiration of the temporary\npermit shall be deemed a violation of this article."
												}
											]
										},
										{
											"number": "(8) ",
											"content": [
												{
													"text": "A farmer-operator may apply for the renewal of a farm\nstand permit, provided that such renewal will only be granted following\na determination by the Building Inspector that the farmer applicant\nhas operated the farm stand during the prior permit period in compliance\nwith the requirements of this article and all other standards, codes,\nrules and regulations applicable to a farm stand."
												}
											]
										}
									]
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 245-37",
			"title": "(Reserved)\n                                                                                          [1]",
			"content": [
				{
					"footnote": "[1]\nEditor's Note: Former § 245-37, Lot area, was repealed\n3-18-2013 by L.L. No. 3-2013.\n"
				}
			]
		},
		{
			"paragraph": "§ 245-38",
			"title": "Rear yard lot coverage.",
			"content": [
				{
					"text": "Accessory buildings and/or structures, including swimming pools\nand tennis courts, to be located or constructed in any residential\nzone in the required rear yard for a main or principal building shall\nnot occupy more than 20% of such required rear yard. The total lot\ncoverage shall not exceed the maximum lot coverage as described in\nthe Table of Dimensional Regulations.[1]"
				},
				{
					"footnote": "[1]\nEditor's Note: The Table of Dimensional Regulations is located\nat the end of this chapter.\n"
				}
			]
		},
		{
			"paragraph": "§ 245-39",
			"title": "Lot width.",
			"content": [
				{
					"text": "The minimum road frontage of a lot at the street\nline shall be at least 40 feet in all districts, and also in the case\nof approved flagpole lots where the minimum road frontage at the street\nline shall be at least 20 feet, and this minimum shall apply along\nthe entire length of the flagpole."
				}
			]
		},
		{
			"paragraph": "§ 245-40",
			"title": "Lot setbacks.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Distance from street and side and rear yard setbacks\nare set forth in the Table of Dimensional Regulations at the end of\nthis chapter."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Setback requirements may be superseded by New York\nState Department of Environmental Conservation wetlands regulations."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 245-41",
			"title": "Yards.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "The following accessory structures may be located\nin any required front or rear yard:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "An awning or movable canopy not exceeding 10 feet\nin height."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Open arbor or trellis."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Retaining wall, fence or masonry wall."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "Unroofed steps, deck, patio or terrace not higher\nthan one foot above ground level."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "The space in a required front yard shall be open and unobstructed, except for structures provided for in Subsection A of this section and the following:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "An unroofed balcony projecting not more than eight\nfeet into the yard."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Other projections specifically authorized in Subsections C and D."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Every part of a required yard shall be open to the\nsky, unobstructed except for retaining walls and for accessory buildings\nin a rear yard and except for the ordinary projection of sills, belt\ncourses and ornamental features projecting not to exceed six inches.\nCornices and eaves shall not project more than 18 inches. Exterior\ncellar entrances, commonly known as \"bilco doors,\" shall not encroach\nmore than four feet into the required rear yard and shall not encroach\nat all into any other required yard."
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "Open or lattice-enclosed fireproof fire escapes or\nstairways required by law, projecting into a yard not more than four\nfeet, and the ordinary projections of chimneys and pilasters shall\nbe permitted by the Building Inspector when placed so as not to obstruct\nlight and ventilation."
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "Where a lot extends through from street to street,\nthe applicable front yard regulations shall apply on both street frontages."
								}
							]
						},
						{
							"number": "F. ",
							"content": [
								{
									"text": "In all residence districts, where an approving authority\nhaving jurisdiction has authorized a wetlands permit for a principal\nbuilding requiring relief from the minimum required yards restrictions,\na required yard of such proposed principal building may be reduced\nup to 50% by the Planning Board; provided, however, that any such\nreduced front or rear yard shall not be less than 30 feet, and any\nsuch reduced side yard shall not be less than 10 feet, and, where\nthe administrator under the Coastal Erosion Hazard Act local law,[1] has authorized a coastal erosion management permit requiring\nsimilar relief, a required front yard setback measured from an existing\nstreet or property northerly line paralleling the ocean may be reduced\nby the Planning Board to not less than 30 feet. The relief herein\nshall only be the minimum necessary to achieve the maximum practicable\nbuffer zones required under the Coastal Erosion Hazard Act local law."
								},
								{
									"footnote": "[1]\nEditor’s Note: See Ch. 42, Coastal Erosion Hazard Area.\n"
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 245-42",
			"title": "Height.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Except for chimneys as part of a dwelling and barns\nor silos to be used directly and solely for agricultural production,\nno building or other structure shall exceed the maximum permitted\nheight of 32 feet, including but not limited to any private radio\nor television antenna, mast, flagpole or tower."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Pyramid law. All buildings or other structures on any lot in any district must be set back from all property lines so that the height of any point of the building or other structure is not greater than the horizontal distance of the point from the nearest property line to the building or other structure at that location. Notwithstanding any language in this subsection, the maximum height limitation for a building or other structure in the Table of Dimensional Regulations at the end of this chapter shall not be exceeded at any point unless the structure is one exempted under Subsection A hereof. An illustration depicting a typical elevation view showing the control of height of buildings and structures under this subsection is included at the end of this chapter."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Measurement. For the purpose of this chapter, when\ndetermining the height of a building or other structure it shall be\nmeasured as follows:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "For buildings and structures in any AE or VE Zone\nas shown on the applicable Flood Insurance Rate Map (FIRM) prepared\nby the Federal Emergency Management Agency for the Village, the vertical\ndistance measured from the base flood elevation at and along the side\nof the building or other structure fronting on the nearest street\nto the highest point of the highest roof or, in the case of any other\nstructure, to the highest point."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "The vertical distance measured from the average elevation\nof the existing natural grade (before any fill has been or is proposed\nto be placed thereon), as established on a plan prepared by a licensed\nprofessional surveyor, at and along the side of the building or other\nstructure fronting on the nearest street to the highest point of the\nhighest roof or, in the case of a structure, to the highest point.\nWhere the height is different measured from the fronting side and\nmeasured from the nearest street, the lower dimension shall prevail\nand no part of the roof shall exceed said lower dimension on any side."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "All buildings and other structures on any lot in any\ndistrict must be set back from all property lines so that the height\nof any point of the building or other structure is not greater than\nthe horizontal distance of the point from the nearest property line\nto the building or other structure at that location. Notwithstanding\nany language to the contrary in this subsection, the maximum height\nlimitation for a building or other structure shall be as set forth\nin the Table of Dimensional Regulations included at the end of this\nchapter."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 245-43",
			"title": "Methods of determining off-street parking space requirements.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "The number of spaces required for a single use (e.g.,\na single-family dwelling) shall be two per dwelling, plus one additional\nfor each bedroom in excess of three bedrooms."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "The number of spaces required for a home occupation\nor home professional office, in addition to the required off-street\nparking spaces for the dwelling, shall be two for the first 400 square\nfeet of area given over to this component of the land use, plus one\nsuch space for each additional 150 square feet or fraction thereof,\nplus one per each employee outside of the family occupying the dwelling\nin which the occupation or office is located."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "If the use is not specifically listed in this chapter,\nthe requirements shall be the same as for the most similar use listed,\nas determined by the Planning Board."
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "When the schedule requires the number of spaces to\nbe calculated per employee, the number to be used is the total number\nof employees who may use the site for parking at any one time."
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "A garage or a carport may be used to meet the requirements\nof this section. A driveway may only be used to meet the requirements\nof this section where it serves a single-family dwelling."
								}
							]
						},
						{
							"number": "F. ",
							"content": [
								{
									"text": "Uses that may be required to provide off-street parking\nspaces in excess of the requirements of this section shall require\napproval pursuant to the special exception procedure set forth in\nthis chapter."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 245-44",
			"title": "Schedule of off-street parking space requirements for residential uses.",
			"content": [
				{
					"text": "The schedule of off-street parking space requirements\nfor residential uses is as follows:"
				}
			]
		},
		{
			"paragraph": "§ 245-45",
			"title": "Supplemental regulations for private garages and off-street parking areas in residence districts.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "No parking spaces may be rented to persons not living\non the lot."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Not more than two commercial vehicle shall be housed\nor parked in a private garage or off-street parking area. Such commercial\nvehicle shall not exceed a gross motor vehicle weight of 15,000 pounds\nor 25 feet in length."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 245-46",
			"title": "Exemptions and waivers of parking requirements.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Existing buildings and uses are exempt as follows: the parking provisions of this Article V shall not apply to any buildings or other structure lawfully in use at the effective date of this chapter. No building or other structure or lot lawfully in use at the effective date shall be enlarged unless the off-street parking requirements of this article are complied with to the same extent as would be required if the entire preexisting building or other structure or lot and the proposed enlargement were being submitted as if they were a new application for a building permit for the entire project."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "When the Planning Board shall determine that dedication\nof land or an easement is desirable to facilitate improvement of existing\nor proposed public parking facilities and said dedication of land\nor easement is voluntarily and unconditionally offered to the Village\nfor said purposes as a matter of public policy, the off-street parking\nrequirements of this article may be waived, in whole or in part, by\nthe Planning Board."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 245-47",
			"title": "Corner clearance.",
			"content": [
				{
					"text": "On a corner lot in any district within the triangular\narea determined as provided in this section, no wall or fence or other\nstructure shall be erected to a height in excess of two feet; no vehicle,\nobject or any other obstruction of a height in excess of two feet\nshall be parked or placed; and no hedge, shrub or other growth shall\nbe maintained at a height in excess of two feet, except that trees\nwhose branches are trimmed away to a height of at least 10 feet above\nthe curb level, or pavement level where there is no curb, shall be\npermitted. Such triangular area shall be determined by two points,\none on each intersecting street line, each of which points is 50 feet\nfrom the intersection of such street lines."
				}
			]
		},
		{
			"paragraph": "§ 245-48",
			"title": "Use of dwellings and limitations on occupancy.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Dwellings shall only be utilized by families for residential\npurposes on a seasonal basis or for a longer duration up to and including\npermanent residence, except as otherwise permitted in this chapter."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "A single-family dwelling shall be designed and configured\nto be used as a single-family dwelling. All habitable space must be\nconnected by a conditioned hallway or habitable space. Under no circumstances\nshall habitable space be connected through a mechanical room, laundry\nroom, storage room, or garage."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 245-49",
			"title": "Fences, walls, screening and clotheslines.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "In all residence districts."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "No fence or wall in a required front yard shall have\na height greater than four feet."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "No fence or wall in a required rear or side yard within\n20 feet of a rear or side yard lot line shall have a height greater\nthan six feet."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "In no case shall any fence or wall have a height greater\nthan six feet except for a tennis court enclosure which shall not\nexceed eight feet."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "Any fence or wall having a height four feet or less\nshall be exempt from building permit requirements, provided that it\nshall be constructed of standard materials used for such purposes."
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "All fences shall have a finished side facing toward\nthe adjoining property."
												}
											]
										},
										{
											"number": "(6) ",
											"content": [
												{
													"text": "Corner lot fences and walls. Fences and walls on corner\nlots and fences on through lots may be up to six feet high in required\nfront yards that are opposite side yard lines or in the front yard\nnot used as primary access to the dwelling only if:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "The fence is installed in that portion of the\nrequired front yard that lies between the nearest rear wall of the\ndwelling and the rear lot line."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "The fence is set back a minimum of five feet\nfrom the front lot line."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "Appropriate ornamental planting or natural buffer\nis provided at all times in the form of plant material approved by:"
																},
																{
																	"content": [
																		{
																			"number": "[1] ",
																			"content": [
																				{
																					"text": "The AHRB pursuant to Article X for a proposed fence that is not part of site plan review or subdivision approval."
																				}
																			]
																		},
																		{
																			"number": "[2] ",
																			"content": [
																				{
																					"text": "The Planning Board pursuant to Chapter 190 of the Village Code for a proposed fence that is part of a subdivision application."
																				}
																			]
																		},
																		{
																			"number": "[3] ",
																			"content": [
																				{
																					"text": "The Planning Board pursuant to Article VIII of this chapter for a proposed fence that is part of a site plan application."
																				}
																			]
																		}
																	]
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(7) ",
											"content": [
												{
													"text": "Gates and gateposts.[Amended 7-19-2010 by L.L. No. 6-2010]"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "Gateposts at a driveway entrance or exit may  exceed the foregoing\nheight limitation (four feet) but shall not exceed six feet."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "Gates at a driveway entrance or exit cannot exceed four feet in the\nvertical center and, when hung, cannot exceed a height of five feet\nat the center. Each gate may slope or arc towards the  gatepost(s)\nto a maximum height of six feet, and the width of the gate(s) and/or\nthe distance between the gateposts shall not exceed an aggregate of\n25 feet."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "Any provision in this chapter or otherwise to the contrary notwithstanding,\nresidential driveway entry gates and/or gateposts are prohibited on\nboth the east and west sides of Sagg Main Street south of Montauk\nHighway as well as each side of those portions of Hedges Lane, Personage\nLane, Gibson Lane, Daniels Lane, Sagaponack Road and Bridge Lane which\nare in the Sagaponack Historic District.[Added 4-18-2016 by L.L.\nNo. 3-2016]"
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(8) ",
											"content": [
												{
													"text": "No clothesline or outdoor clothes-hanging device shall\nbe placed or used in any front yard or the rear yard of a waterfront\nlot. Any clothesline or clothes-hanging device located in a side yard\nor rear yard shall be exempt from building permit requirements, provided\nthat it shall be constructed of standard materials used for such purposes."
												}
											]
										},
										{
											"number": "(9) ",
											"content": [
												{
													"text": "Flagpole lot fences and walls."
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "Fences and walls on flagpole lots may be up\nto six feet high in the required front yards."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "No fence or wall installed along the pole portion\nof the lot shall have a height greater than four feet within a distance\nfrom the right-of-way equal to the required front yard setback."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "No fence or wall installed along the pole portion\nof the lot a distance greater than the required front yard setback\nfrom the right-of-way shall have a height greater than six feet."
																}
															]
														}
													]
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Method of measuring the height of a fence or wall. The height of a fence or wall shall be measured from the ground level at the base of the fence, except that, where there is a retaining wall, the height shall be measured from the average of the ground levels at each side of the retaining wall, except that any fence or wall on the uphill side of such retaining wall may be at least four feet high, notwithstanding the provisions of Subsection A."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Electrical fences. The use of any fence which delivers\nan electric shock, charge or current to any animal or human being\nwhen contact is made shall be strictly prohibited in all zones, unless\nauthorized by the Planning Board."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "No Planning Board approval is necessary for an electrical\nfence where the use of the premises is for the keeping of livestock,\nincluding horses, and the protection of field crops from deer damage."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "All electrical fences approved by the Planning Board or allowed under Subsection C(1) of this section shall require a permit from the Building Inspector."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "No electrical fence shall place the safety of residents\nin jeopardy, and conspicuous notices shall be affixed to the fence\nto warn of the potential for electric shock."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "Underground electrical dog fences shall not require\nPlanning Board approval or a permit from the Building Inspector."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "Agricultural fencing."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Within all residential districts any portion of which\nis situated within the Agricultural Overlay District, the Planning\nBoard may approve an increase in the permitted height of a fence located\nin any front, side or rear yard in order to protect agricultural crops\nfrom damage due to deer. The maximum height of such an agricultural\nfence approved by the Planning Board may not exceed eight feet."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "The increase in permitted fence height shall be based\non the following findings of the Planning Board:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "The subject property is currently in agricultural\nproduction."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "The applicant can demonstrate that an economic\nloss will occur to agricultural crops without an increase in fencing\nheight."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "Alternatives to fencing that will reduce the\neconomic loss of agricultural crops have been investigated and found\nnot to have been reasonable."
																}
															]
														},
														{
															"number": "(d) ",
															"content": [
																{
																	"text": "Alternative types and heights of fencing materials\nhave been investigated and found not to have been reasonable."
																}
															]
														},
														{
															"number": "(e) ",
															"content": [
																{
																	"text": "The installation of the fencing will be accomplished\nin a manner to preserve and protect the visual and scenic resources\nof the Village."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "An application to install agricultural fencing that\nexceeds the permitted height shall be in the form of a building permit\napplication submitted to the Building Inspector. The application shall\ninclude a plan of the property accurately showing the delineation\nof the proposed fence and a description of the proposed fence materials.\nThe Building Inspector shall submit a complete application to the\nPlanning Board. The Planning Board shall approve, approve with conditions\nor deny the application."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "Preservation of vistas. Any provision hereinabove\nin this section to the contrary notwithstanding, any fence or hedgerow\nin any residential district or OSC district or agricultural overlay\ndistrict which shall impede the public view from any road or street\nof a scenic vista, including, by way of illustration, not limitation,\na farm field where development rights have been acquired by any government\nagency or the farm field is restricted from nonagricultural development,\na preserved open space of any kind, a scenic easement or conservation\neasement, a public property, or any unimproved or improved area similar\nto the foregoing, shall require a special exception permit from the\nBoard of Trustees, and no such permit shall be approved which shall\nallow the installation of a fence of any type or kind, including hedgerows,\nwhich shall diminish existing viewsheds of areas as described in this\nsubsection. Excepting as permitted under this subsection, fences and\nhedgerows impeding public views of scenic vistas as described herein\nare prohibited."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 245-50",
			"title": "Berms.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "All berms, except those required to be constructed\nin connection with the Planning Board's[1] approval of a subdivision plat or site plan, which exceed\nfour feet in height shall require a building permit."
								},
								{
									"footnote": "[1]\nEditor's Note: The Planning Board was abolished 12-20-2011 by L.L. No. 14-2011. See § 245-71.\n"
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "All berms shall be constructed so that each side of\nthe berm shall not have a slope greater than one to three feet. For\nthe purposes of this section, the slope refers to the ratio of a vertical\nrise of one foot to a horizontal run of three feet."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "All berms shall be constructed out of clean fill or\nan approved equivalent which shall be given sufficient time to settle\nbefore final shaping and topsoil are applied. After the settled fill\nhas been shaped, a uniform at least six-inch layer of approved horticultural\ntopsoil shall be placed and fine graded."
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "All berms shall be properly vegetated and landscaped,\nas to be approved by the Planning Board,[2] before any erosion occurs in the topsoil on the berm,\nor, in the alternative, the berm shall be covered with an approved\nground cover until such time as the berm can be properly landscaped."
								},
								{
									"footnote": "[2]\nEditor's Note: The Planning Board was abolished 12-20-2011 by L.L. No. 14-2011. See § 245-71.\n"
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "Berms shall be constructed only during the period\nfrom March 1 through October 30."
								}
							]
						},
						{
							"number": "F. ",
							"content": [
								{
									"text": "No fence or wall shall be constructed on a berm. However,\na retaining wall may be placed on the sides of a berm where the Planning\nBoard finds the retaining wall will promote aesthetic considerations\nand the height of the wall does not exceed the grade of the berm."
								}
							]
						},
						{
							"number": "G. ",
							"content": [
								{
									"text": "The construction of berms and the berm itself shall\nnot interfere with the natural drainage, and the street side base\nof the berm shall be set back from the boundary line not less than\n12 feet."
								}
							]
						},
						{
							"number": "H. ",
							"content": [
								{
									"text": "No berm shall have a height greater than four feet\nin a front yard or six feet in a rear or side yard."
								}
							]
						},
						{
							"number": "I. ",
							"content": [
								{
									"text": "The height of a berm shall be the vertical distance\nfrom the top of the berm to the natural existing grade at the base\nof the berm."
								}
							]
						},
						{
							"number": "J. ",
							"content": [
								{
									"text": "All applications for a building permit for a berm\nshall include the following:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "A detailed grading plan of the entire site, indicating\nthe existing topography in contour intervals no greater than five\nfeet and the proposed topography in contour intervals no greater than\ntwo feet; the scale of the grading plan shall be no greater than one\ninch equals 20 feet;"
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "A cross section of the berm indicating the type of\nmaterials to be used in constructing the berm (i.e., fill or topsoil)\nand the location of landscaping; the scale of cross section shall\nbe no greater than one inch equals four feet; and"
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "A detailed landscaping plan indicating the location,\nsize and quality of the species to be planted."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "K. ",
							"content": [
								{
									"text": "All applications for a building permit for a berm\nshall be referred to the Planning Board[3] for its approval with respect to the compatibility of\nthe berm with the surrounding properties and associated land uses,\ndrainage considerations and landscaping."
								},
								{
									"footnote": "[3]\nEditor's Note: The Planning Board was abolished 12-20-2011 by L.L. No. 14-2011. See § 245-71.\n"
								}
							]
						},
						{
							"number": "L. ",
							"content": [
								{
									"text": "The Building Inspector shall not issue a permit for\na berm until Planning Board approval has been received.[Amended 2-18-2014 by L.L. No. 4-2014[4]]"
								},
								{
									"footnote": "[4]\nEditor's Note: This local law also repealed former Subsection L, regarding a thirty-day approval or denial, and redesignated former Subsections M and N as Subsections L and M, respectively.\n"
								}
							]
						},
						{
							"number": "M. ",
							"content": [
								{
									"text": "All provisions of this Zoning Code relating to building\npermits and construction shall apply to building permits for berms."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 245-51",
			"title": "Importation and exportation of fill.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Definitions. As used in this section, the following terms shall have\nthe following meanings:"
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Site plan approval required. Except to deposit and grade soil excavated at a site in compliance with §§ 245-65F and 245-66C and incident to any lawful construction which does not change the natural grade or existing topographical elevation or existing surface water runoff, the placement, deposit, excavation or importation of fill which either changes the natural grade or changes topographical elevation or changes surface water runoff shall be prohibited excepting upon Planning Board approval of a site plan for said placement, deposit, excavation or importation."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Fill permit required. The importation of fill shall, in addition\nto site plan approval, require a fill permit from the Planning Board.[1] The exportation of fill shall require an exportation permit\nfrom the Building Inspector."
								},
								{
									"footnote": "[1]\nEditor's Note: The Planning Board was abolished 12-20-2011 by L.L. No. 14-2011. See § 245-71.\n"
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "Exemptions. A fill permit is not required for any of the following:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Dredging of a waterway pursuant to all required regulatory approvals."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Any activity for which a waiver of fill permit is granted by the\nBoard of Trustees upon an express finding that regulation of such\nactivity is outside the purpose of enactment of this section."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Removal, cleanup and/or remediation of contaminated soil required\nby order of a federal or state agency pursuant to the Comprehensive\nEnvironmental Response, Compensation and Liability Act of 1980 or\nsimilar statute or regulation."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "Permit application. Any application for a fill permit shall include\nat least the following:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "A detailed statement of the proposed work, the proposed excavation\nor importation and exact condition of the plot or premises before\nthe work proposed to be accomplished under the requested permit is\ncommenced and proposed topography of said plot or premises when the\nwork is completed."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "An estimate prepared by a licensed engineer of the total volume of\nfill proposed to be excavated, or imported to the property."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "The elevations of all abutting properties to the extent available\nand to the extent necessary to indicate the existing drainage condition\nand its relationship to the subject property."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "A duly acknowledged consent of the owner of the premises, including\naddresses."
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "Where the application pertains to land used in agricultural production,\nthe application must be referred to the Commissioner of Agriculture\nand Markets of the State of New York or his or her duly appointed\nagent or representative to ascertain that any fill to be exported\nis apparently free from golden nematode or similar condition."
												}
											]
										},
										{
											"number": "(6) ",
											"content": [
												{
													"text": "The purpose of the proposed excavation or importation."
												}
											]
										},
										{
											"number": "(7) ",
											"content": [
												{
													"text": "The groundwater level at the location as determined by a current\ntest well or boring."
												}
											]
										},
										{
											"number": "(8) ",
											"content": [
												{
													"text": "The procedures whereby dust or other fugitive or windborne materials\nshall be controlled."
												}
											]
										},
										{
											"number": "(9) ",
											"content": [
												{
													"text": "A current site plan including such topographical data as required\nby the Planning Board.[2]"
												},
												{
													"footnote": "[2]\nEditor's Note: The Planning Board was abolished 12-20-2011 by L.L. No. 14-2011. See § 245-71.\n"
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "F. ",
							"content": [
								{
									"text": "Standards of review. The Planning Board, upon any review of an application\nhereunder, must affirmatively find that the importation of fill shall\nnot cause damage to Village roads or other Village resources; the\nplacement of any fill shall not cause adverse changes in existing\nsurface water runoff patterns; any change in topography resulting\nfrom the placement or removal of fill shall be necessary to the reasonable\ndevelopment of the site; and granting of any approval of a permit\nhereunder shall achieve a harmonious balance between existing site\ntopography and any development activity at said site."
								}
							]
						},
						{
							"number": "G. ",
							"content": [
								{
									"text": "Fee. Except as amended by resolution of the Board of Trustees, the\nfee for a fill permit shall be $10 per cubic yard of fill imported\nor exported. The fee for an exportation permit shall be calculated\nby the Building Inspector based on an estimate prepared by a licensed\nengineer of the total volume of fill to be exported. Any payment of\na fee shall be subject to a supplemental payment in the event the\nVillage Engineer determines that the applicant's estimate of\ncubic yards was inaccurate and understated. The payment of a fill\npermit fee and an exportation permit fee shall occur upon the filing\nof either application."
								}
							]
						}
					]
				}
			]
		}
	]
}