{
	"url": "http://ecode360.com/9145071",
	"paras": [
		{
			"paragraph": "§ 230",
			"title": "Village of Croton-on-Hudson Area and Bulk Schedule",
			"content": [
				{
					"text": "The following regulations shall apply in an RA-9 district:"
				},
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Minimum Lot Area (square feet): 9,375"
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Minimum Lot Width (feet): 75"
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Minimum Lot Depth (feet): 125"
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "Minimum Yards (feet) Front: 25"
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "Minimum Yards (feet) Side One/ Both Yards: 12/30"
								}
							]
						},
						{
							"number": "F. ",
							"content": [
								{
									"text": "Minimum Yards (feet) Rear: 30"
								}
							]
						},
						{
							"number": "G. ",
							"content": [
								{
									"text": "Habitable Floor Area (square feet) Total/Main Floor: 1000/880"
								}
							]
						},
						{
							"number": "H. ",
							"content": [
								{
									"text": "Floor Area Ratio: 0.40"
								}
							]
						},
						{
							"number": "I. ",
							"content": [
								{
									"text": "Maximum Height (stories/feet): 2.5/35"
								}
							]
						},
						{
							"number": "J. ",
							"content": [
								{
									"text": "Building Coverage(%): 35"
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 230-40",
			"title": "Supplementary regulations applicable to residence districts.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Accessory buildings."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "An accessory building may be located in any required\nside or rear yard, provided that:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "Such building shall not exceed 15 feet in height."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "Except as provided in Subsection H below for fences, walls, and retaining walls, such buildings shall be set back not less than five feet from any lot line.[Amended 3-6-2017 by L.L.\nNo. 1-2017]"
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "All such buildings in the aggregate shall not\noccupy more than 30% of the area of the required rear and side yards."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Accessory buildings on adjoining lots constructed\nat the same time may be located in pairs or groups in the required\nrear or side yard along the common side lot line or rear lot line\nof contiguous lots."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Relation of accessory buildings to streets. Except as provided in Subsection H below for fences, walls, and retaining walls, no accessory building shall project nearer to the streets on which the principal building fronts than such principal building. Should topographic conditions be such that practical difficulties would be caused by this requirement with respect to the location of garages or if the principal building does not face upon the street or for that or other reason related to topography or the characteristics of the neighborhood the requirement that accessory buildings project nearer to the street than such principal building is not appropriate, the Zoning Board of Appeals may authorize the issuance of a special permit for the erection of such garage or other accessory building which may project nearer to the street than such principal building, the normal front yard setback requirements for a principal building to apply to such garage or accessory building unless the Zoning Board of Appeals shall specify otherwise and except that the Zoning Board of Appeals may authorize the issuance of a special permit for the erection of garages within not less than 10 feet of the street line where the natural slope of the ground within 25 feet of such line is between 12% and 20% and within not less than five feet of the street line where such slope within 25 feet of such line exceeds 20%.[Amended 3-6-2017 by L.L.\nNo. 1-2017]"
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Corner lots."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Obstruction to vision at street intersections. At\nall street intersections in all residence districts, no obstructions\nto vision exceeding 30 inches in height above curb level shall be\nerected or maintained on any lot within the triangle formed by the\nstreet lines of such lot and a line drawn between points along such\nstreet lines 30 feet distant from their point of intersection, except\ntree trunks cleared to a height of eight feet."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Rear and side yards. On a corner lot, front yards\nare required on both street frontages, and one yard other than the\nfront yards shall be deemed to be a rear yard and the other or others,\nside yards. The minimum district requirements for each shall be complied\nwith."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "Exceptions to lot depth requirements. The minimum\nlot depth at any point may be decreased to 75% of the minimum requirement\nif the average depth conforms to the minimum requirement."
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "Exceptions to yard requirements."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Permitted obstructions. Cornices or cantilevered roofs may project\nnot more than two feet into a required yard. Belt courses, windowsills\nand other ornamental features may project not more than six inches\ninto a required yard. Paved terraces, steps and walks, other than\nsuch as are needed for access to the buildings on the lot, shall not\nproject within 15 feet of a street line or four feet of a property\nline.[Amended 3-6-2017 by L.L.\nNo. 1-2017]"
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Entries and porticos. A roofed-over but unenclosed\nprojection in the nature of an entry or portico not more than eight\nfeet wide and extending not more than six feet out from the front\nwall of the building shall be exempt from the requirements of this\nsubsection when the building otherwise complies with the regulations\nof this subsection. In computing the average setback, the presence\nof such entries and porticos shall be ignored."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Existing setback. No proposed one-family or two-family\ndwelling need have a front yard greater than the average setback of\ntwo or more existing dwellings located within 300 feet on each side\nof said proposed dwelling, on the same side of the street and within\nthe same block and the same district."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "F. ",
							"content": [
								{
									"text": "Exceptions to height requirements for office buildings\nand laboratories. District height limitations shall not apply to chimneys,\nantennas, ventilators, skylights, water tanks, bulkheads, cooling\ntowers, necessary mechanical appurtenances and similar features usually\ncarried above the roof level in office or laboratory buildings, provided\nthat:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "The aggregate area covered by all such features shall\nnot exceed 20% of the area of the roof of the building on which they\nare located."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "The height of each such feature shall not exceed 15\nfeet above the district height limitations."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "All such features, except antennas, shall be suitably\nscreened in a manner which is in harmony with the building of which\nthey are a part."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "G. ",
							"content": [
								{
									"text": "Existing small lots in all RA and RB Districts."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Less than required area or width. A lot owned individually and separately\non January 22, 1962, and owned individually and separately at all\ntimes thereafter, which has a total area or width less than prescribed\nherein, may be used for a one-family residence in RA and RB Districts\nand a two-family residence in RB Districts, provided that such a lot\nshall be developed in conformity with all applicable district regulations\nother than the minimum lot area and lot width requirements, and with\nthe minimum side yards set forth below:[Amended 11-3-2014 by L.L. No. 2-2014]"
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Less than required depth. A lot owned individually\nand separately on January 22, 1962, and owned individually and separately\nat all times thereafter, which has a depth less than that prescribed\nherein, may be used for a one-family residence in RA and RB Districts\nand a two-family residence in RB Districts, provided that such lot\nshall be developed in conformity with all applicable district regulations\nother than the minimum lot depth requirement and provided that the\nrear yard is at least 25% of the lot depth."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "H. ",
							"content": [
								{
									"text": "Fences and walls.[Added 3-6-2017 by L.L.\nNo. 1-2017]"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Fences or walls in front yards shall be not more than four feet in height and, in the case of fences, not more than 50% solid, except as provided in Subsection C(1) above; provided, however, that the Planning Board shall have the authority, during the site plan review process, to approve retaining walls in front yards with a maximum height of six feet if the Planning Board makes a determination that a higher wall is required for the grading necessary to construct the driveway or primary structure."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Fences or walls not over six feet in height may be erected anywhere\non a lot except in a front yard."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Fences not over eight feet in height and not more than 25% solid\nmay be erected anywhere on a lot except in a front yard."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "Fences shall be erected with the finished side facing the street(s)\nor abutting lot(s)."
												}
											]
										}
									]
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 230-41",
			"title": "Accessory apartments.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "An accessory apartment shall be permitted in a single-family detached\ndwelling, on a lot containing no more than one dwelling unit, in districts\npermitting single-family residences upon approval by the Planning\nBoard, subject to the conditions and limitations contained in this\nsection."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "No accessory apartment shall be installed or maintained except upon\napproval by the Planning Board. The application procedures and required\nsubmittals shall be the same as for minor site plan approval, except\nthat noticing shall be required for property owners within 100 feet\nof the subject property and that scaled floor plans for the dwelling,\nwith floor areas noted, shall be submitted as part of the application.\nThe application fee for an accessory apartment application shall be\nan amount set by resolution of the Board of Trustees. Approval for\nan accessory apartment shall be issued to and run with the property\nowner."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "The owner of a detached dwelling in which the accessory apartment is located shall occupy at least one of the dwelling units on the premises as his primary residence. For the purposes of this § 230-41C of the Zoning Code, the word \"owner\" shall mean: any individual who is an owner of the subject premises, including a joint tenant, tenant in common or tenant by the entireties; or the grantor and/or beneficiary of a trust that owns the subject premises; or the owner of a majority of the membership interest/share interest in an LLC or corporation that owns the premises."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "The Planning Board approval for an accessory apartment shall become\nnull and void within 90 days of any of the following events: change\nof property ownership; b) death of the property owner; or change in\nresidence of the owner. The Planning Board may grant a ninety-day\nextension past the expiration for good cause, including that an application\nhas been filed to continue an accessory apartment use."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Upon a change in ownership, should the new owner desire to continue\nthe accessory apartment use, then the owner shall apply to the Planning\nBoard for renewal of the approval."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "Only one accessory apartment per single-family detached dwelling\nshall be permitted."
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "No accessory apartment shall be permitted on premises where there\nis also a professional office use."
								}
							]
						},
						{
							"number": "F. ",
							"content": [
								{
									"text": "An accessory apartment shall be permitted only within the main structure\nand not within any accessory building. The character, degree and extent\nof any additions to the residence shall be a factor to be considered\nby the Planning Board in approval of an application for an accessory\napartment."
								}
							]
						},
						{
							"number": "G. ",
							"content": [
								{
									"text": "An accessory apartment shall have separate access, not observable\nfrom the street, unless there is a single access from the front of\nthe building with a split access inside the building."
								}
							]
						},
						{
							"number": "H. ",
							"content": [
								{
									"text": "All code requirements under Village law and other applicable laws\nand regulations shall be complied with and a building permit obtained\nfor any changes or alterations requiring such permit."
								}
							]
						},
						{
							"number": "I. ",
							"content": [
								{
									"text": "The habitable floor area of an accessory apartment shall be no less\nthan 400 square feet and no greater than the lesser of 750 square\nfeet or 33.3% of the habitable floor area of the dwelling in which\nit is contained."
								}
							]
						},
						{
							"number": "J. ",
							"content": [
								{
									"text": "The lot size for buildings containing accessory apartments shall\nconform to the requirements of the district in which the building\nis located, unless a variance shall have been granted by the Zoning\nBoard of Appeals."
								}
							]
						},
						{
							"number": "K. ",
							"content": [
								{
									"text": "The building shall, to the degree reasonably feasible, maintain the\ncharacter and appearance of a single-family dwelling."
								}
							]
						},
						{
							"number": "L. ",
							"content": [
								{
									"text": "A residence containing an accessory apartment shall have a minimum\nof three off-street parking spaces. In an RA-5 District, no expansion\nof the existing parking area shall be permitted in order to satisfy\nthis off-street parking requirement."
								}
							]
						},
						{
							"number": "M. ",
							"content": [
								{
									"text": "If the premises are not serviced by the Village sewer system, approval\nof the Westchester County Department of Health shall be obtained before\nPlanning Board approval."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 230-42",
			"title": "Supplementary regulations for the Multiple Residence RC District.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Exceptions to yard requirements. Garages designed\nso as to allow the use of the roof thereof as part of the grounds\nmay be erected in side or rear yards, not nearer than four feet to\nany property line, provided that the average height of such wall or\nwalls thereof which face a side lot line or a rear lot line is not\nin excess of 6 1/2 feet above the average level of such lot line.\nThe side yard provision may be eliminated, but not reduced, along\nany portion of a lot line where a building erected on an adjoining\nlot is built to the lot line, provided that the second side yard shall\nbe increased to a minimum width of two times the width otherwise required."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Exceptions to maximum coverage regulations. Where\nthe Board of Trustees finds that the provisions of the required off-street\nparking space underneath the principal building or in such a way as\nto enable the roof thereof to be used as part of the grounds would\nbe impractical, such Board may authorize the issuance of a special\npermit allowing accessory garages to cover an additional 10% of the\narea of the lot. Garages designed to enable the roof thereof to be\nused as part of the grounds shall be exempt from any coverage limitation."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Length of buildings. No building shall exceed a length\nof 160 feet."
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "Distance between buildings. The following minimum\ndistances between buildings shall be observed:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Between a principal building, other than a one-family\ndwelling, and a one-story accessory building: 20 feet."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Between any two other buildings: a distance equal\nto the average height of such buildings at the points where such buildings\nare nearest one to the other."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Notwithstanding any other provision, and except as\nprovided hereinafter, no building on any lot shall intrude into the\narea enclosed by an arc of a circle with a radius of 60 feet extending\n70° on each side of a line perpendicular to the center of any\nlegally required window, other than a bathroom or kitchen window,\nand the exterior radii of such arc. All measurements shall be performed\nin horizontal projection at the sill level of the subject window.\nThis limitation shall not apply to any wall of the same building the\nplane of which intersects the plane of the wall in which the subject\nwindow is located at an exterior angle of more than 80°. A minimum\ndistance of 60 feet shall be maintained between the subject window\nand any wall parallel thereto, whether such wall is a part of the\nsame or of another building on the same lot."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "Courts."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Inner courts are prohibited."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "The minimum width of an outer court shall be 20 feet,\nand the depth thereof shall not exceed its width."
												}
											]
										}
									]
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 230-42.1",
			"title": "Mixed occupancy.",
			"content": [
				{
					"text": "Dwelling units may be permitted on the non-street-level\nstory of buildings having nonresidential use on the street level,\nsubject to the issuance of a special permit from the Board of Trustees\nand in accordance with the following conditions:"
				},
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Mixed occupancy shall be permitted in Central Commercial\nC-1 and General Commercial C-2 Districts only and in buildings which\nconform to the New York State Uniform Fire Prevention and Building\nCode for the proposed mixed occupancy."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "The nonresidential use in a mixed-occupancy building\nshall be limited to the street level and shall not exceed 5,000 square\nfeet."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "The residential and nonresidential uses in a mixed-occupancy\nbuilding shall have separate means of access (this is, the entrance/exit\nfor residential use shall not be through the nonresidential use of\nthe building and vice versa), except that the Board of Trustees may,\nat its discretion, approve the use of a common lobby or plaza."
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "The nonresidential use of the building shall be provided with the number of parking spaces required by § 230-35 herein. In addition, two parking spaces per dwelling unit shall be provided for the residential use of the building. The requirement of this subsection may be waived by the Board of Trustees for buildings existing on the date of adoption of this section if there is insufficient area for parking on the site of a mixed-occupancy building."
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "All utility, storage, service and parking areas on\nthe site of the mixed-occupancy building shall be screened by means\nof landscaping and/or fencing to the extent deemed necessary and practical\nby the Board of Trustees in order to minimize the impact of these\nareas upon the residential use of the building."
								}
							]
						},
						{
							"number": "F. ",
							"content": [
								{
									"text": "Residential use shall not be permitted in buildings\nhousing motor vehicle sales and service agencies, motor vehicle service\nstations, manufacturing, animal hospitals, bowling alleys or any other\nuse deemed by the Board of Trustees to be incompatible with the residential\nuse of the building."
								}
							]
						},
						{
							"number": "G. ",
							"content": [
								{
									"text": "The provisions of this § 230-42.1 shall not apply to properties located in the Harmon/South Riverside Gateway Overlay area. Regulations governing Harmon/South Riverside Gateway Overlay area mixed-use buildings [as defined in § 230-20.3B(3)(a)] are contained in Article IVA of this chapter.[Amended 6-4-2012 by L.L. No. 1-2012[1]]"
								},
								{
									"footnote": "[1]\nEditor's Note: This local law also repealed L.L. No. 4-2009,\nadopted 11-16-2009, which was stayed by court-ordered stipulation.\nSection 12 of L.L. No. 1-2012 states: “The provisions of Sections\n2 through 9 of this local law shall not apply to any proposed project\nfor which a complete application has been submitted prior to the effective\ndate hereof. The provisions of the Zoning Law in effect on November\n15, 2009, shall apply to such proposed projects.”\n"
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 230-43",
			"title": "Nonresidential buildings.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Supplementary height regulations in RC, C-1, C-2,\nWC and PRE Districts. In RC, C-1, C-2, WC and PRE Districts, except\nfor one- or two-family dwellings, where a lot has frontage on two\nor more streets or other public ways, the height limitation shall\napply only as measured from the curb level along the street or way\nwith a higher elevation above sea level. When penthouses, etc., are\nover 12 feet high and cover more than 20% of the roof area, measurements\nmust be taken to the top of such penthouses or bulkheads. All penthouses,\nbulkheads, etc., must be 10 feet back of the front and rear walls\nof a building and three feet back of the side walls, except that walls\nof elevators and stair enclosures may be built on the side wall when\nrequired by the plan of the building. "
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Courts for nonresidential buildings."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Inner courts. No inner court shall have a minimum\ndimension less than 1/2 of the average height of all surrounding walls."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Outer courts. The minimum width of an outer court\nshall be 20 feet, and the depth thereof shall not exceed its width."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Obstruction to vision at street intersections. The provisions of § 230-40C(1) shall also apply to corner lots in nonresidential districts."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 230-44",
			"title": "Signs.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Intent. The purposes of the signage regulations set\nforth in this chapter are to encourage the effective use of signs\nas a means of communication in the Village; to minimize possible adverse\neffects of signs on nearby public and private properties; to maintain\nand enhance the visual and aesthetic environment; to improve pedestrian\nand vehicular traffic safety; and to enable the fair and consistent\nenforcement of these sign regulations by the Village."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Conformance. Any sign shall be erected, replaced, moved or modified in conformity with the provisions of this chapter. All actions related to questions of conformance shall be subject to the review and decision thereon by the Planning Board. See Subsection K below for the regulation of temporary signs. Where the provisions of Subsections D through O below may be in conflict with the signage provisions relating specifically to the respective zoning districts in Subsection P below, the latter provisions shall apply."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Application process."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Except as provided in Subsection K in connection with temporary signs, the Village Engineer shall receive, review and comment on conformance for all completed applications to erect, replace, move or modify signs. The Village Engineer shall then forward applications that are in substantial compliance to the Visual Environment Board (VEB) within five business days for VEB review and recommendation on the issuance of a sign permit. The Visual Environment Board's opinion shall be rendered to the Village Engineer and/or Planning Board within 21 days of receipt of said application. If the signage is part of an application for a site plan approval or a change of use approval, the Planning Board's decision on the site plan shall include its decision on the proposed signage."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "The payment of an application fee in accordance with\nthe Village's schedule of fees[1] shall accompany all sign permit applications."
												},
												{
													"footnote": "[1]\nEditor's Note: The current fee resolution\nis on file in the Village Clerk's office.\n"
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "The Village Engineer and VEB shall maintain a book\nof photographs and/or drawings representing the types and styles of\nsigns preferred in the Village in order to assist in expediting the\napplication process."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "Relationship to use. All signs, except for temporary signs and except for the kind of billboards permitted in Subsection M below, must pertain to a use conducted on the same property on which the sign is located."
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "Illumination."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Permitted signs may be illuminated except where this\nchapter specifically prohibits certain signs from being illuminated.\nHowever, sign illumination shall not be twinkling, flashing, intermittent\n(except for time/temperature signs), or of changing degrees of color\nor intensity. Further, neon signs shall only be permitted on the inside\nof buildings. No sign shall contain or consist of Day-Glo-like material."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "All light sources used for illuminating signage shall\nbe shielded and shall not be a source of glare."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Upon referral by the Village Engineer and/or VEB,\nthe Planning Board may require the submission of an illumination plan\nand may regulate the number, placement, intensity and hours of illumination\nof all light fixtures used for signage."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "F. ",
							"content": [
								{
									"text": "Placement. No sign shall be located so as to obscure\nany signs displayed by a public authority, nor shall any sign be placed\nin such a way as to obstruct proper vehicular sight distance. Further,\nsigns shall not interfere with pedestrian or vehicular traffic flow,\nnor shall any sign interfere with any ventilation system, door, window,\nfire escape or other emergency exit."
								}
							]
						},
						{
							"number": "G. ",
							"content": [
								{
									"text": "Movement, animation, removable letters, lights. No\nsign or sign component shall be moving, animated, rotating or revolving.\nFurther, no sign shall contain removable letters, except for signs\nassociated with educational, religious or municipal institutions,\ngas stations, or with movie theaters. In addition, light strips and\nstrings of lights shall not be used for advertising or attracting\nattention to a sign when they do not comprise the text of the sign."
								}
							]
						},
						{
							"number": "H. ",
							"content": [
								{
									"text": "Maintenance and quality of signs. All signs and components\nthereof shall be kept in good repair and in safe, neat and clean condition.\nAll signs and related illumination shall be of a professional quality\nwith respect to such matters as design, painting, lettering, materials\nand construction."
								}
							]
						},
						{
							"number": "I. ",
							"content": [
								{
									"text": "Nonconforming signs. All signs that do not conform to the provisions of this chapter shall be subject to the requirements of §§ 230-53 and 230-54 herein."
								}
							]
						},
						{
							"number": "J. ",
							"content": [
								{
									"text": "Projecting signs. Marquee signs are permitted for\ntheaters only. For all projecting signs, there shall be at least an\neight-foot clearance above pedestrian rights-of-way and at least a\nfourteen-foot clearance above vehicular rights-of-way for permitted\nsigns projecting from buildings. Signs shall not project vertically\nabove the roofline or parapet, or extend horizontally beyond the limits\nof the building."
								}
							]
						},
						{
							"number": "K. ",
							"content": [
								{
									"text": "Temporary signs."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Temporary signs are those which are displayed for\nshort periods of time. Unless specified otherwise below, all temporary\nsigns shall be limited in usage to a maximum of 45 days. Signs shall\nnot be considered temporary if they are effectively displayed on an\nongoing basis, interrupted by short intervals when they are not displayed."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "The following types of temporary signs do not require\na signage permit:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "\"For Sale,\" \"For Rent\" or \"Sold\" signs. No more\nthan two temporary signs, not exceeding six square feet in area each,\nare allowed for a single lot. One temporary sign, 16 square feet in\narea, is permitted for each real estate subdivision, set back at least\n15 feet from the street line upon which the property is located. This\nsignage usage shall be allowed beyond 45 days."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "Temporary construction signs. The architect,\nengineer and contractors shall each be allowed one sign not exceeding\nsix square feet in area. Such signs shall be permitted during the\nentire course of construction but shall be removed at the end of construction."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "Temporary signs pertaining to election campaigns. Such signs shall not be subject to the forty-five-day limitation in Subsection K(1) above but shall be removed within 10 days after the election day."
																}
															]
														},
														{
															"number": "(d) ",
															"content": [
																{
																	"text": "Temporary signs pertaining to garage sales,\ntag sales or other business activities which have a duration of seven\ncalendar days or less."
																}
															]
														},
														{
															"number": "(e) ",
															"content": [
																{
																	"text": "Temporary signs pertaining to events of civic, philanthropic, educational or religious institutions shall not be subject to the size limitation contained in Subsection K(4)."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Payment of a review fee in accordance with the Village's\nschedule of fees[2] shall accompany the application for signs which are subject\nto the issuance of a temporary sign permit."
												},
												{
													"footnote": "[2]\nEditor's Note: The current fee schedule is\non file in the Village Clerk's office.\n"
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "Except as provided in Subsections K(2)(a) through (e), temporary signs shall not exceed 16 square feet in area and shall not be illuminated."
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "Temporary signs shall not have an adhesive backing\nand must be easily removable without residual markings."
												}
											]
										},
										{
											"number": "(6) ",
											"content": [
												{
													"text": "Temporary signs must also conform to all of the other provisions of this chapter, except with respect to being of a professional quality as required in Subsection H above."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "L. ",
							"content": [
								{
									"text": "Freestanding signs. No freestanding sign shall extend\nmore than 10 feet from the ground to the top of the sign except for\na freestanding sign associated with a shopping center or a motor vehicle\nservice station, which shall not extend more than 20 feet from the\nground to the top of the sign."
								}
							]
						},
						{
							"number": "M. ",
							"content": [
								{
									"text": "Prohibitions. The following types of signs and artificial\nlighting are prohibited:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Billboards, except for those which are existing on\nthe effective date of these regulations and which are associated with\na site which is on the National Register of Historic Places."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Signs that compete for attention with or may be mistaken\nfor a traffic signal."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Searchlights, beacons, blimps and permanent balloons."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "Signs attached to or painted on trucks or other large\nvehicles when the vehicle is obviously marked and parked in such a\nmanner as to advertise or attract attention to an establishment or\nbusiness."
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "Banners, flags, strings of balloons, flags or lights,\nor similar outdoor advertising, except on a temporary basis with respect\nto the opening, reopening or remodeling of the business (that is,\nlimited to a maximum duration of 45 days)."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "N. ",
							"content": [
								{
									"text": "Consistent signage. Where a building or site is permitted\nmore than one sign by the provisions of this chapter, all new signs\nshall be consistent relative to one another in terms of size, general\nshape and, if building-mounted, location on the building (mounting\nheight). Further, the Planning Board may require the submission of\na master signage plan for the site which shows said consistency."
								}
							]
						},
						{
							"number": "O. ",
							"content": [
								{
									"text": "Window signs. The combination of permanent and temporary\nsignage applied to or placed within two feet of the interior of any\ngiven window shall be considered part of the signage in accordance\nwith the provisions of this chapter. Further, in no event shall permanent\nwindow signage exceed 25% of the window on or within which it is located.\nMerchandise for sale is not considered part of the signage for purposes\nof this item."
								}
							]
						},
						{
							"number": "P. ",
							"content": [
								{
									"text": "District standards. The following signage shall be permitted within the districts listed below and shall be regulated therein, as follows. Said signage shall also conform to the provisions of Subsections A through O above, as qualified in Subsection B."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "One-Family Residence RA-60, RA-40, RA-25, RA-9, RA-5\nDistricts; Two-Family Residence RB District; Multiple Residence RC\nDistrict.[Amended 11-3-2014 by L.L. No. 2-2014]"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "With respect to nurseries and the seasonal sale of produce, signs shall conform to Subsection P(1)(e) below."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "With respect to funeral homes, there shall be no signs other than those permitted in Subsection P(1)(e) below."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "With respect to customary home occupations, no display of signage shall be visible from the street, except as set forth in Subsection P(1)(e) below."
																}
															]
														},
														{
															"number": "(d) ",
															"content": [
																{
																	"text": "With respect to bed-and-breakfast establishments,\none sign designating a bed-and-breakfast establishment shall be permitted,\nsubject to the following conditions:"
																},
																{
																	"content": [
																		{
																			"number": "[1] ",
																			"content": [
																				{
																					"text": "The area of the sign shall not exceed two square\nfeet."
																				}
																			]
																		},
																		{
																			"number": "[2] ",
																			"content": [
																				{
																					"text": "If freestanding, the overall height of the sign shall not exceed six feet as measured from finished grade to top of sign. NOTE: Refer to § 230-4, the definition of \"building,\" and § 230-40A(1)(b) of this chapter."
																				}
																			]
																		},
																		{
																			"number": "[3] ",
																			"content": [
																				{
																					"text": "The sign shall not be internally illuminated."
																				}
																			]
																		},
																		{
																			"number": "[4] ",
																			"content": [
																				{
																					"text": "If externally illuminated, the illumination\nshall not exceed the equivalent of a one-hundred-watt bulb."
																				}
																			]
																		},
																		{
																			"number": "[5] ",
																			"content": [
																				{
																					"text": "If illuminated, the illumination shall be constant,\nshall be directed towards the sign and shall be shielded from the\nview of the street and neighboring properties."
																				}
																			]
																		}
																	]
																}
															]
														},
														{
															"number": "(e) ",
															"content": [
																{
																	"text": "Signs conforming to the following shall be permitted\nas accessory uses:"
																},
																{
																	"content": [
																		{
																			"number": "[1] ",
																			"content": [
																				{
																					"text": "One nonilluminated nameplate or professional\nsign with an area of not over two square feet."
																				}
																			]
																		},
																		{
																			"number": "[2] ",
																			"content": [
																				{
																					"text": "One externally illuminated bulletin board or other announcement sign for educational or religious institutions permitted in § 230-9.1A(4) of this chapter, with an area of not over 12 square feet."
																				}
																			]
																		}
																	]
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Limited Office O-1 District. One nonilluminated sign\nfacing a street and not exceeding an area of five square feet shall\nbe permitted."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Limited Office O-2 District. One sign shall be permitted,\nprovided that such sign is facing a street and as follows:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "The aggregate area, in square feet, shall be\nnot greater than 1 1/2 times the length, in feet, of the wall\non which it is placed."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "Such sign shall be parallel or perpendicular\nto the face of the building and no part thereof, including any illuminating\ndevices, shall project more than 12 inches outward from the face of\nthe wall to which it is applied for parallel signs and no more than\n36 inches outward from the face of the wall to which it is applied\nfor perpendicular signs."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "Central Commercial C-1 District."
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "Signs accessory to an establishment located on the same lot shall be permitted, provided that such signs shall be limited as set forth in Subsection P(4)(b) below and as follows:"
																},
																{
																	"content": [
																		{
																			"number": "[1] ",
																			"content": [
																				{
																					"text": "Not more than one such sign, excluding signs\nin windows, shall be permitted for each tenant on the premises on\neach facade which fronts on a street."
																				}
																			]
																		},
																		{
																			"number": "[2] ",
																			"content": [
																				{
																					"text": "The aggregate area, in square feet, of all signs\non any wall shall be not greater than two times the length, in feet,\nof the wall on which it is placed."
																				}
																			]
																		},
																		{
																			"number": "[3] ",
																			"content": [
																				{
																					"text": "Such sign or signs shall be parallel or perpendicular\nto the face of the building and no part thereof, including any illuminating\ndevices, shall project no more than 12 inches outward from the face\nof the wall to which it is applied for parallel signs and no more\nthan 36 inches outward from the face of the wall to which it is applied\nfor perpendicular signs."
																				}
																			]
																		},
																		{
																			"number": "[4] ",
																			"content": [
																				{
																					"text": "In addition, where the building is set back from the curbline a distance of 25 feet or more, not more than one freestanding sign with a total area on each face of not more than 40 square feet may be erected; provided, however, that the Zoning Board of Appeals may, in accordance with the procedure set forth in § 230-162B of this chapter, authorize the Village Engineer to issue a special permit for the erection or continuance of a freestanding sign with an area on each face not exceeding 40 square feet or such lesser area as the Zoning Board of Appeals may prescribe in instances where the building is set back from the curb or edge of traveled way less than 25 feet but 15 feet or more, subject to such conditions as the Zoning Board of Appeals may impose and with due regard to safety and other factors set forth in § 230-75B where the Board shall find that:"
																				},
																				{
																					"content": [
																						{
																							"number": "[a] ",
																							"content": [
																								{
																									"text": "The building in connection with\nwhich such sign is used or to be used was in existence on July 1,\n1963, and has not after that date been altered to cause it to be closer\nto the curbline or edge of traveled way; and"
																								}
																							]
																						},
																						{
																							"number": "[b] ",
																							"content": [
																								{
																									"text": "Other permitted signs are not,\nbecause of lack of visibility or other reason, adequate in the determination\nof the Zoning Board of Appeals and, for that or other reason, the\nZoning Board of Appeals deems such sign to be necessary or desirable."
																								}
																							]
																						}
																					]
																				}
																			]
																		}
																	]
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "Motor vehicle service stations."
																},
																{
																	"content": [
																		{
																			"number": "[1] ",
																			"content": [
																				{
																					"text": "Unless otherwise required by law, signs shall be limited to one freestanding sign and one exterior sign on each wall of a building fronting on a street and shall otherwise conform to the conditions for accessory signs set forth in Subsection P(5)(a)."
																				}
																			]
																		},
																		{
																			"number": "[2] ",
																			"content": [
																				{
																					"text": "In connection with the sale of used cars or\nrental of vehicles at a service station. No temporary signs shall\nbe permitted on the exterior of vehicles. Signs in the interior of\nvehicles shall be limited to one per vehicle, not to exceed 12 inches\nby 15 inches. Sign printing shall have characters not larger than\none inch."
																				}
																			]
																		}
																	]
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "General Commercial C-2 District."
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "Accessory signs shall be as permitted in the Central Commercial C-1 District as set forth in Subsection P(5)."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "Drive-in theaters. In lieu of signs other than a sign permitted by Subsection P(4)(a)[4], a drive-in theater may have:"
																},
																{
																	"content": [
																		{
																			"number": "[1] ",
																			"content": [
																				{
																					"text": "The name of the theater on a sign affixed to\nthe theater screen structure on the reverse side of the screen; and"
																				}
																			]
																		},
																		{
																			"number": "[2] ",
																			"content": [
																				{
																					"text": "A supplementary sign on that same face announcing\nthe feature attraction or attractions and containing other information\ncustomarily contained in theatrical announcements or the opening or\nclosing date of the theater."
																				}
																			]
																		}
																	]
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "Motor vehicle sales and service agencies."
																},
																{
																	"content": [
																		{
																			"number": "[1] ",
																			"content": [
																				{
																					"text": "Unless otherwise required by law, signs shall be limited to one freestanding sign and one exterior sign on each wall of a building fronting on a street and shall otherwise conform to the conditions for accessory signs set forth in Subsection P(4)(a)."
																				}
																			]
																		},
																		{
																			"number": "[2] ",
																			"content": [
																				{
																					"text": "No temporary signs shall be permitted on the\nexterior of vehicles. Signs in the interior of vehicles shall be limited\nto one per vehicle, not to exceed 12 inches by 15 inches. Sign printing\nshall have characters not larger than one inch."
																				}
																			]
																		}
																	]
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(6) ",
											"content": [
												{
													"text": "Light Industrial LI District."
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "Accessory signs. One sign shall be permitted\nfacing each street from which access to the lot is provided. Such\nsign shall be applied onto the wall of the building and shall not\nexceed an area of 50 square feet or an area equal to 1 1/2 times\nthe length, in feet, of the wall on which it is placed, whichever\nis less. All light sources shall be shielded from the view of adjacent\nlots and streets and shall, except for lights suitable for security\npurposes, be extinguished not later than 9:00 p.m. One identification\nsign at each point of access to the lot, with an area of not more\nthan three square feet, shall also be permitted. A single directory\nsign, not exceeding eight feet in height, may be erected at the entrance\nof a complex of sites; each listing on such sign shall not exceed\neight inches in height and two feet in length."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(7) ",
											"content": [
												{
													"text": "Waterfront Commercial WC District."
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "Accessory signs. One sign shall be permitted\nfacing each street from which access to the lot is provided. Such\nsign shall be applied onto the wall of the building, if any, and such\nsign shall not exceed an area of 30 square feet or an area equal to\n1 1/2 times the length, in feet, of the wall on which it is placed,\nwhichever is less. If there is no building, one freestanding sign\nshall be permitted, no higher than 10 feet from the ground, no greater\nthan 30 square feet in area, and no closer than 25 feet to the nearest\nlot line. All light sources shall be shielded from the view of adjacent\nlots and streets and shall, except for lights suitable for security\npurposes, be extinguished no later than normal business hours, as\ndetermined by the Planning Board."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(8) ",
											"content": [
												{
													"text": "Waterfront Development WD District."
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "Offices and studios. Signs for professional\noffices and studios shall be subject to P(1)(e) of this chapter."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "Other uses. For uses other than specified in\nP(8)(a) above, one sign shall be permitted facing each street from\nwhich access to the lot is provided. Such sign shall be applied onto\nthe wall of a building, if any, shall not exceed an area of 24 square\nfeet and shall not extend beyond said wall in any direction. If there\nis no building, one freestanding sign shall be permitted, shall be\nno higher than 10 feet above the ground, shall be no greater than\n24 square feet in size and shall be no closer than 25 feet to the\nnearest lot line. All light sources shall be shielded from the view\nof adjacent lots and streets and shall, except for lights suitable\nfor security purposes, be extinguished no later than normal business\nhours, as determined by the Planning Board during the site development\nplan review process."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "Directional, trail and project signs. Signage\nrelating to vehicular, pedestrian and bicycle usage, traffic and parking\nshall be permitted, as shall an entry sign for the project itself.\nThe locations, sizes, colors, materials and illumination of said signage\nshall be subject to the approval of the Planning Board as part of\nthe site development plan review process."
																}
															]
														},
														{
															"number": "(d) ",
															"content": [
																{
																	"text": "All signs. All signs shall meet the standards of § 230-44 of this chapter. Every effort shall be made to avoid the blockage of views in the placement of signage on the site."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(9) ",
											"content": [
												{
													"text": "Supplementary regulations for any parking spaces adjacent\nto residence districts. Identification and directional signs shall\nnot exceed an area of three square feet each and shall be limited\nto such as are essential for the particular use."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "Q. ",
							"content": [
								{
									"text": "Modification of requirements. Where the Planning Board finds that strict compliance with the requirements of § 230-44 would cause unusual hardship or difficulty because of the specific circumstances of a particular situation, the Board may modify the requirements of said section so long as the Board finds that the public interest will be protected and that any such modification will be consistent with the spirit and intent of this chapter. In permitting any such modification, the Planning Board may attach such conditions as are, in its judgment, necessary to substantially secure the objectives of the requirement so modified."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 230-45",
			"title": "Municipal buildings, structures and uses.",
			"content": [
				{
					"text": "The height and bulk limitations contained in Articles VI and VII of this chapter shall not apply to any municipal building, structure or use in connection with a municipal governmental function where there exists an engineering or other reason related to the particular site, building and use proposed in respect of which the opinion, in writing, of an independent engineer or expert shall have been obtained to the effect that the proposed building, structure or use will better serve its municipal function if it is carried out in a manner which is not in strict conformity with such height and bulk limitations; provided, however, that notwithstanding the nonapplicability of the height and bulk limitations in the circumstances set forth, any building, structure or use to which this section applies shall be authorized only by a resolution of the Board of Trustees which shall include:"
				},
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Findings of fact setting forth the engineering or\nother reason and the Board's determination to the effect above set\nforth."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "The Board's determination that the building, structure\nor use is for the purpose of carrying out a municipal governmental\nfunction."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Referring to the opinion, in writing, of an independent\nengineer or expert with respect to the proposed building, structure\nor use and setting forth the substance of such opinion and the Board's\ndetermination that it complied with the foregoing provisions."
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "The Board's determination that the proposed building,\nstructure or use will be in general harmony with the general purposes\nand intent of this chapter. considered in the light of the overall\nhealth and welfare of the Village and that it will not be detrimental\nto the public welfare."
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "Prescribing such limitations and conditions with respect\nto the building. structure or use as the Board of Trustees may deem\nnecessary or desirable."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 230-46",
			"title": "Amusement games and devices.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "No more than two amusement devices shall be maintained,\nexhibited or used in the same premises in any zoning district in the\nVillage at any one time."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Subsection A above shall be inapplicable to any amusement device in existence at any premises within the Village on January 1, 1982, provided that it remains at the same premises, and to any substitute or replacement device of the same general character at the same premises."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 230-47",
			"title": "Performance standards.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Restrictions on creation of dangerous and objectionable elements. Every use subject to performance standards shall conform to the restrictions set forth in Subsections B and C below."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Measurement at the point of emission. The existence\nof the following dangerous and objectionable elements shall be determined\nat the location of the use creating the same or at any point beyond,\nand these shall be limited as follows:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Explosives. Activities involving the storage or manufacture\nof materials or products which decompose by detonation are prohibited,\nexcept for those under the jurisdiction of the Police Department.\nThe list of materials or products which decompose by detonation, when\nin sufficient concentrations, includes but is not limited to the following:"
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Fire hazards. All activities involving and all storage\nof flammable and explosive materials shall be provided with adequate\nsafety devices against the hazard of fire and adequate fire-fighting\nand fire-suppression equipment and devices standards in this industry.\nBurning of waste materials in open fires is prohibited. The relevant\nprovisions of other state and local laws and regulations shall also\napply."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Radioactivity or electrical disturbance. No activities\nshall be permitted which emit dangerous radioactivity at any point.\nNo activities shall be permitted which produce electrical and/or electromagnetic\ndisturbances, except from domestic household appliances and from communications\nequipment subject to control of the Federal Communications Commission\nor appropriate federal agencies which adversely affect the operation\nat any point of any equipment other than that of the creator of such\ndisturbance."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "Smoke. No emission shall be permitted any point from\nany chimney or otherwise of visible gray smoke of a shade darker than\nNo. 1 on the Ringlemann Smoke Chart as published by the United States\nBureau of Mines. (Power's Miscro-Ringelmann Chart, McGraw-Hill Publishing\nCompany, 1954, may be used.) This provision, applicable to visible\ngray smoke, shall also apply to visible smoke of a different color\nbut with an equivalent apparent opacity."
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "Other forms of air pollution. No emission of fly ash,\ndust, fumes, vapors, gases and other forms of air pollution shall\nbe permitted which can cause any damage to health, to animals or vegetation\nor to other forms of property or which can cause any excessive soiling\nof any paint, and in no event shall any emission of any solid or liquid\nparticles in concentrations exceeding 0.3 grains per (standard) cubic\nfoot of the conveying gas or air at any point be permitted. For measurement\nof the amount of particles in gases resulting from combustion, standard\ncorrections shall be applied to a stack temperature of 500° F.\nand 50% excess air."
												}
											]
										},
										{
											"number": "(6) ",
											"content": [
												{
													"text": "Liquid or solid wastes. No discharge shall be permitted\nat any point into any private sewage disposal system or stream or\ninto the ground of any materials in such a way or of such nature or\ntemperature as can contaminate any water supply or otherwise cause\nthe emission of dangerous or objectionable elements, except in accord\nwith standards approved by the State Department of Health, Water Pollution\nControl Board or County Health Department. No accumulation of solid\nwastes conducive to the breeding of rodents or insects shall be permitted."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Measurement at the lot line. The existence of the\nfollowing dangerous and objectionable elements shall be determined\nat the lot line of the use creating the same or at any point beyond\nsaid lot line, and these shall be limited as follows:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Noise. At the specified points of measurement the\nsound-pressure level of noise radiated continuously from a facility\nat nighttime shall not exceed the values for octave bands lying within\nthe several frequency limits given in Table I after applying the corrections\nshown in Table II. The sound-pressure level shall be measured with\na sound level meter and an octave band analyzer conforming to specifications\nprescribed by the American Standards Association, Inc., New York,\nNew York (American Standard Sound Level Meters for Measurement of\nNoise and Other Sounds, 224.3-1944, American Standards Association,\nInc., New York, New York, and American Specification for an Octave\nBand Filter Set for the Analysis of Noise and Other Sounds, 224.10-1953,\nor latest approved revision thereof, American Standards Association,\nInc., New York, New York, shall be used.)"
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Vibration. No vibration shall be permitted which is\ndiscernible to the human sense of feeling for three minutes or more\nduration in any one hour of the day between the hours of 7:00 a.m.\nand 7:00 p.m. or of 30 seconds or more duration in any one hour between\nthe hours of 7:00 p.m. and 7:00 a.m. No vibration at any time shall\nproduce an acceleration of more than 0.1 g or shall result in any\ncombination of amplitudes and frequencies beyond the \"safe\" range\nof Table 7, United States Bureau of Mines Bulletin No. 442, Seismic\nEffects of Quarry Blasting, on any nearby structure. The methods and\nequations of said Bulletin No. 442 shall be used to compute all values\nfor the enforcement of this subsection."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Odors. No emission shall be permitted of odorous gases\nor other odorous matter in such quantities as to be offensive at the\nspecified points of measurement. Any process which may involve the\ncreation or emission of any odor shall be provided with a secondary\nsafeguard system so that control will be maintained if the primary\nsafeguard system should fail. There is hereby established, as a guide\nin determining such quantities of offensive odors, Table III (Odor\nThresholds) in Chapter 5, Air Pollution Abatement Manual, Copyright\n1951, by Manufacturing Chemists' Association, Inc., Washington, D.C."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "Glare. No direct or sky-reflected glare shall be permitted,\nwhether from floodlights or from high-temperature processes, such\nas combustion or welding or otherwise, so as to be visible at the\nspecified points of measurement. This restriction shall not apply\nto signs otherwise permitted by the regulations."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "Elimination of nonconformities. Within 12 months after\nDecember 31, 1972, all existing uses, buildings or other structures\nshall comply with the applicable performance standards herein set\nforth; provided, however, that if the Zoning Board of Appeals finds\nthat because of the nature of the corrective action required the twelve-month\nperiod is inadequate, it may, as a special permit, grant not more\nthan one extension for a period of not more than six months. All new\nuses, buildings or other structures shall comply with the applicable\nperformance standards when put into operation."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 230-48",
			"title": "(Reserved)\n[1]",
			"content": [
				{
					"footnote": "[1]\nEditor's Note: Former § 230-48, Dish antennas, added 12-16-1985 by L.L. No. 11-1985, as amended, was repealed 1-31-2005 by L.L. No. 1-2005; see now § 230-74, Plan amendments for dish antennas.\n"
				}
			]
		}
	]
}