{
	"url": "http://ecode360.com/6237215",
	"paras": [
	    {
        	"paragraph": "§ 125e",
        	"title": "TABLE OF DIMENSIONAL REQUIREMENTS - RESIDENTIAL",
        	"content": [
        		{
        			"text": "The following regulations shall apply in a TF district:"
        		},
        		{
        			"content": [
        				{
        					"number": "1. ",
        					"content": [
        						{
        							"text": "Minimum Lot Area (square feet): 10,000"
        						}
        					]
        				},
        				{
        					"number": "2. ",
        					"content": [
        						{
        							"text": "Minimum Yard Requirements Front (feet): 35"
        						}
        					]
        				},
        				{
        					"number": "3. ",
        					"content": [
        						{
        							"text": "Minimum Yard Requirements Lesser Side/ Total Both Sides (feet): 15/35"
        						}
        					]
        				},
        				{
        					"number": "4. ",
        					"content": [
        						{
        							"text": "Minimum Yard Requirements Rear (feet): 40"
        						}
        					]
        				},
        				{
        					"number": "5. ",
        					"content": [
        						{
        							"text": "Maximum Height (stories): 2.5"
        						}
        					]
        				},
        				{
        					"number": "6. ",
        					"content": [
        						{
        							"text": "Maximum Height (feet): 35"
        						}
        					]
        				},
        				{
        					"number": "7. ",
        					"content": [
        						{
        							"text": "Maximum Coverage, Building: 20%"
        						}
        					]
        				}
        			]
        		}
        	]
        },
		{
			"paragraph": "§ 125-9",
			"title": "Minimum requirements.",
			"content": [
				{
					"text": "In interpreting and applying this Zoning Ordinance,\nthe requirements contained herein are declared to be the minimum requirements\nnecessary for the protection and promotion of the public health, safety\nand general welfare. This chapter shall not be deemed to affect, in\nany manner whatsoever, any easements, covenants or other agreements\nbetween parties, except that, where this chapter imposes a greater\nrestriction upon the use of structures or land or upon the erection,\nconstruction, establishment, moving, alteration or enlargement of\nstructures than those which are imposed by easements, covenants or\nagreements or by public ordinances, rules, regulations, licenses,\ncertificates or other authorizations, the provisions of this Zoning\nOrdinance shall prevail."
				}
			]
		},
		{
			"paragraph": "§ 125-10",
			"title": "Conformance required.",
			"content": [
				{
					"text": "No structure shall be erected, constructed,\nmoved, altered, rebuilt or enlarged, nor shall any land, water or\nstructure be used, designed or arranged to be used, for any purpose\nexcept in accordance with this Zoning Ordinance and with the requirements\nstated in this Zoning Ordinance for the district in which such building\nor land is located."
				}
			]
		},
		{
			"paragraph": "§ 125-11",
			"title": "Nonconforming uses and structures.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Continuing of existing nonconforming uses. Any lawful\nuse of a structure or of land existing on the effective date of this\nchapter may be continued even though such use does not conform with\nthe use provisions of this chapter. Such uses shall be deemed nonconforming\nuses."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Nonconforming use of land. Where no structure is involved,\nthe nonconforming use of land may be continued, provided that:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Such nonconforming use shall not be enlarged or increased,\nnor shall it be extended to occupy a greater area of land than occupied\nby such use at the time of the adoption of this chapter."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "The lot on which such nonconforming use is located\nshall not be reduced in size."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Such nonconforming use shall not be moved, in whole\nor in part, to any other portion of the lot or parcel of land occupied\nby such nonconforming use at the time of the adoption of this chapter."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "If such nonconforming use of land or any portion thereof\nceases for any reason whatsoever for a continuous period of more than\nsix months or is changed to a conforming use, any future use of such\nland shall be in conformity with all provisions of this chapter."
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "No nonconforming use of land shall be changed to another\nnonconforming use."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Nonconforming use of structures. The nonconforming\nuse of a building or structure may be continued, provided that:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Such building or structure shall not be enlarged or\nextended unless the use therein is changed to a conforming use."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Such nonconforming building or structure shall not\nbe structurally altered or reconstructed, except for such alteration,\nmaintenance and repair work as is required to keep said building or\nstructure in a safe condition."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Such nonconforming use shall be changed only to a\nconforming use."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "If such nonconforming use of a building or structure\nceases for any reason for a continuous period of more then six months\nor is changed to a conforming use, then any future use of such building\nor structure and the land on which it is located shall be in conformity\nwith all provisions of this chapter for the district in which it is\nlocated."
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "Any such nonconforming building or structure damaged\nor destroyed by any means to an extent greater than 50% of its fair\nmarket value, as determined by the Town Assessor, shall be permitted\nto be reconstructed only if the future use of the building or structure\nand the land on which it is located is in conformity with this chapter.\nAny such nonconforming building or structure damaged to an extent\nless than 50% of said fair market value may be rebuilt, provided that:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "The resumption of the nonconforming use takes\nplace within one year of the time of its interruption."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "The cost of such reconstruction or structural\nalteration is less than 50% of said fair market value."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "The reconstruction or structural alteration\nis commenced within six months of the date of such damage and completed\nwithin 18 months of the date of such damage."
																}
															]
														},
														{
															"number": "(d) ",
															"content": [
																{
																	"text": "Where such rebuilding can reasonably be accomplished\nso as to result in greater conformity with this chapter, then the\nrebuilding shall be so done."
																}
															]
														}
													]
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "Dimensional nonconformity. A building or structure\nthat is conforming in use, but does not conform to the lot area, effective\nsquare, yard dimension, height, setback, coverage, off-street parking,\nloading or similar dimensional requirements of this chapter, shall\nbe deemed to be dimensionally nonconforming. No permit shall be issued\nthat will result in the increase of any dimensional nonconformity,\nbut any building or structure or any portion thereof may be altered\nto decrease its dimensional nonconformity. An increase in the height\nof a dimensionally nonconforming structure shall constitute an increase\nin dimensional nonconformity and, consequently, no permit shall be\nissued authorizing such an increase in height.[Amended 3-16-2004 by L.L. No. 5-2004]"
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 125-12",
			"title": "Lots.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Every building hereafter erected shall be located\non a lot, as herein defined. There shall be not more than one main\nbuilding and its accessory buildings on each minimum size lot, except\nfor nonresidential buildings in districts where such uses are permitted.\nOn one undivided parcel of land in size equal to or greater than twice\nthe minimum acreage as required for the districts established hereunder,\nno more than two main buildings and their accessory buildings shall\nbe permitted; provided, however, that, in each such instance, all\nmain and accessory buildings must conform to all lot requirements\nestablished hereunder the same as if such buildings were placed on\ntwo separate and independent parcels of land."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "In addition to the minimum lot area shown on the Table\nof Dimensional Requirements[1] for the district in which a lot is located, such lot shall\ncontain an effective square with a side dimension equal to that required\nin the Table of Dimensional Requirements. Where a lot is located on\na curve with a radius of 500 feet or less measured at the front lot\nline, the side of the effective square closest to the front lot line\nmay be reduced by no more than one-third (1/3) if the opposite side\nis increased by the same amount, thus forming a trapezoid instead\nof a square."
								},
								{
									"footnote": "[1]\nEditor's Note: The Table of Dimensional Requirements\nis included at the end of this chapter.\n"
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 125-13",
			"title": "Road frontage and access strips.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "No permit shall be issued for any land use or structure\nunless the lot upon which such land use is to be established has a\nfrontage which has been suitably improved to Town road standards or\na bond posted therefor and unless the actual access to such use or\nsuch structure will be over such frontage; all in accordance with\nthe provisions of § 280-a of the Town Law."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "The following standards shall apply to the creation\nof new lots:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "A minimum frontage of 25 feet shall be required."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Access strips, as defined in § 125-3 herein, shall be not less than 25 feet in width, measured along a line perpendicular to the center line of the access strip. In its review of subdivision plats, the Planning Board may limit the length of the access strip for reasons of health, safety or public welfare."
												}
											]
										}
									]
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 125-14",
			"title": "Land under water or mapped as wetland.",
			"content": [
				{
					"text": "No more than 25% of the minimum lot area required\nunder the Zoning Ordinance may be satisfied by land which is under\nwater or mapped as a wetland by the Wetlands Control Commission, except\nthat in an R-4A District, no more than 50% may be so satisfied."
				}
			]
		},
		{
			"paragraph": "§ 125-15",
			"title": "Obstructions in yards; fences and gates.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "No fence or gate shall be erected except as provided\nherein:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "A fence or gate may be erected in a residential district\nwholly within the lot lines of the subject property, provided that\nthe fence:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "Is located 20 feet or more from the front lot\nline and does not exceed six feet in height."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "Is located less than 20 feet from the front\nlot line and does not exceed four feet in height; provided that a\npermit for same has been issued by the Building Inspector."
																},
																{
																	"content": [
																		{
																			"number": "[1] ",
																			"content": [
																				{
																					"text": "Application for a fence or gate shall be made\non a form or forms provided by the Town. An application shall be accompanied\nby a plan or sketch clearly showing the location and height of the\nproposed fence or gate and it shall state the material of which it\nshall be constructed, all of which shall be in conformity with this\nchapter and accompanied by the appropriate fee. The Building Inspector\nmay require the submission of an as-built survey to confirm the location\nof the fence."
																				}
																			]
																		},
																		{
																			"number": "[2] ",
																			"content": [
																				{
																					"text": "A permit to construct a fence or gate shall\nbe in effect for six months from issuance."
																				}
																			]
																		},
																		{
																			"number": "[3] ",
																			"content": [
																				{
																					"text": "A final inspection must be conducted by the\nBuilding Department after completion of the installation of the fence\nor gate to check for compliance with the provisions of this chapter."
																				}
																			]
																		},
																		{
																			"number": "[4] ",
																			"content": [
																				{
																					"text": "The fee for issuance of a permit shall be set\nby resolution of the Bedford Town Board."
																				}
																			]
																		}
																	]
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "Is located inside the required front, side and\nrear yard requirements, provided that it conforms to the provisions\nof this chapter with respect to walls of structures, with each 12\nfeet or fraction thereof being deemed a story of a principal structure."
																}
															]
														},
														{
															"number": "(d) ",
															"content": [
																{
																	"text": "Encloses a swimming pool, provided that it conforms\nto the New York State Uniform Fire Prevention and Building Code, in\naddition to these regulations."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "A fence or gate may be erected in a nonresidential district wholly within the lot lines of the subject property, provided that the fence or gate does not exceed six feet in height, with any such fence or gate being subject to site plan review in accordance with Article IX, Site Plan Approval, of this chapter."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "The following provisions shall apply to all fences\nand gates, residential and nonresidential, in the Town of Bedford:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "A fence or gate shall be erected within property\nlines so that the smooth or finished side shall face to the outside\nof the premises. All fence posts shall be placed on the inside of\na fence, except for a fence to contain livestock."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "No fence or gate shall be erected in such a\nmanner as to inhibit or divert the natural drainage flow or cause\nthe blockage or damming of surfacing water creating ponding."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "No fence or gate shall be erected which may\ncreate a fire hazard or other dangerous condition or which may result\nin obstruction to effective fire fighting."
																}
															]
														},
														{
															"number": "(d) ",
															"content": [
																{
																	"text": "Fences and gates shall be erected within the\nboundaries of the applicant’s property."
																}
															]
														},
														{
															"number": "(e) ",
															"content": [
																{
																	"text": "Fences and gates shall be maintained in a safe\nand substantial condition."
																}
															]
														},
														{
															"number": "(f) ",
															"content": [
																{
																	"text": "Any driveway gate that obstructs access to the\nproperty for Fire Department personnel is required to be equipped\nwith an approved hold-open device for emergency operation. This device\nmust be approved by the Building Department. The emergency operation\nof these gates shall be maintained at all times. As to existing gates\nthat obstruct driveway access, the section shall be effective as of\nJuly 1, 2005."
																}
															]
														},
														{
															"number": "(g) ",
															"content": [
																{
																	"text": "No fence shall be located or constructed on\na terrace or wall that will result in or have an overall height of\nmore than that permitted, unless such fence shall be located at least\n10 feet back from that terrace or wall."
																}
															]
														},
														{
															"number": "(h) ",
															"content": [
																{
																	"text": "No fence or gate shall be erected within 20\nfeet of a public street which shall, in the judgment of the Superintendent\nof Highways, be a safety hazard or obstruct the view of vehicular\nor pedestrian traffic on such streets."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "The following fences and gates and fencing materials\nare specifically prohibited:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "Barbed, razor or ribbon wire or broken glass\nas part of any fence or gate, unless specifically permitted."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "Pointed metal fences or gates, unless located\nwithin either the Bedford Village Historic District or the Katonah\nHistoric District and approved by the Bedford Historic District Review\nCommission or the Katonah Historic District Advisory Commission."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "Canvas and/or cloth fences, except when used\nto protect shrubs and vegetation."
																}
															]
														},
														{
															"number": "(d) ",
															"content": [
																{
																	"text": "Electrically charged fences and gates."
																}
															]
														},
														{
															"number": "(e) ",
															"content": [
																{
																	"text": "Poultry and/or turkey wire fences and gates\nwithin minimum front, side and rear yards."
																}
															]
														},
														{
															"number": "(f) ",
															"content": [
																{
																	"text": "Temporary fences or gates, such as snow fences,\nunless on sites under construction or for snow control."
																}
															]
														},
														{
															"number": "(g) ",
															"content": [
																{
																	"text": "Expandable fences and gates and collapsible\nfences and gates, except during construction of a building."
																}
															]
														},
														{
															"number": "(h) ",
															"content": [
																{
																	"text": "Chain link fences and gates erected with the\nopen loop at the top of the fence."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "All existing fences and gates which do not conform\nto the provisions of this chapter may be continued as they presently\nexist, except that these fences and gates shall not be altered, extended,\nreplaced or modified except in accordance with the provisions of this\nchapter."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "A cornice, chimney or other architectural feature\nmay project beyond the wall of a building into a yard so as to reduce\nby no more than 12 inches, the required minimum dimensions of such\nyard. Such a cornice or other architectural feature may measure in\narea no more than 25% of the wall upon which it is located."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Mailboxes."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 125-16",
			"title": "Awnings and canopies beyond property lines.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "An awning projecting beyond the property line of any\nlot into a public right-of-way shall not be erected or maintained\non any building or structure, unless such awning be at all points\nat least seven feet above the level of said right-of-way, nor shall\nany such awning project beyond the line of said public road a distance\ngreater than six feet. Any such awning shall be firmly affixed to\nthe building to which it is accessory and entirely supported by such\nbuilding."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "A permanent marquee or canopy projecting beyond the\nproperty line of any plot into a public right-of-way shall not be\nerected or maintained, except that a temporary and/or removable canopy\nmay be erected, provided that the canopy shall be at all points at\nleast seven feet above the level of said public right-of-way, and\nall parts of said canopy and its supports shall be at least 20 inches\nback of the gutter of such public right-of-way."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 125-17",
			"title": "Adjustment of front yard depth.",
			"content": [
				{
					"text": "If the alignment of existing buildings within\n100 feet of each side of the lot in question and within the same block\nand district and on the same side of the road is nearer to the road\nthan the front yard depth prescribed in the Table of Dimensional Requirements,[1] the front yard depth for any building or structure on\nthat lot may be taken as the average front yard depth of the adjoining\nbuildings."
				},
				{
					"footnote": "[1]\nEditor's Note: The Table of Dimensional Requirements\nis included at the end of this chapter.\n"
				}
			]
		},
		{
			"paragraph": "§ 125-18",
			"title": "Yard requirements for corner lots.",
			"content": [
				{
					"text": "On a corner lot, there shall be provided a side\nyard on a side street equal in depth to the required front yard. The\nrear yard may be elected by the owner, provided that it is indicated\non plans filed with the Building Inspector."
				}
			]
		},
		{
			"paragraph": "§ 125-19",
			"title": "Sight distance on corner lots.",
			"content": [
				{
					"text": "On a corner lot, no fence, wall, structure,\ntree or shrubbery or other obstruction more than three feet in height\nabove the plane of the established grade of the roads shall be erected\nor placed on any part of the front or side yard herein established\nthat is included within the triangular area formed by the nearest\nedges of road pavement and a straight line between two points each\na minimum of 75 feet back from the intersection of the nearest edges\nof pavement prolonged. Such obstructions may be permitted if authorized,\nin writing, by the Highway Superintendent."
				}
			]
		},
		{
			"paragraph": "§ 125-20",
			"title": "Exceptions to height limitations.",
			"content": [
				{
					"text": "The maximum building height limitations of this\nchapter shall not apply to flagpoles, church spires, belfries, domes,\nchimneys, ventilators, skylights, tanks or solar energy collectors\nor other similar features and necessary mechanical appurtenances not\nused for human occupancy, provided that:"
				},
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "They shall not extend more than 15 feet above the\nroof; and"
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "The total area covered by such features shall not\nexceed 10% of the area of the roof upon which they are located."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 125-21",
			"title": "Inner court dimensions.",
			"content": [
				{
					"text": "The least dimension of any inner court at the\nsill level of the lowest windows shall be at least equal to the height\nof the highest wall forming part of such court."
				}
			]
		},
		{
			"paragraph": "§ 125-22",
			"title": "Sewer or septic system required.",
			"content": [
				{
					"text": "No structure of any kind in which persons customarily\nlive, sleep, eat, work or congregate shall be erected unless such\nbuilding is equipped with toilet facilities connected with a public\nsewer or septic tank or to some other means of disposal approved by\nthe Westchester County Department of Health."
				}
			]
		},
		{
			"paragraph": "§ 125-23",
			"title": "Underground installation of utilities.",
			"content": [
				{
					"text": "In any development requiring site plan review under the provisions of Article IX of this chapter, all new utilities and services, including lines and equipment for providing power and/or communication, including cable television, shall be installed underground. All installations shall be made in accordance with the rules and regulations of the appropriate municipal district and/or utility company. If the site includes a new road, all underground utility lines, except for underground service connections, shall be located outside the traveled way. If located outside of the road right-of-way, the necessary easements for this purpose must be provided prior to site plan approval by the Planning Board."
				}
			]
		},
		{
			"paragraph": "§ 125-24",
			"title": "Buffer screening areas.",
			"content": [
				{
					"text": "Any application to the Planning Board or Board\nof Appeals for the erection, construction, enlargement, alteration\nor movement of any building or structure or for the establishment\nof any use within any business or industrial district or any nonresidential\nuse in any residence district shall include provisions for a buffer\nscreening area at least 10 feet in width along any lot line abutting\nor, if determined necessary by the approving authority, directly across\nthe street from any lot in a residence district. This requirement\nmay be waived by the approving authority in situations where it determines\nthat large distances, topographic features or existing vegetation\nsatisfy the same purpose. Where such a buffer screening area is required,\nit shall meet the following standards:"
				},
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "It shall be of evergreen planting of such type, height,\nspacing and arrangement as, in the judgment of the approving authority,\nwill screen the activity involved from the neighboring residential\narea. Nonevergreen planting may seasonally supplement evergreen planting,\nbut not take its place."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "The plan and specifications for such planting shall\nbe filed with the plans for the use of the lot."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Required planting shall be properly trimmed and maintained\nin good condition at all times."
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "A wall or fence, of location, height, design and materials approved by the approving authority as providing equivalent screening may be substituted for part or all of the required planting. Walls and fences are subject to the requirements of § 125-15A of this Article."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 125-25",
			"title": "Keeping of animals.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "General regulations. The following regulations apply\nto the maintenance of animals in all districts:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "The maintenance, breeding, raising, purchase and/or\nsale of all animals and their products, including but not limited\nto milk and eggs, is considered an accessory use and is permitted,\nsubject to the requirements listed below."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "The acreage required to meet the standard for one\ntype of animal may not also be applied to meet the standard for another\ntype of animal. For example, the maintenance of two horses and four\ngoats on one lot would require a lot area of at least five acres."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "All animals living primarily within the residence\nand not regulated below are excluded from these regulations."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "All animals shall be suitably contained to prevent\ndamage to persons and property."
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "Regulations for types of animals not regulated in Subsection B below and not excluded in Subsection A(3) above may be determined by the Planning Board."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Regulations for specific animals."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Fowl (such as chickens and ducks)."
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "The maintenance of 12 or fewer fowl is permitted\nas an accessory use in the R-1/2A, R-1A, R-2A and R-4A Districts.\nNo roosters shall be permitted in the R-1/2A and R-1A Districts."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "All feed shall be housed in rodentproof containers."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "The maintenance of more than 12 fowl on a lot\nmust meet the following standards:"
																},
																{
																	"content": [
																		{
																			"number": "[1] ",
																			"content": [
																				{
																					"text": "At least four acres of lot area in the R-4A\nDistrict is required."
																				}
																			]
																		},
																		{
																			"number": "[2] ",
																			"content": [
																				{
																					"text": "All structures used for the housing and feeding\nof fowl and all exercise yards, pens or other areas used for their\nmaintenance shall be located at least 50 feet from each property line\nand at least 150 feet from any existing residence other than that\non the lot. Abutting lots with common beneficial ownership shall be\nconsidered a single lot."
																				}
																			]
																		}
																	]
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Goats and sheep."
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "The maintenance of two or fewer goats or sheep\nis permitted as an accessory use on conforming lots in the R-1A, R-2A\nand R-4A Districts. All structures, exercise yards, pens or other\nareas used for their maintenance shall be located at least five feet\nfrom each property line."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "All feed shall be housed in rodentproof containers."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "The maintenance of three or more goats or sheep\non a lot must meet the following standards:"
																},
																{
																	"content": [
																		{
																			"number": "[1] ",
																			"content": [
																				{
																					"text": "At least one acre of lot area is required for\nthe first two goats or sheep. An additional one-half (1/2) acre of\nlot area is required for each goat or sheep after two."
																				}
																			]
																		},
																		{
																			"number": "[2] ",
																			"content": [
																				{
																					"text": "All structures used for the housing or feeding\nof goats or sheep shall be located at least 50 feet from each property\nline and at least 150 feet from any existing residence other than\nthat on the lot. All exercise yards, pens or other areas used for\ntheir maintenance shall be located at least five feet from each property\nline."
																				}
																			]
																		}
																	]
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Horses. On conforming lots in the R-2A and R-4A Districts,\nthe maintenance of horses is permitted as an accessory use, subject\nto the conditions listed below:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "Two acres of lot area shall be required for\nthe first horse; one acre of lot area shall be required for each horse\nafter one."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "Barns and manure storage areas shall be located\nat least 50 feet from each property line and 150 feet from any existing\nresidence other than that on the lot. Fences and all exercise yards\nor pasture lands shall be located at least five feet from each property\nline. Abutting lots with common beneficial ownership shall be considered\na single lot."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "All feed shall be housed in rodentproof containers."
																}
															]
														},
														{
															"number": "(d) ",
															"content": [
																{
																	"text": "The boarding of 10 or more horses on any property requires the approval of a special permit by the Planning Board. (See § 125-78.)"
																}
															]
														},
														{
															"number": "(e) ",
															"content": [
																{
																	"text": "Riding instruction is permitted, provided that\nno paid advertising is used to announce such use and provided that\ninstruction is limited to a single pupil at a time."
																}
															]
														},
														{
															"number": "(f) ",
															"content": [
																{
																	"text": "Commercial livery stables are not permitted."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "Cattle."
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "On conforming lots in the R-2A and R-4A Districts,\nthe maintenance of cattle is permitted as an accessory use. Two acres\nof lot area shall be required for the first such animal; one acre\nof lot area shall be required for each such animal after one."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "All structures used for the housing or feeding\nof cattle shall be located at least 50 feet from each property line\nand at least 150 feet from any existing residence other than that\non the lot. All exercise yards, pens or other areas for their maintenance\nshall be located at least five feet from all property lines. Abutting\nlots with common beneficial ownership shall be considered a single\nlot."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "All feed shall be housed in rodentproof containers."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "Dogs.[1]"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "Dogs less than six months old shall be exempt\nfrom these regulations."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "The maintenance of three or fewer dogs is permitted\nas an accessory use in any district."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "The maintenance of four or more dogs must meet\nthe following standards:"
																},
																{
																	"content": [
																		{
																			"number": "[1] ",
																			"content": [
																				{
																					"text": "At least one-half (1/2) acre of lot area is\nrequired for the first three dogs. An additional one-fourth (1/4)\nacre of lot area is required for each dog after four."
																				}
																			]
																		},
																		{
																			"number": "[2] ",
																			"content": [
																				{
																					"text": "All structures used for the housing or feeding\nof dogs shall be located at least 50 feet from each property line\nand at least 150 feet from any existing residence other than that\non the lot. All exercise yards, pens or other areas for their maintenance\nshall be located at least five feet from each property line. Abutting\nlots with common beneficial ownership shall be considered a single\nlot."
																				}
																			]
																		}
																	]
																}
															]
														},
														{
															"number": "(d) ",
															"content": [
																{
																	"text": "The maintenance of eight or more dogs on a lot is considered a kennel and requires the approval of a special permit by the Planning Board. (See § 125-73.)"
																}
															]
														}
													]
												},
												{
													"footnote": "[1]\nEditor's Note: See also Ch. 48, Dogs.\n"
												}
											]
										},
										{
											"number": "(6) ",
											"content": [
												{
													"text": "Swine."
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "The maintenance of two or fewer swine is permitted\nas an accessory use on conforming lots in the R-2A and R-4A Districts."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "All feed shall be housed in rodentproof containers."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "The maintenance of three or more swine on a\nlot must meet the following standards:"
																},
																{
																	"content": [
																		{
																			"number": "[1] ",
																			"content": [
																				{
																					"text": "At least one-third (1/3) of an acre is required\nfor each animal."
																				}
																			]
																		},
																		{
																			"number": "[2] ",
																			"content": [
																				{
																					"text": "All structures used for the housing or feeding\nof swine shall be located at least 50 feet from each property line\nand at least 150 feet from any existing residence other than that\non the lot. All exercise yards, pens or other areas for their maintenance\nshall be located at least 50 feet from each property line. Abutting\nlots with common beneficial ownership shall be considered a single\nlot."
																				}
																			]
																		},
																		{
																			"number": "[3] ",
																			"content": [
																				{
																					"text": "The maintenance of 10 or more swine requires\nthe approval of a special permit from the Planning Board."
																				}
																			]
																		}
																	]
																}
															]
														}
													]
												}
											]
										}
									]
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 125-26",
			"title": "Tag sales.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Tag sales may be conducted from a residential property,\nprovided that:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Signs advertising the tag sale shall comply with the\nrequirements of § 125-117L herein."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "The number of tag sales shall be limited to one per\nyear and shall be limited to a maximum duration of three consecutive\ndays."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Religious institutions and charitable organizations\nshall be exempt from these regulations, except that the sign regulations\nlisted in § 125-117L shall be met."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 125-27",
			"title": "Accessory buildings or structures.",
			"content": [
				{
					"text": "The accessory buildings and structures listed\nbelow shall be permitted in all districts, subject to the following:"
				},
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "The total building coverage of all principal and accessory buildings and structures, regardless of size, located on a lot shall comply with the maximum building coverage requirements in § 125-50 herein."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "The following shall be considered accessory buildings\nor structures for the purposes of this section: tennis courts, paddle\ntennis courts and similar facilities without provisions for night\nplay; swimming pools; garages for passenger or commercial vehicles;\ngreenhouses; playhouses; garden houses; toolhouses; stables; barns;\nsolar energy collectors and studios.[Amended 2-7-1984; 5-15-1984; 8-1-1989]"
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Accessory buildings and structures not greater than 100 square feet in floor area and not more than 10 feet in height measured to the highest point of the building or structure shall be located not closer than one-third (1/3) of the side yard and rear yard dimensions specified in § 125-50 herein. Accessory buildings and structures shall comply with the front yard setbacks specified therein."
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "Individual accessory buildings and structures greater\nthan 100 square feet in ground floor area or greater than 10 feet\nin height shall meet the following requirements:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Accessory buildings and structures permitted under this section shall comply with the front, rear and side yard requirements specified in § 125-50 herein and shall be limited in height to a maximum of 20 feet measured to the highest point of the building or structure."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "The ground floor of an individual accessory building\nor structure permitted under this section shall not exceed 0.5% of\nthe area of the lot on which the accessory building or structure is\nlocated."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "The construction of an accessory building or structure over 2,500 square feet in ground floor area or greater than 20 feet in height shall require the issuance of a special permit by the Planning Board pursuant to the requirements of Article VII herein."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "In calculating maximum building coverage, 50% of the\nsquare footage of tennis courts should be included in the calculation\nof building coverage.[Added 6-7-2005 by L.L. No. 7-2005]"
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 125-28",
			"title": "Customary home occupations.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "It is the intent of this section to permit customary home occupations\nto be conducted and carried on in an existing dwelling unit or in\nan existing accessory structure, provided that such customary home\noccupation does not disturb the residential characteristics and nature\nof the neighborhood in which it is located."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "A customary home occupation is a special use permit for which the\nPlanning Board is authorized to grant a special use permit in all\nresidential zoning districts subject to the following conditions:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "The use is conducted solely within the dwelling unit or in an existing\naccessory structure by the occupants of the dwelling and the use is\nclearly incidental and secondary to the use of the dwelling unit for\nliving purposes."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "There is no external display or advertising of goods or services\nor other external evidence of such use except for one nonilluminated\nnameplate not over one square foot in area, with letters not exceeding\n1 1/2 inches in height."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "The establishment of such occupation shall not require external alterations\nor involve exterior construction features not customarily found in\nresidential neighborhoods with the exception of alterations required\nfor handicapped accessibility."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "The occupation does not utilize an area exceeding 25% of the floor\narea of the first story of the dwelling unit or 500 square feet, whichever\nis less. In the case of an accessory structure, the limits of not\nmore than 25% of the first floor of the residential building or 500\nsquare feet shall also apply. In addition, there shall be no expansion\nof the existing building area of an accessory structure to permit\nthe home occupation."
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "The appliances and equipment shall be operated in such a manner that\nthey do not produce and emit, beyond the boundaries of the lot on\nwhich the use is located, dust, glare, hazard, heat, light, noise,\nnuisance, odor, radiation, radio or television interference, smoke\nor vibration and are in no other manner obnoxious, offensive or detrimental\nto the immediate neighborhood."
												}
											]
										},
										{
											"number": "(6) ",
											"content": [
												{
													"text": "The use itself is conducted in such a manner or during such hours\nthat it is in no way obnoxious, offensive or detrimental to the immediate\nneighborhood."
												}
											]
										},
										{
											"number": "(7) ",
											"content": [
												{
													"text": "There are to be no employees other than members of the family residing\nin the dwelling unit."
												}
											]
										},
										{
											"number": "(8) ",
											"content": [
												{
													"text": "No article is sold or offered for sale except such as produced by\nmembers of the immediate family residing in the dwelling."
												}
											]
										},
										{
											"number": "(9) ",
											"content": [
												{
													"text": "In the case of an instructor in violin, etc., music teacher or tutor\nof standard scholastic subjects, the office or studio shall be so\nequipped and used that the sounds therefrom shall not be heard beyond\nthe boundaries of the premises on which the use is located."
												}
											]
										},
										{
											"number": "(9A) ",
											"content": [
												{
													"text": "No more than one client shall be served by the customary\nhome occupation at one time on the property."
												}
											]
										},
										{
											"number": "(10) ",
											"content": [
												{
													"text": "There shall be no more than one customary home occupation within\na lot."
												}
											]
										},
										{
											"number": "(11) ",
											"content": [
												{
													"text": "There shall be no outside storage of equipment, supplies and/or commercial\nvehicles related to the permitted home occupation."
												}
											]
										},
										{
											"number": "(12) ",
											"content": [
												{
													"text": "The Planning Board shall determine the number of off-street parking\nspaces that must be provided, their location on the lot and the screening\nwhich shall be provided. The customary home occupation shall be so\nconducted that on-street parking shall not exceed what would be expected\nfor a residence without such home occupation, and, if it is not so\nconducted, the special use permit shall be subject to revocation."
												}
											]
										},
										{
											"number": "(13) ",
											"content": [
												{
													"text": "The proposed customary home occupation and the parking and traffic\nincident thereto:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "Will not create or aggravate hazards or dangers to the public or\nto persons in the vicinity."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "Will not be incongruous with or detrimental to the prevailing residential\ncharacter of the neighborhood."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "Will not impair the use, enjoyment or value of adjacent residential\nproperties."
																}
															]
														},
														{
															"number": "(d) ",
															"content": [
																{
																	"text": "Will not detract from the appearance of the area."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(14) ",
											"content": [
												{
													"text": "The Planning Board may permit a customary home occupation in an accessory\nstructure which has existed for at least five years and, in the opinion\nof the Planning Board, meets all conditions of this section. In evaluating\nthe proposal the Planning Board shall consider whether an accessory\nstructure's use for a customary home occupation will alter the\nexisting residential character of the neighborhood."
												}
											]
										},
										{
											"number": "(15) ",
											"content": [
												{
													"text": "The Planning Board must first consider the following before granting\na special use permit hereunder:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "In making any determination whether to approve or deny a special\nuse permit for a customary home occupation, the Planning Board shall\ntake into account other factors, such as the proximity of schools\nand other home occupations."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "In addition in granting any such permit, the Planning Board may impose\nreasonable conditions consistent with preserving the character of\nthe neighborhood and the public health, safety, morals and general\nwelfare of the community appropriate to the application. Among the\nlimitations which may be imposed are"
																},
																{
																	"content": [
																		{
																			"number": "[1] ",
																			"content": [
																				{
																					"text": "A limit on the hours of operation and on the number of visitors permitted\nper hour."
																				}
																			]
																		},
																		{
																			"number": "[2] ",
																			"content": [
																				{
																					"text": "Notwithstanding Subsection B(11) above, a prohibition of on-street parking."
																				}
																			]
																		},
																		{
																			"number": "[3] ",
																			"content": [
																				{
																					"text": "A requirement that visitors must have scheduled appointments."
																				}
																			]
																		},
																		{
																			"number": "[4] ",
																			"content": [
																				{
																					"text": "A limit on the number of vehicles that may be parked in the driveway\nor designated parking area of the premises at any one time."
																				}
																			]
																		},
																		{
																			"number": "[5] ",
																			"content": [
																				{
																					"text": "A requirement that driveways must be expanded, or may not be expanded\nto accommodate visitor parking."
																				}
																			]
																		},
																		{
																			"number": "[6] ",
																			"content": [
																				{
																					"text": "Restrictions on public advertising inviting patients, clients, customers\nor students to visit the premises if the premises is identified by\nspecific address."
																				}
																			]
																		},
																		{
																			"number": "[7] ",
																			"content": [
																				{
																					"text": "The scope of the use for which the residence is to be used and/or\nany other restrictions which may be reasonable, in light of the potential\nadverse impacts of operation of the customary home occupation to the\nneighborhood."
																				}
																			]
																		},
																		{
																			"number": "[8] ",
																			"content": [
																				{
																					"text": "Other conditions as appropriate to the application."
																				}
																			]
																		}
																	]
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(16) ",
											"content": [
												{
													"text": "Any such special permit granted under this section shall be limited\nto a period of one year and may be renewed for additional periods\nas determined by the Planning Board."
												}
											]
										},
										{
											"number": "(17) ",
											"content": [
												{
													"text": "Any permit granted by the Planning Board shall apply only to the\nuse described in such permit, and it shall expire upon the termination\nor modification of such use, the sale of the property, or any increase\nin the future size of the dwelling unit or accessory structure."
												}
											]
										},
										{
											"number": "(18) ",
											"content": [
												{
													"text": "In considering any special use permit for a customary home occupation,\nthe Planning Board shall consider whether the site has been subject\nto a current violation of any provision of the Zoning Code, or is\na nonconforming structure in any respect, and may deny the permit\nbased on that information."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Inspection."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "All residents engaging in existing home occupations, as well as those\nreceiving special permits pursuant to this section, shall be subject\nto the right of inspection of their premises by the Building Inspector\nor Code Enforcement Officer upon 30 days' written notice."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "The failure to permit an annual inspection by the Building Inspector\nor Code Enforcement Officer shall constitute a violation of the provisions\nof this section and result in the immediate revocation of the lawfully\npermitted home occupation."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "All presently existing customary home occupations must come into compliance with this section within 10 years of the effective date. For all other purposes, until the expiration of the ten-year period, said customary home occupations shall be deemed nonconforming accessory uses and shall be subject to compliance with the regulations of § 125-11 of this chapter."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "Penalties for offenses. Any owner who fails to secure a special permit\nfor the operation of a customary home occupation, as provided in this\nchapter, or who otherwise violates the provisions of this chapter\nshall be guilty of an offense punishable by a fine of up to $250 or\nimprisonment not to exceed 15 days, or both, upon conviction of a\nfirst offense; and for the second and each subsequent conviction,\nby a fine of not less than $500 nor more than $1,000 or imprisonment\nnot to exceed 15 days, or both. Each week's continued violation\nshall constitute a separate additional violation."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 125-29",
			"title": "Coin- or electrically operated amusement devices.",
			"content": [
				{
					"text": "The operation of three or fewer coin- or electrically\noperated amusement devices is permitted as an accessory use to any\nlawful use permitted in the NB, CB, RB, LI or PB-R District. The operation\nof more than three coin- or electrically operated amusement devices\nin conjunction with any use or as a separate use is prohibited in\nall districts."
				}
			]
		},
		{
			"paragraph": "§ 125-29.1",
			"title": "Aircraft and airfields.",
			"content": [
				{
					"text": "The Town finds that due to the proximity of\nthe Westchester County Airport, the landing of craft in the Town is\nnot required to serve the transportation needs of Town residents.\nTherefore, no landings or takeoffs of any aircraft and no airfields\nare permitted in any district."
				}
			]
		},
		{
			"paragraph": "§ 125-29.2",
			"title": "DH Diversified Housing District.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Purposes. The purpose of the DH District shall be\nto provide increased housing opportunities in the Town of Bedford\nfor an economically diverse population who, because of reasons of\ncost, are presently excluded from purchasing residences in the Town\nof Bedford. It is the intent of the Town to provide the lowest cost\nhousing possible in this district. The Town Board, with the cooperation\nof the Blue Mountain Housing Corporation and all Town, county, state\nand federal agencies, will work to use all possible means to provide\nhousing for those with moderate means."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Middle-income housing in the DH District. At least 20% of the dwelling units constructed in the DH District shall be middle-income dwelling units as defined in this code and shall meet the requirements of Article VI, § 125-56 therein, as well as the requirements of the DH District."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 125-29.3",
			"title": "EL Housing For Elderly District.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Purposes. The purpose of the EL District is to provide\nincreased housing opportunities for the elderly population of the\nTown of Bedford. Because many of the elderly live on limited incomes,\nit is the intent of the Town to provide the lowest cost housing possible\nin this district. The Town Board, with the cooperation of the Blue\nMountain Housing Corporation and all Town, county, state and federal\nagencies, will work to use all possible means to provide housing for\nthose elderly with limited financial means."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Middle-income housing in the EL District. At least 20% of the dwelling units constructed in the EL District shall be middle-income dwelling units as defined in this code and shall meet the requirements of Article VI, § 125-56 therein, as well as all requirements of the EL District."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 125-29.4",
			"title": "Aquifer Protection Zone.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Findings. The Town of Bedford finds that:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "The groundwater underlying the Town is a major\nsource of its existing and future water supply, including drinking\nwater."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "The groundwater aquifers are integrally connected\nwith and flow into the surface waters, lakes and streams, which constitute\na major source of drinking water for New York City or for parts of\nthe State of Connecticut."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Accidental spills and discharges of toxic and\nhazardous materials have threatened the quality of such groundwater\nsupplies and related water resources in the Town, posing potential\npublic health and safety hazards."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "Unless preventive measures are adopted to control\nthe discharge and storage of toxic and hazardous materials within\nthe Town, further spills and discharges of such materials will predictably\noccur and with greater frequency and degree of hazard by reason of\nincreasing construction, commercial and industrial development, population\nand vehicular traffic in the Town."
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "The foregoing conclusions are confirmed by findings\nset forth in the Water Quality Management Plan of Westchester County,\nprepared pursuant to Section 208 of the Federal Clean Water Act, and\nby Town-commissioned studies."
												}
											]
										},
										{
											"number": "(6) ",
											"content": [
												{
													"text": "There is also a growing concern for control\nof nitrate-nitrogen in the aquifer within tolerable amounts."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Purpose. The purpose of this section is to protect\nthe public health, safety and welfare through the preservation of\nthe Town's major groundwater resources to ensure a future supply of\nsafe and healthful drinking water for the Town of Bedford, local residents\nand employees and the general public. The designation of Aquifer Protection\nZones and careful regulation of development activities within these\nzones can reduce the potential for groundwater contamination. The\npurpose of this section is to protect areas having a high potential\nfor use as a water supply and thereby to maintain the existing quality\nand improve the future quality of the groundwaters of the Town of\nBedford."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Aquifer Protection Zone: location; applicability."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "These regulations shall apply to all land and\nuses encompassed within the Aquifer Protection Zone as designated\non a map entitled \"Town of Bedford, New York Aquifer Map,\" dated December\n5, 1985, which map is hereby made a part of these regulations.[1]"
												},
												{
													"footnote": "[1]\n Editor's Note: The New York Aquifer Map is\non file in the office of the Town Clerk.\n"
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "These regulations shall be in addition to other\nrequirements for the zoning districts designated on the Zoning Map\nof the Town of Bedford and shall apply irrespective of other sections\nof this code.[2]"
												},
												{
													"footnote": "[2]\n Editor's Note: The consolidated Zoning Map\nis on file in the office of the Town Clerk.\n"
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "Use regulations for Aquifer Protection Zones."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Permitted principal and accessory uses. All uses which are permitted under the existing zoning regulations are permitted in the Aquifer Protection Zone unless otherwise identified in Subsection D(2), (3) and (4) below, including the following:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "On-site sewage disposal systems, provided that\nno such system shall discharge more than 300 gallons of wastewater\nper acre per day, as determined by the following schedule:"
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "On-site storage of heating oil in tanks of less\nthan 1,100 gallons installed below ground, provided that such tanks\nare designed and constructed in accordance with the standards of the\nNew York State Department of Environmental Conservation rules and\nregulations for bulk storage (6 NYCRR 614). Replacement tanks must\nmeet the requirements of this section."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Special permit uses."
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "Within the Aquifer Protection Zone, each use below requires the issuance of a special permit by the Planning Board pursuant to the requirements of §§ 125-57 through 125-65:"
																},
																{
																	"content": [
																		{
																			"number": "[1] ",
																			"content": [
																				{
																					"text": "On-site sewage disposal systems that discharge more than 300 gallons of wastewater per acre per day as measured by the criteria of § 125-29.4D(1)(a)."
																				}
																			]
																		},
																		{
																			"number": "[2] ",
																			"content": [
																				{
																					"text": "The use of common septic fields or sewage treatment plants for residential development under the provisions of §§ 125-51 through 125-56 (conservation development) and § 107-22B and C (conservation subdivision) of this Code."
																				}
																			]
																		},
																		{
																			"number": "[3] ",
																			"content": [
																				{
																					"text": "The handling and storage of road salt and deicing\nmaterials, provided that structural and nonstructural measures are\nimplemented to prevent leachate contamination. Such measures may include,\nbut are not limited to, building enclosures, impervious pads and pavements,\nself-contained drainage systems, detention basins, filters, separators\nor other devices and other management practices."
																				}
																			]
																		},
																		{
																			"number": "[4] ",
																			"content": [
																				{
																					"text": "Groundwater heat pumps supplying heating and\ncooling for other than a one-family detached dwelling unit, provided\nthat such systems are designed to treat, if necessary, and return\ndischarged water to the groundwater."
																				}
																			]
																		}
																	]
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "As stated in § 125-61, the Planning Board may at each such conditions and safeguards to any special permit as are, in its opinion, necessary to ensure initial and continued conformance to all applicable standards and requirements. Such conditions may include, but are not limited to, monitoring wells and the requirement of additional setbacks from sewage disposal systems to downgradient property lines."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Prohibited uses. The following uses are prohibited\nuses within the Aquifer Protection Zone:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "The disposal of hazardous materials or solid\nwaste."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "The treatment of hazardous materials, but not\nincluding rehabilitation programs authorized by a government agency\nfor treating existing hazardous materials."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "The storage of hazardous materials, except in\nsealed or unopened containers for resale or in containers normal for\nhousehold use."
																}
															]
														},
														{
															"number": "(d) ",
															"content": [
																{
																	"text": "The creation of hazardous materials."
																}
															]
														},
														{
															"number": "(e) ",
															"content": [
																{
																	"text": "Dry-cleaning and dyeing establishments and laundries\nthat utilize cleaning solvents."
																}
															]
														},
														{
															"number": "(f) ",
															"content": [
																{
																	"text": "Printing and photo processing establishments."
																}
															]
														},
														{
															"number": "(g) ",
															"content": [
																{
																	"text": "Furniture and finish stripping establishments."
																}
															]
														},
														{
															"number": "(h) ",
															"content": [
																{
																	"text": "The storage of hydrocarbon products except for\nheating oil and vehicle fuel stored in vehicle tanks."
																}
															]
														},
														{
															"number": "(i) ",
															"content": [
																{
																	"text": "Oil, gasoline or hazardous material pipelines."
																}
															]
														},
														{
															"number": "(j) ",
															"content": [
																{
																	"text": "Disposal of septic sludge."
																}
															]
														},
														{
															"number": "(k) ",
															"content": [
																{
																	"text": "Uses otherwise allowed in the zone which may\ndischarge hazardous materials into the groundwater."
																}
															]
														},
														{
															"number": "(l) ",
															"content": [
																{
																	"text": "Automotive service stations; public garages."
																}
															]
														},
														{
															"number": "(m) ",
															"content": [
																{
																	"text": "Nonconforming uses or structures. Any lawful use of a structure or of land, existing as of the effective date of this section, shall be deemed nonconforming and may be continued subject to the provisions of § 125-11."
																}
															]
														}
													]
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "Aquifer impact assessment. All applications for a special permit pursuant to § 125-29.4D(2) shall include an aquifer impact assessment. The purpose of this assessment shall be to demonstrate that no activities will be conducted upon the property that will result in groundwater infiltration into a designated aquifer such that, at a confidence level of 90%, the New York State Drinking Water Standards (10 NYCRR 5) will not be violated at the property line. Said assessment shall be prepared by a qualified hydrogeologist at the expense of the applicant. The cost to the Town of hydrogeologic review of such assessment shall be paid by the applicant. The aquifer impact assessment shall include, insofar as is pertinent to the application:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Aquifer flow characteristics, including a delineation\nof the primary recharge area, distribution of transmissivity and details\nof the hydrologic budget, including natural and man-induced sources\nof recharge and withdrawal. Existing data from Town studies on the\naquifer areas may be used in the aquifer impact assessment."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Details of the proposed aquifer usage, including\nstatic conditions of the potentiometric surface, range of withdrawals\nanticipated and the potentiometric surface at critical points in that\nrange. An estimate of the quantity of induced surface flows at each\ncritical point in the range shall also be detailed."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Potential impacts resulting from the planned\ndischarges or withdrawals, including impacts to other users of the\naquifer (wells, surface expressions of groundwater, etc.) in terms\nof levels, quantity of water available and induced quality changes.\nThe impacts resulting from induced infiltration, including quantity\nimplication to both the groundwater and surface water systems, shall\nbe addressed."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "Proposed measures to mitigate any adverse impacts,\nthe system for monitoring quantity, quality or any other aspect deemed\nimportant, including monitoring wells, and a reporting schedule, shall\nbe specified."
												}
											]
										}
									]
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 125-29.5",
			"title": "Child day care.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Subject to the regulations of the Department of Social Services under Social Services Law, § 390, and its implementing regulations and § 125-3, child day care is a permitted use."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "The provisions of the foregoing section notwithstanding, any building or structure to be erected, constructed, enlarged, altered, structurally altered or moved in connection with any child day-care use shall be subject to the building permit requirements of §§ 125-125A, B, E, F and G, the certificate of compliance requirements of § 125-126 and the certificate of occupancy requirements of § 125-127 hereof."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 125-29.6",
			"title": "Affordable housing.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Findings; policy. The Town of Bedford finds that:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "The Town faces a shortage of affordable housing due to the high\ncost of housing in the Town, which impacts the general welfare of\nthe municipality."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "The Town has an obligation to assist Westchester County and\nNew York State in the preservation, rehabilitation, and construction\nof affordable housing."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "The social and economic diversity of the Town is dependent upon\na reasonable supply of affordable housing."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "The Town's Comprehensive Plan encourages the creation of\naffordable housing within the Town."
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "The Town Housing Agency utilizes substantial resources in providing\nand assisting in the provision of affordable housing."
												}
											]
										},
										{
											"number": "(6) ",
											"content": [
												{
													"text": "It is the policy of the Town to require applicants to share\nin the creation of affordable housing."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Purpose. The purpose of this section is to ensure that new residential\ndevelopment in the Town includes a reasonable supply of fair and affordable\nhousing. This section sets forth standards for affordable housing\nto be provided in conjunction with residential development of land."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Applicability."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "This section shall apply to all proposed residential development\nof land."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "This section shall not apply to any residential development\nwhich has received preliminary subdivision or site plan approval by\nthe Town of Bedford Planning Board as of the effective date of this\nsection."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "Creation of AAFFH units."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "AAFFH units in single-family zoning districts."
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "Within all residential developments of five or more units, no\nless than 10% of the total number of units must be created as AAFFH\nunits. For this purpose, 0.5 unit shall be rounded to the next highest\nwhole number. For example, a development of 17 units will require\ntwo AAFFH units. These units must be provided on the site of the proposed\ndevelopment."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "Within all residential developments of less than five units, in addition to the methods specified in § 125-29.6D(1)(a) and (b) above, the Planning Board may require a fee-in-lieu payment in accordance with the requirements of § 125-29I."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "When a proposed residential subdivision contains 20% or more\naffordable housing units, the Planning Board may:"
																},
																{
																	"content": [
																		{
																			"number": "[1] ",
																			"content": [
																				{
																					"text": "Waive or reduce certain fees for applicants."
																				}
																			]
																		},
																		{
																			"number": "[2] ",
																			"content": [
																				{
																					"text": "Consider such other forms of assistance which may be under the\ncontrol of the Town."
																				}
																			]
																		},
																		{
																			"number": "[3] ",
																			"content": [
																				{
																					"text": "Actively assist in obtaining assistance of federal, state or\nother agencies in support of affordable housing development."
																				}
																			]
																		},
																		{
																			"number": "[4] ",
																			"content": [
																				{
																					"text": "Allow the reduction of dimensional requirements by not more\nthan 25% and an allowance for shared parking so as to reduce infrastructure\ncosts."
																				}
																			]
																		}
																	]
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "AAFFH units in multifamily zoning districts."
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "At least 20% of the units of any multifamily residential development\nin any multifamily residential zoning district shall be established\nas AAFFH units."
																}
															]
														}
													]
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "Planning Board Review. The Planning Board shall consider the following\nprovisions in reviewing affordable housing unit applications:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Siting of affordable units. All AAFFH units constructed under\nthis section shall be situated within the proposed development or\nat an approved off-site location so as not to be in less desirable\nlocations than market-rate units in the development and shall, on\naverage, be no less accessible to public amenities, such as open space,\nas the market-rate units."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Minimum design and construction standards for affordable units.\nAAFFH housing units within market-rate developments shall be integrated\nwith the rest of the developments and shall be compatible in design,\nappearance, construction and quality of materials with other units."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Timing of construction or provision of affordable units or lots.\nThe construction of affordable units shall occur proportionately with\nthe construction of the market-rate units in the subdivision. No certificates\nof compliance may be issued for the last 10% of market-rate units\nwithin a development until the last affordable unit has been issued\na certificate of compliance."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "Minimum floor area. The minimum gross floor area per AAFFH unit\nshall be no less than the following:"
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "Affordable housing requirements for special populations. At\nthe discretion of the Planning Board and upon a showing of good cause,\naffordable housing requirements for special populations may be waived\nor modified. Said population may include the handicapped, the infirm\nor seniors when such housing is independent-living, congregate-care,\nnursing-home or such other housing for special populations that the\nTown Housing Agency recognizes."
												}
											]
										},
										{
											"number": "(6) ",
											"content": [
												{
													"text": "Unit appearance and integration."
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "Within single-family developments, the AAFFH units may be single-family\nhomes or may be incorporated into one or more two-family homes. Each\nsingle-family AAFFH unit may be located on a lot meeting 75% of the\nminimum lot area for the single-family homes in the development. Each\nsuch two-family home shall be located on a lot meeting the minimum\nlot area for the single-family homes in the development. All such\nunits shall be compatible in appearance, siting and exterior design\nfrom the other single-family homes in the development, to the greatest\nextent possible. Interior finishes and furnishings may be reduced\nin quality and cost to assist in the lowering of the cost of development\nof AAFFH units."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "Within multifamily developments, the AAFFH units shall be physically\nintegrated into the design of the development and shall be distributed\namong various sizes (efficiency, one-, two-, three- and four-bedroom\nunits) in the same proportion as all other units in the development.\nAAFFH units shall be compatible with other market-rate units from\nthe outside or building exteriors. Interior finishes and furnishings\nmay be reduced in quality and cost to assist in the lowering of the\ncost of development of the AAFFH units."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(7) ",
											"content": [
												{
													"text": "Conservation zoning. The Planning Board shall consider the provisions\nof conservation subdivisions and conservation development, which may\nprovide for bonus units, of the Town Zoning Law in furtherance of\nthe Town's goals for providing affordable housing."
												}
											]
										},
										{
											"number": "(8) ",
											"content": [
												{
													"text": "Property restriction. All AAFFH units must be restricted using\na document such as a declaration of restrictive covenants, in recordable\nform acceptable to the Town Attorney, which shall ensure that the\nAAFFH unit shall permanently remain subject to affordable regulations.\nAmong other provisions, the covenants shall require that the unit\nbe the primary residence of the residential household selected to\noccupy the dwelling unit. Upon approval, such declaration shall be\nrecorded against the property containing the AAFFH unit prior to the\nissuance of a certificate of occupancy for the dwelling unit."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "F. ",
							"content": [
								{
									"text": "Expedited project review process."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Pre-application meeting. The applicant for a development including\nAAFFH units shall be entitled to attend at least one pre-application\nmeeting at which representatives will be in attendance from each Bedford\nagency and staff expected to play a role in the review and approval\nof the development application and construction. The purpose of the\npre-application meeting will be to expedite the development application\nreview process through:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "The early identification of issues, concerns, code compliance\nand coordination matters that may arise during the review and approval\nprocess."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "The establishment of a comprehensive review process outline,\nproposed meeting schedule and conceptual timeline."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Meeting schedule and timeline. Bedford agencies and staff shall\nendeavor to honor the proposed meeting schedule and conceptual timeline\nestablished as an outcome of the pre-application to the greatest extent\npossible during the review and approval process, subject to the demonstrated\ncooperation of the applicant to adhere to same. Should the approval\nprocess extend beyond one year, an applicant for a development including\nAAFFH units shall be entitled to at least one additional meeting per\nyear with the same departments, agencies, authorities, boards, commissions,\ncouncils or committees to review any and all items discussed at previous\npre-application meetings."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Calendar/agenda priority. Bedford agencies with review or approval\nauthority over applications for developments including AAFFH units\nshall give priority to such applications by placing applications for\nall developments including AAFFH units first on all meeting and work\nsession calendars and agendas and, when feasible based on the ability\nto conduct required reviews and public notice, with the intent of\nshortening minimum advance submission deadlines to the extent practicable."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "G. ",
							"content": [
								{
									"text": "Administration by the Town Housing Agency."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Responsibility. The Town Housing Agency shall be responsible\nfor administering the affordable housing requirements of this section\nas well as for the promulgation of such rules and regulations as may\nbe necessary to implement such requirements."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Maximum cost. At the time of issuance of a building permit,\nthe Building Inspector shall send a copy of such permit to the Town\nHousing Agency, which shall then inform the applicant of the maximum\nrental or sales charge which may be established for AAFFH units in\nsuch development and the maximum annual gross family income eligibility\nfor occupancy of said units."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Annual eligibility requirements. With respect to rental units,\non or before March 30 of each year thereafter, the Town Housing Agency\nshall notify the owner or manager of each affordable unit as to the\nrent and income eligibility requirements for such unit based upon\nfigures derived from the preceding calendar year. With respect to\nownership units, the Town Housing Agency shall provide sales criteria\nfor the sale of an affordable housing unit at the time of offering\nthe unit for sale or resale."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "Certification. The owner or manager of each AAFFH rental unit\nshall annually certify to the satisfaction of the Town Housing Agency\nthat the requisite number of affordable units have been assigned to\nincome-eligible individuals who meet the income guidelines in effect\nwhen said individual(s) took occupancy. Annual certification shall\ninclude unit designations and occupant names and shall be signed by\nthe developer or his or her designated representative, as appropriate,\nand the Chairman of the Town Housing Agency."
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "Marketing plan. All such AAFFH units, whether for purchase or\nfor rent, shall be marketed in accordance with the Westchester County\nFair and Affordable Housing Affirmative Marketing Plan."
												}
											]
										},
										{
											"number": "(6) ",
											"content": [
												{
													"text": "Preferences. No preferences shall be utilized to prioritize\nthe selection of income-eligible tenants or purchasers for affordable\nAAFFH units created under this subsection."
												}
											]
										},
										{
											"number": "(7) ",
											"content": [
												{
													"text": "Maximum rent and sales price. The maximum monthly rent for an\nAAFFH unit and the maximum gross sales price for an AAFFH unit shall\nbe established in accordance with U.S. Department of Housing and Urban\nDevelopment guidelines as published in the current edition of the\nWestchester County Area Median Income (AMI) Sales and Rent Limits,\navailable from the County of Westchester."
												}
											]
										},
										{
											"number": "(8) ",
											"content": [
												{
													"text": "Time period of affordability. Units designated as AAFFH units\nmust remain permanently affordable for rental properties and ownership\nunits."
												}
											]
										},
										{
											"number": "(9) ",
											"content": [
												{
													"text": "Resale requirements."
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "In the case of owner-occupied AAFFH units, the title to said\nproperty shall be restricted so that in the event of any resale by\nthe home buyer or any successor, the resale price shall not exceed\nthe then-maximum sales price for said unit, as determined in this\nsection, or the sum of:"
																},
																{
																	"content": [
																		{
																			"number": "[1] ",
																			"content": [
																				{
																					"text": "The net purchase price (i.e., gross sales prices minus subsidies)\npaid for the unit by the selling owner, increased by the percentage\nincrease, if any, in the Consumer Price Index for Wage Earners and\nClerical Workers in the New York-Northern New Jersey Area, as published\nby the United States Bureau of Labor Statistics (the \"Index\") on any\ndate between the month that was two months earlier than the date on\nwhich the seller acquired the unit and the month that is two months\nearlier than the month in which the seller contracts to sell the unit.\nIf the Bureau stops publishing this index, and fails to designate\na successor index, the municipality will designate a substitute index;\nand"
																				}
																			]
																		},
																		{
																			"number": "[2] ",
																			"content": [
																				{
																					"text": "The cost of the major capital improvements made by the seller\nof the unit while said seller of the unit owned the unit, as evidenced\nby paid receipts, depreciated on a straight-line basis over a fifteen-year\nperiod from the date of completion, and such approval shall be requested\nfor said major capital improvement no later than the time the seller\nof the unit desires to include it in the resale price."
																				}
																			]
																		}
																	]
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "Notwithstanding the foregoing, in no event shall the resale\nprice exceed an amount affordable to a household at 80% of AMI at\nthe time of the resale."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(10) ",
											"content": [
												{
													"text": "Lease renewal requirements."
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "Applicants for rental AAFFH units shall, if eligible and if\nselected for occupancy, sign leases for a term of no more than two\nyears. As long as a resident remains eligible and has complied with\nthe terms of the lease, said resident shall be offered renewal leases\nfor a term of not more than two years each. Renewal of a lease shall\nbe subject to the conditions of federal, state or county provisions\nthat may be imposed by the terms of the original development funding\nagreements for the development or the provisions of other applicable\nlocal law."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "If no such provisions are applicable and if a resident's\nannual gross income should subsequently exceed the maximum then allowable,\nas defined in this chapter, then:"
																},
																{
																	"content": [
																		{
																			"number": "[1] ",
																			"content": [
																				{
																					"text": "Option (a): Said resident may complete his or her\ncurrent lease term and shall be offered a nonrestricted market-rate\nrental unit in the development at the termination of such lease term,\nif available. If no such dwelling unit shall be available at said\ntime, the resident may be allowed to sign a one-year lease for the\nAAFFH unit he or she occupies but shall not be offered a renewal of\nthe lease beyond the expiration of said term; or"
																				}
																			]
																		},
																		{
																			"number": "[2] ",
																			"content": [
																				{
																					"text": "Option (b): Said resident shall pay the greater\nof the following."
																				},
																				{
																					"content": [
																						{
																							"number": "[a] ",
																							"content": [
																								{
																									"text": "The rent amount payable under the provisions of\nthis section should Option (b) be utilized; or"
																								}
																							]
																						},
																						{
																							"number": "[b] ",
																							"content": [
																								{
																									"text": "Thirty percent of the resident's monthly adjusted\nhousehold income, provided that the increased rent may not exceed\nthe market rent in the development for units with the same number\nof bedrooms, or, should Option (b) be utilized, the next open unit\nwill become an AAFFH unit."
																								}
																							]
																						}
																					]
																				}
																			]
																		},
																		{
																			"number": "[3] ",
																			"content": [
																				{
																					"text": "Option (c): Said resident shall pay the greater\nof:"
																				},
																				{
																					"content": [
																						{
																							"number": "[a] ",
																							"content": [
																								{
																									"text": "The rent amount payable under the provisions of\nthis section; or"
																								}
																							]
																						},
																						{
																							"number": "[b] ",
																							"content": [
																								{
																									"text": "Thirty percent of the resident's monthly adjusted household\nincome, provided that the increased rent may not exceed the market\nrent in the development for units with the same number of bedrooms\nfor a term of not more than one year."
																								}
																							]
																						}
																					]
																				}
																			]
																		}
																	]
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(11) ",
											"content": [
												{
													"text": "Occupancy standards. For the sale or rental of AAFFH units,\nthe following occupancy schedule shall apply:"
												}
											]
										},
										{
											"number": "(12) ",
											"content": [
												{
													"text": "Affirmative marketing. The AAFFH units created under the provisions\nof this section shall be sold or rented, and resold and re-rented,\nto only qualifying income-eligible households. Such income-eligible\nhouseholds shall be solicited in accordance with the requirements,\npolicies and protocols established in the Westchester County Fair\nand Affordable Housing Affirmative Marketing Plan, so as to ensure\noutreach to racially and ethnically diverse households."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "H. ",
							"content": [
								{
									"text": "Previously approved affordable housing units. Affordable housing\nunits approved prior to the adoption of this section shall continue\nwith the provisions of their original approvals."
								}
							]
						},
						{
							"number": "I. ",
							"content": [
								{
									"text": "In-lieu fees. An applicant for a single-family residential subdivision\nmay, as specified by the Planning Board, pay a fee in lieu of the\nconstruction of affordable units, on a scaled cost based on the zoning\ndistrict as set forth below. Said fee shall be deposited into a fund,\nhereinafter known as the \"Town of Bedford Housing Trust Fund,\" to\nbe used for the purchase and development of affordable housing at\nother locations within the Town."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 125-29.7",
			"title": "Use restrictions in CB and NB Districts.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "In the CB and NB Districts, no principal nonresidential uses, except\nemergency service providers, medical and veterinary offices and restaurants,\nshall operate between the hours of 1:00 a.m. and 6:00 a.m."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "In the CB and NB Districts, no single permitted use, except emergency\nservice providers, shall occupy a space greater than 4,000 square\nfeet in area on the first floor of any building."
								}
							]
						}
					]
				}
			]
		}
	]
}