{
	"url": "http://ecode360.com/7735339",
	"paras": [
		{
			"paragraph": "§ 203-33",
			"title": "Application of regulations.",
			"content": [
				{
					"text": "In the Residence R-7 District, the following\nregulations shall apply."
				}
			]
		},
		{
			"paragraph": "§ 203-34",
			"title": "Uses permitted.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "No building may be erected, altered or used and no\nlot or premises may be used except for one of the following principal\nuses:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Detached single-family residence."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Park."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Religious use, with the permission of the Board of\nTrustees, subject to the provisions of this chapter."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "Educational use, with the permission of the Board\nof Trustees, subject to the provisions of this chapter."
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "Public library, nonprofit public art gallery, nonprofit\npublic museum, municipal meeting hall, village offices, municipal\nfirehouse and municipal recreational use."
												}
											]
										},
										{
											"number": "(6) ",
											"content": [
												{
													"text": "With the permission of the Board of Trustees, public\nutility company electric substations with transformers, regulators,\nswitchgear, usual accessories and protective fencing, provided that\nthe Board of Trustees may require such protective and decorative measures\nas may be appropriate, including screening and landscaping with trees,\nshrubs and similar plantings, and such other conditions as may be\nrequired to protect the public health, safety and welfare."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "The principal uses in Subsection A may be accompanied\nby one or more of the following accessory uses:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Greenhouse, provided that it is not used for the growing\nof trees, shrubs, vegetables, plants or flowers for sale, and provided\nthat there is no display of products and no advertising, and provided\nthat any detached greenhouse conforms to all requirements in respect\nto an accessory building and that any heating plant accompanying such\nfacility is located not less than 10 feet from the side and rear lines\nof the lot."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Home occupation, as defined in this Code.[Amended 3-25-1997 by L.L. No. 6-1997]"
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "(Reserved)\nEditor's Note: Former Subsection B(3), which\ndealt with home occupations, was repealed 3-25-1997 by L.L. No. 6-1997.\n"
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "Accessory parking, accessory private garage and/or\noutdoor garden storage shed, provided that all accessory detached\nstructures conform to all required setbacks from side and rear lot\nlines, and further provided that detached accessory buildings not\nbe used for either residence or business purposes."
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "(Reserved)\nEditor's Note: Former Subsection B(5), which\ndealt with nonilluminated signs, was repealed 11-26-1996 by L.L. No.\n15-1996.\n"
												}
											]
										}
									]
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 203-35",
			"title": "Minimum lot area, street frontage and width.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "No building shall hereafter be constructed on a lot\nhaving an area of less than 7,000 square feet or having a street frontage\nof less than 35 feet."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "A minimum lot width of 60 feet shall be maintained\nfrom the front yard line on an interior lot or from the front yard\nline along the lesser of the two street lines on a corner lot as far\nas a line drawn parallel to said street line at a distance of 100\nfeet therefrom or 30 feet beyond that point of construction of the\nprincipal building that is located farthest from such street line,\nwhichever distance is greater."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 203-36",
			"title": "Maximum building area and floor area ratio.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "The building area shall not exceed 25% of the lot\narea. In the case of any lot held in single and separate ownership\nat the effective date of this amendment and having an area of 5,500\nsquare feet or less, the building area shall not exceed 35% of the\nlot area."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "The floor area ratio on any lot shall not exceed 0.40."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 203-37",
			"title": "Yard and setback requirements.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Front yard. Except as set forth hereinafter, there\nshall be a front yard, the depth of which shall not be less than 25\nfeet."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "In that portion of the Residence R-7 District which\nis designated as R-7C on the Zoning Map,\nEditor's Note: The Zoning Map is on file in\nthe office of the Village Clerk-Treasurer.\n the minimum depth of the required front yard shall be\n20 feet."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "In no case shall the minimum required depth of a front\nyard be less than the average setback within 200 feet of the proposed\nstructure or building.[Amended 8-8-1988 by L.L. No. 5-1988]"
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Rear yard. There shall be a rear yard, the depth of\nwhich shall not be less than 25 feet plus 1/2 of the depth of the\nlot in excess of 100 feet. Where the depth is less than 100 feet,\nsix inches may be deducted from the required depth of the rear yard\nfor each foot in depth such lot shall lack of said 100 feet, but the\ndepth of such rear yard shall in no case be reduced thereby to less\nthan 15 feet."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Side yards."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Any building other than a dwelling shall have two\nside yards, each having a minimum width of 15 feet."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "In the case of any dwelling, except as set forth hereinafter,\nthere shall be two side yards, one on each side of the main building,\nthe aggregate width of which shall be at least 24 feet. Neither side\nyard shall be less than 10 feet wide; provided, however, that in a\ncase of a lot held in single and separate ownership at the effective\ndate of this chapter and of a width less than 50 feet, six inches\nmay be deducted from the required aggregate width of the side yards\nfor each foot in width such lot shall lack of said 50 feet, but no\nside yard shall be less than five feet wide."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "In that portion of the Residence R-7 District which\nis designated as R-7C on the Zoning Map, in the case of a dwelling,\nthe aggregate width of the two required side yards shall be at least\n18 feet. Neither side yard shall be less than eight feet wide."
												}
											]
										}
									]
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 203-38",
			"title": "Building height restrictions.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Except as set forth hereinafter, no dwelling shall\nexceed a height of 2 1/2 stories or 30 feet. Any dwelling with\na height greater than 30 feet on the effective date of this amendment\nshall be considered in conformance therewith."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Buildings other than dwellings shall not exceed a\nheight of three stories or 30 feet."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 203-39",
			"title": "Corner lots.",
			"content": [
				{
					"text": "In the case of a corner lot, a building shall\nbe required to comply with the front yard restrictions on all street\nfronts. The depth of yard from the other street lines shall be 15%\nof the width of the lot but need not be more than 10 feet."
				}
			]
		},
		{
			"paragraph": "§ 203-40",
			"title": "Minimum floor area of dwellings.",
			"content": [
				{
					"text": "No single-family detached dwelling shall hereafter\nbe erected unless it shall have a minimum floor area of 1,500 square\nfeet. For the purpose of this section, the term \"floor area\" shall\nbe that area enclosed within the outside walls of the principal building,\nexcluding cellar, basement, attic, unenclosed porches, terraces and\nsteps, garages and rooms for heating and ventilating equipment. To\nqualify as floor area for the purposes of this section, the second\nor attic floor shall have or permit a structural headroom of at least\nseven feet six inches in respect of so much of the floor area as shall\nbe deemed so qualified, and full flooring shall be laid thereon, and\nsuch floor area to so qualify shall also have access from the floor\nbelow by a permanent built-in stairway."
				}
			]
		},
		{
			"paragraph": "§ 203-41",
			"title": "Reconstruction of partially destroyed residences.",
			"content": [
				{
					"text": "Whenever an existing residence on a lot affected\nby this Article of this Chapter 203, Zoning, shall be destroyed by\nfire, storm, flood or other act of God to the extent that 50% or more\nof said residence shall be destroyed, then and in such event such\nresidence may be reconstructed to no greater bulk nor floor area than\nthat which existed at the time of the destruction of said residence\nor as is now permitted by this chapter, whichever is greater; provided,\nhowever, that such residence shall have been in conformity with all\nthe provisions of this Article as of 12:00 midnight of the day prior\nto the adoption of this section. If such residence shall not have\nbeen in conformity with all of the provisions of this Article as of\n12:00 midnight of the day prior to the adoption of this section, then\nand in such event this section shall have no application thereto.\nEditor's Note: Former § 148-35,\nCentral air-conditioning system equipment, which immediately followed\nthis section, was repealed 1-10-1994 by L.L. No. 1-1994. See now § 203-122.\n"
				}
			]
		}
	]
}