{
	"url": "http://ecode360.com/7735376",
	"paras": [
		{
			"paragraph": "§ 203-42",
			"title": "Application of regulations.",
			"content": [
				{
					"text": "In the R-6 District, the following regulations\nshall apply."
				}
			]
		},
		{
			"paragraph": "§ 203-43",
			"title": "Uses permitted.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "No building may be erected, altered or used and no\nlot or premises may be used except for:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "One of the following principal uses:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "Detached single-family residence."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "Park."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "Religious use, with the permission of the Board\nof Trustees, subject to the provisions of this chapter."
																}
															]
														},
														{
															"number": "(d) ",
															"content": [
																{
																	"text": "Educational use, with the permission of the\nBoard of Trustees, subject to the provisions of this chapter."
																}
															]
														},
														{
															"number": "(e) ",
															"content": [
																{
																	"text": "Public library, nonprofit public art gallery,\nnonprofit public museum, municipal meeting hall, village offices,\nmunicipal firehouse and municipal recreational use."
																}
															]
														},
														{
															"number": "(f) ",
															"content": [
																{
																	"text": "With the permission of the Board of Trustees,\npublic utility company electric substations with transformers, regulators,\nswitchgear, usual accessories and protective fencing, provided that\nthe Board of Trustees may require such protective and decorative measures\nas may be appropriate, including screening and landscaping with trees,\nshrubs and similar plantings, and such other conditions as may be\nrequired to protect the public health, safety and welfare."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "The principal uses in Subsection A may be accompanied\nby one or more of the following accessory uses:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "Greenhouse, provided that it is not used for\nthe growing of trees, shrubs, vegetables, plants or flowers for sale,\nand provided that there is no display of products and no advertising,\nand provided that any detached greenhouse conforms to all requirements\nin respect to an accessory building and that any heating plant accompanying\nsuch facility is located not less than 10 feet from the side and rear\nlines of the lot."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "Home occupation, as defined in this Code.[Amended 3-25-1997 by L.L. No. 6-1997]"
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "(Reserved)\nEditor's Note: Former Subsection A(2)(c),\nwhich dealt with home occupations, was repealed 3-25-1997 by L.L.\nNo. 6-1997.\n"
																}
															]
														},
														{
															"number": "(d) ",
															"content": [
																{
																	"text": "Accessory parking, accessory private garage\nand/or outdoor garden storage shed, provided that all accessory detached\nstructures conform to all required setbacks from side and rear lot\nlines, and further provided that detached accessory buildings not\nbe used for either residence or business purposes."
																}
															]
														},
														{
															"number": "(e) ",
															"content": [
																{
																	"text": "(Reserved)\nEditor's Note: Former Subsection A(2)(e),\nwhich dealt with nonilluminated signs, was repealed 11-26-1996 by\nL.L. No. 15-1996.\n"
																}
															]
														}
													]
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Not more than two semidetached single-family dwellings."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 203-44",
			"title": "Minimum lot area, street frontage and width.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "No building shall hereafter be constructed on a lot\nhaving an area less than 7,000 square feet or having a street frontage\nless than 35 feet."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "A minimum lot width of 50 feet in the case of a detached\nsingle-family dwelling and 70 feet for all other uses shall be maintained\nfrom the front yard line on an interior lot or from the front yard\nline along the lesser of the two street lines on a corner lot as far\nas a line drawn parallel to said street line at a distance of 100\nfeet therefrom or 30 feet beyond that point of construction of the\nprincipal building that is located farthest from such street line,\nwhichever is greater."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 203-45",
			"title": "Minimum floor area of dwellings.",
			"content": [
				{
					"text": "No single-family detached or semidetached dwelling\nshall hereafter be erected unless it shall have a minimum floor area\nof 1,500 square feet. For the purpose of this section, the term \"floor\narea\" shall be that area enclosed within the outside walls of the\nprincipal building, excluding cellar, basement, attic, unenclosed\nporches, terraces and steps, garages and rooms for heating and ventilating\nequipment. To qualify as floor area for the purposes of this section,\nthe second or attic floor shall have or permit a structural headroom\nof at least seven feet six inches in respect of so much of the floor\narea as shall be deemed so qualified, and full flooring shall be laid\nthereon, and such floor area to so qualify shall also have access\nfrom the floor below by a permanent built-in stairway."
				}
			]
		},
		{
			"paragraph": "§ 203-46",
			"title": "Building height restrictions.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Except as set forth hereinafter, no detached or semidetached\ndwelling shall exceed a height of 2 1/2 stories or 30 feet, whichever\nis less. Any dwelling with a height greater than 30 feet on 12-10-1990\nshall be considered in conformance therewith."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Buildings other than dwellings shall not exceed a\nheight of three stories or 30 feet, whichever is less."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 203-47",
			"title": "Maximum building area and floor area ratio.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "The building area shall not exceed 25% of the lot\narea."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "In the case of any lot held in single and separate\nownership on 12-10-1990 and having an area of 5,500 square feet or\nless, the building area shall not exceed 35% of the lot area."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "The floor area ratio on any lot shall not exceed zero\nand 0.45."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 203-48",
			"title": "Yard and setback requirements.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Front yard. Except as set forth hereinafter, there\nshall be a front yard, the depth of which shall not be less than 25\nfeet. In no case shall the minimum required depth of a front yard\nbe less than the average setback within 200 feet of each side of the\nproposed residence."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Rear yard. There shall be a rear yard, the depth of\nwhich shall not be less than 25 feet plus 1/2 of the depth of the\nlot in excess of 100 feet. Where the lot depth is less than 100 feet,\nsix inches may be deducted from the required depth of the rear yard\nfor each foot in depth such lot shall lack of the said 100 feet, but\nthe depth of such rear yard shall in no case be reduced thereby to\nless than 15 feet."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Side yards."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Any building other than a single-family detached dwelling\nshall have two side yards, each having a minimum width of at least\n15 feet."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "In the case of a single-family detached dwelling,\nexcept as set forth hereinafter, there shall be two side yards, one\non each side of the main building, the aggregate width of which shall\nbe at least 24 feet. Neither side yard shall be less than 10 feet\nwide; provided, however, that in the case of a lot held in single\nand separate ownership at the effective date of this chapter (November\n28, 1931) and of a width less than 50 feet, six inches may be deducted\nfrom the required aggregate width of the side yards for each foot\nin width such lot shall lack of said 50 feet, but no side yard shall\nbe less than five feet wide.\nEditor's Note: Former § 148-43,\nCentral air-conditioning system equipment, which immediately followed\nthis subsection, was amended and renumbered to be § 148-97.1\n12-10-1990 by L.L. No. 13-1990. See now § 203-122.\n"
												}
											]
										}
									]
								}
							]
						}
					]
				}
			]
		}
	]
}