{
	"url": "http://ecode360.com/7735171",
	"paras": [
		{
			"paragraph": "§ 203-33",
			"title": "Application of regulations.",
			"content": [
				{
					"text": "In the Residence R-7 District, the following\nregulations shall apply."
				}
			]
		},
		{
			"paragraph": "§ 203-34",
			"title": "Uses permitted.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "No building may be erected, altered or used and no\nlot or premises may be used except for one of the following principal\nuses:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Detached single-family residence."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Park."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Religious use, with the permission of the Board of\nTrustees, subject to the provisions of this chapter."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "Educational use, with the permission of the Board\nof Trustees, subject to the provisions of this chapter."
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "Public library, nonprofit public art gallery, nonprofit\npublic museum, municipal meeting hall, village offices, municipal\nfirehouse and municipal recreational use."
												}
											]
										},
										{
											"number": "(6) ",
											"content": [
												{
													"text": "With the permission of the Board of Trustees, public\nutility company electric substations with transformers, regulators,\nswitchgear, usual accessories and protective fencing, provided that\nthe Board of Trustees may require such protective and decorative measures\nas may be appropriate, including screening and landscaping with trees,\nshrubs and similar plantings, and such other conditions as may be\nrequired to protect the public health, safety and welfare."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "The principal uses in Subsection A may be accompanied\nby one or more of the following accessory uses:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Greenhouse, provided that it is not used for the growing\nof trees, shrubs, vegetables, plants or flowers for sale, and provided\nthat there is no display of products and no advertising, and provided\nthat any detached greenhouse conforms to all requirements in respect\nto an accessory building and that any heating plant accompanying such\nfacility is located not less than 10 feet from the side and rear lines\nof the lot."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Home occupation, as defined in this Code.[Amended 3-25-1997 by L.L. No. 6-1997]"
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "(Reserved)\nEditor's Note: Former Subsection B(3), which\ndealt with home occupations, was repealed 3-25-1997 by L.L. No. 6-1997.\n"
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "Accessory parking, accessory private garage and/or\noutdoor garden storage shed, provided that all accessory detached\nstructures conform to all required setbacks from side and rear lot\nlines, and further provided that detached accessory buildings not\nbe used for either residence or business purposes."
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "(Reserved)\nEditor's Note: Former Subsection B(5), which\ndealt with nonilluminated signs, was repealed 11-26-1996 by L.L. No.\n15-1996.\n"
												}
											]
										}
									]
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 203-35",
			"title": "Minimum lot area, street frontage and width.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "No building shall hereafter be constructed on a lot\nhaving an area of less than 7,000 square feet or having a street frontage\nof less than 35 feet."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "A minimum lot width of 60 feet shall be maintained\nfrom the front yard line on an interior lot or from the front yard\nline along the lesser of the two street lines on a corner lot as far\nas a line drawn parallel to said street line at a distance of 100\nfeet therefrom or 30 feet beyond that point of construction of the\nprincipal building that is located farthest from such street line,\nwhichever distance is greater."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 203-36",
			"title": "Maximum building area and floor area ratio.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "The building area shall not exceed 25% of the lot\narea. In the case of any lot held in single and separate ownership\nat the effective date of this amendment and having an area of 5,500\nsquare feet or less, the building area shall not exceed 35% of the\nlot area."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "The floor area ratio on any lot shall not exceed 0.40."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 203-37",
			"title": "Yard and setback requirements.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Front yard. Except as set forth hereinafter, there\nshall be a front yard, the depth of which shall not be less than 25\nfeet."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "In that portion of the Residence R-7 District which\nis designated as R-7C on the Zoning Map,\nEditor's Note: The Zoning Map is on file in\nthe office of the Village Clerk-Treasurer.\n the minimum depth of the required front yard shall be\n20 feet."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "In no case shall the minimum required depth of a front\nyard be less than the average setback within 200 feet of the proposed\nstructure or building.[Amended 8-8-1988 by L.L. No. 5-1988]"
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Rear yard. There shall be a rear yard, the depth of\nwhich shall not be less than 25 feet plus 1/2 of the depth of the\nlot in excess of 100 feet. Where the depth is less than 100 feet,\nsix inches may be deducted from the required depth of the rear yard\nfor each foot in depth such lot shall lack of said 100 feet, but the\ndepth of such rear yard shall in no case be reduced thereby to less\nthan 15 feet."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Side yards."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Any building other than a dwelling shall have two\nside yards, each having a minimum width of 15 feet."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "In the case of any dwelling, except as set forth hereinafter,\nthere shall be two side yards, one on each side of the main building,\nthe aggregate width of which shall be at least 24 feet. Neither side\nyard shall be less than 10 feet wide; provided, however, that in a\ncase of a lot held in single and separate ownership at the effective\ndate of this chapter and of a width less than 50 feet, six inches\nmay be deducted from the required aggregate width of the side yards\nfor each foot in width such lot shall lack of said 50 feet, but no\nside yard shall be less than five feet wide."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "In that portion of the Residence R-7 District which\nis designated as R-7C on the Zoning Map, in the case of a dwelling,\nthe aggregate width of the two required side yards shall be at least\n18 feet. Neither side yard shall be less than eight feet wide."
												}
											]
										}
									]
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 203-38",
			"title": "Building height restrictions.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Except as set forth hereinafter, no dwelling shall\nexceed a height of 2 1/2 stories or 30 feet. Any dwelling with\na height greater than 30 feet on the effective date of this amendment\nshall be considered in conformance therewith."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Buildings other than dwellings shall not exceed a\nheight of three stories or 30 feet."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 203-39",
			"title": "Corner lots.",
			"content": [
				{
					"text": "In the case of a corner lot, a building shall\nbe required to comply with the front yard restrictions on all street\nfronts. The depth of yard from the other street lines shall be 15%\nof the width of the lot but need not be more than 10 feet."
				}
			]
		},
		{
			"paragraph": "§ 203-40",
			"title": "Minimum floor area of dwellings.",
			"content": [
				{
					"text": "No single-family detached dwelling shall hereafter\nbe erected unless it shall have a minimum floor area of 1,500 square\nfeet. For the purpose of this section, the term \"floor area\" shall\nbe that area enclosed within the outside walls of the principal building,\nexcluding cellar, basement, attic, unenclosed porches, terraces and\nsteps, garages and rooms for heating and ventilating equipment. To\nqualify as floor area for the purposes of this section, the second\nor attic floor shall have or permit a structural headroom of at least\nseven feet six inches in respect of so much of the floor area as shall\nbe deemed so qualified, and full flooring shall be laid thereon, and\nsuch floor area to so qualify shall also have access from the floor\nbelow by a permanent built-in stairway."
				}
			]
		},
		{
			"paragraph": "§ 203-41",
			"title": "Reconstruction of partially destroyed residences.",
			"content": [
				{
					"text": "Whenever an existing residence on a lot affected\nby this Article of this Chapter 203, Zoning, shall be destroyed by\nfire, storm, flood or other act of God to the extent that 50% or more\nof said residence shall be destroyed, then and in such event such\nresidence may be reconstructed to no greater bulk nor floor area than\nthat which existed at the time of the destruction of said residence\nor as is now permitted by this chapter, whichever is greater; provided,\nhowever, that such residence shall have been in conformity with all\nthe provisions of this Article as of 12:00 midnight of the day prior\nto the adoption of this section. If such residence shall not have\nbeen in conformity with all of the provisions of this Article as of\n12:00 midnight of the day prior to the adoption of this section, then\nand in such event this section shall have no application thereto.\nEditor's Note: Former § 148-35,\nCentral air-conditioning system equipment, which immediately followed\nthis section, was repealed 1-10-1994 by L.L. No. 1-1994. See now § 203-122.\n"
				}
			]
		},
		{
			"paragraph": "§ 203-99",
			"title": "Nonconforming buildings, lots and uses in residential districts.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Nonconforming buildings."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Subject to the provisions of Subsection A(2) hereof, nothing in this chapter shall be deemed to prohibit the continuance or the maintenance, repair, alteration (including enlargement or other structural alteration) or reconstruction of a nonconforming building, provided that no such action shall increase the extent of any nonconformity of such building with any requirement of this chapter or create any new nonconformity therewith."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "No repair, alteration or reconstruction of a nonconforming\nbuilding shall be made if the cost of such action would exceed 50%\nof the then-current replacement value of such building, exclusive\nof foundations."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "No nonconforming building shall be moved, in whole\nor in part, to any other portion of the lot occupied by such building\nunless, as a result of such move, such building would cease to be\na nonconforming building."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Nonconforming uses."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Nothing in this chapter shall be deemed to prohibit\ncontinuance of the use of a building or lot which has become a nonconforming\nuse, subject to the following provisions of this section."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "A use which has become a nonconforming use shall not:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "Be moved, in whole or in part, from the location\nwithin the lot on which it is conducted to another location within\nsuch lot."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "Be moved to a lot other than the lot on which\nsuch use was conducted at the time such use became a nonconforming\nuse unless such use is a permitted use on such other lot."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "The use of a building or lot which is a nonconforming\nuse shall not be changed except to a use permitted for such building\nor lot."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "A nonconforming use shall not be enlarged, increased,\nextended or expanded so as to occupy a larger portion of the lot on\nwhich such use is conducted than the portion occupied by such use\nat the time such use became a nonconforming use."
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "A nonconforming use shall not be extended so as to\ndisplace a permitted use. An increase in the area of accessory parking\nfor a nonconforming use on the same lot on which such use is conducted\nor on a different lot in a district in which such use is not a permitted\nuse shall be deemed the displacement of a permitted use by a nonconforming\nuse."
												}
											]
										},
										{
											"number": "(6) ",
											"content": [
												{
													"text": "A nonconforming use which has been discontinued for\na continuous period of 12 months or more or which is replaced for\nany period by a permitted use shall be deemed to have been abandoned\nand shall not be resumed."
												}
											]
										},
										{
											"number": "(7) ",
											"content": [
												{
													"text": "A building which is utilized for a nonconforming use\nshall not be enlarged or otherwise changed unless, after such enlargement\nor other change, such building is utilized for a permitted use."
												}
											]
										},
										{
											"number": "(8) ",
											"content": [
												{
													"text": "Damage to nonconforming use."
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "In the event that a building which is utilized\nfor a nonconforming use is damaged by fire or other casualty, upon\nthe filing of an application for a building permit for the repair,\nrebuilding or reconstruction (hereinafter called \"restoration\") of\nsuch building, the Board of Trustees shall determine the extent of\nsuch damage in terms of the current cost of such restoration as a\npercentage of the current cost for replacement of the entire structure\n(hereinafter referred to as the \"damage percentage\"), and such determination\nshall be conclusive."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "If the damage percentage is greater than 40%,\nno restoration of such building shall be made unless, after such restoration,\nsuch building and the use thereof will conform to all of the provisions\nof this chapter. In such case, the owner of such building shall furnish\nto the Board of Trustees a declaration, in recordable form, to the\neffect that such nonconforming use has been abandoned."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "If the damage percentage is 40% or less, restoration\nof such building may be done, provided that such building, after such\nrestoration, shall not exceed the height, building area, floor area,\nvolume and other dimensions of such building as existing prior to\nsuch damage and shall not increase any encroachment of such building\ninto yards as existing prior to such damage. Failure of the owner\nto apply, within six months after such casualty, for a building permit\nfor such restoration or to commence such restoration (pursuant to\na permit) within nine months after such casualty and to prosecute\nsuch restoration diligently and without interruption shall be deemed\nan abandonment of such nonconforming use."
																}
															]
														},
														{
															"number": "(d) ",
															"content": [
																{
																	"text": "The Board of Trustees may, in its discretion,\nappoint a licensed architect or licensed professional engineer to\nadvise the Board in regard to its determination of the damage percentage,\nand, in such event, the reasonable fees of such architect or engineer\nshall be paid by the owner of such building in addition to any other\nfees or charges provided for in this Code."
																}
															]
														}
													]
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Nonconforming lots."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "No lot shall be subdivided so as to create any new\nlot which does not conform or so that the building or buildings on\nsuch new lots do not conform to the requirements of this chapter with\nregard to area, depth, street frontage, front yard, rear yard, side\nyard or other dimensional aspect."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Nothing in this chapter shall be deemed to prohibit\nthe establishment of a permitted use or the erection of a building\non a lot which has less than the minimum lot area, street frontage\nor width required by this chapter, provided that:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "The ownership of such lot was different from\nthe ownership of all adjoining lots at the effective date of the earliest\nprovision of this chapter which established such deficiency. (In making\na determination as to the existence or nonexistence of such diverse\nownership, the Board of Trustees may utilize the services of an abstract\ncompany or title company, and, in such event, the reasonable fees\nand expenses of such company for such services shall be paid by the\nowner of such lot, in addition to any other charges provided for by\nthis Code.)"
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "In the case of the proposed erection of a building\non such lot, it was lawful to erect a building on such lot immediately\nprior to such effective date, and such lot and the building to be\nerected thereon will comply with the requirements of this chapter\nin all other respects."
																}
															]
														}
													]
												}
											]
										}
									]
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 203-100",
			"title": "Nonconforming buildings, lots and uses in all districts other than residential districts.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Nonconforming buildings."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Nonconforming buildings legally existing on December\n1, 1990, may be continued, but no such building may thereafter be\nchanged, altered, enlarged, expanded, reconstructed or otherwise modified,\nand no such nonconforming building may be moved or extended to any\nother portion of a lot occupied by such building or any other lot\nexcept as otherwise provided herein."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "The change, alteration, enlargement, expansion, reconstruction,\nmodification or relocation of a nonconforming building is permitted\nif such action would result in the building becoming conforming, provided\nthat the use of such building shall also be conforming to the provisions\nof this Code."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "The ordinary repair or maintenance of a nonconforming\nbuilding may be permitted, provided that the cost of such repair shall\nnot exceed 40% of the then-current replacement value of such building,\nexclusive of foundations."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "If a nonconforming building is damaged by fire or casualty, said building may be repaired, reconstructed or rebuilt under the same terms and conditions as set forth in § 203-99B(8) of this Code."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Nonconforming uses."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Any nonconforming use legally existing on December\n1, 1990, may continue. No nonconforming use may be substituted for\nor added to any existing legal nonconforming use."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "No nonconforming use may be changed, altered, enlarged,\nextended, expanded, moved, in whole or in part, from the location\nwithin a lot on which it is conducted to another location within such\nlot, be moved to any lot other than the lot on which it lawfully exists\non December 1, 1990, or otherwise be changed unless said use becomes\na use which conforms to the requirements of this chapter."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "No building in which a legal nonconforming use is\nconducted shall be changed, altered, enlarged, extended or expanded\nor reconstructed unless all uses of such building after such action\nare uses which conform to the then-current requirements of this chapter."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "The ordinary repair or maintenance of a conforming\nbuilding in which a legal nonconforming use is conducted may be permitted,\nprovided that the cost of such repair shall not exceed 40% of the\nthen-current replacement value of such building, exclusive of foundations."
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "Where a nonconforming use or a conforming building in which a nonconforming use is conducted is damaged by fire or other casualty, the building utilized for such use may be repaired, rebuilt or reconstructed under the same terms and conditions as provided in § 203-99B(8) of this chapter."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Nonconforming lots."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "No lot shall be subdivided so as to create any new\nlot which does not conform or so that the building or buildings on\nsuch new lots do not conform to the requirements of this chapter with\nrespect to area, depth, street frontage, front yard, rear yard, side\nyard or other dimensional aspect or off-street parking requirements."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Any nonconforming lot legally in existence on December\n1, 1990, may be continued, provided that said lot remains in ownership\ndifferent from the ownership of any contiguous lot."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "No nonconforming lot shall be reduced in size or in\nany other aspect in which it does not conform to the zoning regulations\nin effect on December 1, 1990."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "The doctrine of merger shall be applicable in the\nVillage of Thomaston, so that if any nonconforming lot comes into\ncommon ownership with one or more contiguous lots, said lots shall\nbe deemed to have merged into one contiguous lot."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "Abandonment. Where the use of a nonconforming building\nor lot or a nonconforming use is discontinued for a continuous period\nof six months or more or if such nonconforming building or use or\nlot is replaced for any period by a permitted use, the nonconforming\nbuilding, lot or use shall be deemed to have been abandoned and shall\nnot be resumed."
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "Multiple nonconformities. Where a single lot is used\nfor more than one use or for more than one building, no legal use\nof any portion of said lot shall be changed, altered, modified or\nexpanded unless any existing legal nonconforming uses or buildings\non said lot are discontinued and all uses and buildings on the property\nconform to the then-current requirements of the zoning regulations."
								}
							]
						},
						{
							"number": "F. ",
							"content": [
								{
									"text": "Temporary provisions for expansion or alteration of\nbuildings used for nonconforming uses. Notwithstanding the provisions\nof this section, the Board of Trustees may grant permission for the\nexpansion or enlargement of a building in the OB District which is\nused for a nonconforming use where the Board of Trustees determines\nthat the proposed alteration or expansion will facilitate and improve\nthe orderly use of the subject property, permit the removal or rehabilitation\nof a structure which the village deems inappropriate for use for the\nsaid nonconforming use and reduce the degree to which existing buildings\nand structures on the property do not conform to the then-current\nprovisions of this chapter. Such permission may be granted by the\nBoard without a public hearing, upon such terms and conditions as\nthe Board may determine are reasonable and appropriate and which will\nprevent or inhibit further expansion or alteration of the nonconforming\nuse. Any such grant of permission shall include a requirement that\nwithin nine months after such grant of permission a building permit\nmay be obtained for the construction authorized by such permission.[Added 3-21-1996 by L.L. No. 5-1996[1]]"
								},
								{
									"footnote": "[1]\nEditor's Note: This local law also provided\nthat it \"shall take effect immediately upon adoption and filing pursuant\nto the Municipal Home Rule Law and shall remain in effect for a period\nof two months after such effective date, upon the expiration of which\nperiod the provisions of this local law shall expire and be of no\nforce and effect; provided, however, that the provisions of this law\nshall remain applicable for an additional period of three months with\nrespect to any application for permission timely filed within said\ntwo-month period. Any permission granted for expansion or alteration\nof a building or structure pursuant to this law shall remain valid\nas a basis for issuance of a building permit, provided that such permit\nshall issue no later than nine months after the grant of such permission.\"\n"
								}
							]
						},
						{
							"number": "G. ",
							"content": [
								{
									"text": "Temporary provisions for expansion or alteration of\nbuildings used for nonconforming uses. Notwithstanding the provisions\nof this section, the Board of Trustees may grant permission for the\nexpansion or enlargement of a building in the Business District which\nis used for a nonconforming use where the Board of Trustees determines\nthat the proposed alteration or expansion will facilitate and improve\nthe orderly use of the subject property, permit the removal or rehabilitation\nof a structure which the village deems inappropriate for use for the\nnonconforming use and reduce the degree to which existing buildings\nand structures on the property do not conform to the then-current\nprovisions of this chapter. Such permission may be granted by the\nBoard without a public hearing, upon such terms and conditions as\nthe Board may determine are reasonable and appropriate and which will\nprevent or inhibit further expansion or alteration of the nonconforming\nuse. Any such grant of permission shall include a requirement that\nwithin nine months after such grant of permission a building permit\nbe obtained for the construction authorized by such permission.[2][Added 8-27-1996 by L.L. No. 12-1996]"
								},
								{
									"footnote": "[2]\nEditor's Note: This local law also provided\nthat it \"shall take effect immediately upon adoption and filing pursuant\nto the Municipal Home Rule Law and shall remain in effect for a period\nof two months after such effective date, upon the expiration of which\nperiod the provisions of this local law shall expire and be of no\nforce and effect; provided, however, that the provisions of this law\nshall remain applicable for an additional period of three months with\nrespect to any application for permission timely filed within said\ntwo-month period. Any permission granted for expansion or alteration\nof a building or structure pursuant to this law shall remain valid\nas a basis for issuance of a building permit, provided that such permit\nshall issue no later than nine months after the grant of such permission.\"\n"
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 203-101",
			"title": "Offensive and obnoxious uses.",
			"content": [
				{
					"text": "No trade, industry or purpose shall be permitted which, in the judgment of the Board of Appeals, as provided below in Article XVII, § 203-139A(8), is likely to be so conducted as to create corrosive or toxic fumes, gas, smoke or odors, obnoxious dust, vapor or wastes or offensive noise or vibration so as to be detrimental to the public health, safety or general welfare."
				}
			]
		},
		{
			"paragraph": "§ 203-102",
			"title": "Visual obstructions at intersections.",
			"content": [
				{
					"text": "On any corner lot, no wall, fence or other structure\nshall be erected or altered and no hedge, tree, shrub or other growths\nshall be maintained which shall exceed the height of four feet measured\nfrom a point on or in line with the surfaces of the abutting streets,\nand this said height shall be maintained within the triangular space\nformed by said corner having its two sides 25 feet each extending\nalong each street forming said corner, the purpose thereof being to\nlessen the danger to traffic on street corners caused by obscuring\nthe view."
				}
			]
		},
		{
			"paragraph": "§ 203-103",
			"title": "Irregular lots.",
			"content": [
				{
					"text": "In the case of a narrow corner lot or of any shallow, irregular or steeply sloping lot existing as such at the effective date of this chapter where conformity with the provisions of this Article would in the judgment of the Board of Appeals make it difficult to erect a practicable building, the Board, as provided below in Article XVII, § 203-139A(1) and (2), may allow such building or structure to project nearer to any street or lot line than is herein prescribed, provided that it can be done in a way to safeguard the neighborhood, and provided that compensating area shall be added to one or the other required open spaces, and provided that in no case in a Residence or Apartment District shall any part of any structure be within less than five feet of any street or lot line."
				}
			]
		},
		{
			"paragraph": "§ 203-104",
			"title": "Accessory building setbacks; maximum height.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Except as permitted by § 203-70, accessory buildings shall be distant from the street line at least 10 feet more than the distance from the rear wall of the main building to the rear property line and not less than three feet from a property line, except that a private garage may be located across a common lot line by mutual agreement between the owners of both lots. No accessory building shall exceed 16 feet in height.[Amended 7-11-1994 by L.L. No. 9-1994]"
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "On corner lots, accessory buildings shall be located\nas far as possible from all street lines while conforming to the requirements\nof the above subsection."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 203-105",
			"title": "Projections into yards.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "No building or part of a building shall be erected\nin or shall project into a rear yard, front yard or side yard, with\nthe following exceptions:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Cornices, eaves, gutters or chimneys projecting not\nmore than 18 inches."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "One-story bay windows projecting not more than two\nfeet for a width not exceeding eight feet."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Open balconies, steps and terraces."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "One-story porches which shall project into the front\nor rear yard not more than 10 feet or which may project into one side\nyard, but shall not be nearer to the side line of the lot than the\nminimum side yard requirement."
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "As provided in § 203-70 of Article X.[1]"
												},
												{
													"footnote": "[1]\nEditor's Note: Former Subsection A(5), which\nlisted a certain projection into the rear yard as an exception, was\nrepealed 4-7-1986 by L.L. No. 5-1986. Said local law also provided\nfor the redesignation of former Subsection A(6) as Subsection A(5).\n"
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "The exceptions in Subsection A(1) through (5) above are subject to building area restrictions as provided for elsewhere in this chapter."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 203-106",
			"title": "Courts.",
			"content": [
				{
					"text": "Courts shall be governed by the following restrictions:"
				},
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "The width of an inner court shall not be less than\neight feet, but in no event shall it be less than four inches for\neach foot of the building height. For an inner court not on the lot\nline, the least dimension shall not be less than 16 feet."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "The width of an outer court shall not be less than\neight feet, but in no event shall it be less than four inches for\neach foot of building height. If the depth of an outer court shall\nexceed four times its width, the width shall be increased one foot\nfor each four feet of depth.[1]"
								},
								{
									"footnote": "[1]\nEditor's Note: Former § 148-82, Average\nsetback line, which immediately followed this subsection, was repealed\n2-8-1988 by L.L. No. 1-1988.\n"
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 203-107",
			"title": "Fences.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "No fence shall be erected or installed which exceeds\na height of six feet above the existing natural grade on any property\nin a residential district.[1]"
								},
								{
									"footnote": "[1]\nEditor's Note: See also § 203-91 for fencing requirements for swimming pools.\n"
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Except where expressly required by law, no fence shall\nbe permitted in any district other than a residential district, except\nwith the permission of the Board of Trustees; provided, however, that\nthe Building Inspector may authorize a temporary fence to protect\nor safeguard a construction or demolition site for one or more periods\nof time not to exceed 30 days each.[Amended 10-31-1995 by L.L. No. 7-1995]"
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "No fence shall be erected or installed in a front\nyard."
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "Any fence permitted by this chapter shall be constructed\nand maintained in a workmanlike manner. Any fence permitted by this\nchapter shall have a finished side facing out toward the nearest property\nline of the premises on which the fence is located."
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "For the purposes of this section, the term \"fence\"\nshall mean and refer to an artificially constructed barrier of any\nmaterial or combination of materials erected to separate, divide,\nenclose or screen areas of land and shall include a wall.[Amended 1-10-1994 by L.L. No. 1-1994]"
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 203-108",
			"title": "Extension of districts back from streets on which they front.",
			"content": [
				{
					"text": "Unless otherwise designated on the Zoning Map and except as otherwise expressly provided in Article II, § 203-4 of this chapter:"
				},
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Apartment B Districts extend 110 feet back from the\nstreet or streets on which they front."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Business Districts extend 100 feet back and Office\nBuilding OB Districts extend 200 feet back from the street or streets\non which they front. On side streets intersecting Business Districts,\nBusiness Districts extend 100 feet back from the street line on which\nthe Business District fronts. On side streets intersecting Office\nBuilding OB Districts, such districts extend 200 feet back from the\nstreet line on which the Office Building OB District fronts.[Amended 6-9-1980 by L.L. No. 18-1980]"
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Public Use Districts extend 200 feet back from the\nstreet or streets on which they front but not beyond the limits of\na Business District or district of other classification fronting on\nan adjacent parallel street or not beyond the line of the parallel\nstreet where the frontage on the latter has not another classification.[Amended 9-27-1994 by L.L. No. 13-1994]"
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 203-109",
			"title": "Determination of front yard depth.",
			"content": [
				{
					"text": "The depths of all front yards will be reckoned\nfrom existing street lines, or, where the street has been widened\nor is proposed to be widened and this new width has been duly authorized\nand recorded on a duly filed map, the depth of front yards shall be\nreckoned from the new street lines."
				}
			]
		},
		{
			"paragraph": "§ 203-110",
			"title": "Building setback on business streets.",
			"content": [
				{
					"text": "Where business streets are less than 50 feet\nin width, buildings shall be set not nearer the street line than 25\nfeet from the center line of the street."
				}
			]
		},
		{
			"paragraph": "§ 203-111",
			"title": "Effect of regulations on buildings under construction.",
			"content": [
				{
					"text": "Nothing herein contained shall require any change\nin the plans, construction or designated use of a building under construction,\nprovided that at the effective date of this chapter the construction\nshall have proceeded to the completion of the foundations and the\nsetting of the first-floor beams, and provided further that the work\nthereon shall be diligently prosecuted to completion within one year\nfrom the effective date of this chapter. The Board of Appeals may,\nin its discretion, due to the size or nature of the building or any\nspecial circumstances which in its judgment are sufficient, extend\nthe date of completion beyond the one year above fixed."
				}
			]
		},
		{
			"paragraph": "§ 203-112",
			"title": "Reduction of yard areas prohibited.",
			"content": [
				{
					"text": "In no event shall the building area in any district\nbe exceeded by reason of the deduction of yard areas required leaving\na greater percentage of lot area nor shall the yard areas in any district\nbe decreased by reason of the permitted building area."
				}
			]
		},
		{
			"paragraph": "§ 203-113",
			"title": "Elevator service in multifamily residences.",
			"content": [
				{
					"text": "No building which is arranged, intended or designed\nto be used for multifamily residential purposes shall be erected to\na height in excess of four stories unless it provides for the maintenance\nof adequate elevator service."
				}
			]
		},
		{
			"paragraph": "§ 203-114",
			"title": "Building permit required; filing of plans.",
			"content": [
				{
					"text": "No structure shall be erected, altered or changed\nin use nor any lot changed in use until all necessary plans and applications\nfor such erection, alteration or change have been filed and approved,\nincluding a certification by the Code Official that such work or change\nis in compliance with all village laws and requirements. All applications\nfor such approval and permit shall be in writing and shall be accompanied\nby a site plan, drawn to scale, showing the actual dimensions of the\nlot; the location of existing and proposed structures on the lot;\nthe use of each structure; the dimensions of each structure; the dimensions\nof each front yard, side yard and rear yard; a tabulation showing\ncompliance with applicable zoning requirements or the extent to which\nthe zoning requirements are not being met, and showing average front\nyard building setbacks of existing buildings on the same block; and\nany other information as may be required by the Code Official to provide\nfor a proper review and enforcement of the village laws and regulations."
				}
			]
		},
		{
			"paragraph": "§ 203-115",
			"title": "Sewage disposal facilities required.",
			"content": [
				{
					"text": "No apartment shall be permitted in any district\nor classification herein described not provided with suitable and\nefficient municipal sewage disposal facilities unless an independent\nsewage disposal plant having the approval of the Building Inspector\nis constructed for the sanitary disposal of the sewage of such buildings."
				}
			]
		},
		{
			"paragraph": "§ 203-116",
			"title": "Motor vehicle storage places in conjunction with apartment houses.",
			"content": [
				{
					"text": "Storage places for motor vehicles will be permitted on the same lot with apartment houses at the rates prescribed in Article XV for multiple dwellings, but no facilities for other than minor repairs will be permitted therein."
				}
			]
		},
		{
			"paragraph": "§ 203-117",
			"title": "Location of public garages; entrance doors.",
			"content": [
				{
					"text": "No public garage shall be located less than 40 feet from any residence district on either side thereof, except as provided in Article X, § 203-70, and the vehicular entrance door thereto shall be set back a distance of at least 15 feet from the street line and an open, unoccupied space shall be maintained between said door and the street line. The height of such open, unoccupied space shall be not less than 12 feet, and the other dimensions shall be such that the center of said vehicular entrance door is visible from any point on the street line within a distance of 12 feet each side of the center line of said door. A storage garage as permitted by this Article and Articles VII and VIII in connection with multiple dwellings and apartment houses shall not be deemed a public garage."
				}
			]
		},
		{
			"paragraph": "§ 203-118",
			"title": "Home occupation.",
			"content": [
				{
					"text": "A home occupation shall be a permitted use accessory\nto a permitted principal residential use where expressly so provided\nin this chapter, provided that such use conforms to the following\nstandards:[1]"
				},
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "No more than 25% of the total floor area of the dwelling\nunit, or 500 square feet, whichever is the lesser, may be used for\nsuch use."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "The use shall be conducted wholly within the enclosed\nwalls of the dwelling unit or a permitted accessory building."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "There shall be no external evidence of such use except\nfor a sign permitted by this chapter. No stock, merchandise, equipment\nor displays shall be visible outside the dwelling unit or accessory\nbuilding where such use is conducted."
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "No external structural alterations which are not customary\nto a residential building shall be permitted."
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "Except where otherwise provided by law, any use which\nis accessory to and clearly subordinate to the principal use of the\ndwelling unit for residential purposes, and consistent with the principal\nuse of the dwelling unit as a residence, shall be permitted as a home\noccupation, except that the following uses are prohibited:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Any form of business or other activity, the primary\nfunction of which is the wholesale or retail sale of goods or articles\nat the premises;"
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Any use which involves primarily catalog sales or\norder processing; provided, however, that such use shall be permitted\nif stock or merchandise is not distributed, stored or delivered to\ncustomers or others at the premises."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Automobile, boat or other vehicle repair."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "Massage parlor."
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "Any use which constitutes a public nuisance."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "F. ",
							"content": [
								{
									"text": "The premises where the home occupation is conducted\nshall be the principal residence of at least one person conducting\nthe home occupation."
								}
							]
						},
						{
							"number": "G. ",
							"content": [
								{
									"text": "No more than one home occupation may be conducted\nin any dwelling unit or on any premises."
								}
							]
						},
						{
							"number": "H. ",
							"content": [
								{
									"text": "All persons who are employed at the premises in connection\nwith the home occupation, or who participate in activity at the premises\nfor the operation of the home occupation, shall lawfully reside at\nthe premises as their principle residence, except that no more than\none other person may be so employed or so participate in the home\noccupation."
								}
							]
						},
						{
							"number": "I. ",
							"content": [
								{
									"text": "No home occupation may detract from the residential\ncharacter of the neighborhood in which it is conducted nor shall the\nhome occupation be conducted in such manner that the structure or\npremises differs from its residential character by the use of colors,\nmaterials, premises layout, construction or lighting."
								}
							]
						},
						{
							"number": "J. ",
							"content": [
								{
									"text": "For home occupations which are of a type in which\ninstruction or classes are given, no more than four students or pupils\nmay be in the dwelling unit or on the premises at any one time, except\nthat the Board of Trustees may grant permission for a reasonable number\nof additional pupils if it is found that the additional number will\nnot generate additional motor vehicle traffic and will otherwise maintain\nand be consistent with the residential character of the neighborhood."
								}
							]
						},
						{
							"number": "K. ",
							"content": [
								{
									"text": "In addition to the off-street parking required on\nthe premises for the residential use, each home occupation shall provide\none additional off-street parking facility on the premises."
								}
							]
						},
						{
							"number": "L. ",
							"content": [
								{
									"text": "Street parking for the home occupation shall be limited\nto the area within the street frontage of the premises where the use\nis conducted and shall be in conformity with any applicable regulations\nfor street parking. Where a home occupation is being conducted on\na corner lot, parking shall be within the street frontage of only\none street fronting on the premises, as designated by the Village\nBuilding Department, and shall be in conformity with any applicable\nregulations for street parking."
								}
							]
						},
						{
							"number": "M. ",
							"content": [
								{
									"text": "No commercial vehicle associated with the activities\nof the home occupation may be parked on the premises."
								}
							]
						},
						{
							"number": "N. ",
							"content": [
								{
									"text": "No home occupation shall make, generate or produce\nany offensive noise, vibration, smoke, electrical interference, dust,\nodors or heat. Any noise, vibration, smoke, electrical interference,\ndust, odors or heat detectable beyond the property lines of the premises\nwhere the use is conducted shall be deemed offensive for the purposes\nof this subsection."
								}
							]
						},
						{
							"number": "O. ",
							"content": [
								{
									"text": "No home occupation may constitute a fire hazard to\nbuildings or structures on neighboring properties nor adversely affect\nneighboring property values or constitute a nuisance or otherwise\nbe detrimental to the owners or occupants of neighboring properties\nby reason of excessive traffic, excessive or offensive noise, vibration,\nsmoke, electrical interference, dust, heat or odors or other circumstances."
								}
							]
						},
						{
							"number": "P. ",
							"content": [
								{
									"text": "No home occupation shall be open to the public, or\nto customers or clientele, earlier than 8 a.m. on any day nor later\nthan 9:00 p.m. on any day."
								}
							]
						},
						{
							"number": "Q. ",
							"content": [
								{
									"text": "No home occupation shall generate vehicle or pedestrian\ntraffic which is greater than normally generated by permitted uses\nin the district in which the use is located."
								}
							]
						},
						{
							"number": "R. ",
							"content": [
								{
									"text": "No home occupation shall consist, in whole or in part,\nof illegal activity or conduct."
								}
							]
						},
						{
							"number": "S. ",
							"content": [
								{
									"text": "No home occupation shall increase demand on water,\nsewer or solid waste disposal services to the extent that the combined\ndemand for the dwelling and the home occupation is significantly greater\nthan that which is normal to the use of the premises for residential\npurposes as permitted by the applicable zoning regulations."
								}
							]
						}
					]
				},
				{
					"footnote": "[1]\nEditor's Note: Former § 203-118, Permit\nrequired for public garage or service station; hearing; protests,\nas amended, was repealed 11-26-1996 by L.L. No. 17-1996.\n"
				}
			]
		},
		{
			"paragraph": "§ 203-119",
			"title": "(Reserved).\n                                                                                          [1]",
			"content": [
				{
					"footnote": "[1]\nEditor's Note: Former § 203-119, Location\nof garages and service stations with respect to certain buildings,\nas amended, was repealed 11-26-1996 by  L.L. No. 17-1996.\n"
				}
			]
		},
		{
			"paragraph": "§ 203-120",
			"title": "Buildings to be located on single lot; subdivisions of land.",
			"content": [
				{
					"text": "Regardless of the area of a plot or parcel of\nland on which a building is hereafter erected or altered, such building\nshall be located on a single and separately delineated building lot.\nAny subdivision of land into one or more lots shall require the approval\nof the Planning Board as otherwise provided by law. Each such building\nlot, and any building or structure erected or altered thereon, shall\nconform to the requirements of this chapter.[1]"
				},
				{
					"footnote": "[1]\nEditor's Note: Former § 148-96, Subdivision\nor development fees, amended 1-10-1994 by L.L. No. 1-1994, which immediately\nfollowed this section, was repealed 3-1-1994 by L.L. No. 4-1994. Former\n§ 148-97, Additions or extensions to conforming buildings, was\nrepealed 4-25-1989 by L.L. No. 5-1989.\n"
				}
			]
		},
		{
			"paragraph": "§ 203-121",
			"title": "Minimum floor area of apartments.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "In any district in which apartments are permitted\nor exist as nonconforming uses, the minimum floor area for any apartment\nto be constructed or altered to reduce its existing floor area shall\nbe as follows:"
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "The term \"bedroom\" shall include any room or alcove\nwhich is not a kitchen, bathroom or living room."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 203-122",
			"title": "Air-conditioning system equipment.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "All outdoor compressors, cooling towers and other\nair-conditioning system equipment for all residential or other building\ntypes shall be located in the rear yard immediately adjacent to the\nrear wall of the building and at least 20 feet distant from any property\nline. However, no such equipment shall be installed until a building\npermit for the same has been obtained from the village and all required\nfees paid."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "In buildings other than residential, as an alternate\nto the rear yard location, such equipment may be located on the roof\nof the structure. All such equipment in such rooftop locations shall\nbe set back from the roof edge not less than 10 feet and shall be\nsurrounded by a form of screening approved by the Village Planning\nBoard."
								}
							]
						}
					]
				}
			]
		}
	]
}