{
	"url": "http://ecode360.com/14999727",
	"paras": [
		{
			"paragraph": "§ 530-3-1",
			"title": "Districts designated.",
			"content": [
				{
					"text": "For the purpose of this chapter, the Village of Mastic Beach\nis hereby divided into use districts, which shall be designated as\nfollows, and such other districts as may be added by amendments to\nthis chapter:"
				}
			]
		},
		{
			"paragraph": "§ 530-3-1.2-R-1",
			"title": "R-1 Residence District.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Uses. In the R-1 Residence District, no building or premises shall\nbe used, and no building shall be hereafter erected or altered, unless\notherwise provided for in this chapter, except for one or more of\nthe following uses:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "One-family dwelling."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Churches or similar places of worship, parish houses, convents\nand accessory buildings of a religious nature, when authorized by\na special permit from the Board of Trustees."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Public parks, playgrounds and recreational areas, when authorized\nor operated by a governmental authority."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "A regularly organized elementary or high school having a curriculum\napproved by the Board of Regents of the State of New York, accredited\ncolleges or universities, by special permit from the Board of Trustees."
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "Private detached garage as an accessory building."
												}
											]
										},
										{
											"number": "(6) ",
											"content": [
												{
													"text": "Other customary accessory uses and buildings, provided that\nsuch uses are incidental to the principal use, but such uses shall\nnot include any activity conducted as a business."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Height. In the R-1 Residence District, no building or structure hereafter erected or altered shall exceed 30 feet or two stories, except where such building or structure lies within a Flood Damage Prevention Zone as defined in Chapter 230 of the Village Code, in which case the maximum height shall not exceed 35 feet."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Lot area. In the R-1 Residence District, no building shall be erected on a lot having an area of less than 7,500 square feet and a width of less than 75 feet at the street line and at the building line. A one-family dwelling may be built upon a lot held in single and separate ownership at the effective date of the original amendment of this chapter so long as it conforms with the requirements under Article VIII, § 530-8-3, of this chapter. A one-family dwelling legally existing at the effective date of the original amendment of this chapter may be altered in compliance with Article VIII, § 530-8-3, of this chapter."
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "Front yard. In the R-1 Residence District, no building hereafter\nerected or altered shall have a depth of front yard less than 30 feet.\nIf on the same side of the street 40% or more of the total street\nline distance between the two nearest intersecting street lines shall\nhave been improved with two or more buildings, or in the event that\nbuilding permits shall have been issued therefor, not less than the\naverage depth of yard as so established by such existing or permitted\nbuildings shall be maintained; provided, however, that any such front\nyard depth shall not be required to be more than 40 feet."
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "Corner lot. In the R-1 Residence District, such lot shall have a front yard along each street and one rear yard as is provided in Subsection H."
								}
							]
						},
						{
							"number": "F. ",
							"content": [
								{
									"text": "Double-front lots. In the R-1 Residence District, the required front yard as required in Subsection D shall be provided on both street fronts."
								}
							]
						},
						{
							"number": "G. ",
							"content": [
								{
									"text": "Side yards. In the R-1 Residence District, there shall be two side\nyards, one on each side of the building. The total of the widths of\nboth side yards shall be not less than 30 feet wide, and neither side\nyard shall be less than 15 feet wide."
								}
							]
						},
						{
							"number": "H. ",
							"content": [
								{
									"text": "Rear yard. In the R-1 Residence District, there shall be a rear yard\nhaving a minimum depth of 25 feet."
								}
							]
						},
						{
							"number": "I. ",
							"content": [
								{
									"text": "Building area. In the R-1 Residence District, the total building\narea shall not exceed 35% of the required lot area."
								}
							]
						},
						{
							"number": "J. ",
							"content": [
								{
									"text": "Accessory buildings or structures."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Accessory buildings in the R-1 District may occupy not more\nthan 25% of the required rear yard."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "The yard area occupied by such accessory building shall be included\nin computing the percentage of lot area permitted to be built upon."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Any accessory building shall be located on the same lots with\nthe principal building."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "No accessory building shall be constructed upon a lot or plot\nuntil the construction of the principal structure has been actually\ncommenced."
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "No accessory building shall be used unless the principal structure\non a lot or plot has been completed and is in use."
												}
											]
										},
										{
											"number": "(6) ",
											"content": [
												{
													"text": "No accessory building shall be built within two feet of any\nside or rear lot line."
												}
											]
										},
										{
											"number": "(7) ",
											"content": [
												{
													"text": "Maximum height of any accessory building or shed, excluding\na garage, shall not exceed 12 feet. Maximum height of a garage may\nnot exceed 14 feet. All accessory buildings are required to have a\npitched roof. The minimum pitch for the roof is to be 2 1/2 inches\nof height for every foot of length. Highest point of the roof must\nbe at least 25% of the length or width of the structure inward from\nat least two outer walls."
												}
											]
										},
										{
											"number": "(8) ",
											"content": [
												{
													"text": "No accessory building shall exceed 144 square feet, with the\nexception of a garage. No garage shall exceed 750 square feet."
												}
											]
										},
										{
											"number": "(9) ",
											"content": [
												{
													"text": "No accessory building shall be built forward of the front line\nof the principal structure."
												}
											]
										},
										{
											"number": "(10) ",
											"content": [
												{
													"text": "No accessory building shall be built in any part of the front\nyard of a property."
												}
											]
										},
										{
											"number": "(11) ",
											"content": [
												{
													"text": "No accessory building shall be built within five feet of the\nprincipal structure."
												}
											]
										},
										{
											"number": "(12) ",
											"content": [
												{
													"text": "No garage shall be built within 10 feet of any yard lot lines."
												}
											]
										},
										{
											"number": "(13) ",
											"content": [
												{
													"text": "No more than three accessory buildings shall be permitted on\nany lot. The accessory buildings on any lot shall not consist of more\nthan one garage and two other accessory buildings."
												}
											]
										},
										{
											"number": "(14) ",
											"content": [
												{
													"text": "No swimming pool shall be built forward of the front line of\nthe principal structure."
												}
											]
										},
										{
											"number": "(15) ",
											"content": [
												{
													"text": "No swimming pool shall be built within 10 feet of any yard lot\nlines."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "K. ",
							"content": [
								{
									"text": "Any type of structure or constructed, delivered, or erected object\nnot defined within this section shall not be constructed, delivered,\nor erected without permission and definition by the Zoning Board of\nAppeals."
								}
							]
						},
						{
							"number": "L. ",
							"content": [
								{
									"text": "Permitted encroachments. In the R-1 Residence District, the following\nencroachments upon required yard areas are permitted:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Cornices, eaves, gutters, chimneys or bay windows projecting\nnot more than 24 inches."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "One-story open covered (roofed-over) porches and terraces, projecting\nnot more than six feet into a required rear, front or side yard."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "A one-story enclosed vestibule not greater than six feet wide\nand five feet deep into a front yard."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "In any case where the Zoning Board of Appeals has diminished\na required yard by a variance, none of the foregoing encroachments\nshall be permitted into such diminished yard."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "M. ",
							"content": [
								{
									"text": "No more than one dwelling shall be erected on any building lot."
								}
							]
						},
						{
							"number": "N. ",
							"content": [
								{
									"text": "Accessory apartments are permitted upon the issuance of a special\npermit by the Board of Trustees with restrictions on occupancy to\nbe determined by the Board of Trustees."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 530-3-1.2-R-2",
			"title": "R-2 Residence District.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Uses. In the R-2 Residence District, no building or premises shall\nbe used, and no building shall be hereafter erected or altered, unless\notherwise provided for in this chapter, except for one or more of\nthe following uses:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "One-family dwelling."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Churches or similar places of worship, parish houses, convents\nand accessory buildings of a religious nature, when authorized by\na special permit from the Board of Trustees."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Public parks, playgrounds and recreational areas, when authorized\nor operated by a governmental authority."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "A regularly organized elementary or high school having a curriculum\napproved by the Board of Regents of the State of New York, accredited\ncolleges or universities, by special permit of the Board of Trustees."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Height. In the R-2 Residence District, no residential building or structure hereafter erected or altered shall exceed 35 feet or two stories, except where such building or structure lies within a Flood Damage Prevention Zone as defined in Chapter 230 of the Village Code, in which case the maximum height shall not exceed 40 feet."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Lot area. In the R-2 Residence District, no building shall be erected or altered on a lot having an area of less than 80,000 square feet and a width of less than 150 feet at the street line and at the building line. A one-family dwelling may be built upon a lot held in single and separate ownership at the effective date of the original amendment of this chapter so long as it conforms with the requirements under Article VIII, § 530-8-3, of this chapter. A one-family dwelling legally existing at the effective date of the original amendment of this chapter may be altered in compliance with Article VIII, § 530-8-3 of this chapter."
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "Front yard. In the R-2 Residence District, no building hereafter\nerected or altered shall have a depth of front yard less than 60 feet.\nIf on the same side of the street 40% or more of the total street\nline distance between the two nearest intersecting street lines shall\nhave been improved with two or more buildings, or in the event that\nbuilding permits shall have been issued therefor, not less than the\naverage depth of yard as so established by such existing or permitted\nbuildings shall be maintained; provided, however, that any such front\nyard depth shall not be required to be more than 60 feet."
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "Corner lot. In the R-2 Residence District, such lot shall have a front yard along each street as provided in Subsection D and one rear yard as is provided in Subsection H."
								}
							]
						},
						{
							"number": "F. ",
							"content": [
								{
									"text": "Double-front lots. In the R-2 Residence District, the required front yard as required in Subsection D shall be provided on both street fronts."
								}
							]
						},
						{
							"number": "G. ",
							"content": [
								{
									"text": "Side yards. In the R-2 Residence District, there shall be two side\nyards, one on each side of the building. The total of the widths of\nboth side yards shall be not less than 80 feet wide, and neither side\nyard shall be less than 30 feet wide."
								}
							]
						},
						{
							"number": "H. ",
							"content": [
								{
									"text": "Rear yard. In the R-2 Residence District, there shall be a rear yard\nhaving a minimum depth of 75 feet."
								}
							]
						},
						{
							"number": "I. ",
							"content": [
								{
									"text": "Building area. In the R-2 Residence District, the total building\narea shall not exceed 15% of the lot area."
								}
							]
						},
						{
							"number": "J. ",
							"content": [
								{
									"text": "Accessory buildings or structures."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Accessory buildings in the R-2 District may occupy not more\nthan 15% of the required rear yard."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "The yard area occupied by such accessory building shall be included\nin computing the percentage of lot area permitted to be built upon."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Any accessory building shall be located on the same lots with\nthe principal building."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "No accessory building shall be constructed upon a lot or plot\nuntil the construction of the principal structure has been actually\ncommenced."
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "No accessory building shall be used unless the principal structure\non a lot or plot has been completed and is in use."
												}
											]
										},
										{
											"number": "(6) ",
											"content": [
												{
													"text": "No accessory building shall be built within five feet of any\nside or rear lot line."
												}
											]
										},
										{
											"number": "(7) ",
											"content": [
												{
													"text": "No accessory structure shall exceed 750 square feet without\napproval of the Zoning Board of Appeals."
												}
											]
										},
										{
											"number": "(8) ",
											"content": [
												{
													"text": "Maximum height of any accessory building or shed, excluding\na garage, shall not exceed 12 feet. Maximum height of a garage may\nnot exceed 14 feet. All accessory buildings are required to have a\npitched roof. The minimum pitch for the roof is to be 2 1/2 inches\nof height for every foot of length. Highest point of the roof must\nbe at least 25% of the length or width of the structure inward from\nat least two outer walls."
												}
											]
										},
										{
											"number": "(9) ",
											"content": [
												{
													"text": "No accessory building shall exceed 144 square feet with the\nexception of a garage. No garage shall exceed 750 square feet."
												}
											]
										},
										{
											"number": "(10) ",
											"content": [
												{
													"text": "No accessory building shall be built forward of the front line\nof the principal structure."
												}
											]
										},
										{
											"number": "(11) ",
											"content": [
												{
													"text": "No accessory building shall be built in any part of the front\nyard of that property."
												}
											]
										},
										{
											"number": "(12) ",
											"content": [
												{
													"text": "No accessory building shall be built within 10 feet of the principal\nstructure."
												}
											]
										},
										{
											"number": "(13) ",
											"content": [
												{
													"text": "No garage shall be built within 15 feet of any yard lot lines."
												}
											]
										},
										{
											"number": "(14) ",
											"content": [
												{
													"text": "No more than three accessory buildings shall be permitted on\nany lot. The accessory buildings on any lot shall not consist of more\nthan one garage and two other accessory buildings."
												}
											]
										},
										{
											"number": "(15) ",
											"content": [
												{
													"text": "No swimming pool shall be built forward of the front line of\nthe principal structure."
												}
											]
										},
										{
											"number": "(16) ",
											"content": [
												{
													"text": "No swimming pool shall be built within 10 feet of any yard lot\nlines."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "K. ",
							"content": [
								{
									"text": "Any type of structure or constructed, delivered, or erected object\nnot defined within this section shall not be constructed, delivered,\nor erected without permission and definition by the Zoning Board of\nAppeals."
								}
							]
						},
						{
							"number": "L. ",
							"content": [
								{
									"text": "Permitted encroachments. In the R-2 Residence District, the following\nencroachments upon required yard areas are permitted:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Cornices, eaves, gutters, chimneys or bay windows projecting\nnot more than 24 inches."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "One-story open covered (roofed over) porches and terraces, projecting\nnot more than six feet into a required rear, front or side yard."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "One-story enclosed vestibule not greater than six feet wide\nand five feet deep into front yard."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "In any case where the Zoning Board of Appeals has diminished\na required yard by a variance, none of the foregoing encroachments\nshall be permitted into such diminished yard."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "M. ",
							"content": [
								{
									"text": "No more than one dwelling shall be erected on any building lot."
								}
							]
						},
						{
							"number": "N. ",
							"content": [
								{
									"text": "Accessory apartments are permitted upon the issuance of a special\npermit by the Board of Trustees with restrictions on occupancy to\nbe determined by the Board of Trustees."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 530-3-1.3",
			"title": "RH Retirement Housing District.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Legislative intent. These provisions are intended to provide for\nproper housing for the Village's senior citizens. The Board of\nTrustees recognizes an existing and growing need for the provision\nof housing especially designed for senior citizens. Therefore, maximum\npermitted densities may be increased to accomplish these goals."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Definitions. As used in this section, the following term shall have\nthe meaning indicated:"
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Permitted uses. In the RH District, no building, structure or premises\nshall be used or occupied and no building or part thereof of other\nstructure shall be so erected or altered except for attached or semiattached\none-family residences."
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "Accessory uses: customary accessory uses, structures and buildings,\nprovided such uses are clearly accessory and incidental to the principal\nuse and do not include any activity commonly conducted as a business."
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "Prohibited uses. All uses not expressly permitted are prohibited."
								}
							]
						},
						{
							"number": "F. ",
							"content": [
								{
									"text": "Minimum lot area. The required minimum lot area shall be eight acres."
								}
							]
						},
						{
							"number": "G. ",
							"content": [
								{
									"text": "Minimum width of lot throughout. The required minimum lot width shall\nbe 200 feet."
								}
							]
						},
						{
							"number": "H. ",
							"content": [
								{
									"text": "Minimum front yard setback. The required minimum front yard setback\nshall be 25 feet. The Planning Board may increase the minimum required\nfront yard setback up to 75 feet as deemed appropriate based upon\nthe nature and character of development that is in close proximity\nto the subject parcel. No parking shall be permitted within a designated\nfront yard setback."
								}
							]
						},
						{
							"number": "I. ",
							"content": [
								{
									"text": "Minimum required side yard and rear yard setbacks."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "A minimum setback of 50 feet shall be provided adjacent to all\nadjoining properties."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "The Planning Board may decrease the minimum required side yard\nor rear yard setback within a designated primary zone to 25 feet if\ndeemed appropriate based upon the nature and character of development\nwithin 500 feet of the subject parcel."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "J. ",
							"content": [
								{
									"text": "Maximum permitted height."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Except as otherwise provided herein, the maximum permitted height\nfor all structures shall be 35 feet or 2 1/2 stories."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "The Planning Board may increase the maximum permitted height\nwithin a designated primary zone to 50 feet and/or three stories,\nwhichever is less."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "K. ",
							"content": [
								{
									"text": "Maximum permitted floor area ratio (FAR). The maximum permitted FAR\nshall be 30%."
								}
							]
						},
						{
							"number": "L. ",
							"content": [
								{
									"text": "Density (units per acre). The maximum permitted density shall be\nfour units per acre."
								}
							]
						},
						{
							"number": "M. ",
							"content": [
								{
									"text": "Recreational facilities. The owner or developer of a multiple-residence\ndevelopment shall set aside an area for outdoor recreational purposes\nexclusively for the use of the occupants of such multiple-residence\ndevelopment and their guests. Such recreational area shall be equal\nto the number of units multiplied by 200 square feet for each dwelling\nunit. Such area shall be shown as part of the site plan. The recreational\narea may include play lot facilities and equipment, group game areas\nor swimming pools. Such area shall be improved, constructed and maintained\nat the expense of the owner or owners thereof. Landscaped areas which\nare not developed for recreational purposes shall not be deemed to\nsatisfy the requirements of this section."
								}
							]
						},
						{
							"number": "N. ",
							"content": [
								{
									"text": "Time limitations on construction."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "A building permit shall be secured and construction begun in\naccordance with the approved final site development plan within three\nyears from the effective date of the Board of Trustees establishing\nsuch zone. Application may be made to the Board of Trustees for not\nmore than a one-year extension of the time limit for commencement\nof construction. The application shall be in the form of a written\nrequest setting forth the basis for the request. In the event construction\nis not commenced within the specified time limits, the Board of Trustees\nmay review the zoning classification and the construction progress\nin connection therewith and, if deemed necessary, initiate proceedings\nto reclassify the property as deemed appropriate."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "All construction authorized in the final development plan must\nbe completed within two years of the date construction is commenced.\nApplication may be made to the Board of Trustees for not more than\na one-year extension of the time limit for completion of construction.\nThe application shall be in the form of a written request setting\nforth the basis for the request. A plan for stated development, which\nwill require more time than the limits contained herein, may be approved\nby the Board of Trustees prior to or during the course of construction.\nIn the event that construction is not completed within the time limit\nspecified by the Board of Trustees on this section, the Board of Trustees\nmay review the zoning and the progress in connection with the development\nand, if necessary, initiate proceedings to reclassify the property\nas deemed appropriate."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "O. ",
							"content": [
								{
									"text": "General severability. If any clause, sentence, paragraph, section\nor item of this article shall be adjudged by any court of competent\njurisdiction to be invalid, such judgment shall not impair nor invalidate\nthe remainder hereof, but such adjudication shall be confined to its\noperation to the clause, sentence, paragraph, section or item directly\ninvolved in the controversy in which such judgment shall have been\nrendered."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 530-3-1.4",
			"title": "R/B Residence/Business District.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Uses. In the R/B District, no building or premises shall be used\nand no building shall be hereafter erected or altered unless otherwise\nprovided in this chapter. Permitted uses shall not include and such\nnonpermissible uses shall not be limited to beauty parlors, barbershops,\nconvalescent homes, funeral homes, dancing schools, music schools,\nreal estate offices, veterinarian offices, animal hospitals and biological\nor medical testing laboratories. The following are permissible uses\nin the R/B District:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Any principal and accessory use permitted in the R-1 Residence\nDistrict."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Offices and professional spaces as an accessory use by the owner\nof the residence where the principal use is as a residence and when\nauthorized by the Planning Board by virtue of application thereto\nas hereinafter provided."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Home-based business as an accessory use by the owner of the\nresidence where the principal use is as a residence and when authorized\nby the Planning Board by virtue of application thereto as hereinafter\nprovided."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "Bed-and-breakfast as an accessory use by the owner of the residence\nwhere the principal use is as a residence and when authorized by the\nPlanning Board by virtue of application thereto as hereinafter provided.\nSection 530-8-10 of this chapter defines the term \"bed-and-breakfast\"[1] and provides further regulations for their operation."
												},
												{
													"footnote": "[1]\nEditor's Note: See the definition of \"bed-and-breakfast\"\nin § 530-2-2, Definitions, and related provisions in § 530-8-10,\nbed-and-breakfast establishments.\n"
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Height. In the R/B District, height restrictions shall be the same\nas in the R-1 Residence District."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Lot area. In the R/B District, no building shall be erected or altered on a lot having an area of less than 10,000 square feet and a width of less than 100 feet at the street line and at the building line. A one-family dwelling may be built upon a lot held in single and separate ownership at the effective date of the original amendment of this chapter so long as it conforms with the requirements under Article VIII, § 530-8-3, of this chapter. A one-family dwelling legally existing at the effective date of the original amendment of this chapter may be altered in compliance with this chapter."
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "Front yard. In the R/B District, no building hereafter erected or\naltered shall have a depth of front yard less than 30 feet. If on\nthe same side of the street 40% or more of the total street-line distance\nbetween the two nearest intersecting street lines shall have been\nimproved with two or more buildings, or in the event that building\npermits shall have been issued therefor, not less than the average\ndepth of front yard as so established by such existing or permitted\nbuildings shall be maintained; provided, however, that any such front\nyard depth shall not be required to be more than 40 feet."
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "Corner lot. In the R/B District, such lot shall have a front yard along each street as is provided in Subsection D and one rear yard as is provided in Subsection H."
								}
							]
						},
						{
							"number": "F. ",
							"content": [
								{
									"text": "Double-front lots. In the R/B Residence District, the required front yard as required in Subsection D shall be provided on both street fronts."
								}
							]
						},
						{
							"number": "G. ",
							"content": [
								{
									"text": "Side yards. In the R/B District, there shall be two side yards, one\non each side of the building. The total of the widths of both side\nyards shall be not less than 30 feet, and neither side yard shall\nbe less than 15 feet wide."
								}
							]
						},
						{
							"number": "H. ",
							"content": [
								{
									"text": "Rear yard. In the R/B District, the rear yard requirements shall\nbe not less than 25 feet."
								}
							]
						},
						{
							"number": "I. ",
							"content": [
								{
									"text": "Building area. In the R/B District, the total building area shall\nnot exceed 35% of the total required lot area."
								}
							]
						},
						{
							"number": "J. ",
							"content": [
								{
									"text": "Accessory buildings. In the R/B District, the restrictions on and\nrequirements for accessory buildings shall be the same as in the R-1\nResidence District."
								}
							]
						},
						{
							"number": "K. ",
							"content": [
								{
									"text": "Parking. In the R/B Business District, off-street parking shall be required to obtain a building permit provided pursuant to the provisions of Article IX, § 530-9-1, inclusive of this chapter, except that the parking provided shall not be located in the front yard of the premises for which it is provided. This regulation limiting the required off-street parking to the rear yard may be varied by the Planning Board after application to it and a public hearing. The Planning Board, in granting a variance to the provisions of this subdivision, shall determine whether the proposed variance will be in harmony with the existing traffic and parking conditions and will adversely affect the safety, welfare and convenience of the public and whether there are practical difficulties in the way of strictly carrying out this regulation."
								}
							]
						},
						{
							"number": "L. ",
							"content": [
								{
									"text": "Permitted encroachments. In the R/B District, the permitted encroachments\nshall be the same as are permitted in the R-1 Residence District."
								}
							]
						},
						{
							"number": "M. ",
							"content": [
								{
									"text": "Architectural design and other criteria for variances and special\nuse permits in the R/B District as approved by the Planning Board."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "In the R/B District, the architectural design, scale and mass\nof buildings and other structures, including, among other elements,\nthe exterior building material, color, roofline and building elevations,\nshall be of such character as to harmonize and be compatible with\nthe neighborhood so as to protect property values in the neighborhood\nand to preserve and improve the appearance and beauty of the community.\nNew construction shall adhere to the purposes of this district, in\nwhole or in part."
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "Buildings shall be designed to achieve a small-scale and residential\nappearance."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "Pitched-roofed buildings shall be required."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "Rooftop mechanical equipment shall be prohibited, except for\nenergy conservation systems such as solar energy panels."
																}
															]
														},
														{
															"number": "(d) ",
															"content": [
																{
																	"text": "Buildings shall be designed and located on the site so as to\nretain the existing topography and natural features of the land to\nthe greatest extent possible."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Role of Planning Board. In order to carry out the purposes of\nthis section, the Planning Board shall be empowered to serve as the\ngeneral administrative and review agency with the specific powers\nand duties enumerated elsewhere in this subsection. The Planning Board\nshall make the necessary studies, research investigations and consultations;\nprepare the necessary maps, reports and other material; and undertake\nsuch other assignments as it deems appropriate and as may be requested\nby the Board of Trustees, all directed toward the preservation of\nthe appearance and beauty of the community."
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "Powers and duties of the Planning Board. In carrying out the\npurposes of this subsection, the Planning Board shall have the following\npowers and duties:"
																},
																{
																	"content": [
																		{
																			"number": "[1] ",
																			"content": [
																				{
																					"text": "To review all applications for building permits,\nspecial use permits, sign permits and variances in the R/B District\nto determine what effect their granting may have on the special character\nto be preserved."
																				}
																			]
																		},
																		{
																			"number": "[2] ",
																			"content": [
																				{
																					"text": "To utilize the service of special consultants to\nassist in the resolution of specific problems."
																				}
																			]
																		},
																		{
																			"number": "[3] ",
																			"content": [
																				{
																					"text": "To consult with and offer suggestions to property\nowners, residents and tenants in the R/B District to help implement\nthe objectives of this subsection."
																				}
																			]
																		}
																	]
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "Review procedure."
																},
																{
																	"content": [
																		{
																			"number": "[1] ",
																			"content": [
																				{
																					"text": "Applications for building permits, special use\npermits, sign permits and variances within the R/B District shall\nbe referred to the Planning Board by the Building Inspector or the\nBoard of Appeals."
																				}
																			]
																		},
																		{
																			"number": "[2] ",
																			"content": [
																				{
																					"text": "The Planning Board shall then review the applications\nand plans in accordance with the provisions of this subsection. In\nmaking its review, the Planning Board may confer with the applicant\nor its authorized representative and shall, in making its determination,\nconsider the following:"
																				},
																				{
																					"content": [
																						{
																							"number": "[a] ",
																							"content": [
																								{
																									"text": "The compatibility of the proposed building, structure,\nalteration thereof or use of the property with neighboring properties\nand the R/B District as a whole."
																								}
																							]
																						},
																						{
																							"number": "[b] ",
																							"content": [
																								{
																									"text": "The visual and locational relationship between\nthe property in question and the R/B District's existing buildings,\nstructures, special character and general appearance in regard to\nstyle, material, scale, proportion, composition, mass, line, color,\ndetail, setback, landscaping and related items."
																								}
																							]
																						},
																						{
																							"number": "[c] ",
																							"content": [
																								{
																									"text": "Any other factors relating to aesthetic considerations\nwhich are deemed pertinent to the benefit of the R/B District."
																								}
																							]
																						},
																						{
																							"number": "[d] ",
																							"content": [
																								{
																									"text": "The number of professionals and staff on the premises,\nthe type of profession and hours of operation, the anticipated number\nof clients at any one time on the premises, and the effect on traffic\ncongestion, adequate parking and pedestrian safety in the immediate\narea."
																								}
																							]
																						}
																					]
																				}
																			]
																		},
																		{
																			"number": "[3] ",
																			"content": [
																				{
																					"text": "By specific request in a particular case, the Planning\nBoard may require the submission of such plans, reports, maps, exhibits,\nphotographs or drawings as are necessary for its determinations. These\nsubmissions shall include but not be limited to site plans; architectural\nplans; landscaping plans; proposed signs; proposed door, window and\nfacade design details and colors; and photographs or drawings indicating\nvisual relationships to adjoining buildings and spaces in the R/B\nDistrict."
																				}
																			]
																		},
																		{
																			"number": "[4] ",
																			"content": [
																				{
																					"text": "After its review and examination of the items submitted\nand subsequent to such further deliberations as it deems necessary,\nbut within 45 days of the receipt of the application and accompanying\nitems for review, unless the time period is extended as mutually agreed\nupon by the Planning Board and the applicant, the Planning Board shall\nissue a favorable recommendation to the Building Inspector or Chairman\nof the Board of Appeals only if it finds that the proposal or a modification\nthereof is in fact appropriate to the character, appearance and efficient\nfunctioning of the R/B District. When the recommendation is for denial,\nthe Planning Board shall state the reasons given for such recommendation."
																				}
																			]
																		},
																		{
																			"number": "[5] ",
																			"content": [
																				{
																					"text": "In the R/B District, no permit shall be issued\nto erect or alter a building, structure or sign in such manner as\nto change the outside dimensions or exterior appearance unless and\nuntil a recommendation has been received by the Planning Board. Likewise,\nno special use permit or variance shall be granted by the Board of\nAppeals until a recommendation by the Planning Board has been received."
																				}
																			]
																		}
																	]
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "Maintenance. Nothing contained in this subsection shall be construed\nto prevent the ordinary maintenance and repair of any exterior architectural\nfeature or premises in the R/B District which does not involve a change\nin design, material, color or the outward appearance thereof."
																}
															]
														}
													]
												}
											]
										}
									]
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 530-3-1.5",
			"title": "B-1 Business District.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Uses. In the B-1 Business District, no building or premises shall\nbe used and no building shall be hereafter erected or altered, unless\notherwise provided in this chapter, except for one or more of the\nfollowing permitted uses:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Offices and professional buildings."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Shops and stores for wholesale and retail of consumer merchandise\nand services."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Personal service shops, such as barbershops, beauty parlors\nand like services."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "Bowling alleys."
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "Banks."
												}
											]
										},
										{
											"number": "(6) ",
											"content": [
												{
													"text": "Undertaking establishments."
												}
											]
										},
										{
											"number": "(7) ",
											"content": [
												{
													"text": "Game rooms, when allowed by special permit of the Zoning Board\nof Appeals. Said permits shall commence January 1 of one year and\nshall expire on December 31 of the following year unless renewed upon\ntimely application."
												}
											]
										},
										{
											"number": "(8) ",
											"content": [
												{
													"text": "Veterinarian."
												}
											]
										},
										{
											"number": "(9) ",
											"content": [
												{
													"text": "Billiard parlors, when authorized by special permit from the\nZoning Board of Appeals."
												}
											]
										},
										{
											"number": "(10) ",
											"content": [
												{
													"text": "Restaurants, when authorized by special permit from the Zoning\nBoard of Appeals and licensed by the Suffolk County Department of\nHealth Services."
												}
											]
										},
										{
											"number": "(11) ",
											"content": [
												{
													"text": "Bars and taverns, when authorized by special permit from the\nZoning Board of Appeals and licensed by the Suffolk County Department\nof Health Services."
												}
											]
										},
										{
											"number": "(12) ",
											"content": [
												{
													"text": "Grocery stores, or any other retail store that sells prepared\nor packaged food products, when authorized by special permit from\nthe Zoning Board of Appeals and licensed by the Suffolk County Department\nof Health Services."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Height. In the B-1 Business District, no building or structure hereafter erected or altered shall exceed 2 1/2 stories or 35 feet, except where such building or structure lies within a Flood Damage Prevention Zone as defined in Chapter 230 of the Village Code, in which case the maximum height shall not exceed 40 feet."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Lot area. In the B-1 Business District, no building shall be erected\nor altered on a lot having an area less than 10,000 square feet and\nupon a lot having a frontage of less than 80 feet."
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "Front yard. In the B-1 Business District, the required front yard\ndepth shall be not less than five feet. If 40% or more of the distance\nof the street frontage on the same side of the street between the\ntwo nearest intersecting streets shall have been improved with two\nor more buildings, or in the event that building permits shall have\nbeen issued therefor, not less than the average front yard depth as\nso established by such existing or permitted buildings shall be maintained;\nprovided, however, that any such front yard depth shall not be required\nto be more than 10 feet."
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "Double-front or corner lots. In the B-1 Business District, the required\nfront yard shall be provided for on both streets."
								}
							]
						},
						{
							"number": "F. ",
							"content": [
								{
									"text": "Rear yard. In the B-1 Business District, there shall be a rear yard\nhaving a minimum depth of 15 feet."
								}
							]
						},
						{
							"number": "G. ",
							"content": [
								{
									"text": "Building area. In the B-1 Business District, the total building area\nshall not exceed 75% of the total required lot area."
								}
							]
						},
						{
							"number": "H. ",
							"content": [
								{
									"text": "Accessory buildings. In the B-1 Business District, accessory buildings\nmay occupy 50% of the required rear yard, up to an average height\nof 14 feet."
								}
							]
						},
						{
							"number": "I. ",
							"content": [
								{
									"text": "Parking. In the B-1 Business District, off-street parking shall be required to obtain a building permit provided pursuant to the provisions of Article IX, § 530-9-1, inclusive of this chapter, except that the parking provided shall not be located in the front yard of the premises for which it is provided. This regulation limiting the required off-street parking to the rear yard may be varied by the Planning Board after application to it and a public hearing. The Planning Board, in granting a variance to the provisions of this subdivision, shall determine whether the proposed variance will be in harmony with the existing traffic and parking conditions and will adversely affect the safety, welfare and convenience of the public and whether there are practical difficulties in the way of strictly carrying out this regulation."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 530-3-1.6",
			"title": "B-2 Business District.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Uses. In the B-2 Business District, no building or premises shall\nbe used and no building shall be hereafter erected or altered, unless\notherwise provided in this chapter, except for one or more of the\nfollowing uses:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Any use permitted in the B-1 Business District."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Nightclubs or cabarets when allowed as a special exception by\nthe Zoning Board of Appeals."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Golf courses; private, country and yacht clubs when permitted\nas a special exception by the Zoning Board of Appeals."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "Shops and stores for wholesale and retail consumer merchandise\nand services."
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "Laundromats, when allowed as a special exception by the Zoning\nBoard of Appeals as hereinafter provided."
												}
											]
										},
										{
											"number": "(6) ",
											"content": [
												{
													"text": "Hotels, motels, and boardinghouses as a special exception by\nthe Board of Trustees."
												}
											]
										},
										{
											"number": "(7) ",
											"content": [
												{
													"text": "Catering facilities; restaurant businesses with seating in excess\nof 99 persons."
												}
											]
										},
										{
											"number": "(8) ",
											"content": [
												{
													"text": "Schools: private, public, parochial, business and professional."
												}
											]
										},
										{
											"number": "(9) ",
											"content": [
												{
													"text": "Minor garages and motor vehicle salesrooms as permanent buildings,\nand used car lots, together with automobile service facilities other\nthan body shops accessory to same, when permitted as a special exception\nby the Zoning Board of Appeals."
												}
											]
										},
										{
											"number": "(10) ",
											"content": [
												{
													"text": "Health facilities:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "Health-related facilities, including diagnostic or treatment\ncenters."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "Outpatient care facilities."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "Clinics."
																}
															]
														},
														{
															"number": "(d) ",
															"content": [
																{
																	"text": "After-care treatment facilities."
																}
															]
														},
														{
															"number": "(e) ",
															"content": [
																{
																	"text": "Psychiatric and public health centers."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(11) ",
											"content": [
												{
													"text": "Formula and/or franchise food establishments."
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "Legislative intent and findings. It is hereby found and established\nthat the Village of Mastic Beach has a strong interest in creating\nand maintaining a desirable living, working and business environment\nfor all visitors and residents of the Village. It is further found\nthat the addition of formula and/or franchise food establishments,\nif not monitored and regulated, will frustrate the Village's\ngoal of achieving a unique and diverse retail business and food establishment\nbase, comprised of a mix of businesses, both local and national in\nnature, and that the unregulated establishment of formula or franchise\nfood establishments will unduly limit or eliminate business establishment\nopportunities for local and small- or medium-sized businesses. In\nlight of the foregoing considerations, the Village has determined\nthat the welfare of the Village's residential, business and tourist\ncommunity will be best served and advanced by monitoring and regulating\nthe establishment of formula and/or franchise food establishments\nthrough the mechanism of special use permits."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "Prohibition. Formula or franchise food establishments, as defined in Article II, § 530-2-2, of this chapter, are prohibited in the B-2 Business District, except by special use permit of the Board of Trustees."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(12) ",
											"content": [
												{
													"text": "Other uses which, in the opinion of the Zoning Board of Appeals, meet the standards set forth in Subsection A of this chapter[1] and are of the same general characterization as those\nlisted as permitted uses in this district."
												},
												{
													"footnote": "[1]\nEditor's Note: So in original.\n"
												}
											]
										},
										{
											"number": "(13) ",
											"content": [
												{
													"text": "Outdoor storage when approved by the Zoning Board of Appeals\nand when kept behind a six-foot-high opaque fence with an eight-foot-wide\nlandscaped buffer zone."
												}
											]
										},
										{
											"number": "(14) ",
											"content": [
												{
													"text": "Grocery stores, or any other retail store that sells prepared\nor packaged food products, when authorized by special permit from\nthe Zoning Board of Appeals and licensed by the Suffolk County Department\nof Health Services."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Height. In the B-2 Business District, the height restrictions shall\nbe the same as in the B-1 Business District."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Lot area. In the B-2 Business District, no building shall be erected\nor altered on a lot having an area less than 20,000 square feet and\nupon a lot having a frontage of less than 100 feet."
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "Front yard. In the B-2 Business District, the required front yard\ndepth shall be not less than 25 feet. If 40% or more of the distance\nof the street frontage on the same side of the street between the\ntwo nearest intersecting streets shall have been improved with two\nor more buildings, or in the event that building permits shall have\nbeen issued therefor, not less than the average front yard depth as\nso established by such existing or permitted buildings shall be maintained;\nprovided, however, that any such front yard depth shall not be required\nto be more than 40 feet."
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "Double-front or corner lots. In the B-2 Business District, the required\nfront yard shall be provided for on both streets."
								}
							]
						},
						{
							"number": "F. ",
							"content": [
								{
									"text": "Rear yard. In the B-2 Business District, there shall be a rear yard\nhaving a minimum depth of 30 feet."
								}
							]
						},
						{
							"number": "G. ",
							"content": [
								{
									"text": "Building area. In the B-2 Business District, the total building area\nshall not exceed 35% of the total required lot area."
								}
							]
						},
						{
							"number": "H. ",
							"content": [
								{
									"text": "Accessory buildings. In the B-2 Business District, the restrictions\non accessory buildings shall be the same as in the B-1 Business District."
								}
							]
						},
						{
							"number": "I. ",
							"content": [
								{
									"text": "Accessory outside storage facilities: outdoor storage of motor vehicles,\ntrailers, motor homes stored in a fenced yard with an eight-foot-wide\nlandscaped buffer between the fence and the property lines after approval\nby the Zoning Board of Appeals."
								}
							]
						},
						{
							"number": "J. ",
							"content": [
								{
									"text": "Parking. In the B-2 Business District, off-street parking shall be required to obtain a building permit provided pursuant to the provisions of Article IX, § 530-9-1, inclusive of this chapter, except that the parking provided shall not be located in the front yard of the premises for which it is provided. This regulation limiting the required off-street parking to the rear yard may be varied by the Planning Board after application to it and a public hearing. The Planning Board, in granting a variance to the provisions of this subdivision, shall determine whether the proposed variance will be in harmony with the existing traffic and parking conditions and will adversely affect the safety, welfare and convenience of the public and whether there are practical difficulties in the way of strictly carrying out this regulation."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 530-3-1.7",
			"title": "X Business District.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Uses. In the X Business District, no building or premises shall be\nused, and no building shall be hereafter erected or altered, except\nfor use as an adult establishment or tattoo establishment. Adult and\ntattoo establishments shall not be permitted in any other use district\nof the Village of Mastic Beach. The X Business District is a floating\nzone subject to approval by the Board of Trustees in each case and\nin accordance with an approved preliminary development concept plan,\nas described and defined herein."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Restrictions and requirements. In the X Business District, the restrictions\nand requirements as to height, lot area, double-front lot, building\narea and accessory buildings shall be the same as in the B-2 Business\nDistrict."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Front yard. In the X Business District, the required front yard depth\nshall be not less than 25 feet."
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "Rear yard. In the X Business District, there shall be a rear yard\nhaving a minimum depth of 25 feet."
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "An X Business District may only be established within the boundaries\nof the B-2 Business District and must be 800 feet or more from any\nlot line of property on which any of the following zones or uses has\nbeen established by permit or otherwise recognized as a legally established\nzone or use: community center; child-care center; school, elementary\nor secondary; public park; one-family dwelling; churches, places of\nworship, parish houses, convents, and accessory building of a religious\nnature; R-1 Residence District; R-2 Residence District; and the R/B\nDistrict."
								}
							]
						},
						{
							"number": "F. ",
							"content": [
								{
									"text": "Site improvements. In addition to the requirements for site plan\napproval by the Planning Board as set forth in this chapter, the following\nsite improvements shall be set forth on a site plan submitted to and\napproved by the Board of Trustees, and such site improvements shall\nat all times be maintained:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "A brick, stone or architectural stone wall or split-cedar stockade-type\nfence six feet in height shall be required along each property line,\ntogether with such screening as may be deemed necessary by the Planning\nBoard or the Board of Trustees."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "All exterior lighting shall be shielded so that the source of\nlight is not visible from any point off the property."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "The plot shall be provided with curbs, and there shall be no\nmore than one curb cut on any road frontage."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "Planting strips containing evergreen shrubs or hedges shall\nbe installed on each lot line."
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "No flashing, intermittent or revolving signs or flags, pennants\nand banners shall be permitted, and no sign shall be erected without\nprior approval of the dimensions and lettering of said sign by the\nBoard of Trustees. No signs shall contain any material other than\nblock lettering, which shall have been so approved."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "G. ",
							"content": [
								{
									"text": "Application procedure. The procedure for zone change and development\napproval of any proposed X Business District (or the extension or\nexpansion of an existing X Business District) shall involve a two-stage\nreview process, as follows:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Approval of a preliminary development concept plan and the reclassification\nof a specific parcel or parcels of land for development in accordance\nwith that plan by the Board of Trustees after holding a public hearing\non the application pursuant to the same notice and procedural requirements\nthat are generally prescribed by law for Village zoning amendments;\nand"
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Approval of a final detailed site development plan, and a subdivision\nplat, if applicable, by the Board of Trustees."
												}
											]
										}
									]
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 530-3-1.8",
			"title": "I Industrial District.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Uses. In the I Industrial District, no building or premises shall\nbe used and no building shall be hereafter erected or altered, unless\notherwise provided in this chapter, except for one or more of the\nfollowing uses:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Automobile repair shop and automobile service stations, as shall\nbe restricted as follows:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "No major repair work shall be permitted in the open."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "Pumps, lubricating and other devices shall be located at least\n25 feet from the line of any street or highway right-of-way."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "All fuel, oil or similar substances shall be stored at least\n35 feet distant from any street or lot line."
																}
															]
														},
														{
															"number": "(d) ",
															"content": [
																{
																	"text": "No motor vehicles, automobile parts, dismantled vehicles and\nsimilar articles shall be stored in the open."
																}
															]
														},
														{
															"number": "(e) ",
															"content": [
																{
																	"text": "Where abutting property is zoned or used for residential purposes,\na brick, stone or architectural stone wall or split-cedar stockade-type\nfence six feet in height shall be required along such property line,\ntogether with such other screening as may be deemed necessary by the\nPlanning Board."
																}
															]
														},
														{
															"number": "(f) ",
															"content": [
																{
																	"text": "Overnight outdoor parking of any vehicle shall only be permitted\nwithin a fenced and landscaped area not within the front yard."
																}
															]
														},
														{
															"number": "(g) ",
															"content": [
																{
																	"text": "No debris, junk, empty cans or garbage shall be permitted to\nremain outdoors."
																}
															]
														},
														{
															"number": "(h) ",
															"content": [
																{
																	"text": "Gasoline, diesel fuel and/or other motor fuel may be dispensed\non a self-service basis on the condition that at least one full-service\nisland be opened and staffed during the hours of operation. Fuel from\nsaid full-service island during the hours of operation shall be dispensed\nonly by an employee of the public garage or filling station. Automatic\nfire-suppression systems approved by the Fire Inspector shall be provided\nand maintained in working order over any self-service island containing\none or more such self-service pumps, and all other applicable local,\ncounty and state laws, rules and regulations shall be adhered to.\nThese provisions shall apply not only to public garages and filling\nstations in I Industrial Districts but to all public garages and filling\nstations which may exist by nonconforming use."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Motor vehicle washing businesses or structures, except those\nthat are incidental or accessory to a public garage or filling station."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "The sale, distribution or dispensing of any goods, wares, merchandise\nor services to persons while said persons are in automobiles or other\nmotor vehicles."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "Mini storage facility."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Height. In the I Industrial District, no building or structure hereafter\nerected or altered shall exceed 2 1/2 stories or 35 feet."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Lot area. In the I Industrial District, no building or structure\nshall be erected or altered on a lot having an area less than 20,000\nsquare feet and upon a lot having a frontage of less than 100 feet."
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "Front yard. In the I Industrial District, the required front yard\ndepth shall be not less than 30 feet for any building or accessory\nstructure."
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "Double-front or corner lots. In the I Industrial District, the required\nfront yard shall be provided for on both streets."
								}
							]
						},
						{
							"number": "F. ",
							"content": [
								{
									"text": "Rear yard. In the I Industrial District, there shall be a rear yard\nhaving a minimum depth of 30 feet."
								}
							]
						},
						{
							"number": "G. ",
							"content": [
								{
									"text": "Side yard. In the I Industrial District, there shall be a side yard\nhaving a minimum depth of 25 feet."
								}
							]
						},
						{
							"number": "H. ",
							"content": [
								{
									"text": "Building area. In the I Industrial District, the total building area\nshall not exceed 35% of the total required lot area."
								}
							]
						},
						{
							"number": "I. ",
							"content": [
								{
									"text": "Accessory buildings. In the I Industrial District, the restrictions\non accessory buildings shall be the same as in the B-1 Business District."
								}
							]
						},
						{
							"number": "J. ",
							"content": [
								{
									"text": "Parking. In the I Industrial District, off-street parking shall be required to obtain a building permit provided pursuant to the provisions of Article IX, § 530-9-1, inclusive of this chapter, except that the parking provided shall not be located in the front yard of the premises for which it is provided. This regulation limiting the required off-street parking to the rear yard may be varied by the Planning Board after application to it and a public hearing. The Planning Board, in granting a variance to the provisions of this subsection, shall determine whether the proposed variance will be in harmony with the existing traffic and parking conditions and will adversely affect the safety, welfare and convenience of the public and whether there are practical difficulties in the way of strictly carrying out this regulation."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 530-3-1.9",
			"title": "WD Waterfront District.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Uses. It is intended, in the creation of this zoning district, that\nlands which have a direct relationship to or impact upon the waterfront\nareas within the Village of Mastic Beach shall be developed to enhance\nthe waterfront's recreational, historic, scenic, cultural, residential\nand commercial values and to preserve and enhance these values for\nthe future. It is further intended that development in this district\nencourage design features and views that best capture the relationship\nbetween waterfront and inland that create opportunities for pedestrian\naccess to and along the waterfront. It is further intended that water-dependent\nactivities (such as marinas or bait and tackle shops) and water-enhanced\nactivities are not preempted by non-water-related activities. Therefore,\nin the WD Waterfront District, no building or premises shall be used,\nand no building shall be hereafter erected or altered, except for\none or more of the following permitted uses:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Restaurants other than drive-through restaurants when located\nwithin 100 feet of the waterfront."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Bed-and-breakfast establishments when located within 250 feet\nof the waterfront."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Marinas, commercial boathouses, boat basins and boat repair yards that are incidental to other permitted uses set forth under this Subsection A."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "Facilities for sightseeing, excursion, party and fishing boats."
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "Membership boating and yacht clubs."
												}
											]
										},
										{
											"number": "(6) ",
											"content": [
												{
													"text": "Shops, stores and other facilities for the sale of goods and\nservices at wholesale and/or retail, when located within 250 feet\nof the waterfront and when allowed as a special exception by the Planning\nBoard. The goods or services must be related to or enhanced by the\nwaterfront location. Such activities include, but are not limited\nto, the sale of fish and fish products, the sale of marine and boating\nproducts and tourist-related shops and activities."
												}
											]
										},
										{
											"number": "(7) ",
											"content": [
												{
													"text": "Other customary accessory uses and buildings, provided that\nsuch uses are incidental to the principal use, and including but not\nlimited to the following:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "Swimming pools, tennis courts and similar recreational facilities."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "Outdoor storage of boats."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "Fully enclosed and screened storage areas."
																}
															]
														},
														{
															"number": "(d) ",
															"content": [
																{
																	"text": "Boat storage in boat racks with a maximum structure height of\n20 feet, measured from grade, consisting of no more than two tiers,\nwhen approved by the Planning Board."
																}
															]
														}
													]
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Lot regulations."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Height. No such building or structure hereafter erected or altered shall exceed 35 feet or two stories, except where such building or structure lies within a Flood Damage Prevention Zone as defined in Chapter 230 of the Village Code, in which case the maximum height shall not exceed 40 feet."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Lot area. No building shall be erected or altered on a lot having\nan area less than 10,000 square feet and a width of less than 80 feet\nat the street line and at the building line."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Front yard. No such building hereafter erected or altered shall\nhave a depth of front yard less than 30 feet."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "Corner lots. Each such lot shall have a front yard along each street as is provided in Subsection B(3) and one rear yard as is provided in Subsection B(7)."
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "Double-front lots. The required front yard shall be provided\non both streets."
												}
											]
										},
										{
											"number": "(6) ",
											"content": [
												{
													"text": "Side yards. There shall be two side yards, one on each side\nof the building. The total of the widths of both side yards shall\nbe not less than 20 feet, and neither side yard shall be less than\n10 feet."
												}
											]
										},
										{
											"number": "(7) ",
											"content": [
												{
													"text": "Rear yard. There shall be a rear yard having a minimum depth\nof 25 feet."
												}
											]
										},
										{
											"number": "(8) ",
											"content": [
												{
													"text": "Building area. The total building area shall not exceed 40%\nof the required lot area."
												}
											]
										},
										{
											"number": "(9) ",
											"content": [
												{
													"text": "Parking. In WD Waterfront District, off-street parking shall be required to obtain a building permit provided pursuant to the provisions of Article IX, § 530-9-1, inclusive of this chapter, except that the parking provided shall not be located in the front yard of the premises for which it is provided. This regulation limiting the required off-street parking to the rear yard may be varied by the Planning Board after application to it and a public hearing. The Planning Board, in granting a variance to the provisions of this subdivision, shall determine whether the proposed variance will be in harmony with the existing traffic and parking conditions and will adversely affect the safety, welfare and convenience of the public and whether there are practical difficulties in the way of strictly carrying out this regulation."
												}
											]
										}
									]
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 530-3-2",
			"title": "Boundaries established.",
			"content": [
				{
					"text": "The boundaries of said districts are hereby established as shown\nupon the Building Zone Map of the Village of Mastic Beach, Suffolk\nCounty, New York, which map is hereby made a part of this chapter,\nand all notations, references and other things shown thereon shall\nbe as much a part of this chapter as if fully described herein.[1]"
				},
				{
					"footnote": "[1]\nEditor's Note: The Official Zoning Map is on file in\nthe office of the Village Clerk. A copy of the Zoning Map is included\nas an attachment to this chapter.\n"
				}
			]
		},
		{
			"paragraph": "§ 530-3-3",
			"title": "Compliance with district regulations required.",
			"content": [
				{
					"text": "No building shall be erected, altered or used and no premises\nshall be used for any other purpose than as may be permitted in the\ndistrict in which such building or premises is or shall be located."
				}
			]
		},
		{
			"paragraph": "§ 530-3-4",
			"title": "Boundary indications on map.",
			"content": [
				{
					"text": "The boundaries between districts are either the center line\nof streets or of railroad rights-of-way or such lines extended or\nlines parallel thereto, unless otherwise indicated upon the Building\nZone Map. Where figures are shown on the Building Zone Map between\na street and a district boundary line, such figures indicate that\nthe district boundary line runs parallel to the street line at the\ndistance so indicated by such figures. When the location of a district\nboundary line is not otherwise determined, it shall be determined\nby the scale of the map. Whenever the lines of any existing or mapped\nstreet vary from the same street lines as shown on the Building Zone\nMap, the district designation shown on the Building Zone Map shall\ngovern and control."
				}
			]
		},
		{
			"paragraph": "§ 530-3-5",
			"title": "Division of lot by district boundary line.",
			"content": [
				{
					"text": "Where a district boundary line divides a lot which was held\nin single and separate ownership at the date of the adoption of this\nchapter, the Zoning Board of Appeals, as hereinafter provided, may\npermit the less restricted use to extend to the whole or any part\nof such lot for a distance not exceeding 50 feet."
				}
			]
		},
		{
			"paragraph": "§ 530-3-6",
			"title": "Tidal lands.",
			"content": [
				{
					"text": "When the tidal lands are not shown as zoned on the Zoning Map,\nthey shall be considered to lie within the R-2 Residence Zone."
				}
			]
		}
	]
}