{
	"url": "http://ecode360.com/8700216",
	"paras": [
		{
			"paragraph": "§ 330-6",
			"title": "General regulations.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Within any residence district, a building, structure, lot or land shall be used only for one of the uses indicated in § 330-10, Residence Districts Table of Use Regulations,[1] for the specific district in which it is located on the\nZoning Map[2] and in accordance with the particular classification of that use in that district. In the case of a lot or land being utilized for the construction or erection of a single-family detached dwelling, the definition of \"lot\" in § 330-5 shall apply. Further, any such building, structure, lot or land shall only be utilized in conformance with the provisions of § 330-11, Residence Districts Table of Dimensional Regulations.[3] In addition, such uses shall also comply with all other\napplicable provisions of this chapter."
								},
								{
									"footnote": "[1]\nEditor's Note: The Residence Districts Table of Use Regulations is included at the end of this chapter.\n[2]\nEditor's Note: The Zoning Map is on file in\nthe office of the Town Clerk.\n[3]\nEditor's Note: The Residence Districts Table of Dimensional Regulations is included at the end of this chapter.\n"
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Multiple dwellings in MF-44, SC-44 and MFPRD Zones.[Amended 6-13-1989 by L.L. No. 13-1989]"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "No more than eight dwelling units shall be permitted in any building which is a multiple dwelling constructed after the effective date of this subsection. This restriction shall not apply to a building or group of buildings converted to a residential condominium or residential cooperative in compliance with other provisions of this chapter. No more than 12 dwelling units shall be permitted in any building erected or converted under the provisions of § 330-8 for senior citizens as herein defined."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "No dwelling unit in a multiple dwelling shall be located\nbelow the first story or above the second story."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Any building that contains four, five, or six dwelling\nunits shall be equipped with an automatic fire sprinkler system in\naccordance with National Fire Protection Association (NFPA) 13D Standards.[Added 9-11-2007 by L.L. No. 45-2007]"
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "Any building that contains seven or more dwelling\nunits shall be equipped with an automatic fire sprinkler system in\naccordance with National Fire Protection Association (NFPA) 13R Standards.[Added 9-11-2007 by L.L. No. 45-2007]"
												}
											]
										}
									]
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 330-7",
			"title": "Transfer of permitted residential development rights.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "These provisions are enacted to implement the Comprehensive\nPlan of the Town of Southampton and the Central Pine Barrens Comprehensive\nLand Use Plan adopted by the Town Board on June 27, 1995, adopted\nby the Central Pine Barrens Joint Planning and Policy Commission on\nJune 28, 1995, and signed by the Governor of the State of New York\non June 28, 1995, pursuant to the provisions of Article 57 of the\nNew York State Environmental Conservation Law, by providing the means\nof achieving elements of the community planning objectives with reference\nto natural resources, population, utilities and housing and, more\nparticularly to do so while maintaining the overall ratio established\nbetween population capacity at ultimate community development and\nthe safe yield of the fresh groundwater reservoir within the Town\nof Southampton's territorial limits. Further, land from which the\ndevelopment rights are to be transferred must have such characteristics\nthat their permanent open space preservation will fulfill one of the\nfollowing objectives:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Porous moraine soils, found in the CR-200, CR-120,\nCR-80, R-120 and R-80 Districts, will be retained for the purpose\nof maximizing groundwater recharge while lessening potential pollution\nof these groundwaters by individual sewage disposal systems."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Soils found in the Agricultural Overlay District and\nconforming to United States Soil Conservation Service capability Classes\nI and II will be retained for permanent agricultural use."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Wetlands, as defined in the Town Code, and their immediate\nupland environments will be retained for their ecological benefits\nand held in permanent open space use."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "Lands found in an area designated by the Comprehensive\nPlan for a greenbelt park system or for an individual park, beach\nor public recreation area, which will be retained for such open space\nuse."
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "Lands located with the core preservation area of the Central Pine Barrens Overlay District established under Article XXIV of this chapter."
												}
											]
										},
										{
											"number": "(6) ",
											"content": [
												{
													"text": "In the event that not all of the land from which the\ndevelopment rights are to be transferred is to be in a state of permanent\nopen space preservation or it does not fulfill one of the above objectives,\nthen at least 1/2 of the development rights to be transferred, or\nthe remainder, shall be for residential units for moderate-income\nfamilies."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "In pursuit of these purposes, the Town Board of the\nTown of Southampton may from time to time authorize by local law the\ntransfer of permitted residential development rights from one parcel\nof land to another parcel of land within the same school district\nwhere such authorization shall be found to be beneficial to the Town\nthrough serving to implement the Comprehensive Plan and to be in accordance\nwith the provisions of this section."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Procedure."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "An applicant for the transfer of permitted residential\ndevelopment rights shall present documentation satisfactory to the\nTown Board, indicating:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "The location, land area and related residential\ndevelopment rights permitted under the applicable provisions of this\nchapter which the applicant proposes to transfer."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "The location and land area of the site to which\nsuch rights are to be transferred, the projected total number of dwelling\nunits that would result on the site from such a transfer and a statement\nof the character of the projected housing development."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "A presentation as to the reasonable and beneficial\nresults anticipated from the authorization applied for with respect\nto the implementation of the Comprehensive Plan."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "If the Town Board decides to consider the applicant's proposal, it shall proceed in the same manner as provided in § 330-185 for amending this chapter, except that the fee for such application shall be $250."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "The Planning Board report to the Town Board shall\nconsider all aspects of the proposal, particularly that of the degree\nto which the proposal implements the Comprehensive Plan."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "Upon favorable review by the Town Board, such an application\nshall be approved subject to completion of the following actions:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "Approval by the Planning Board of a detailed\nsite development plan for the property to which the development rights\nare to be transferred and a recommendation with regard to the disposition\nof the property from whence the development rights were transferred."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "Execution of an instrument legally sufficient\nboth in form and content to effect such transfer and the transmittal\nof the fee title for the property from which the development rights\nare to be transferred to the Town of Southampton or such other governmental\nagency as the Town shall designate for use as permanent open space.\nWhere development rights remain, said instrument shall specify that\nno additional development rights shall accrue to said property upon\nthe transfer."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "Filing copies of the executed legal instrument\nin the office of the Town Clerk, the Planning Board, the Building\nInspector and with the County Clerk as a notice of such transfer incorporated\nin the deeds of each property affected by the transfer. Such instrument\nshall specifically set forth the rights transferred and the resultant\ntotal residential development rights in each property."
																}
															]
														},
														{
															"number": "(d) ",
															"content": [
																{
																	"text": "Such other requirements as the Town Board shall\nestablish."
																}
															]
														}
													]
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "General standards."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Districts in which an increase in the number of dwelling units may be permitted shall be restricted to those listed hereinafter, and for each district specified, the number of dwelling units shall not exceed the following, unless a greater density is authorized by the Town Board in connection with the establishment of a Planned Development District (PDD) under Article XXV of this chapter:"
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Where development rights are transferred to the R-20\nDistrict, the Tables of Use and Dimensional Regulations for the MF-44\nDistrict[1] shall apply, unless different dimensional requirements are authorized by the Town Board in connection with the establishment of a Planned Development District (PDD) under Article XXV of this chapter."
												},
												{
													"footnote": "[1]\nEditor's Note: Said tables are included at\nthe end of this chapter.\n"
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Development rights may be transferred within the CR-200 Zone and may be transferred out of said zone; however, nothing contained herein shall be deemed to permit transfer of development rights into the CR-200 District from any other residential zones, unless authorized by the Town Board in connection with the establishment of a Planned Development District (PDD) under Article XXV of this chapter. The resultant density on the parcel within the CR-200 Zone to which rights are transferred shall not exceed the number of dwellings which would be permitted by the standard dimensional requirements in the CR-120 Zone, unless a greater density is authorized by the Town Board in connection with the establishment of a Planned Development District (PDD) under Article XXV of this chapter."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "Development rights may be transferred within the Central Pine Barrens Overlay District, the Aquifer Protection Overlay District, the Agricultural Overlay District and the Tidal Wetlands and Ocean Beach Overlay District and may be transferred out of said districts, the above being subject to the restrictions applicable to the respective zoning district as set forth in this article. However, nothing contained herein shall be deemed to permit the transfer of development rights into any of the aforementioned overlay districts, unless authorized by the Town Board in connection with the establishment of a Planned Development District (PDD) under Article XXV of this chapter."
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "The site to which the transfer of development rights\nis proposed shall be no less than five acres in the R-120, R-80, R-60,\nR-40, R-20, CR-200, CR-120, CR-80, CR-60 and CR-40 Districts."
												}
											]
										},
										{
											"number": "(6) ",
											"content": [
												{
													"text": "All yard requirements of the more restrictive district found along the perimeter of the site shall apply to perimeter yards on the site to which the transfer of development rights is proposed, unless different dimensional requirements are authorized by the Town Board in connection with the establishment of a Planned Development District (PDD) under Article XXV of this chapter."
												}
											]
										},
										{
											"number": "(7) ",
											"content": [
												{
													"text": "Nothing in this article shall abrogate the requirements\nof other codes and regulations, including the Town of Southampton\nSubdivision Regulations, when they are applicable.[2]"
												},
												{
													"footnote": "[2]\nEditor's Note: See Ch. 292, Subdivision of Land.\n"
												}
											]
										}
									]
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 330-8",
			"title": "Increased residential density to establish low- and lower-middle-income housing inventory.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Since there is a limited supply of standard housing\navailable at purchase prices or rentals commensurate with the incomes\nof low- or lower-middle-income residents in the Southampton community,\nthese provisions are enacted to implement the Town of Southampton\nMaster Plan of 1970 community planning objectives with reference to\nencouraging a wide variety of housing types and, more particularly,\nto help make possible purchase and rental costs in keeping with the\nfinancial means of the Town's residents who have low or lower-middle\nincomes."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "In pursuit of this purpose, the Town Board of the\nTown of Southampton may from time to time authorize by local law an\nincrease in residential development density where it shall be found\nthat a bona fide nonprofit corporation guarantees to develop and maintain\nthe resultant housing at a purchase price or rental cost within the\nlow- or lower-middle-income housing market in accordance with a contractual\nagreement between said nonprofit corporation and the Town and further,\nthat such authorization shall be found to be beneficial to the Town\nthrough serving to implement the Master Plan of 1970."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Procedure."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "An applicant for increased residential development\ndensity under this section shall present documentation satisfactory\nto the Town Board, indicating:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "The location, land area, proposed residential\ndensity and general development concept and physical characteristics\nof the development."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "The organizational characteristics, legal basis\nand financial status of the nonprofit corporation sponsoring the proposed\nhousing."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "The projected development costs, the resultant\ncapital and operating costs, the detailed elements of the purchase\nprice or rental costs to be charged and the proposed income limitations\nto be placed on owners or tenants."
																}
															]
														},
														{
															"number": "(d) ",
															"content": [
																{
																	"text": "The details of any program whereby such owners\nor tenants may acquire equity in housing without changing the future\nmarket value of the proposed housing units and any proposals to overcome\neconomic hardship for those eventually moving out of the proposed\nnonprofit housing."
																}
															]
														},
														{
															"number": "(e) ",
															"content": [
																{
																	"text": "The instrument or instruments by which the objectives\nof this program are to be guided and enforced legally."
																}
															]
														},
														{
															"number": "(f) ",
															"content": [
																{
																	"text": "A presentation as to the reasonable and beneficial\nresults anticipated from the authorization applied for with respect\nto the implementation of the Master Plan of 1970."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "If the Town Board decides to consider the applicant's proposal, it shall proceed in the same manner as provided in §330-185 for amending this chapter. A fee schedule shall be established, as needed, by resolution of the Southampton Town Board. A copy of the fee schedule is on file with the Town Clerk’s office and the Department of Land Management.[Amended 11-10-2009 by L.L. No. 46-2009]"
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "The Planning Board report to the Town Board shall\nconsider all aspects of the proposal, particularly that of the degree\nto which the proposal implements the Master Plan of 1970."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "Upon favorable review by the Town Board, such an application\nshall be approved subject to completion of the following actions:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "Approval by the Planning Board of a detailed\nsite development plan for the property."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "Execution of an instrument legally sufficient\nboth in form and content to effect the purposes of these provisions."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "Filing copies of the executed legal instrument\nin the office of the Municipal Clerk, the Planning Board, the Building\nInspector and with the County Clerk as a notice of such instrument\nincorporated in the deeds of each property affected by the instrument.\nSuch instrument shall be specific as to the right of the Town of Southampton\nto enforce its provisions with reference to owner or tenant incomes\nand the nonprofit character of the project."
																}
															]
														},
														{
															"number": "(d) ",
															"content": [
																{
																	"text": "Such other requirements as the Town Board shall\nestablish."
																}
															]
														}
													]
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "General standards."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "The resultant number of dwelling units per gross acre\nof land on the development site shall not exceed 12 units. In all\nother respects, the provisions of the Tables of Use and Dimensional\nRegulations for the MF-44 District shall apply.[1]"
												},
												{
													"footnote": "[1]\nEditor's Note: See the Residence Districts Table of Use Regulations and the Residence Districts Table of Dimensional Regulations included at the end of this chapter.\n"
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Nothing contained in this article shall abrogate the\nrequirements of other codes and regulations, including the Town of\nSouthampton subdivision regulations,[2] where they are applicable. However, nothing in this article\nshall preclude the use of prefabricated housing units where the construction\nquality of such units is officially approved under the New York State\nBuilding Code."
												},
												{
													"footnote": "[2]\nEditor's Note: See Ch. 292, Subdivision of Land.\n"
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "The site plan review fee provided in § 330-183B shall be waived where the applicant is a bona fide nonprofit corporation which provides the guaranty described in § 330-8B.[Added 10-10-1989 by L.L. No. 21-1989]"
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "The building permit fees provided in § 123-12 of the Building Construction Code of the Town of Southampton shall be waived where the applicant is a bona fide nonprofit corporation which provides the guaranty described in § 330-8B.[Added 6-9-1998 by L.L. No. 14-1998]"
												}
											]
										}
									]
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 330-9",
			"title": "Density incentive provisions.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Purpose. In accordance with the provisions of Town Law §§ 261-a and 261-b, this section authorizes the Planning Board or, in the instance of carriage houses, the Chief Building Inspector, upon consultation with the Town's Planning and Development Administrator, to increase density on certain parcels as receiving sites for development rights or Pine Barrens Credits (PBC) pursuant to Articles X and XXIV of this chapter or to increase residential density if the project proposes the construction of community benefit units as that term is defined in Chapter 216 of this Code. In connection with the transfer of development rights or PBCs, the Planning Board and, where appropriate, the Chief Building Inspector are further authorized to consider and modify the dimensional regulations of this Code without the necessity of Town Board review and approval."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Zoning district eligibility. The following residential\nand nonresidential zoning districts are eligible to utilize the density\nincentive provisions of this section if they comply with the minimum\nacreage requirements as set forth herein:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Residential districts."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Nonresidential districts.[Amended 5-24-2016 by L.L. No. 9-2016]"
												},
												{
													"text": "(HB) Highway Business"
												},
												{
													"text": "(OD) Office District"
												},
												{
													"text": "(VB) Village Business"
												},
												{
													"text": "(SCB) Shopping Center Business"
												},
												{
													"text": "(LI-40, LI-200) Light Industrial"
												},
												{
													"text": "(HO) Hamlet Office/Residential"
												},
												{
													"text": "(HC) Hamlet Commercial/ Residential"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "In the case of\na transfer of development rights or PBCs, wherein the Planning Board\nmay increase lot yield, lot coverage, floor area, height or building\nmass, said Board is authorized to do so in nonresidential districts\npursuant to the following criteria:"
																},
																{
																	"content": [
																		{
																			"number": "(i) ",
																			"content": [
																				{
																					"text": "At least one development right or PBC is transferred\nto the site;"
																				},
																				{
																					"text": ""
																				}
																			]
																		},
																		{
																			"number": "(ii) ",
																			"content": [
																				{
																					"text": "The lot to receive the density incentive has a minimum lot area of\none acre;"
																				}
																			]
																		},
																		{
																			"number": "(iii) ",
																			"content": [
																				{
																					"text": "The total yield shall be the sum of the yield for the receiving parcel plus the equivalent value of the transfer of development rights or PBCs as set forth in Chapter 244;"
																				}
																			]
																		},
																		{
																			"number": "(iv) ",
																			"content": [
																				{
																					"text": "Each development right or PBC shall be equivalent to a sewage water\nflow rate of 300 gallons per acre per day as described in the Suffolk\nCounty Department of Health Services standards and/or up to a two-percent\nincrease in building coverage, floor area, height or building mass.\nA total increase in building coverage, floor area or height exceeding\n10% of the maximum for the zone shall not be permitted;"
																				}
																			]
																		},
																		{
																			"number": "(v) ",
																			"content": [
																				{
																					"text": "The site requirements for water supply and sewage disposal shall\nbe approved by the Suffolk County Department of Health Services; and"
																				}
																			]
																		},
																		{
																			"number": "(vi) ",
																			"content": [
																				{
																					"text": "A written application shall be submitted to the Planning Board in compliance with the site plan and hearing requirements as stated in §§ 330-182 through 330-184."
																				}
																			]
																		}
																	]
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Density incentives shall not be authorized on lands\nwithin the Core Preservation Area of the Central Pine Barrens Overlay\nDistrict or the Tidal Wetlands and Ocean Beach Overlay District.[Amended 12-11-2012 by L.L. No. 16-2012]"
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "General standards. All density incentives shall meet\nand be subject to the following general standards."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "In the case of transferring either development rights or pine barrens credits to the site, each development right or PBC so transferred shall authorize the Planning Board or the Chief Building Inspector under Subsection D(4) to increase the allowable density by one lot or unit, provided the development right or PBC originated in the Town of Southampton and the same school district, with the following exceptions:"
												},
												{
													"content": [
														{
															"number": "a. ",
															"content": [
																{
																	"text": "The\ntransfer is to a commercial property for purposes of providing additional\nsewage credits; or"
																}
															]
														},
														{
															"number": "b. ",
															"content": [
																{
																	"text": "The\ntransfer is out of the Town of Southampton to a site in another town."
																}
															]
														}
													]
												},
												{
													"text": "The Planning Board or Chief Building Inspector\nunder Subsection (D)4 is authorized to transfer development rights\nor PBCs from one side of the Shinnecock Canal to the other within\nthe same school district."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "In consideration of subdivisions, the Planning Board\nmay authorize a maximum density increase of 30% where development\nrights or PBCs are used. Notwithstanding, where the permitted yield\nis three lots or less, the Planning Board may authorize one additional\nbuilding lot, provided that a full development right or PBC is transferred\nto the site. Each additional development right or PBC transferred\nto the site shall allow one additional lot or dwelling unit. In addition,\nthe Planning Board may authorize a maximum density increase of up\nto 50% of the as-of-right yield for community benefit units."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Density incentives may be authorized where the Planning Board or the Chief Building Inspector under Subsection D(4) determines, after consultation with the Town's Planning and Development Administrator, that the development will be beneficial, compatible and harmonious with the surrounding land uses and will not adversely affect the environment or any special assessment district in which the subject parcel is located, and density incentives shall be consistent with the recommendations of the Town of Southampton Comprehensive Plan."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "The Planning Board and the Chief Building Inspector under Subsection D(4), of this section, may modify the dimensional regulations of the zoning district to permit increased density in accordance with the specific standards listed hereunder. Nothing herein shall be construed to limit the existing authority of the Planning Board or the Chief Building Inspector under Subsection D(4) of this section to control the design of subdivisions or site plans."
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "The Planning Board and the Chief Building Inspector under Subsection D(4) shall each have the authority to require the applicant or owner to submit the documentation required under this chapter, Chapter 244 or elsewhere to foster the transfer or redemption of development rights or PBCs."
												}
											]
										},
										{
											"number": "(6) ",
											"content": [
												{
													"text": "The Planning Board or the Chief Building Inspector under Subsection D(4), upon consultation with the Town's Planning and Development Administrator, may require the applicant or owner to execute such agreements and covenants as may be necessary to implement the purposes of this chapter or other applicable law. Said agreements or covenants shall be recorded in the Office of the Suffolk County Clerk and shall constitute a covenant running with the land. Such covenant or agreement may be modified or released only as set forth in said covenant or agreement or by a simple majority vote of the Town Board."
												}
											]
										},
										{
											"number": "(7) ",
											"content": [
												{
													"text": "Any proposals seeking to utilize the density incentives\nset forth herein shall be in writing and accompany the subdivision\nor site plan application to the Planning Board or, in the instance\nof a carriage house, shall be to the Chief Building Inspector and\naccompany the building permit application."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "Specific standards."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Increased subdivision yield utilizing the affordable housing incentive. In addition to meeting the general standards as listed in § 330-9C above, where the density incentive is sought in connection with the project's proposal to build affordable housing, at least 40% of the additional dwelling units shall be community benefit units, as defined by Chapter 216. In its determination of such an application, the Planning Board shall consider the following in consultation with the Department of Land Management:[Amended 8-12-2008 by L.L. No. 47-2008]"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "The need for affordable housing in the particular\nhamlet;"
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "Whether the applicant\nhas demonstrated:"
																},
																{
																	"content": [
																		{
																			"number": "i. ",
																			"content": [
																				{
																					"text": "The appropriateness of the proposed site;"
																				}
																			]
																		},
																		{
																			"number": "ii. ",
																			"content": [
																				{
																					"text": "The environmental suitability of the site; and"
																				}
																			]
																		},
																		{
																			"number": "iii. ",
																			"content": [
																				{
																					"text": "That the density incentive subdivision plan\nprotects community character."
																				}
																			]
																		}
																	]
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "The adequacy of applicable public resources\npursuant to Town Law."
																}
															]
														},
														{
															"number": "(d) ",
															"content": [
																{
																	"text": "Consistency with\nthe Town of Southampton's affordable housing goals as set forth in\nthe Comprehensive Plan. In conformance with the Comprehensive Plan,\nthe Planning Board shall encourage placement of affordable housing\nwhere it is most scarce. The Planning Board may only authorize a density\nincentive after it makes findings that:"
																},
																{
																	"content": [
																		{
																			"number": "i. ",
																			"content": [
																				{
																					"text": "The density incentive does not result in an\nadverse impact on the affected school district or other special assessment\ndistrict; or"
																				}
																			]
																		},
																		{
																			"number": "ii. ",
																			"content": [
																				{
																					"text": "The Planning Board authorizes, by resolution,\na waiver that states the proposed development implements or furthers\nother objectives of the Town of Southampton Comprehensive Plan, including\nupgrading existing affordable housing stock and revitalization of\nexisting dwellings in blighted areas."
																				}
																			]
																		}
																	]
																}
															]
														},
														{
															"number": "(e) ",
															"content": [
																{
																	"text": "Density incentive for affordable housing shall\nonly be authorized in those hamlets where the population density is\nequal to or less than 500 persons per square mile, exclusive of land\nowned by the state, county or Town as open space or park land. The\nDecennial Federal Census shall be the source of the population numbers."
																}
															]
														},
														{
															"number": "(f) ",
															"content": [
																{
																	"text": "Eligibility. The Planning Board shall insure affordable housing projects are subject to the eligibility, resale and sustainable affordability restrictions consistent with Chapter 216 and § 330-11.1 of this chapter, as applicable. The Planning Board may waive certain provisions of the eligibility priority for set-aside dwellings and dwelling units where federal or state subsidies are being utilized by the developer to reduce the purchase price to qualified first-time home buyers, provided it is demonstrated that said subsidy precludes the specified eligibility preference, upon the advice of the Department of Land Management."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Increased subdivision yield utilizing the transfer of development rights or pine barrens credits incentive. In addition to meeting the general standards of § 330-9C, the Planning Board may increase the density for subdivision yield using the following standards:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "A maximum increase of 30% may be authorized when development rights or PBCs are transferred to the site as authorized under Chapters 292 and 244 of the Town Code, where requirements of this section are complied with. Notwithstanding the foregoing, where the permitted yield is three lots or less, the Planning Board may authorize one additional building lot, provided that at least one development right or PBC is transferred to the site and where all other requirements of this section are complied with."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "The site on which the density incentive for\nincreased subdivision yield is to be authorized shall be no less than\n10 acres in the CR-200 Zone and no less than six acres in the CR-120,\nCR-80, CR-60, R-120, R-80 and R-60, CR-40, R-40 and R-20 Zones."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "When additional density is authorized, the dimensional requirements shall be determined by the Planning Board and indicated on the approved plan and shall not be less restrictive than those required in the R-15 Residential Zone when subdividing land in all other zones greater than R-20. However, nothing herein shall limit the provisions of Chapter 247, Open Space."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Subdivision into two undersized lots. The Planning Board may only authorize the subdivision of a single parcel of land into two nonconforming lots provided that at least one development right or PBC is transferred to the site. Further, in addition to meeting all the general standards set forth in § 330-9C above, the Planning Board must find that such density incentive meets the following standards:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "A minimum of five acres shall be required to\nseek a density incentive to establish two nonconforming lots in the\nCR-200 Zone and three acres in the CR-120 and R-120 Zones. In all\nother eligible zones, the site shall not be less than 1 1/2 times\nthe minimum lot size of the zoning district."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "The dimensional requirements shall be established by the Planning Board, delineated on the approved plan, and shall not be less restrictive than those required in the R-15 Residential Zone for subdivision of land in the R-20 Residential Zone or the R-20 Residential Zone for the subdivision of land in the R-40 or CR-40 Zones, and the R-40 Residential Zone for the subdivision of land in all other zones higher than R-40. However, nothing herein shall limit the use of Chapter 247, Open Space, on said lands, provided that all the provisions of that chapter are met."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "The Planning Board shall conduct at least one public hearing on the application, and the application shall comply with all preapplication, submission and notice requirements consistent with Chapter 292 and § 330-164I(1)."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "Carriage houses. The Chief Building Inspector may only authorize a density incentive for two dwellings on one lot (one principal and one accessory dwelling on one lot) where one or more development right or PBC is transferred to the site. The development right or PBC transfer shall not be required when one of the two dwellings is a designated Town landmark, pursuant to Town Code § 330-321, and the Town Board has determined to extinguish a Town-owned development right in favor of the application. Further, in addition to the general standards listed in § 330-9C above, the Chief Building Inspector shall determine that such development (carriage house) meets the following criteria:[Amended 6-24-2014 by L.L. No. 20-2014]"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "The minimum lot area required for the addition\nof a carriage house shall be three acres in the CR-200, CR-120 and\nR-120 Zones and not less than 1 1/2 times the minimum lot size\nof the zoning district in all other eligible zones."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "The principal dwelling shall comply with all\napplicable dimensional requirements of the code; however, the Chief\nBuilding Inspector may approve an application where a preexisting\nprincipal dwelling does not meet the applicable dimensional regulations\nwhen the proposed carriage house meets all of the principal dwelling\nsetbacks."
																},
																{
																	"content": [
																		{
																			"number": "[1] ",
																			"content": [
																				{
																					"text": "When the preexisting principal dwelling is a designated Town landmark pursuant to Town Code § 330-321 and is proposed to be converted to a carriage house in its preexisting location, said historic structure designated as a Town landmark shall not be required to meet the applicable dimensional regulations, provided the proposed new principal dwelling meets all required principal setbacks."
																				}
																			]
																		}
																	]
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "The carriage house shall have a front yard setback\nof at least 10 feet greater than the principal dwelling setback. The\ncarriage house shall have a side yard setback of not less than 30\nfeet and a rear yard setback of not less than 50 feet."
																}
															]
														},
														{
															"number": "(d) ",
															"content": [
																{
																	"text": "Lot coverage may be increased by the Chief Building\nInspector by no more than 2% However, except as explicitly authorized\nherein, the applicant must in be in conformance with all other applicable\nzoning regulations."
																}
															]
														},
														{
															"number": "(e) ",
															"content": [
																{
																	"text": "The carriage house may be one or two stories\nor added to the second floor of an accessory garage when the maximum\nheight of the building does not exceed 24 feet."
																}
															]
														},
														{
															"number": "(f) ",
															"content": [
																{
																	"text": "The total floor area of the carriage house shall\nnot exceed 50% of the floor area of the principal dwelling or a maximum\nof 3,000 square feet, exclusive of decks, stairways, patios or other\nunroofed portions of the structure."
																}
															]
														},
														{
															"number": "(g) ",
															"content": [
																{
																	"text": "The method of water supply and sewage disposal\nfor the two dwellings shall be approved by the Suffolk County Department\nof Health Services."
																}
															]
														},
														{
															"number": "(h) ",
															"content": [
																{
																	"text": "Access to the principal dwelling and carriage\nhouse shall be limited to one driveway."
																}
															]
														},
														{
															"number": "(i) ",
															"content": [
																{
																	"text": "When possible, new utility lines shall be shared;\nhowever, any new utilities to the carriage house shall be placed underground."
																}
															]
														},
														{
															"number": "(j) ",
															"content": [
																{
																	"text": "A parcel consisting of a principal structure\nand carriage house shall not be further subdivided."
																}
															]
														},
														{
															"number": "(k) ",
															"content": [
																{
																	"text": "Town Board evaluation of an application to extinguish a Town-owned development right in relation to a carriage house designated or proposed to be designated as a Town landmark pursuant to Town Code § 330-321 shall be as follows:"
																},
																{
																	"content": [
																		{
																			"number": "[1] ",
																			"content": [
																				{
																					"text": "All applications to extinguish a Town-owned development right\nin relation to a carriage house designated as a Town landmark shall\nbe available from and submitted to the Department of Land Management\nand forwarded to the Town Board for review."
																				}
																			]
																		},
																		{
																			"number": "[2] ",
																			"content": [
																				{
																					"text": "Application to extinguish a Town-owned development right may\nbe made at the same time as application for designation as a Town\nlandmark, or separately."
																				}
																			]
																		},
																		{
																			"number": "[3] ",
																			"content": [
																				{
																					"text": "The Town Board may only extinguish a Town-owned development\nright in favor of an application concerning a proposal of a carriage\nhouse to be designated as a Town landmark, or a carriage house designated\nas a Town landmark, after a public hearing in accordance with this\nsection."
																				}
																			]
																		},
																		{
																			"number": "[4] ",
																			"content": [
																				{
																					"text": "In making a determination under this section, the Town Board\nmay obtain and consider written reports from the Department of Land\nManagement and such other sources as required in the judgment of the\nTown Board and consistent with the purpose of this section."
																				}
																			]
																		},
																		{
																			"number": "[5] ",
																			"content": [
																				{
																					"text": "The Town Board may require covenants or other similar documents\nto assure that the provisions of this article are adhered to."
																				}
																			]
																		},
																		{
																			"number": "[6] ",
																			"content": [
																				{
																					"text": "Any transfer of a Town-owned development right pursuant to this section shall be subject to 6 NYCRR Part 617, provisions of the New York State Environmental Quality Review Act (SEQRA), and Chapter 157 of the Town Code (Environmental Quality Review)."
																				}
																			]
																		},
																		{
																			"number": "[7] ",
																			"content": [
																				{
																					"text": "Hearing; notice; action during process."
																				},
																				{
																					"content": [
																						{
																							"number": "[a] ",
																							"content": [
																								{
																									"text": "The Town Board shall hold such a public hearing\nwithin 60 days of receipt of a complete application."
																								}
																							]
																						},
																						{
																							"number": "[b] ",
																							"content": [
																								{
																									"text": "The Town Board shall fix a time and place for a\npublic hearing thereon and shall provide for the giving of notice\nat least 10 days prior to the date thereof in accordance with this\nsection."
																								}
																							]
																						},
																						{
																							"number": "[c] ",
																							"content": [
																								{
																									"text": "Notice shall be published in the official Town\nnewspaper at least 10 days prior to the date of the public hearing."
																								}
																							]
																						},
																						{
																							"number": "[d] ",
																							"content": [
																								{
																									"text": "The Town Board shall require the applicant to erect\na white-and-black-lettering sign or signs measuring not less than\ntwo feet long and one foot wide, which shall be prominently displayed\non the premises facing each public street on which the property abuts,\ngiving notice that an application for extinguishing a Town-owned development\nright in relation to a carriage house designated or proposed to be\ndesignated as a Town landmark is pending and the date, time and place\nwhere the public hearing will be held. The sign shall not be set back\nmore than 10 feet from the street line and shall not be less than\ntwo nor more than six feet above the grade at the street line. The\nsign shall be made of durable material and shall be furnished by the\nDepartment of Land Management. It shall be displayed for a period\nof not less than 10 days immediately preceding the public hearing\ndate. No additional posting shall be required for any adjournment\ndate. The applicant shall file an affidavit that he/she has complied\nwith the provisions of this section."
																								}
																							]
																						},
																						{
																							"number": "[e] ",
																							"content": [
																								{
																									"text": "If the land involved in an application is within\n500 feet of the boundary of any other municipality, notice of the\npublic hearing shall also be mailed to the Municipal Clerk of such\nother municipality."
																								}
																							]
																						},
																						{
																							"number": "[f] ",
																							"content": [
																								{
																									"text": "The Town Board shall require the applicant to mail\nwritten notice of the date, time and place of the hearing, together\nwith a copy of the application and survey submitted to the Town Board,\nby certified mail, return receipt requested, to every property owner,\nas shown on the current Town of Southampton assessment rolls, of parcels\nabutting and parcels directly opposite (by extension of lot lines\nthrough a street or right-of-way) of the property which is the subject\nof the application, proof of which shall be submitted to the Town\nBoard on or before the commencement of the public hearing in the form\nof an affidavit with postal receipts annexed thereto confirming mailing\nof said notices at least 10 days prior to the hearing date."
																								}
																							]
																						},
																						{
																							"number": "[g] ",
																							"content": [
																								{
																									"text": "The Town Board shall render a determination within\n45 days of the close of the public hearing and written record."
																								}
																							]
																						}
																					]
																				}
																			]
																		}
																	]
																}
															]
														}
													]
												}
											]
										}
									]
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 330-10",
			"title": "Residence Districts Table of Use Regulations.",
			"content": [
				{
					"text": "The Residence Districts Table of Use Regulations is included at the end of this chapter."
				}
			]
		},
		{
			"paragraph": "§ 330-11",
			"title": "Residence Districts Table of Dimensional Regulations.",
			"content": [
				{
					"text": "The Residence Districts Table of Dimensional Regulations is included at the end of this chapter. The following regulations apply all properties in a CR-60 district:"
				},
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Lot Area, minimum(square feet): 60,000"
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Lot Coverage, maximum main and accessory buildings(percent): 15"
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Lot Width, minimum(feet): 150"
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "Height, maximum Stories: 2, Feet: 32"
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "Yards, principal building minimum(feet) Front: 80, Side: 25, Side, total for both interior lot: 65, Side, corner lot: 80, Rear: 100"
								}
							]
						},
						{
							"number": "F. ",
							"content": [
								{
									"text": "Yards, accessory building minimum(feet) Distance from street: 90, Distance from side and rear lot lines: 30"
								}
							]
						}	
					]
				}
			]
		},
		{
			"paragraph": "§ 330-76",
			"title": "Placement of accessory buildings, structures and uses in all districts.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Accessory buildings, including garages, if detached\nfrom a main building or if connected only by an open breezeway-type\nstructure, shall be not less than five feet from the main building."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "A private garage may be constructed as a structural\npart of a main building, provided that when so constructed the garage\nwalls shall be regarded as the walls of the main building in applying\nthe front, rear and side yard regulations of this chapter."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "No accessory building, structure, or use shall be\npermitted on a lot or plot unless a main or principal building already\nexists on said lot or plot and has a valid certificate of occupancy\nor a valid building permit has been issued and is in effect for the\nconstruction or erection of a main or principal building. This restriction\nshall not apply to agricultural or farm buildings or structures.[Amended 6-8-2010 by L.L. No. 17-2010; 7-13-2010 by L.L. No.\n21-2010]"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "However,\nwhere a property owner owns two or more contiguous conforming residential\nlots in common ownership, at least one of which is improved with a\nsingle-family dwelling, an accessory building or structure may be\nconstructed on any vacant conforming contiguous lot, provided that\nthe applicant demonstrates the existence of sufficient buildable area\nto construct a principal structure on the lot upon which the accessory\nstructure is to be constructed. Should common ownership of the contiguous\nlots cease, the accessory building or structure must be removed within\nsix months or the owner of the lot without a principal structure must\nobtain a building permit for a principal building or structure within\nsix months. For purposes of this provision only, \"common ownership\"\nshall be deemed to refer to:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "Title to contiguous properties being held in the same  name(s);"
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "Title to contiguous properties being held by a married or registered\ndomestic couple with any combination of one or both names on either\ndeed; or"
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "An individual or married or registered domestic couple holding title\nto one or both of the contiguous properties in the name of one or\nmore corporations, limited-liability companies, trusts, family limited\npartnerships, or any other similar beneficial entities."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Prior\nto the issuance of any permit for said accessory building or structure\non the conforming contiguous lot, the Building Inspector shall take\ninto consideration any applicable overlay district(s) on the parcel\nand its resultant impact, including, but not limited to, clearing\nrestrictions in the Aquifer Protection Overlay District (APOD)."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "The Building Department shall note, on the certificate of occupancy or certificate of compliance issued for said accessory building or structure on the conforming contiguous lot, that said building or structure is permitted pursuant to Town Code § 330-76C and, thus, is subject to change upon conveyance of either parcel."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "Accessory buildings and structures, including private\ngarages, shall not be placed within a required front yard, a required\nside yard nor the total required side yard for a principal building,\nexcept as allowed elsewhere in this chapter."
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "An access driveway may be located within a required\nyard."
								}
							]
						},
						{
							"number": "F. ",
							"content": [
								{
									"text": "Accessory off-street parking or truck loading areas\nshall be improved in accordance with Town specifications."
								}
							]
						},
						{
							"number": "G. ",
							"content": [
								{
									"text": "Required accessory off-street parking areas or truck\nloading space shall not be encroached upon by buildings, open storage\nor any other use."
								}
							]
						},
						{
							"number": "H. ",
							"content": [
								{
									"text": "The storage of manure or of odor- or dust-producing\nsubstances as an accessory use shall not be permitted within 50 feet\nof any side or rear lot line or within 100 feet of any front lot line."
								}
							]
						},
						{
							"number": "I. ",
							"content": [
								{
									"text": "All accessory buildings, structures or land used for animal husbandry shall conform to the provisions of § 330-79."
								}
							]
						},
						{
							"number": "J. ",
							"content": [
								{
									"text": "The keeping of more than two dogs more than six months old in outdoor shelters or pens or the keeping of any horses or farm livestock on the premises shall conform to the provisions of § 330-79, except in the case of a veterinarian, veterinary hospital or kennel."
								}
							]
						},
						{
							"number": "K. ",
							"content": [
								{
									"text": "A wind energy conversion system may be constructed\nor erected in the applicable zones as prescribed in the Tables of\nUse Regulations, provided that:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Such wind energy conversion systems shall be set back\nfrom all property lines, aboveground utility lines, radio or television\ntowers or other wind energy conversion systems a distance equal to\nor greater than the distance from existing grade at the foot of the\ntower to the top of the sweep of the blade or rotor system."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "No such system shall be located in a required yard."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "All guy wires and anchors shall be located at least\n10 feet from any property lines."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "No wind energy conversion system shall be constructed\nuntil a building permit has been issued to the property owner by the\nBuilding Inspector. Each application shall be accompanied by a complete\nplan drawn to scale showing the location of the tower on site, existing\ngrade elevation, location of all structures, aboveground power lines\nor other utility lines within a radius equal to the distance from\nexisting grade at the foot of the tower to the top of the sweep of\nthe blade or rotor system and dimensions and sizes of the various\nstructural components of the tower's construction. Also submitted\nshall be a detail design of the entire structure, including footings,\ntower, rotor or blade system and any other component of the wind energy\nconversion system, with computations submitted by a registered professional\nengineer licensed in the State of New York certifying that the tower\n(including footings and rotor system) is designed to comply with the\nwind load requirements of the New York State Building Construction\nCode. It shall also be certified by said engineer that the energy\nconversion system is designed so as not to exceed the peak load requirements\nof the user(s) of the system."
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "No climbing pegs shall be located closer than 12 feet\nto the ground level at the base of the structure for freestanding\nsingle pole or guyed towers. A six-foot-high fence with a locking\nportal shall be required to enclose lattice towers."
												}
											]
										},
										{
											"number": "(6) ",
											"content": [
												{
													"text": "The minimum distance between the ground and any part\nof the rotor or blade system shall be 15 feet."
												}
											]
										},
										{
											"number": "(7) ",
											"content": [
												{
													"text": "An automatic braking, governing or feathering system\nshall be required to prevent uncontrolled rotation at wind speeds\ngreater than 40 miles per hour."
												}
											]
										},
										{
											"number": "(8) ",
											"content": [
												{
													"text": "All power transmission lines from the tower to any\nbuilding or other structure shall be located underground."
												}
											]
										},
										{
											"number": "(9) ",
											"content": [
												{
													"text": "No television, radio or other communication antennas\nmay be affixed or otherwise made part of such wind energy conversion\nsystem."
												}
											]
										},
										{
											"number": "(10) ",
											"content": [
												{
													"text": "Wind energy conversion systems shall not cause\ninterference with radio and/or television broadcasting or reception\nand shall comply with the provisions of 47 CFR 15 (Federal Communications\nCommission), as exists or as may be amended."
												}
											]
										},
										{
											"number": "(11) ",
											"content": [
												{
													"text": "Evidence satisfactory to the Building Inspector\nshall be submitted that the wind energy conversion system complies\nwith the regulations of the Federal Aviation Administration Part 77,\nSubchapter B, as exists or as may be amended."
												}
											]
										},
										{
											"number": "(12) ",
											"content": [
												{
													"text": "All necessary approvals of other agencies having jurisdiction over such installation, including but not limited to a New York Board of Fire Underwriters inspection certificate, shall be presented to the Building Inspector of the Town of Southampton prior to the issuance of a building permit. In addition, the owner of the premises on which said system is to be erected shall sign a statement prepared by the Town acknowledging the provisions of § 330-76K(16) of this article and agreeing that the issuance of a permit for the construction of said wind energy conversion system is subject to such provisions. No person other than the owner of the premises may sign such statement.[Amended 1-10-2006 by L.L. No. 2-2006]"
												}
											]
										},
										{
											"number": "(13) ",
											"content": [
												{
													"text": "Property owners may construct a wind energy\nconversion system for their use in common, but such a system may not\nbe rented or leased to any other corporation or individual and shall\nbe for the sole use and benefit of the owners of property which utilize\nsuch system or the tenants or lessees of such property. The mechanical\nor electrical energy produced or generated by such system may not\nbe sold or otherwise made available to any individual or corporation\nother than the owner, tenant or lessee of the subject properties,\nor a public utility regulated by the Public Service Commission. If\nsuch wind energy conversion system is to be used in common, all owners\nand users of such system shall be made part of the application, and\nappropriate underwriter certificates, etc., shall be submitted for\nall properties, buildings and structures to be served by such system."
												}
											]
										},
										{
											"number": "(14) ",
											"content": [
												{
													"text": "A certificate of compliance indicating that\nthe wind energy conversion system has been built in conformance with\nthe plans and specifications filed with the Building Department shall\nhave been issued prior to the operation of the wind energy conversion\nsystem."
												}
											]
										},
										{
											"number": "(15) ",
											"content": [
												{
													"text": "No alterations, additions, modifications, substitutions\nor deletions shall be made to such wind energy conversion system without\napproval of the same pursuant to the provisions of this article."
												}
											]
										},
										{
											"number": "(16) ",
											"content": [
												{
													"text": "The Building Inspector and/or the Town Engineer\nshall have the right at any reasonable time to enter, in the company\nof the owner or his agent, the premises on which a wind energy conversion\nsystem has been constructed to inspect all parts of said wind energy\nconversion system installation and require that repairs or alterations\nbe made if, in his judgment, there exists a deficiency in the operation\nor in the structural stability of the system. If necessary, the Building\nInspector or Town Engineer may order the system secured or otherwise\ncease its operation. It shall not be required that the owner or his\nagent be present in the event of an emergency situation involving\ndanger to life, limb or property."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "L. ",
							"content": [
								{
									"text": "Solar energy systems. All such systems are permitted as an accessory\nuse in all zoning districts when the primary purpose is for producing\nelectricity or thermal energy for on-site consumption.[Added 9-27-2016 by L.L.\nNo. 10-2016]"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Roof-mounted solar energy systems."
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "All such systems are subject to the requirements of § 123-39.1."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "Height: shall not exceed the maximum height restrictions of\nthe zoning district within which they are located."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "Aesthetics. Roof-mounted solar energy system installations shall\nincorporate the following design requirements:"
																},
																{
																	"content": [
																		{
																			"number": "[1] ",
																			"content": [
																				{
																					"text": "When feasible, solar energy equipment shall be installed inside\nwalls and attic spaces to reduce its visual impact. If solar energy\nequipment is installed externally, then it shall be placed in the\nside or rear yard of the subject building so as not to be visible\nfrom a public right-of-way. If solar energy equipment is visible from\na public right-of-way, it shall match the color scheme of the underlying\nstructure."
																				}
																			]
																		},
																		{
																			"number": "[2] ",
																			"content": [
																				{
																					"text": "Panels facing the front yard must be mounted at the same angle\nas the roof's surface, with a maximum distance of six inches\nbetween the roof and highest edge of the system."
																				}
																			]
																		}
																	]
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Ground-mounted solar energy systems."
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "Maximum height shall not exceed 10 feet."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "Shall adhere to the setback requirements pursuant to § 330-77G, as well as transition yard requirements pursuant to § 330-83, as may be applicable, but in no case shall it be located closer than 10 feet to any property line."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "All such systems shall be installed in the side or rear yards."
																}
															]
														}
													]
												}
											]
										}
									]
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 330-77",
			"title": "Placement of accessory buildings, structures and uses in residence districts.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Accessory off-street parking areas shall not be located\nin a required front yard or side yard and shall be not less than 10\nfeet from any property line in a required rear yard."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "No commercial vehicle nor any house trailer, mobile\nhome, boat or boat trailer or any similar equipment shall be parked\nin any front yard or in any required side yard or within 10 feet of\nany property line in a required rear yard."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "The height of any accessory building located or constructed\nin any residential zone shall not have a height greater than 20 feet.\nHowever, this restriction shall not apply to agricultural or farm\nbuildings."
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "Accessory buildings and/or structures to be located or constructed in any residential zone in the required rear yard for a main or principal building shall not occupy more than 20% of such required rear yard, except for the area of the footprint associated with a ground-mount energy system having a minimum output of five kilowatts and decks and patios within 12 inches of grade. The total lot coverage shall not exceed the maximum lot coverage provided in § 330-11.[Amended 9-27-2016 by L.L. No. 10-2016]"
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "A residential storage shed as defined in § 330-5 shall be permitted in the rear yard of a lot if it meets the rear and side yard setbacks for accessory structures as defined in § 330-11 of the Town Code. Residential storage sheds that are located on lots 80,000 square feet and less in all zoning districts, except waterfront lots, shall be allowed to have a minimum side and rear yard setback of 10 feet. This relief shall be granted for one residential storage shed per lot."
								}
							]
						},
						{
							"number": "F. ",
							"content": [
								{
									"text": "A deck, unroofed steps, patio, or terrace abutting or attached to a principal dwelling shall be subject to accessory structure setbacks, with the exception of distance from street regulations, as described in § 330-11."
								}
							]
						},
						{
							"number": "G. ",
							"content": [
								{
									"text": "Residential pool equipment, generators, and electrical equipment are not considered accessory structures and are exempt from accessory structure setbacks, but must maintain a ten-foot setback from all property lines, except for property located wholly within an R-10 Residential Zoning District, where an eight-foot setback from all property lines must be maintained. Screening from abutting properties and noise mitigation to comply with § 235-1, the definition of \"noise pollution,\" is required.[Added 4-22-2008 by L.L. No. 23-2008]"
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 330-78",
			"title": "Placement of accessory buildings and uses in nonresidential districts.",
			"content": [
				{
					"text": "Except in the HO and HC Districts, accessory off-street parking areas may be located in required front, side or rear yards, provided they are set back at least 10 feet from all property lines. In the HO and HC Districts, no off-street parking shall be permitted in the front yard. Such accessory off-street parking shall, however, not encroach on required transitional yards established in accordance with § 330-83G. The Planning Board may allow accessory off-street parking areas to be set back less than the above-required 10 feet, so long as the Planning Board finds that the location of such off-street parking areas facilitates the coordination of joint access driveways and/or joint parking areas with neighboring commercial properties."
				}
			]
		},
		{
			"paragraph": "§ 330-79",
			"title": "Agriculture, gardening and animal husbandry.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "In CR and R Districts, the following shall apply to\nthe keeping of animals in all forms, except the keeping of animals\nas household pets:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Animal husbandry shall only be permitted on sites\nof 10 acres or more."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "All shelters provided for livestock, fowl or fur-\nand woolbearing animals shall be at least 150 feet from any street\nline and 200 feet from any other property line, except that an existing\nshelter may remain and be added to, provided that the addition shall\nnot encroach on a required yard."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "The disposal of animal wastes shall be provided for\nin such a manner as to prevent any nuisance or sanitary problem."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "In CR and R Districts, agricultural and gardening\nuses shall comply with the following requirements:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Cover crops shall be planted or sown on all cultivated\nland of one acre or more within two weeks of the date when crops are\nharvested therefrom and in no event later than October 30 of any year.\nSuch crops shall be grown and maintained in such condition as to protect\nthe soil against wind erosion at all times to the full extent possible\nafter the use of such due diligence as a reasonably prudent farmer\nor gardener would employ or exercise under all circumstances."
												}
											]
										}
									]
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 330-79.1",
			"title": "Temporary permit for accessory farmstand.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Permit required. It shall be unlawful to sell at retail crops and\nother farm-related products at an accessory farmstand, unless the\nfarmer-operator shall apply for and receive a permit from the Chief\nFire Marshal. Said permit shall allow the farmer-operator to erect,\nmaintain, use or operate, on a temporary basis, a farmstand as an\naccessory use, as set forth in this section. Said temporary permit\nshall be known as a \"farmstand permit.\""
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "No permit shall be required for the person who intends to sell crops\nhe or she grows in the Town of Southampton at a single roadside stand\nwith a display area less than 40 square feet in area."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "The application for said permit shall be in a form prepared by the\nChief Fire Marshal and shall include at least the following items\nof information:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "The name(s) and address(es) of the property owner, the farmer-applicant\n(if other than the owner) and of any professional engaged to work\non the application."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Where the farmer-applicant is not the owner of the property\nwhere the farmstand is located, written authorization with a notarized\nsignature from the owner for the submission of the application."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "The location of the property upon which the farmstand is to\nbe situated and the location of the lands in agricultural production\nassociated with this application."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "The Suffolk County Tax Map number(s) shall be provided for all\nparcels involved in the application."
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "A written statement describing and listing all crops grown by\nthe farmer-applicant which will be eligible for sale at the farmstand.\nSaid list may be based upon the crops listed in the New York State\nGuide to Farm Fresh Foods, published by the New York State Department\nof Agriculture and Markets. The Chief Fire Marshal may also accept,\nas additional proof, the farmer's seed order list for the current\ngrowing season."
												}
											]
										},
										{
											"number": "(6) ",
											"content": [
												{
													"text": "A written statement describing and listing all supporting products\nwhich are intended for sale at the farmstand."
												}
											]
										},
										{
											"number": "(7) ",
											"content": [
												{
													"text": "An informal site plan, sketch or survey map of the roadside\nstand parcel, depicting the location and setbacks of all buildings,\nstructures, displays, signs, off-street parking areas, driveways and\nother significant natural or man-made features within 100 feet of\nthe farmstand."
												}
											]
										},
										{
											"number": "(8) ",
											"content": [
												{
													"text": "A sworn notarized statement signed by the farmer-applicant agreeing\nto abide by the provisions of this section and all other applicable\nstatutes, ordinances and regulations governing the sale of crops and\nother farm products, and that the farmer-applicant agrees to remove\nall temporary buildings, structures and/or signs erected pursuant\nto this temporary farmstand permit within 30 days of the closing of\nthe farmstand."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "There shall be a filing fee for each application for a temporary\nfarmstand permit in an amount to be established, and changed as needed,\nby resolution of the Southampton Town Board."
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "In addition to the requirements of this section, any other standards, codes, rules or regulations which may be applicable to the erection, maintenance, use or operation of a temporary farmstand shall apply, including location in an appropriate zoning district as regulated by §§ 330-10, 330-33 and 330-37 (Tables of Use Regulations). All temporary farmstands accessing county roads shall receive a Suffolk County Highway work permit prior to issuance of a temporary farmstand permit."
								}
							]
						},
						{
							"number": "F. ",
							"content": [
								{
									"text": "Special standards."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Temporary farmstand permit. The Chief Fire Marshal may issue\na permit for the retail sale of crops and other farm-related products\nat an accessory farmstand for a maximum period of nine successive\nmonths in any twelve-month period. The permit issued by the Chief\nFire Marshal shall state the expiration date of such temporary permit."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Accessory use. The temporary farmstand shall be accessory to\nthe principal use of growing crops by the farmer-applicant. The area\ndevoted to the principal use of growing crops by the farmer-applicant\nshall be no less than 10 acres located in the Town of Southampton.\nThe farmer-applicant may grow his or her products on a number of smaller\nparcels located in the Town, provided that the total number of acres\nwhere products are grown is no less than 10 acres and that all the\nparcels are part of a single agricultural operation under the control\nof the farmer-applicant."
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "For purposes of this section, crops shall include field crops,\nfruits, vegetables, herbs and cut flowers."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "Notwithstanding the aforementioned restrictions, the farmer-applicant\nmay sell supporting farm products and farm products not grown or produced\nby the farmer-applicant, provided that the total area of the temporary\nfarmstand devoted to the sale of said products does not exceed 240\nsquare feet, and further provided that the area devoted to the sale\nof said products shall not exceed 20% of the combined area of said\nproducts and the area devoted to the sale of products grown by the\nfarmer. Supporting farm products include baked goods, eggs, cheese\nand milk, preserves, syrup, salad dressing, honey, juice, bottled\nwater, foods processed locally from crops grown locally, apparel or\nsimilar items that promote the specific farmstand, and crops sold\nin addition to those grown by the farmer-applicant which are grown\nby a person or entity that is also engaged in bona fide agricultural\nproduction within the Town. Supporting farm products shall not include\nprepackaged grocery items, the sale of which is expressly prohibited\nat a temporary farmstand."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "The sale of roasted corn may be permitted subject to compliance with all applicable regulations and codes, including but not limited to Town Code Chapter 164."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "The portion of the farm on which the temporary farmstand use\nis located shall be no less than three acres. Exceptions are as provided\nfor below:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "The farmstand is located in an agricultural accessory structure\nlawfully existing at the time of application."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "The farmer-applicant's property has been subdivided prior\nto application, but such property is contiguous with a portion of\nthe farm that is not less than three acres."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "All temporary farmstand buildings, structures and displays shall\nbe set back no less than 30 feet from the edge of pavement. In no\ncase shall any part of the temporary farmstand buildings, structures\nand displays encroach on the public right-of-way."
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "An area shall be provided for the informal parking of at least\nfive vehicles off the public right-of-way."
												}
											]
										},
										{
											"number": "(6) ",
											"content": [
												{
													"text": "Nothing herein shall preclude the temporary use of a legally\nexisting agricultural accessory building on a farm for the retail\nsale of crops and other farm-related products, provided that said\nbuilding is set back no less than 30 feet from the edge of pavement.\nA temporary farmstand shall only be permitted in a preexisting agricultural\naccessory structure that has been issued a certificate of occupancy\nor a certificate of compliance for an agricultural-related use, or\na certificate of occupancy for said use by virtue of preexisting status."
												}
											]
										},
										{
											"number": "(7) ",
											"content": [
												{
													"text": "A vehicle not exceeding 6,000 pounds' net weight or a typical\nfarm wagon may be considered a permitted farmstand for the purpose\nof this permit. Either part of a vehicle customarily known as an \"over-the-road\ntractor-trailer\" shall not be permitted."
												}
											]
										},
										{
											"number": "(8) ",
											"content": [
												{
													"text": "A temporary farmstand may have a total of two temporary ground\nidentification signs for the term of the temporary permit for said\nfarmstand, provided that:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "Such signs shall not create a hazard to traffic."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "Each of the temporary ground identification signs shall not\nexceed 12 square feet in area and shall not be illuminated."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "Such signs may be single- or double-faced."
																}
															]
														},
														{
															"number": "(d) ",
															"content": [
																{
																	"text": "Such signs shall not exceed six feet in height measured from\nthe ground level."
																}
															]
														},
														{
															"number": "(e) ",
															"content": [
																{
																	"text": "Such signs shall be located on the farm property not more than\n150 feet from the intersection point of the front property line and\na line perpendicular thereto to said farmstand. In no case shall any\nsigns be located off-premises."
																}
															]
														},
														{
															"number": "(f) ",
															"content": [
																{
																	"text": "Such signs shall be removed when the farmstand closes for the\nseason."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(9) ",
											"content": [
												{
													"text": "Since a farmstand, as permitted under this section, is an accessory\nuse to the principal use of the agricultural production on certain\nlands, such a farmstand shall only be for the use of the farmer-applicant\nand his immediate family. In the event that such farmstand is used\nby any other person, company, corporation or business or commercial\nentity, whether it is rented, leased or the right of use transferred\nin any other way from the farmer-applicant to any other person, company,\ncorporation or business or commercial entity, such a use shall not\nbe deemed an accessory use and shall be deemed a violation of this\nchapter."
												}
											]
										},
										{
											"number": "(10) ",
											"content": [
												{
													"text": "The farmer-applicant agrees, in writing, to abide by the provisions of this section and to remove all temporary buildings, structures and signs erected under the temporary farmstand permit within 30 days of the closing of the farmstand. If the farmer-applicant fails to abide by any provisions of this section or fails to remove said temporary farmstand and temporary ground identification signs after the expiration of the temporary permit, it shall be deemed a violation of this chapter, and the provisions of § 330-186 shall apply."
												}
											]
										},
										{
											"number": "(11) ",
											"content": [
												{
													"text": "A farmer-operator may apply for the renewal of a temporary farmstand permit issued during the prior nine-month period. The application for renewal will be in a form established by the Chief Fire Marshal. The renewal will only be granted following a determination by the Chief Fire Marshal that the farmer-applicant has operated the temporary farmstand during the prior nine-month period in compliance with Subsection F, Special standards, and all other standards, codes, rules and regulations applicable to a temporary farmstand."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "G. ",
							"content": [
								{
									"text": "The Chief Fire Marshal may deny any application for or revoke any\ntemporary farmstand permit if the farmer-operator fails to comply\nwith any requirement of this section. Written notice of such denial\nor rescission, and the reasons for such determination, shall be mailed\nby the Chief Fire Marshal, by certified mail, return receipt requested,\nto the applicant at the address provided in the application."
								}
							]
						},
						{
							"number": "H. ",
							"content": [
								{
									"text": "If the Chief Fire Marshal denies any application for or revokes any\ntemporary farmstand permit, the applicant may appeal to the Public\nSafety Commission, upon payment of the applicable fee. All requests\nfor an appeal shall be made in writing and shall be filed with the\nTown Clerk within 10 days from the date of receipt of the written\ndenial or rescission notification."
								}
							]
						},
						{
							"number": "I. ",
							"content": [
								{
									"text": "The Public Safety Commission shall refer the appeal to the Town Agricultural\nAdvisory Committee for evaluation and recommendation. The Agricultural\nAdvisory Committee shall submit an advisory report to the Public Safety\nCommission. In determining the appeal, the Public Safety Commission\nshall consider all available information, including said advisory\nreport. After a duly noticed public hearing, the Public Safety Commission\nmay grant or deny said temporary farmstand permit by resolution with\nfindings, and shall notify the applicant of its determination by certified\nmail, return receipt requested, to the address provided in the application.\nThe decision of the Public Safety Commission shall be final and shall\nconstitute the exhaustion of the applicant's administrative remedy."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 330-80",
			"title": "Lot areas.",
			"content": [
				{
					"text": "The minimum required lot area shall not include any underwater or tidal lands below the mean high-tide level, except that in a Tidal Wetlands and Ocean Beach Overlay District, marshlands customarily flooded at high tide may be included as part of such required lot area, pursuant to the provisions of Article VIII; however, the area of lots in a proposed subdivision shall conform to the applicable provisions of § 292-10 of the subdivision regulations of the Town of Southampton."
				}
			]
		},
		{
			"paragraph": "§ 330-81",
			"title": "Lot coverage.",
			"content": [
				{
					"text": "The calculation of the percentage of lot coverage\nshall include those lot areas covered by temporary structures and\nopen storage of more than an incidental transitory character."
				}
			]
		},
		{
			"paragraph": "§ 330-82",
			"title": "Lot width.",
			"content": [
				{
					"text": "The minimum road frontage of a lot at the street\nline shall be at least 40 feet in all districts, except in those districts\nwhere there are no minimum lot area requirements and also in the case\nof approved flagpole lots where the minimum road frontage at the street\nline shall be at least 20 feet, and those minimums shall apply along\nthe entire length of the flagpole."
				}
			]
		},
		{
			"paragraph": "§ 330-83",
			"title": "Yards.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "The following accessory structures may be located\nin any required front or rear yard:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Awning or movable canopy not exceeding 10 feet in\nheight."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Open arbor or trellis."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Retaining wall, fence or masonry wall, pursuant to § 330-109 of the Town Code.[Amended 7-28-2009 by L.L. No. 32-2009]"
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "Unroofed steps, deck, patio or terrace not higher\nthan one foot above ground level."
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "Accessory driveway structures, pursuant to Chapter 330, Article XXX, Driveway Standards, of the Town Code.[Added 7-28-2009 by L.L. No. 32-2009]"
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "The space in a required front yard shall be open and unobstructed, except for structures provided for in Subsection A and the following:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "An unroofed balcony projecting not more than eight\nfeet into the yard."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Other projections specifically authorized in Subsections C and D."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Every part of a required yard shall be open to the sky, unobstructed except for retaining walls and for accessory buildings in a rear yard and except for the ordinary projection of sills, belt courses and ornamental features projecting not to exceed six inches. Cornices and eaves shall not project more than 18 inches. Exterior cellar entrances, commonly known as \"bilco doors,\" shall be exempt from setbacks, pursuant to § 330-11 of the Southampton Town Code, but must be located a minimum of five feet from all property lines and rights-of-way. The side of the bilco door facing the street and the side of the bilco door facing all adjacent properties along the side yard shall be screened from view."
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "Open or lattice-enclosed fireproof fire escapes or\nstairways required by law, projecting into a yard not more than four\nfeet, and the ordinary projections of chimneys and pilasters shall\nbe permitted by the Building Inspector when placed so as not to obstruct\nlight and ventilation."
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "Where a lot extends through from street to street,\nthe applicable front yard regulations shall apply on both street frontages."
								}
							]
						},
						{
							"number": "F. ",
							"content": [
								{
									"text": "In any residence district where 25% of the block frontage\nwithin 200 feet of a proposed building on either the same side of\nthe street or across the street is already improved with buildings,\nthe front yard of such proposed building shall be required to exceed\nthe minimum required dimension stipulated in this chapter for the\ndistrict in which it is situated in cases where the average front\nyard setback of the two nearest buildings within such 200 feet exceeds\nsuch minimum dimension; provided, however, that such increased front\nyard shall not be required to exceed the minimum required front yard\nprescribed for the district in which such proposed building is to\nbe located by more than 10 feet."
								}
							]
						},
						{
							"number": "G. ",
							"content": [
								{
									"text": "The following minimum required transitional yards\nand screening shall be provided within nonresidential districts in\norder to assure orderly and compatible relationships along certain\nboundary lines:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Adjoining residential districts."
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "The minimum required transitional side and rear\nyards shall be 50 feet."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "The minimum required side and rear transitional\nyards for nonresidential uses located in the HO or HC Zones shall\nbe as follows:"
																},
																{
																	"content": [
																		{
																			"number": "[1] ",
																			"content": [
																				{
																					"text": "For buildings up to 3,000 square feet in size,\nthe minimum side and rear transition yard shall be 20 feet."
																				}
																			]
																		}
																	]
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "The minimum required screening within such transitional side and rear yards shall be a six-foot-high stockade-type fence or equal and landscape plantings to be erected and maintained by the nonresidential property owner along the side and rear property lines; provided, however, that the Planning Board, subject to the applicable provisions of §§ 330-181 through 330-184, may modify these requirements for screening where the same screening effect is accomplished by the natural terrain or foliage."
																}
															]
														},
														{
															"number": "(d) ",
															"content": [
																{
																	"text": "The minimum required transitional side and rear yards provided for in Subsection G(1) of this section may be modified by the Planning Board as part of site plan review pursuant to §§ 330-181 through 330-184 of this chapter where the subject premises is a single lot which lies across district boundaries or where natural, physical or other existing features are present and the goals of this section will be accomplished."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Adjoining limited access and secondary highways."
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "The minimum required transitional front yard\nshall be 20 feet in the OD, HO, HC, MTL and RWB Zones."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "The minimum required transitional front yard\nshall be 50 feet in the HB and LI-40 Zones."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "The minimum required transitional front yard\nshall be 100 feet in the SCB and LI-200 Zones."
																}
															]
														},
														{
															"number": "(d) ",
															"content": [
																{
																	"text": "The minimum required screening within such transitional\nyards cited above shall be landscape plantings, including evergreen\nshrubs not less than one foot nor more than three feet high, and street\ntrees meeting Town specifications."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Adjoining all other streets (i.e., collector or minor\nstreets). The minimum required transitional front yard shall be 20\nfeet in all nonresidential zones, unless the Planning Board finds\nfor aesthetic and safety reasons that additional area is necessary."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "H. ",
							"content": [
								{
									"text": "In the Highway Business (HB) and Light Industrial\n(LI-40) Zones:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "In order to encourage commercial development whereby\noff-street parking is provided to the side(s) and rear of developing\nbusiness sites and to encourage the provision of additional landscape\nmaterials and planting areas adjacent to the Town's major arteries,\nthe minimum required front yard in the HB and LI-40 Zones shall be\n50 feet, provided that within said required front yard there shall\nnot be any off-street parking areas, truck loading spaces or paved\nvehicular maneuvering lanes [except for the entrance(s) and exit(s)\nto the site], and further provided that a detailed landscaping plan\n(prepared by a licensed professional) shall be submitted to the Planning\nBoard along with or as part of the required site plan. Said landscaping\nplan shall depict the plant materials, sodded areas, etc., which are\nto be provided within such fifty-foot front yard. The Planning Board\nshall have the authority to reject the use of a fifty-foot minimum\nfront yard in consideration of the setback of existing building(s)\non adjacent properties should such buildings be located further than\n50 feet from the street line."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Off-street parking areas and paved maneuvering lanes may be included in such front yards, provided that such parking areas and lanes shall not be located within the required fifty-foot transitional front yard specified in Subsection G(2) and (3)."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "I. ",
							"content": [
								{
									"text": "In the Shopping Center Business Zone. In order to\nencourage commercial development whereby off-street parking is provided\nto the side(s) and rear of developing business sites and to encourage\nthe provision of additional landscape materials and planting areas\nadjacent to the Town's major arteries, a principal building, constructed\nor erected in the Shopping Center Business Zone after the effective\ndate of this section, shall not have a front yard in excess of 100\nfeet, unless the required transitional yard is increased, and that\nsuch increase in the transitional yard shall be five feet for every\n10 feet of increased front yard distance, and the increased front\nyard is approved by the Planning Board, contingent upon the submission\nof a detailed landscape plan (prepared by a licensed professional)\nfor said transitional yard (planting area), which is to accompany\nthe required overall site plan."
								}
							]
						},
						{
							"number": "J. ",
							"content": [
								{
									"text": "Notwithstanding any provision of this chapter to the\ncontrary, in the case of corner lots:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "There shall be only one rear lot line. The rear lot\nline shall be the lot line opposite the shorter front lot line (exclusive\nof the corner arc). If the front lot lines are the same length, the\nBuilding Inspector shall determine the rear lot line."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "The rear yard shall be the space on the same lot with\na building, situated between the nearest roofed portion of the principal\nbuilding or buildings and the rear lot line of the lot and extending\nfrom side lot line to the required front yard of the longer front\nline."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "In the case of a waterfront lot line, the line opposite\nthe waterfront shall be considered the rear lot line."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "K. ",
							"content": [
								{
									"text": "In all residence districts, where the approving authority under Chapter 325, Wetlands, of the Town Code has authorized a wetlands permit for a principal building requiring relief from the minimum required yards under § 330-11 of this chapter, a required yard of such proposed principal building may be reduced up to 50%; provided, however, that any such reduced front or rear yard shall not be less than 30 feet, and any such reduced side yard shall not be less than 10 feet, and where the Administrator under Chapter 138, Coastal Erosion Hazard Areas, has authorized a coastal erosion management permit requiring similar relief, a required front yard setback measured from an existing street or property northerly line paralleling the ocean may be reduced to not less than 30 feet. The relief herein shall only be the minimum necessary to achieve the maximum practicable buffer zones required under Chapter 325 or Chapter 138 of the Town Code."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 330-84",
			"title": "Height.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Nothing herein contained shall restrict the height\nof the following architectural and structural features:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "On any building, except one- and two-family dwellings, a spire, cupola, dome, belfry or clock tower, provided that such spire, cupola, dome, belfry or clock tower does not constitute habitable space or a building story as defined by all applicable provisions of the Town Code or the New York State Uniform Fire Prevention and Building Code; and provided that such spire, cupola, dome, belfry or clock tower is approved as an integral element of the architectural style of the building by the Planning Board or Board of Architectural Review in accordance with the criteria set forth in § 330-171.[Amended 4-11-1995 by L.L. No. 18-1995]"
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "A flagpole, chimney flue, elevator or stair bulkhead,\nwater tank, stage tower or scenery loft as accessory facilities to\npermitted or special exception uses in a given district."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Barns, silos or similar farm structures in districts\nwhere agriculture is a permitted use."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "A wireless communications tower or antenna or similar\nstructure only if approved as a special exception use by the Planning\nBoard.[Amended 12-22-1992 by L.L. No. 54-1992; 11-24-1998 by L.L. No. 42-1998]"
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "Structures shown on a site plan approved in accordance with the provisions of Article XXII (QPSUD).[Added 12-22-1992 by L.L. No. 54-1992]"
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "No building or structure erected pursuant to Subsection A to a height in excess of the height limit for the district in which it is situated shall:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Have a lot coverage in excess of 10% of the lot area."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Be used for residence or tenancy purposes."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Have any sign, nameplate, display or advertising device\nof any kind whatsoever inscribed upon or attached to such building\nor structure."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "No private radio or television antenna, mast or tower\nshall exceed the maximum permitted height prescribed for the district\nin which such proposed structure is to be located."
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "Pyramid Law.[Added 12-22-1992 by L.L. No. 55-1992; amended 11-14-1997 by L.L. No. 38-1997; 6-10-1997 by L.L. No.\n47-2003; 8-26-2003 by L.L. No. 65-2003; 5-13-2008 by L.L. No.\n30-2008; 5-27-2014 by L.L. No. 17-2014]"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Except on lots in the Village Business (VB) District, Office District (OD), Hamlet Office/Residential (HO) District, Hamlet Commercial/Residential (HC) District, or Light Industrial (LI-40 and LI-200) Districts, all buildings and structures on any lot in any district must remain within the sky plane of the lot. The sky plane shall begin at all property lines from the average elevation of the existing natural grade (prior to any site disturbance) adjacent to that building or structure and extend inward at an angle of 45°. Notwithstanding any language in this subsection, the maximum height limitation for a building or structure in the dimensional tables of this chapter (§§ 330-11, 330-34 and 330-38)[1] shall not be exceeded at any point unless the structure is one exempted under Subsection A hereof or pursuant to Subsection D(2)(a) below. An illustration depicting a typical elevation view showing the control of height of buildings and structures under this subsection is included at the end of this chapter."
												},
												{
													"footnote": "[1]\nEditor's Note: The Tables of Dimensional Regulations\nare included at the end of this chapter.\n"
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "For buildings and structures in any AE or VE Zone\nas shown on the applicable Flood Insurance Rate Map (FIRM) prepared\nby the Federal Emergency Management Agency for the Town of Southampton,\nthe height of any building or structure must remain in the sky plane\nof the lot. The sky plane shall begin at all property lines at base\nflood elevation plus any free board required by the Residential Code\nof the State of New York and extend inward at an angle of 45°."
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "Exception: Existing buildings and structures located in any AE or\nVE Zone may be elevated and exceed the sky plane and the maximum height\nset forth above in order to conform with current state and federal\nregulations"
																}
															]
														}
													]
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "The maximum\nheight in any AE or VE Zone as shown on the applicable Flood Insurance\nRate Map prepared by the Federal Emergency Management Agency for the\nTown of Southampton shall not exceed elevation +40 feet NAVD (88)\nplus required Residential Code of New York State freeboard or the\nmaximum height in feet as shown on the table provided for in 330 Attachment\n3, whichever is less.[2][Added 5-27-2014 by L.L. No. 17-2014]"
								},
								{
									"footnote": "[2]\nEditor's Note: 330 Attachment 3, the Residence Districts Table of Dimensional Regulations, is included as an attachment to this chapter.\n"
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 330-85",
			"title": "(Reserved)\n                                                                                          [1]",
			"content": [
				{
					"footnote": "[1]\nEditor’s Note: Former § 330-85, Schedule of permitted signs, was repealed 10-26-2004 by L.L. No. 35-2004. See now Article XXII, Signs.\n"
				}
			]
		},
		{
			"paragraph": "§ 330-86",
			"title": "(Reserved)\n                                                                                          [1]",
			"content": [
				{
					"footnote": "[1]\nEditor’s Note: Former § 330-86, Professional signs and announcement signs, was repealed 10-26-2004 by L.L. No. 35-2004. See now Article XXII, Signs.\n"
				}
			]
		},
		{
			"paragraph": "§ 330-87",
			"title": "(Reserved)\n                                                                                          [1]",
			"content": [
				{
					"footnote": "[1]\nEditor’s Note: Former § 330-87, Village and Highway Business District identification signs, as amended, was repealed 10-26-2004 by L.L. No. 35-2004. See now Article XXII, Signs.\n"
				}
			]
		},
		{
			"paragraph": "§ 330-88",
			"title": "(Reserved)\n                                                                                          [1]",
			"content": [
				{
					"footnote": "[1]\nEditor’s Note: Former § 330-88, All other nonresidential district identification signs, was repealed 10-26-2004 by L.L. No. 35-2004. See now Article XXII, Signs.\n"
				}
			]
		},
		{
			"paragraph": "§ 330-88.1",
			"title": "(Reserved)\n                                                                                          [1]",
			"content": [
				{
					"footnote": "[1]\nEditor’s Note: Former § 330-88.1, Signs in the HO and HC Districts, added 8-26-2003 by L.L. No. 65-2003, was repealed 10-26-2004 by L.L. No. 35-2004. See now Article XXII, Signs.\n"
				}
			]
		},
		{
			"paragraph": "§ 330-89",
			"title": "(Reserved)\n                                                                                          [1]",
			"content": [
				{
					"footnote": "[1]\nEditor’s Note: Former § 330-89, Real estate and construction signs, was repealed 10-26-2004 by L.L. No. 35-2004. See now Article XXII, Signs.\n"
				}
			]
		},
		{
			"paragraph": "§ 330-90",
			"title": "(Reserved)\n                                                                                          [1]",
			"content": [
				{
					"footnote": "[1]\nEditor’s Note: Former § 330-90, General provisions (regarding signs), as amended, was repealed 10-26-2004 by L.L. No. 35-2004. See now Article XXII, Signs.\n"
				}
			]
		},
		{
			"paragraph": "§ 330-91",
			"title": "(Reserved)\n                                                                                          [1]",
			"content": [
				{
					"footnote": "[1]\nEditor’s Note: Former § 330-91, Procedures, permits and fees for signs, as amended, was repealed 10-26-2004 by L.L. No. 35-2004. See now Article XXII, Signs.\n"
				}
			]
		},
		{
			"paragraph": "§ 330-92",
			"title": "Off-street parking and truck loading space generally.",
			"content": [
				{
					"text": "In order to minimize traffic congestion, air pollution and the risk of motor vehicle and pedestrian accidents, as well as to promote other elements of sound community planning, off-street parking and truck loading spaces shall be provided and kept available as an accessory use to all permitted and special exception uses of buildings, structures and lots in amounts not less than those specified in this section. Subject to the provisions of § 330-100, the requirements of this section apply under the following circumstances:"
				},
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "All new buildings and structures erected for use on\na property shall be subject to these requirements."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Any building and/or structure which is hereafter altered\nor enlarged shall be subject to these requirements."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "All new uses of a property shall be subject to these\nrequirements."
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "Any use of a property which is hereafter changed shall\nbe subject to these requirements."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 330-93",
			"title": "Methods of determining off-street parking space requirements.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "The requirement for a single use (e.g., a one-family\ndwelling or a retail store) shall be determined directly from the\nschedule of such requirements which is a part of this chapter.[1]"
								},
								{
									"footnote": "[1]\nEditor's Note: See § 330-94.\n"
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "The requirement for a combination use made up of several\ncomponent uses (e.g., a bowling alley combined with an auditorium;\na restaurant and bar; or a retail store combined with an office building\nor a storage area) shall be determined by establishing the requirement\nfor each component use from the schedule of such requirements, which\nis a part of this chapter, and adding them together."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "When the required number of spaces is determined to\nresult in a fraction, it shall be increased to the next highest whole\nnumber."
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "If the use is not specifically listed in the schedule\nof such requirements, the requirements shall be the same as for the\nmost similar use listed, as determined by the Planning Board."
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "When the schedule requires the number of spaces to\nbe calculated per employee and employees are on the site in shifts,\nthe number to be used is the number of employees present during the\nlargest shift. In all other cases it shall mean the total number of\nemployees on the site or who will use the site for parking at any\none time."
								}
							]
						},
						{
							"number": "F. ",
							"content": [
								{
									"text": "A garage or a carport may be used to meet the requirements\nof this section. A driveway may only be used to meet the requirements\nof this section where it serves a one-family or two-family dwelling.\nNo garage or other parking area shall be located under a motel, multiple\ndwelling (other than a two-family dwelling) or other commercial use\nwithout the explicit written permission of the Town Department of\nFire Prevention and all other local agencies having jurisdiction to\nreview and approve such a plan."
								}
							]
						},
						{
							"number": "G. ",
							"content": [
								{
									"text": "Uses which require approval pursuant to the special exception procedure set forth in § 330-121 may be required to provide off-street parking spaces in excess of the requirements of this section, as indicated in § 330-122I."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 330-94",
			"title": "Schedule of Off-Street Parking Space Requirements for Residential Uses.",
			"content": [
				{
					"text": "The Schedule of Off-Street Parking Space Requirements\nfor Residential Uses is as follows:"
				}
			]
		},
		{
			"paragraph": "§ 330-95",
			"title": "Schedule of Off-Street Parking Space Requirements for Nonresidential Uses.",
			"content": [
				{
					"text": "The Schedule of Off-Street Parking Space Requirements\nfor Nonresidential Uses is as follows:"
				},
				{
					"footnote": "[1]\nEditor's Note: The former entry for warehouse\nand miniwarehouse facility, which immediately followed this entry,\nwas repealed 2-23-1993 by L.L. No. 6-1993.\n"
				}
			]
		},
		{
			"paragraph": "§ 330-96",
			"title": "Off-street truck loading space requirements.",
			"content": [
				{
					"text": "Every building or structure or lot used for\nnonresidential purposes shall be provided with off-street truck loading\nspaces in accordance with the following schedule:"
				}
			]
		},
		{
			"paragraph": "§ 330-97",
			"title": "Supplemental regulations for private garages and off-street parking areas in residence districts.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Not more than two parking spaces per dwelling unit\nmay be rented to persons living off the premises in the case of a\none-family or two-family dwelling use and not more than one parking\nspace per each two dwelling units may be rented to persons living\noff the premises in the case of any other residential use."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Not more than one commercial vehicle shall be housed\nor parked in a private garage or off-street parking area. Such commercial\nvehicle shall not exceed a gross motor vehicle weight of 10,000 pounds\nor 25 feet in length."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "A dwelling unit shall not have more than one vehicle for each conventional bedroom, plus one additional vehicle parked on the property at night, nor shall vehicles be parked on the street in violation of applicable parking regulations. The exemption provided for in § 330-100A of this chapter shall not apply to this provision."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 330-98",
			"title": "Access driveway requirements.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Public parking areas, filling stations, repair garages\nand any other high-volume traffic generators may have separate or\ncombined entrances."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Every separate entrance or exit driveway shall have\na minimum unobstructed width of 10 feet on collector roads and 15\nfeet on secondary highways. Every combined entrance and exit driveway\nshall have a minimum unobstructed width of 20 feet on collector roads\nand 30 feet on secondary highways. The classification of such roads\nand highways shall be as set forth in the Master Plan or its subsequent\namendments. Notwithstanding the provisions of this subsection, all\nentrance or exit driveways onto a state or county road shall be in\naccordance with the requirement of the highway department having jurisdiction\nover said roads."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "The intersection of a separate or combined exit and entrance driveway of a parking area with the public street shall have the same corner clearance as prescribed for intersecting streets, in § 330-103."
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "The gradient of driveways shall be such as to facilitate\nthe entrance and exit traffic flow."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 330-99",
			"title": "Design requirements for nonresidential parking and truck loading areas.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "All accessory off-street parking and truck loading areas shall be located in accordance with the provisions of §§ 330-76 and 330-78 of this chapter. For all properties and uses subject to site plan review pursuant to § 330-181 of this chapter, new accessory off-street parking and truck loading areas shall be located and established only as the same are indicated on a site plan duly approved by the Planning Board. Any changes, alterations, improvements or additions to the parking area(s) shall require further review by the Planning Board."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "The physical improvements of off-street parking and\ntruck loading areas shall include:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Curbs, paving, sidewalks and drainage facilities complying\nwith the standards established in Town ordinances, regulations or\nspecifications."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Adequate lighting in public parking areas to assure\nthe general safety and convenience of the public. Such lighting shall\nnot project onto surrounding properties. As a minimum standard, the\nlight sources shall be shielded and project downward."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Appropriate landscaping and screening for aesthetic purposes and for the protection of adjacent properties, particularly along district boundary lines as provided in § 330-83G."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "All aisles within parking areas shall have a minimum\nwidth of 24 feet when the parking spaces are at a ninety-degree angle\nwith the aisle; 18 feet when the parking spaces are at 60º in\na one-way direction; and 12 feet when the parking spaces are at 45º\nin a one-way direction. Aisles adjoining a building shall be wide\nenough to accommodate fire lanes/zones as may be required by the Town\nDepartment of Fire Prevention and/or the local fire district."
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "Aisles and turning areas shall provide good internal\ncirculation with adequate radii to assure ease of mobility, ample\nclearance and convenient access and egress. Queuing line areas required\nfor drive-in facilities shall be designed such that at least 2/3 of\nthe parking spaces required in the queuing line are separate from\naccess lanes, maneuvering lanes and parking areas."
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "Center-line gradients of aisles shall not exceed 8%."
								}
							]
						},
						{
							"number": "F. ",
							"content": [
								{
									"text": "Accessory off-street parking areas shall be marked\noff into spaces with a minimum width of nine feet and a minimum length\nof 20 feet or a minimum width of 10 feet and a minimum length of 18\nfeet. The dimensions of the parking spaces shall be determined by\nthe Planning Board based on the design and the type of improvements\nto be done to the parking area. As a policy, nine-by-twenty spaces\nshould only be considered where the parking areas are to be substantially\nimproved (i.e., asphalt or concrete paving) and there is a large number\nof spaces. The ten-by-eighteen spaces should be used in all other\ninstances, especially where the parking areas are minimally improved\n(i.e., oil and bluestone or gravel). In the case of parking spaces\nfor trucks or special equipment, the minimum size of the spaces shall\nbe determined by the Planning Board based on the nature of the parked\nvehicles."
								}
							]
						},
						{
							"number": "G. ",
							"content": [
								{
									"text": "All accessory off-street parking areas shall provide\nfor handicapped access and parking in accordance with the standards\nof the Suffolk County Department of Handicapped Services. A minimum\nof 5% of the total number of parking spaces required for the site\nshall be allocated to handicapped parking; however, in no case shall\nthe number of handicapped spaces exceed 10, unless the use warrants\nadditional spaces as may be determined by the Planning Board. The\nhandicapped parking areas shall be marked off into spaces with the\nsame minimum width as required for regular parking spaces, plus an\nadjacent five-foot wide unloading area, providing for a fourteen-or-fifteen-foot-wide\nparking space. Each space shall be striped with blue paint and shall\ncontain the international handicapped symbol and an approved sign\nat the head of each space."
								}
							]
						},
						{
							"number": "H. ",
							"content": [
								{
									"text": "An accessory off-street truck loading space shall\nhave a minimum width of 12 feet, a minimum length of 25 feet and a\nminimum clear height of 14 feet. The related aisles or driveways shall\nhave the same minimum width and clear height. Where large trucks (i.e.,\ntractor trailers) are anticipated delivering to the site, the Planning\nBoard may require larger spaces and on-site turning areas to accommodate\nsaid trucks."
								}
							]
						},
						{
							"number": "I. ",
							"content": [
								{
									"text": "Traffic pavement markings may be provided on various\ninternal roadways and parking areas, which may include parking stalls,\nstop bars, crosswalks, lane lines, fire zones, handicapped parking\nstalls, directional arrows and other miscellaneous markings. Signs\nmay also be provided along said roadways to identify these areas.\nPavement markings and signs shall conform to the New York State Manual\nof Uniform Traffic Control Devices or as directed by the Town Engineer."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Where striping can be accomplished, all parking spaces\nshall be striped in accordance with the approved plan. All striping\nshall be four-inch white lines, except handicapped spaces, which shall\nbe four-inch blue lines. Specifications of the paint and method of\napplication shall be determined by the Town Engineer."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Traffic islands separating opposing flows of traffic\nshall be bordered by two four-inch-wide yellow lines and shall be\ncrosshatched with twelve-inch-wide yellow bars."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Fire zones shall be installed in accordance with the\nrecommendations of the Southampton Town Department of Fire Prevention\nand/or the local fire district Fire zones shall be marked out with\ntwenty-four-inch-wide red or yellow bars, painted on a 45º angle\nwith the curb, spaced four feet apart, for a depth of 10 feet off\nthe face of the curb or the building. The words FIRE ZONE shall be\npainted on the pavement, and signs with the words NO STANDING, FIRE\nZONE shall be posted adjacent to the curb or on the building at a\nheight no greater than seven feet above the ground."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "J. ",
							"content": [
								{
									"text": "To improve the aesthetics of a site, promote public safety, moderate climatic effects and minimize nuisances such as noise and glare, accessory off-street parking areas shall include appropriate landscaping around the perimeter and within the interior of the parking area. The Planning Board shall determine the amount, location and type of landscaping; however, as a minimum, accessory off-street parking areas with over 50 spaces shall have at least 25 square feet of interior landscaping for each parking space. In addition, interior parking islands should allow ample room for the growth of plants without disturbance from vehicular and pedestrian traffic. Landscaped areas shall not obstruct the driver's view of the right-of-way and shall provide proper corner clearance at intersections in accordance with § 330-103 of this chapter."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 330-100",
			"title": "Exemptions and waivers of parking and truck loading space requirements.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Existing buildings and uses are exempt as follows:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "The provisions of §§ 330-92 through 330-101 shall not apply to any buildings or structure or lot lawfully in use at the effective date of this chapter, whether continued as a legal nonconforming use or thereafter converted or changed without enlargement to a different lawful use having the same parking and truck loading requirements, except as provided in § 330-167B(1)."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "However, no building or structure or lot lawfully\nin use at the effective date of this chapter shall be enlarged unless\nthe off-street parking and truck loading space requirements of this\nsection are complied with to the same extent as would be required\nif the entire preexisting building or structure or lot and the proposed\nenlargement were being submitted as if they were a new application\nfor a building permit for the entire project; except that credit shall\nbe given for the off-street parking and truck loading spaces that\nwould have been required for the existing buildings, structures and\nuses if the spaces did not have preexisting status. It is intended\nby this provision that additional off-street parking and truck loading\nspaces shall be provided with respect to the proposed enlargement,\nbut no additional spaces shall be required with respect to the preexisting\nportions. However, conforming spaces actually provided at the time\nof the application, even if voluntary or informal and unpaved, shall\nbe charged to the preexisting portions and shall be formalized and\npaved incident to construction of the addition."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Where the Planning Board shall determine that a proposed land use, building or structure is adequately served by existing or proposed public parking facilities as a matter of public policy, the off-street parking space requirements stipulated in §§ 330-92 through 330-101 may be waived, in whole or in part, by the Planning Board. See also § 330-101 for required fee."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Where the Planning Board shall determine that dedication of land or an easement is desirable to facilitate improvement of existing or proposed public parking facilities and said dedication of land or easement is voluntarily and unconditionally offered to the Town for said purposes as a matter of public policy, the off-street parking requirements stipulated in §§ 330-92 through 330-101 may be waived, in whole or in part, by the Planning Board. The number of spaces that may be waived shall be calculated on the basis of one space per each two hundred (20) square feet of land area covered in the dedication or easement. No off-street parking fee, as required in § 330-101, shall be imposed for those spaces waived pursuant to these provisions."
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "The Board of Appeals, subject to the applicable provisions of §§ 330-101 and 330-167E, may waive the requirements, in whole or in part, for the off-street parking or truck loading spaces stipulated in this §§ 330-92 through 330-101."
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "In the event that an applicant can demonstrate to the Planning Board that its present parking needs do not necessitate the construction of the number of parking spaces required herein, the Planning Board may approve a site plan requiring the present construction of a lesser number of spaces. In such an event, the site plan shall show sufficient spaces reserved for future parking requirements with the combined number of spaces being not less than that required by §§ 330-92 through 330-101. In all cases, at least 2/3 of the number of required parking spaces shall be provided. The Planning Board may order the property owner to install the future parking spaces if, at the Planning Board's discretion, the need for additional spaces arises. For example, a mere change in the use(s) or the ownership of the parcel may be enough to require the installation of the parking spaces. In the event that the owner fails to install the additional parking spaces within 120 days of being so ordered, the Building Inspector shall revoke the certificate of occupancy for the premises, and the Town Attorney may take appropriate action in a court of competent jurisdiction to restrain the use of said premises. When this subsection is utilized, the site plan shall contain a statement, signed by the applicant in such a form as shall be approved by the Town Attorney, consenting to the provisions contained herein. In addition, the property owner shall be required to submit a covenant, for filing in the Suffolk County Clerk's office, in such a form as shall be approved by the Town Attorney, indicating consent to the provisions of this subsection. The provisions of this subsection shall not apply in the VB and OD Districts."
								}
							]
						},
						{
							"number": "F. ",
							"content": [
								{
									"text": "As a matter of public policy, the Town of Southampton\nfinds that the coordination of off-street parking areas between adjoining\nsites is desirable to allow for traffic circulation between sites\nrather than having all traffic entering and exiting the existing highway\nsystem to proceed from site to site. This coordination can take various\nforms, from a simple paved connection to a more elaborate plan to\nprovide both a connection and shared parking arrangements. This is\nnot to be considered a parking waiver, but an agreement between the\nlandowners and the Town of Southampton to effect an overall circulating\nand parking plan and provide the required number of parking spaces\nin accordance with the applicable Code provisions for the respective\nuse(s). For these reasons, in its review of a commercial site plan,\nthe Planning Board may, at its discretion, allow for parking spaces\nto be provided both on and off site, provided that:[Added 1-10-1995 by L.L. No. 2-1995]"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "This is done in accordance with an acceptable overall\ndesign for the coordination of parking areas between two or more commercial\nsites, such design to be approved by the Town Engineer and the Planning\nBoard."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "The required number of parking spaces are to be provided."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "A document is filed with the Suffolk County Clerk's\noffice, acceptable to the Town Attorney in form and content, to which\nthe Town of Southampton is party, which provides for the use of a\nportion of a commercial site to be improved and used for parking for\nan adjoining site as part of the coordinated parking and access design\nmentioned above."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "The site on which the off-site parking is being provided\nwill have the required number of parking spaces for the use or uses\nwhich exist."
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "The site on which the off-site parking is being provided\nwas not the subject of a Board of Zoning Appeals case for the granting\nof a waiver or variance from the required number of off-street parking\nspaces for its use and development."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "G. ",
							"content": [
								{
									"text": "Shared parking on a single parcel. Where the Planning\nBoard determines that a proposed development consisting of two or\nmore uses located on a single and separate parcel will generate different\nhourly, daily and seasonal accumulations of parking demand due to\nthe varied hours of operation of each use and frequencies of customer\nand employee occupancy of available parking spaces, the Planning Board\nmay approve a site plan requiring the present construction of a lesser\nnumber of spaces, provided that:[Added 2-13-1996 by L.L. No. 2-1996]"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "The applicant shall provide the Planning Board with\na shared parking plan which shall be based upon the following:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "A complete and accurate description of the proposed\nuses, floor areas devoted to such uses and the number of seats or\nrooms assigned to each use."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "A complete and accurate description of the number\nof employees and their respective shifts."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "A complete and accurate description of the projected\ntotal peak hour or daily period of occupancy by patrons for each proposed\nuse during weekdays, Saturday, Sunday and any seasonal variations\nin peak hour or period of occupancy."
																}
															]
														},
														{
															"number": "(d) ",
															"content": [
																{
																	"text": "A complete and accurate description of the days\nand hours of operation of each use for weekdays, Saturday, Sunday\nand for any seasonal variations in operation."
																}
															]
														},
														{
															"number": "(e) ",
															"content": [
																{
																	"text": "A complete and accurate description of the projected\nhourly accumulation of off-street parking over a twenty-four-hour\nperiod for each use. The description shall be provided for the weekday,\nSaturday and Sunday accumulations of off-street parking and any seasonal\nvariations in off-street parking accumulation."
																}
															]
														},
														{
															"number": "(f) ",
															"content": [
																{
																	"text": "A complete and accurate description of the total\nhourly accumulation of off-street parking demand created over a twenty-four-hour\nperiod by the combined operations of the proposed uses for weekday,\nSaturday and Sunday accumulations of off-street parking and any seasonal\nvariations in total off-street parking accumulation."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "In all cases, at least 2/3 of the number of required\nparking spaces shall be provided. The Planning Board may order the\nproperty owner to install the future parking spaces if, at the Planning\nBoard's discretion, the need for additional spaces arises. For example,\na mere change in the use(s), hours of operation or the ownership of\nthe parcel may be enough to require the installation of the parking\nspaces. In the event that the owner fails to install the additional\nparking spaces within 120 days of being so ordered, the Building Inspector\nshall revoke the certificate of occupancy for the premises, and the\nTown Attorney may take appropriate action in a court of competent\njurisdiction to restrain the use of said premises. When this subsection\nis utilized, the site plan shall contain a statement, signed by the\napplicant in such a form as shall be approved by the Town Attorney,\nconsenting to the provisions contained herein. In addition, the property\nowner shall be required to submit a covenant, for filing in the Suffolk\nCounty Clerk's office, in such a form as shall be approved by the\nTown Attorney, indicating consent to the provisions of this subsection."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "H. ",
							"content": [
								{
									"text": "Off-street parking on a separate parcel. Where the\nPlanning Board determines that the off-street parking requirements\nof a proposed development can be met by the construction of new off-street\nparking spaces or the use of an existing off-street parking area located\non a single and separate parcel within 500 feet of the proposed development,\nthe Planning Board may approve a site plan requiring the present construction\nof a lesser number of spaces, provided that:[Added 2-13-1996 by L.L. No. 2-1996]"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "The applicant shall provide the Planning Board with\na parking plan for the separate parcel demonstrating the following:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "The proposed or existing off-site parking area\nshall comply in all respects with the provisions of this chapter."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "The proposed or existing off-site parking area\nmust be located and designed in such a manner as to provide safe and\nconvenient access to the proposed development."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "The existing use(s) on the separate parcel must\nbe adequately served, and the additional use of the parking area shall\nnot unduly impact the existing use of the premises."
																}
															]
														},
														{
															"number": "(d) ",
															"content": [
																{
																	"text": "To assure that new parking facilities are adequately designed, the Planning Board may require the parking plan to contain the elements of a site plan in accordance with § 330-183."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "A document is filed with the Suffolk County Clerk's\noffice, acceptable to the Town Attorney in form and content, to which\nthe Town of Southampton is a party, which provides legal access to\nthe off-site parking area for the patrons of the proposed development\nand assures that all applicable provisions of this section are adhered\nto."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "In all cases, at least 2/3 of the number of required\nparking spaces shall be provided on the proposed development site.\nThe Planning Board may order the property owner to install the future\nparking spaces if, at the Planning Board's discretion, the need for\nadditional spaces arises. For example, a mere change in the use(s),\nhours of operation or the ownership of the parcel may be enough to\nrequire the installation of the parking spaces. In the event that\nthe owner fails to install the additional parking spaces within 120\ndays of being so ordered, the Building Inspector shall revoke the\ncertificate of occupancy for the premises, and the Town Attorney may\ntake appropriate action in a court of competent jurisdiction to restrain\nthe use of said premises. When this subsection is utilized, the site\nplan shall contain a statement, signed by the applicant in such a\nform as shall be approved by the Town Attorney, consenting to the\nprovisions contained herein. In addition, the property owner shall\nbe required to submit a covenant, for filing in the Suffolk County\nClerk's office, in such a form as shall be approved by the Town Attorney,\nindicating consent to the provisions of this subsection."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "The Planning Board may use the provisions of this\nsubsection in combination with other applicable forms of relief found\nin this section."
												}
											]
										}
									]
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 330-101",
			"title": "Parking trust fund.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "There is hereby created a Town of Southampton Parking\nand Truck Loading Space Trust Fund to be used exclusively for public\noff-street parking and truck loading space purposes, including the\nacquisition and improvement of land for such purposes."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Every decision of the Planning Board or Board of Appeals under § 330-100B or D of this chapter waiving the requirements for off-street parking and/or truck loading spaces, in whole or in part, shall clearly set forth the nature and extent of such waiver by specifying the number of spaces required to be provided pursuant to said requirements, the number of spaces required to be provided by the respective Board and the number of spaces thus waived by the respective Board. The number of spaces so waived by the respective Board shall constitute the number of spaces for which a variance is granted."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Every decision which waives the requirements for off-street\nparking and/or truck loading spaces, in whole or in part, shall be\nmade subject to a condition requiring a payment to the Town of Southampton\nof a sum for each and every space for which a waiver is granted, which\nsum shall constitute a trust fund to be used exclusively for public\noff-street parking and truck loading space purposes, including the\nacquisition and improvement of land for such purposes. Such condition\nshall be deemed a condition of every such waiver, and such payment\nmay be referred to as the \"off-street parking space fee.\" Said fee\nshall be paid prior to the issuance of the certificate of occupancy\nand/or certificate of compliance for the use for which the waiver\nwas granted."
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "The amount of the per-space sum required to be paid\nto the Town for each and every space for which a waiver is granted\nshall be $2,000 per space."
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "The Planning Board may delineate boundaries for each\nhamlet area in the Town. Where the Planning Board makes such a delineation,\nthe Town Comptroller shall set up a separate fund for each hamlet\narea, and payments shall be deposited into the hamlet area fund from\nwhich the payments originated. Moneys from each hamlet area fund may\nonly be expended for public parking in the hamlet for which the fund\nwas created."
								}
							]
						},
						{
							"number": "F. ",
							"content": [
								{
									"text": "The provisions of this section shall only apply in\nthe VB and OD Districts."
								}
							]
						},
						{
							"number": "G. ",
							"content": [
								{
									"text": "The provisions of this section relating to a parking\nfee shall not be waived by the Planning Board or Zoning Board of Appeals."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 330-102",
			"title": "(Reserved)\n                                                                                          [1]",
			"content": [
				{
					"footnote": "[1]\nEditor's Note:Former § 330-102,\nCourts and spacing of buildings, was repealed 2-13-2007 by L.L. No.\n3-2007.\n"
				}
			]
		},
		{
			"paragraph": "§ 330-103",
			"title": "Corner clearance.",
			"content": [
				{
					"text": "On a corner lot in any district, except those\nin districts where there is no minimum lot area requirement, within\nthe triangular area determined as provided in this section, no wall\nor fence or other structure shall be erected to a height in excess\nof two feet; no vehicle, object or any other obstruction of a height\nin excess of two feet shall be parked or placed; and no hedge, shrub\nor other growth shall be maintained at a height in excess of two feet,\nexcept that trees whose branches are trimmed away to a height of at\nleast 10 feet above the curb level, or pavement level where there\nis no curb, shall be permitted. Such triangular area shall be determined\nby two points, one on each intersecting street line, each of which\npoints is 50 feet from the intersection of such street lines."
				}
			]
		},
		{
			"paragraph": "§ 330-104",
			"title": "Purpose of minimum and maximum floor area requirements.",
			"content": [
				{
					"text": "The requirements contained in this article are\ndesigned to promote and protect the public health, to prevent overcrowded\nliving conditions, to guard against the development of substandard\nneighborhoods, to conserve community character and established property\nvalues and contribute to the general welfare."
				}
			]
		},
		{
			"paragraph": "§ 330-105",
			"title": "Schedules of minimum and maximum floor area.",
			"content": [
				{
					"text": "Every dwelling or other building devoted in whole or in part to a residential use which is hereafter erected or converted to accommodate additional families shall provide a minimum floor area per family on floors with clear ceiling height of not less than seven feet six inches, in conformity with the following schedule and with the other provisions of §§ 330-104 through 330-108. In addition, any building devoted to a business or industrial use which is hereinafter erected or converted to accommodate such uses shall provide a minimum floor area in conformity with the following schedule. The minimum stipulated herein shall be deemed to be exclusive of unenclosed porches, breezeways, garage areas and basement and cellar rooms or areas."
				},
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "One-family dwellings:[Amended 4-10-2007 by L.L. No. 13-2007]"
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Two-family detached dwellings:"
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Three- and four-family dwellings:"
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "Apartment dwelling units, where permitted:"
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "Mobile homes, where permitted: 600 square feet."
								}
							]
						},
						{
							"number": "F. ",
							"content": [
								{
									"text": "Business or industrial building, first floor: 600\nsquare feet."
								}
							]
						},
						{
							"number": "G. ",
							"content": [
								{
									"text": "Floor area dimensions for nonresidential uses in the\nVB District:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Minimum: 500 square feet."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Maximum: 5,000 square feet per use. Uses containing\nbetween 5,000 square feet and 15,000 square feet may be permitted\nby special exception."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "No detached or attached building to serve either a\nsingle use or a combination of uses shall exceed 15,000 square feet\nin gross floor area."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "H. ",
							"content": [
								{
									"text": "Units for moderate-income families:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Single-family detached dwellings:"
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Two-family detached dwellings:"
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Apartments:"
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "I. ",
							"content": [
								{
									"text": "Accessory apartments created or made conforming under\nArticle IIA: 400 square feet."
								}
							]
						},
						{
							"number": "J. ",
							"content": [
								{
									"text": "The maximum total floor area for one- and two-family\ndetached dwellings, as permitted in all residential zoning districts,\nshall be 15,000 square feet. For the purposes of this subsection,\n“total floor area” shall be defined as the area of a dwelling\nmeasured from the outermost exterior walls of the dwellings structure.[Amended 2-10-2009 by L.L. No. 2-2009]"
								}
							]
						},
						{
							"number": "K. ",
							"content": [
								{
									"text": "The maximum gross floor area per building or building\ncomplex in the Highway Business Zoning District shall not exceed 15,000\nsquare feet per lot, except for the following uses which shall require\nspecial exception approval:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "The following residential community facilities which\nare permitted in the Highway Business District:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "Church or similar place of worship or religious\ninstruction, parish house, rectory, seminary or convent."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "Public library or museum."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "Fire station, municipal office or any governmental\nbuilding of similar character."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Agricultural greenhouses larger than 15,000 square\nfeet."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "The above special exception uses shall comply with the special exception standards set forth in § 330-129."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "L. ",
							"content": [
								{
									"text": "Floor area dimensions for buildings in the Shopping\nCenter Business Zone shall be limited to 15,000 square feet per building\nper lot. The Planning Board may grant a special exception permit,\nwhich allows buildings larger than 15,000 square feet for the following\nuses, and only the following uses:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Residential community facilities limited to the following:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "Church or similar place of worship or religious\ninstruction, parish house, rectory, seminary or convent."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "Park, playground or recreational area when authorized\nor operated by the municipality."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "Public library or museum."
																}
															]
														},
														{
															"number": "(d) ",
															"content": [
																{
																	"text": "Fire station, municipal office or any governmental\nbuilding of similar character."
																}
															]
														},
														{
															"number": "(e) ",
															"content": [
																{
																	"text": "School, elementary or high, public, denominational\nor private, operated or licensed by the New York State Education Department."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "General community facilities limited to the following;"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "Philanthropic, fraternal, social or educational\ninstitutional office or meeting room, nonprofit."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "Performing arts center."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Amusement and recreational business category:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "Other indoor recreation."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "Grocery stores. Grocery stores may only exceed 15,000\nsquare feet by special exception and in any case may not exceed 40,000\nsquare feet."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "M. ",
							"content": [
								{
									"text": "Specific special exception criteria as outlined in § 330-139 shall be used in addition to the general special exception criteria outlined in § 330-122 for buildings or building complexes in the Shopping Center Business Zone greater than 15,000 square feet."
								}
							]
						},
						{
							"number": "N. ",
							"content": [
								{
									"text": "Floor area dimensions for buildings in the Office\nDistrict Zone shall be limited to 15,000 square feet per building\nor building complex per lot. The Planning Board may grant a special\nexception permit for the following uses, and only the following uses:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Residential community facilities limited to the following:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "Church or similar place of worship or religious\ninstruction, parish house, rectory, seminary or convent."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "Nursery school or child day care."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "Park, playground or recreational area when authorized\nor operated by the municipality."
																}
															]
														},
														{
															"number": "(d) ",
															"content": [
																{
																	"text": "Public library or museum."
																}
															]
														},
														{
															"number": "(e) ",
															"content": [
																{
																	"text": "Fire station, municipal office or any governmental\nbuilding of similar character."
																}
															]
														},
														{
															"number": "(f) ",
															"content": [
																{
																	"text": "School, elementary or high, public, denominational\nor private, operated or licensed by the New York State Education Department."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "General community facilities limited to the following;"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "Nursery school or child day care."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "Philanthropic, fraternal, social or educational\ninstitutional office or meeting room, nonprofit."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "Performing arts center."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Office business category limited to the following:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "Civic, social and fraternal associations."
																}
															]
														}
													]
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "O. ",
							"content": [
								{
									"text": "Specific special exception criteria as outlined in § 330-138 shall be used in addition to the general special exception criteria outlined in § 330-122 for buildings or building complexes in the Office District Zone greater than 15,000 square feet."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 330-106",
			"title": "Least overall dimension of first-floor area of dwellings.",
			"content": [
				{
					"text": "The least overall dimension of any minimum required\nfirst-floor area of a dwelling, other than mobile homes where permitted,\nshall be 20 feet."
				}
			]
		},
		{
			"paragraph": "§ 330-107",
			"title": "Use of dwellings.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Dwellings and dwelling units shall only be utilized\nby families for residential purposes on a seasonal basis or for a\nlonger duration up to and including permanent residence, except as\notherwise permitted in this chapter."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "The use of dwellings and dwelling units for daily\nor weekly occupancy is hereby declared to be a transient occupancy\nand is prohibited."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Nothing contained in this section shall be construed\nas prohibiting the use of a dwelling unit in a resort motel on a weekly\nrental basis."
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "A single-family dwelling shall be designed and configured\nto be used as a one-family dwelling. All habitable space must be connected\nby a conditioned hallway or habitable space. Under no circumstances\nshall habitable space be connected through a mechanical room, laundry\nroom, storage room, or garage."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 330-108",
			"title": "Limitations on occupancy of dwellings and dwelling units.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "In dwelling units, the maximum number of occupants\nshall be determined on the basis of floor area of each conventional\nbedroom as follows:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Less than 70 square feet: zero."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "At least 70 but less than 120 square feet: one."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "One hundred twenty square feet or more: two."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Areas utilized for kitchenettes, bath, toilet, storage,\nutility space, closets and other service or maintenance space shall\nbe excluded."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 330-109",
			"title": "Fences, walls, accessory driveway structures, and clotheslines.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "In residence districts.[Amended 4-24-2001 by L.L. No. 15-2001; 11-13-2001 by L.L. No. 50-2001; 4-23-2002 by L.L. No. 9-2002; 2-11-2003 by L.L. No. 7-2003; 5-27-2003 by L.L. No. 44-2003]"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "No fence or wall in a required front yard shall have\na height greater than four feet."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "No fence or wall in a required rear or side yard shall\nhave a height greater than six feet."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "In no case shall any fence or wall have a height greater\nthan six feet."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "Any fence or wall having a height of four feet or\nless shall be exempt from building permit requirements, provided that\nit shall be constructed of standard materials used for such purposes."
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "All fences to be erected will have a finished side\nof the fence facing toward adjoining neighboring property(ies)."
												}
											]
										},
										{
											"number": "(6) ",
											"content": [
												{
													"text": "Corner lot fences and walls. Fences and walls on corner\nlots may be up to six feet high in required front yards that are opposite\nside yard lines only if:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "The fence is installed in that portion of the\nrequired front yard that lies between the nearest rear wall of the\ndwelling and the rear lot line."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "The fence is set back a minimum of five feet\nfrom the front lot line."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "Appropriate ornamental planting or a natural\nbuffer is provided in the form of plant material approved by:"
																},
																{
																	"content": [
																		{
																			"number": "[1] ",
																			"content": [
																				{
																					"text": "The Architectural Review Board pursuant to § 330-170B for a proposed fence that is not part of site plan review or subdivision approval."
																				}
																			]
																		},
																		{
																			"number": "[2] ",
																			"content": [
																				{
																					"text": "The Planning Board pursuant to § 292-8 for a proposed fence that is part of a subdivision application."
																				}
																			]
																		},
																		{
																			"number": "[3] ",
																			"content": [
																				{
																					"text": "The Planning Board pursuant to § 330-184 for a proposed fence that is part of a site plan application."
																				}
																			]
																		}
																	]
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(7) ",
											"content": [
												{
													"text": "Fences on through lots, as defined by this Code, may\nbe up to six feet high in the front yard that is not used as the primary\naccess to the dwelling only if:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "The fence is installed in that portion of the\nrequired front yard that lies between the nearest rear wall of the\ndwelling and the rear lot line."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "The fence is set back a minimum of five feet\nfrom the rear lot line."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "Appropriate ornamental planting or natural buffer\nis provided in the form of plant material approved by:"
																},
																{
																	"content": [
																		{
																			"number": "[1] ",
																			"content": [
																				{
																					"text": "The Architectural Review Board pursuant to § 330-170B for a proposed fence that is not part of site plan review or subdivision approval."
																				}
																			]
																		},
																		{
																			"number": "[2] ",
																			"content": [
																				{
																					"text": "The Planning Board pursuant to § 292-8 for a proposed fence that is part of a subdivision application."
																				}
																			]
																		},
																		{
																			"number": "[3] ",
																			"content": [
																				{
																					"text": "The Planning Board pursuant to § 330-184 for a proposed fence that is part of a site plan application."
																				}
																			]
																		}
																	]
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(8) ",
											"content": [
												{
													"text": "Accessory driveway structures, including but not limited to fences, gates, gatehouses, gateposts, bridges and pillars, are subject to the provisions of Chapter 330, Article XXX, Driveway Standards, of the Town Code.[Amended 7-28-2009 by L.L. No. 32-2009]"
												}
											]
										},
										{
											"number": "(9) ",
											"content": [
												{
													"text": "In\nthe case of a waterfront lot, with the exception of an oceanfront\nlot, where the rear lot line is a street right-of-way, a fence or\nwall with a height greater than four feet from natural grade is permitted\nonly if:[Added 7-13-2010 by L.L. No. 20-2010[1]]"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "The fence or wall is set back a minimum of five feet from the rear\nlot line; and"
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "Appropriate ornamental planting or natural buffer is provided in\nthe form of plant material approved by:"
																},
																{
																	"content": [
																		{
																			"number": "[1] ",
																			"content": [
																				{
																					"text": "The Architectural Review Board pursuant to § 330-170B for a proposed fence that is not part of site plan review or subdivision approval."
																				}
																			]
																		},
																		{
																			"number": "[2] ",
																			"content": [
																				{
																					"text": "The Planning Board pursuant to § 292-8 for a proposed fence that is part of a subdivision application."
																				}
																			]
																		},
																		{
																			"number": "[3] ",
																			"content": [
																				{
																					"text": "The Planning Board pursuant to § 330-184 for a proposed fence that is part of a site plan application."
																				}
																			]
																		}
																	]
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "Any fence or wall with a height greater than four feet from natural\ngrade, benefiting from a certificate of occupancy or certificate of\ncompliance issued prior to the adoption date of this amendment, shall\nbe considered a legally preexisting structure and, as such, may be\nreplaced, rehabilitated, or reconstructed."
																}
															]
														}
													]
												},
												{
													"footnote": "[1]\nEditor's Note: This local law also provided for the renumbering\nof former Subsection A(9) and (10) as Subsection A(10) and (11), respectively.\n"
												}
											]
										},
										{
											"number": "(10) ",
											"content": [
												{
													"text": "Any clothesline or clothes-hanging device shall\nbe exempt from building permit requirements, provided that it shall\nbe constructed of standard materials used for such purposes.[Amended 6-10-2008 by L.L. No. 36-2008]"
												}
											]
										},
										{
											"number": "(11) ",
											"content": [
												{
													"text": "Flagpole lot fences and walls."
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "Fences and walls on flagpole lots may be up\nto six feet high in the required front yards."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "No fence or wall installed along the pole portion\nof the lot shall have a height greater than four feet within a distance\nfrom the right-of-way equal to the required front yard setback."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "No fence or wall installed along the pole portion\nof the lot a distance greater than the required front yard setback\nfrom the right-of-way shall have a height greater than six feet."
																}
															]
														}
													]
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "In nonresidence districts.[Amended 3-11-2003 by L.L. No. 16-2003]"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "No fence or wall within 10 feet of a lot line in a\nrequired front or side yard shall have a height greater than six feet."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "No fence or wall within 10 feet of a lot line in a\nrequired rear yard shall have a height greater than 10 feet."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Accessory driveway structures, including but not limited to fencing, gates, gatehouses, gateposts, bridges and pillars, are subject to the provisions of Chapter 330, Article XXX, Driveway Standards, of the Town Code.[Added 7-28-2009 by L.L. No. 32-2009[2]]"
												},
												{
													"footnote": "[2]\nEditor's Note: This local law also provided for the renumbering\nof former Subsection B(3) as Subsection B(4).\n"
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "Garbage and waste containers. These are containers\nthat include dumpsters, garbage cans or other receptacles that store\ngarbage, combustible materials and noncombustible waste materials.\nThese containers shall be enclosed as follows:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "All containers shall have a cover which can\nbe secured to the container."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "All containers shall be enclosed on three sides\nby a solid fence, and on the fourth side with a solid gate. The width\nof each side and gate shall exceed the width of the containers by\na minimum of one foot on each side. The gate and each side shall exceed\nthe height of the containers by a minimum of one foot."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "All containers shall be located in the rear\nor side yard and shall not obstruct access to utilities."
																}
															]
														},
														{
															"number": "(d) ",
															"content": [
																{
																	"text": "Existing containers within nonresidential districts shall be in compliance with these enclosure requirements within one year of the effective date of § 330-109B(4)."
																}
															]
														}
													]
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Method of measuring the height of a fence or wall. The height of a fence or wall shall be measured from the ground level at the base of the fence, except that, where there is a retaining wall, the height shall be measured from the average of the ground levels at each side of the retaining wall and further except that any fence or wall on the uphill side of such retaining wall may be at least four feet high, notwithstanding the provisions of Subsections A and B."
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "Electrical fences. The use of any fence which delivers\nan electric shock, charge or current to any animal or human being\nwhen contact is made shall be strictly prohibited in all zones, unless\nauthorized by the Planning Board.[Added 6-26-1996 by L.L. No. 17-1996]"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "No Planning Board approval is necessary for an electrical\nfence where the use of the premises is for the keeping of livestock,\nincluding horses."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "All electrical fences authorized by the Planning Board or allowed under Subsection D(1) above shall require a permit from the Building Inspector."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "No electrical fence shall place the safety of residents\nin jeopardy, and conspicuous notices shall be affixed to the fence\nto warn of the potential for electric shock."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "Underground electrical dog fences shall not require\nPlanning Board approval or a permit from the Building Inspector."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "Agricultural fencing.[Added 3-25-1997 by L.L. No. 8-1997]"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Within all Country Residential (CR) and Residential\n(R) Zoning Districts situated within the Agricultural Overlay District,\nthe Planning Board may approve an increase in the permitted height\nof a fence located in any front, side or rear yard in order to protect\nagricultural crops from damage due to deer. The maximum height of\nan agricultural fence approved by the Planning Board may not exceed\neight feet."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "The increase in permitted fence height shall be based\non the following findings of the Planning Board:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "The subject property is currently in agricultural\nproduction."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "The applicant can demonstrate that an economic\nloss will occur to agricultural crops without an increase in fencing\nheight."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "Alternatives to fencing that will reduce the\neconomic loss of agricultural crops have been investigated."
																}
															]
														},
														{
															"number": "(d) ",
															"content": [
																{
																	"text": "Alternative types and heights of fencing materials\nhave been investigated."
																}
															]
														},
														{
															"number": "(e) ",
															"content": [
																{
																	"text": "The installation of the fencing will be accomplished\nin a manner to preserve and protect the visual and scenic resources\nof the Town."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "An application to install agricultural fencing that\nexceeds the permitted height shall be in the form of a building permit\napplication submitted to the Town's Building Inspector. The application\nshall include a plan of the property accurately showing the delineation\nof the proposed fence and a description of the proposed fence materials.\nThe Building Inspector shall submit a complete application to the\nPlanning Board. The Planning Board shall approve, approve with conditions\nor deny the application. In reviewing applications for agricultural\nfencing, the Planning Board may seek an advisory report from the Agricultural\nAdvisory Committee."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "An application for agricultural fencing on preserved farmland shall be submitted to the Farmland Committee in accordance with Article X, Agricultural Overlay District."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "F. ",
							"content": [
								{
									"text": "Public\ngarden fencing.[Added 7-14-2015 by L.L.\nNo. 19-2015]"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Within\nall zoning districts, the Planning Board may approve an increase in\nthe permitted height of a fence located in any yard in order to protect\nsubject gardens from damage due to deer, subject to the following:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "The maximum height of the fence may not exceed eight feet."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "Visibility (open space) must be provided through said fence equaling\na minimum of 40% of the area."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "The subject public garden meets the definition pursuant to § 330-5."
																}
															]
														},
														{
															"number": "(d) ",
															"content": [
																{
																	"text": "The fence shall be located landward of any existing buffer area or transition yard required pursuant to § 330-83G, but in no case less than 20 feet from any public right-of-way."
																}
															]
														},
														{
															"number": "(e) ",
															"content": [
																{
																	"text": "The installation of the fencing will be accomplished in a manner\nto preserve and protect the visual and scenic resources of the Town,\nwhich may include appropriate ornamental planting or natural buffer\nprovided in order to screen the subject fence from the public right-of-way."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "An application for public garden fencing shall be submitted to the Planning Board and shall include a landscape plan as may be necessary to illustrate compliance with § 330-109F(1) above."
												}
											]
										}
									]
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 330-110",
			"title": "Berms.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "All berms shall be constructed so that all sides of the berm shall not have a slope greater than one to three feet. For the purposes of §§ 330-110 through 330-112, the slope shall refer to the ratio of a vertical rise of one foot to a horizontal run of three feet."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "All berms shall be constructed out of clean fill or\nan approved equal. Said fill shall be given sufficient time to settle\nbefore final shaping and topsoil are applied. After the settled fill\nhas been shaped, a uniform six-inch layer of approved horticultural\ntopsoil shall be placed and fine graded."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "All berms shall be properly vegetated and landscaped,\nas approved by the Planning Board, before any erosion occurs in the\ntopsoil on the berm or, in the alternative, the berm shall be covered\nwith an approved ground cover until such time the berm can be properly\nlandscaped."
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "Berms shall be constructed only during the period\nfrom March 1 through October 15."
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "The construction of a berm shall not violate Chapter 287, Article III, of this Code."
								}
							]
						},
						{
							"number": "F. ",
							"content": [
								{
									"text": "No fence or wall shall be constructed on a berm. However,\na retaining wall may be placed on the sides of a berm where the Planning\nBoard finds said retaining wall will promote aesthetic considerations\nand the height of the same does not exceed the grade of the berm."
								}
							]
						},
						{
							"number": "G. ",
							"content": [
								{
									"text": "The construction of berms and the berm itself shall\nnot interfere with the natural drainage."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 330-111",
			"title": "Berm height.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "In all residence districts, no berm shall have a height\ngreater than four feet in a front yard or six feet in a rear or side\nyard."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "In all nonresidence districts, no berm shall have\na height greater than six feet in a front, rear or side yard."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Notwithstanding the provisions of Subsections A and B of this section, where the proposed berm is along a highway, as that term is defined in § 292-3 of this Code, the Planning Board may increase the height limitations of this section, where it would be in the public interest, by limiting adverse impacts from noise or light or by promoting aesthetic considerations. However, in no case shall a berm along a highway exceed 10 feet."
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "The height of a berm shall be the vertical distance\nfrom the top of the berm to the natural existing grade at the base\nof the berm."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 330-112",
			"title": "Permit required for construction of berms.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "All berms, except those required to be constructed\nin connection with the Planning Board's approval of a subdivision\nplat or site plan, which exceed four feet in height shall require\na building permit."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "All applications for a building permit for a berm\nshall include the following:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "A detailed grading plan of the entire site, indicating\nthe existing topography in contour intervals no greater than five\nfeet and the proposed topography in contour intervals no greater than\ntwo feet. The scale of the grading plan shall be no greater than one\ninch equals 20 feet;"
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "A cross section of the berm indicating the type of\nmaterials to be used in constructing the berm (i.e., fill, topsoil)\nand the location of landscaping. The scale of cross section shall\nbe no greater than one inch equals four feet; and"
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "A detailed landscaping plan indicating the location,\nsize and quality of the species to be planted."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "All applications for a building permits for a berm\nshall be referred to the Planning Board for its approval with respect\nto the compatibility of the berm with the surrounding properties and\nassociated land uses, drainage considerations and landscaping."
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "Within 15 working days of receipt of an application,\nthe Planning Board shall approve, approve with modifications or deny\nthe application."
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "The Building Inspector shall not issue a permit for\na berm until Planning Board approval has been received. Failure of\nthe Planning Board to act within 15 working days shall be deemed an\napproval."
								}
							]
						},
						{
							"number": "F. ",
							"content": [
								{
									"text": "All provisions of this Code relating to the building permits and construction shall apply to building permits for berms, except as provided in §§ 330-110 through 330-112."
								}
							]
						}
					]
				}
			]
		}
	]
}