{
	"url": "http://ecode360.com/8700476",
	"paras": [
		{
			"paragraph": "§ 330-6",
			"title": "General regulations.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Within any residence district, a building, structure, lot or land shall be used only for one of the uses indicated in § 330-10, Residence Districts Table of Use Regulations,[1] for the specific district in which it is located on the\nZoning Map[2] and in accordance with the particular classification of that use in that district. In the case of a lot or land being utilized for the construction or erection of a single-family detached dwelling, the definition of \"lot\" in § 330-5 shall apply. Further, any such building, structure, lot or land shall only be utilized in conformance with the provisions of § 330-11, Residence Districts Table of Dimensional Regulations.[3] In addition, such uses shall also comply with all other\napplicable provisions of this chapter."
								},
								{
									"footnote": "[1]\nEditor's Note: The Residence Districts Table of Use Regulations is included at the end of this chapter.\n[2]\nEditor's Note: The Zoning Map is on file in\nthe office of the Town Clerk.\n[3]\nEditor's Note: The Residence Districts Table of Dimensional Regulations is included at the end of this chapter.\n"
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Multiple dwellings in MF-44, SC-44 and MFPRD Zones.[Amended 6-13-1989 by L.L. No. 13-1989]"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "No more than eight dwelling units shall be permitted in any building which is a multiple dwelling constructed after the effective date of this subsection. This restriction shall not apply to a building or group of buildings converted to a residential condominium or residential cooperative in compliance with other provisions of this chapter. No more than 12 dwelling units shall be permitted in any building erected or converted under the provisions of § 330-8 for senior citizens as herein defined."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "No dwelling unit in a multiple dwelling shall be located\nbelow the first story or above the second story."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Any building that contains four, five, or six dwelling\nunits shall be equipped with an automatic fire sprinkler system in\naccordance with National Fire Protection Association (NFPA) 13D Standards.[Added 9-11-2007 by L.L. No. 45-2007]"
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "Any building that contains seven or more dwelling\nunits shall be equipped with an automatic fire sprinkler system in\naccordance with National Fire Protection Association (NFPA) 13R Standards.[Added 9-11-2007 by L.L. No. 45-2007]"
												}
											]
										}
									]
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 330-7",
			"title": "Transfer of permitted residential development rights.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "These provisions are enacted to implement the Comprehensive\nPlan of the Town of Southampton and the Central Pine Barrens Comprehensive\nLand Use Plan adopted by the Town Board on June 27, 1995, adopted\nby the Central Pine Barrens Joint Planning and Policy Commission on\nJune 28, 1995, and signed by the Governor of the State of New York\non June 28, 1995, pursuant to the provisions of Article 57 of the\nNew York State Environmental Conservation Law, by providing the means\nof achieving elements of the community planning objectives with reference\nto natural resources, population, utilities and housing and, more\nparticularly to do so while maintaining the overall ratio established\nbetween population capacity at ultimate community development and\nthe safe yield of the fresh groundwater reservoir within the Town\nof Southampton's territorial limits. Further, land from which the\ndevelopment rights are to be transferred must have such characteristics\nthat their permanent open space preservation will fulfill one of the\nfollowing objectives:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Porous moraine soils, found in the CR-200, CR-120,\nCR-80, R-120 and R-80 Districts, will be retained for the purpose\nof maximizing groundwater recharge while lessening potential pollution\nof these groundwaters by individual sewage disposal systems."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Soils found in the Agricultural Overlay District and\nconforming to United States Soil Conservation Service capability Classes\nI and II will be retained for permanent agricultural use."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Wetlands, as defined in the Town Code, and their immediate\nupland environments will be retained for their ecological benefits\nand held in permanent open space use."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "Lands found in an area designated by the Comprehensive\nPlan for a greenbelt park system or for an individual park, beach\nor public recreation area, which will be retained for such open space\nuse."
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "Lands located with the core preservation area of the Central Pine Barrens Overlay District established under Article XXIV of this chapter."
												}
											]
										},
										{
											"number": "(6) ",
											"content": [
												{
													"text": "In the event that not all of the land from which the\ndevelopment rights are to be transferred is to be in a state of permanent\nopen space preservation or it does not fulfill one of the above objectives,\nthen at least 1/2 of the development rights to be transferred, or\nthe remainder, shall be for residential units for moderate-income\nfamilies."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "In pursuit of these purposes, the Town Board of the\nTown of Southampton may from time to time authorize by local law the\ntransfer of permitted residential development rights from one parcel\nof land to another parcel of land within the same school district\nwhere such authorization shall be found to be beneficial to the Town\nthrough serving to implement the Comprehensive Plan and to be in accordance\nwith the provisions of this section."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Procedure."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "An applicant for the transfer of permitted residential\ndevelopment rights shall present documentation satisfactory to the\nTown Board, indicating:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "The location, land area and related residential\ndevelopment rights permitted under the applicable provisions of this\nchapter which the applicant proposes to transfer."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "The location and land area of the site to which\nsuch rights are to be transferred, the projected total number of dwelling\nunits that would result on the site from such a transfer and a statement\nof the character of the projected housing development."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "A presentation as to the reasonable and beneficial\nresults anticipated from the authorization applied for with respect\nto the implementation of the Comprehensive Plan."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "If the Town Board decides to consider the applicant's proposal, it shall proceed in the same manner as provided in § 330-185 for amending this chapter, except that the fee for such application shall be $250."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "The Planning Board report to the Town Board shall\nconsider all aspects of the proposal, particularly that of the degree\nto which the proposal implements the Comprehensive Plan."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "Upon favorable review by the Town Board, such an application\nshall be approved subject to completion of the following actions:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "Approval by the Planning Board of a detailed\nsite development plan for the property to which the development rights\nare to be transferred and a recommendation with regard to the disposition\nof the property from whence the development rights were transferred."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "Execution of an instrument legally sufficient\nboth in form and content to effect such transfer and the transmittal\nof the fee title for the property from which the development rights\nare to be transferred to the Town of Southampton or such other governmental\nagency as the Town shall designate for use as permanent open space.\nWhere development rights remain, said instrument shall specify that\nno additional development rights shall accrue to said property upon\nthe transfer."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "Filing copies of the executed legal instrument\nin the office of the Town Clerk, the Planning Board, the Building\nInspector and with the County Clerk as a notice of such transfer incorporated\nin the deeds of each property affected by the transfer. Such instrument\nshall specifically set forth the rights transferred and the resultant\ntotal residential development rights in each property."
																}
															]
														},
														{
															"number": "(d) ",
															"content": [
																{
																	"text": "Such other requirements as the Town Board shall\nestablish."
																}
															]
														}
													]
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "General standards."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Districts in which an increase in the number of dwelling units may be permitted shall be restricted to those listed hereinafter, and for each district specified, the number of dwelling units shall not exceed the following, unless a greater density is authorized by the Town Board in connection with the establishment of a Planned Development District (PDD) under Article XXV of this chapter:"
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Where development rights are transferred to the R-20\nDistrict, the Tables of Use and Dimensional Regulations for the MF-44\nDistrict[1] shall apply, unless different dimensional requirements are authorized by the Town Board in connection with the establishment of a Planned Development District (PDD) under Article XXV of this chapter."
												},
												{
													"footnote": "[1]\nEditor's Note: Said tables are included at\nthe end of this chapter.\n"
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Development rights may be transferred within the CR-200 Zone and may be transferred out of said zone; however, nothing contained herein shall be deemed to permit transfer of development rights into the CR-200 District from any other residential zones, unless authorized by the Town Board in connection with the establishment of a Planned Development District (PDD) under Article XXV of this chapter. The resultant density on the parcel within the CR-200 Zone to which rights are transferred shall not exceed the number of dwellings which would be permitted by the standard dimensional requirements in the CR-120 Zone, unless a greater density is authorized by the Town Board in connection with the establishment of a Planned Development District (PDD) under Article XXV of this chapter."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "Development rights may be transferred within the Central Pine Barrens Overlay District, the Aquifer Protection Overlay District, the Agricultural Overlay District and the Tidal Wetlands and Ocean Beach Overlay District and may be transferred out of said districts, the above being subject to the restrictions applicable to the respective zoning district as set forth in this article. However, nothing contained herein shall be deemed to permit the transfer of development rights into any of the aforementioned overlay districts, unless authorized by the Town Board in connection with the establishment of a Planned Development District (PDD) under Article XXV of this chapter."
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "The site to which the transfer of development rights\nis proposed shall be no less than five acres in the R-120, R-80, R-60,\nR-40, R-20, CR-200, CR-120, CR-80, CR-60 and CR-40 Districts."
												}
											]
										},
										{
											"number": "(6) ",
											"content": [
												{
													"text": "All yard requirements of the more restrictive district found along the perimeter of the site shall apply to perimeter yards on the site to which the transfer of development rights is proposed, unless different dimensional requirements are authorized by the Town Board in connection with the establishment of a Planned Development District (PDD) under Article XXV of this chapter."
												}
											]
										},
										{
											"number": "(7) ",
											"content": [
												{
													"text": "Nothing in this article shall abrogate the requirements\nof other codes and regulations, including the Town of Southampton\nSubdivision Regulations, when they are applicable.[2]"
												},
												{
													"footnote": "[2]\nEditor's Note: See Ch. 292, Subdivision of Land.\n"
												}
											]
										}
									]
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 330-8",
			"title": "Increased residential density to establish low- and lower-middle-income housing inventory.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Since there is a limited supply of standard housing\navailable at purchase prices or rentals commensurate with the incomes\nof low- or lower-middle-income residents in the Southampton community,\nthese provisions are enacted to implement the Town of Southampton\nMaster Plan of 1970 community planning objectives with reference to\nencouraging a wide variety of housing types and, more particularly,\nto help make possible purchase and rental costs in keeping with the\nfinancial means of the Town's residents who have low or lower-middle\nincomes."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "In pursuit of this purpose, the Town Board of the\nTown of Southampton may from time to time authorize by local law an\nincrease in residential development density where it shall be found\nthat a bona fide nonprofit corporation guarantees to develop and maintain\nthe resultant housing at a purchase price or rental cost within the\nlow- or lower-middle-income housing market in accordance with a contractual\nagreement between said nonprofit corporation and the Town and further,\nthat such authorization shall be found to be beneficial to the Town\nthrough serving to implement the Master Plan of 1970."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Procedure."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "An applicant for increased residential development\ndensity under this section shall present documentation satisfactory\nto the Town Board, indicating:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "The location, land area, proposed residential\ndensity and general development concept and physical characteristics\nof the development."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "The organizational characteristics, legal basis\nand financial status of the nonprofit corporation sponsoring the proposed\nhousing."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "The projected development costs, the resultant\ncapital and operating costs, the detailed elements of the purchase\nprice or rental costs to be charged and the proposed income limitations\nto be placed on owners or tenants."
																}
															]
														},
														{
															"number": "(d) ",
															"content": [
																{
																	"text": "The details of any program whereby such owners\nor tenants may acquire equity in housing without changing the future\nmarket value of the proposed housing units and any proposals to overcome\neconomic hardship for those eventually moving out of the proposed\nnonprofit housing."
																}
															]
														},
														{
															"number": "(e) ",
															"content": [
																{
																	"text": "The instrument or instruments by which the objectives\nof this program are to be guided and enforced legally."
																}
															]
														},
														{
															"number": "(f) ",
															"content": [
																{
																	"text": "A presentation as to the reasonable and beneficial\nresults anticipated from the authorization applied for with respect\nto the implementation of the Master Plan of 1970."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "If the Town Board decides to consider the applicant's proposal, it shall proceed in the same manner as provided in §330-185 for amending this chapter. A fee schedule shall be established, as needed, by resolution of the Southampton Town Board. A copy of the fee schedule is on file with the Town Clerk’s office and the Department of Land Management.[Amended 11-10-2009 by L.L. No. 46-2009]"
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "The Planning Board report to the Town Board shall\nconsider all aspects of the proposal, particularly that of the degree\nto which the proposal implements the Master Plan of 1970."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "Upon favorable review by the Town Board, such an application\nshall be approved subject to completion of the following actions:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "Approval by the Planning Board of a detailed\nsite development plan for the property."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "Execution of an instrument legally sufficient\nboth in form and content to effect the purposes of these provisions."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "Filing copies of the executed legal instrument\nin the office of the Municipal Clerk, the Planning Board, the Building\nInspector and with the County Clerk as a notice of such instrument\nincorporated in the deeds of each property affected by the instrument.\nSuch instrument shall be specific as to the right of the Town of Southampton\nto enforce its provisions with reference to owner or tenant incomes\nand the nonprofit character of the project."
																}
															]
														},
														{
															"number": "(d) ",
															"content": [
																{
																	"text": "Such other requirements as the Town Board shall\nestablish."
																}
															]
														}
													]
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "General standards."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "The resultant number of dwelling units per gross acre\nof land on the development site shall not exceed 12 units. In all\nother respects, the provisions of the Tables of Use and Dimensional\nRegulations for the MF-44 District shall apply.[1]"
												},
												{
													"footnote": "[1]\nEditor's Note: See the Residence Districts Table of Use Regulations and the Residence Districts Table of Dimensional Regulations included at the end of this chapter.\n"
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Nothing contained in this article shall abrogate the\nrequirements of other codes and regulations, including the Town of\nSouthampton subdivision regulations,[2] where they are applicable. However, nothing in this article\nshall preclude the use of prefabricated housing units where the construction\nquality of such units is officially approved under the New York State\nBuilding Code."
												},
												{
													"footnote": "[2]\nEditor's Note: See Ch. 292, Subdivision of Land.\n"
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "The site plan review fee provided in § 330-183B shall be waived where the applicant is a bona fide nonprofit corporation which provides the guaranty described in § 330-8B.[Added 10-10-1989 by L.L. No. 21-1989]"
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "The building permit fees provided in § 123-12 of the Building Construction Code of the Town of Southampton shall be waived where the applicant is a bona fide nonprofit corporation which provides the guaranty described in § 330-8B.[Added 6-9-1998 by L.L. No. 14-1998]"
												}
											]
										}
									]
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 330-9",
			"title": "Density incentive provisions.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Purpose. In accordance with the provisions of Town Law §§ 261-a and 261-b, this section authorizes the Planning Board or, in the instance of carriage houses, the Chief Building Inspector, upon consultation with the Town's Planning and Development Administrator, to increase density on certain parcels as receiving sites for development rights or Pine Barrens Credits (PBC) pursuant to Articles X and XXIV of this chapter or to increase residential density if the project proposes the construction of community benefit units as that term is defined in Chapter 216 of this Code. In connection with the transfer of development rights or PBCs, the Planning Board and, where appropriate, the Chief Building Inspector are further authorized to consider and modify the dimensional regulations of this Code without the necessity of Town Board review and approval."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Zoning district eligibility. The following residential\nand nonresidential zoning districts are eligible to utilize the density\nincentive provisions of this section if they comply with the minimum\nacreage requirements as set forth herein:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Residential districts."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Nonresidential districts.[Amended 5-24-2016 by L.L. No. 9-2016]"
												},
												{
													"text": "(HB) Highway Business"
												},
												{
													"text": "(OD) Office District"
												},
												{
													"text": "(VB) Village Business"
												},
												{
													"text": "(SCB) Shopping Center Business"
												},
												{
													"text": "(LI-40, LI-200) Light Industrial"
												},
												{
													"text": "(HO) Hamlet Office/Residential"
												},
												{
													"text": "(HC) Hamlet Commercial/ Residential"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "In the case of\na transfer of development rights or PBCs, wherein the Planning Board\nmay increase lot yield, lot coverage, floor area, height or building\nmass, said Board is authorized to do so in nonresidential districts\npursuant to the following criteria:"
																},
																{
																	"content": [
																		{
																			"number": "(i) ",
																			"content": [
																				{
																					"text": "At least one development right or PBC is transferred\nto the site;"
																				},
																				{
																					"text": ""
																				}
																			]
																		},
																		{
																			"number": "(ii) ",
																			"content": [
																				{
																					"text": "The lot to receive the density incentive has a minimum lot area of\none acre;"
																				}
																			]
																		},
																		{
																			"number": "(iii) ",
																			"content": [
																				{
																					"text": "The total yield shall be the sum of the yield for the receiving parcel plus the equivalent value of the transfer of development rights or PBCs as set forth in Chapter 244;"
																				}
																			]
																		},
																		{
																			"number": "(iv) ",
																			"content": [
																				{
																					"text": "Each development right or PBC shall be equivalent to a sewage water\nflow rate of 300 gallons per acre per day as described in the Suffolk\nCounty Department of Health Services standards and/or up to a two-percent\nincrease in building coverage, floor area, height or building mass.\nA total increase in building coverage, floor area or height exceeding\n10% of the maximum for the zone shall not be permitted;"
																				}
																			]
																		},
																		{
																			"number": "(v) ",
																			"content": [
																				{
																					"text": "The site requirements for water supply and sewage disposal shall\nbe approved by the Suffolk County Department of Health Services; and"
																				}
																			]
																		},
																		{
																			"number": "(vi) ",
																			"content": [
																				{
																					"text": "A written application shall be submitted to the Planning Board in compliance with the site plan and hearing requirements as stated in §§ 330-182 through 330-184."
																				}
																			]
																		}
																	]
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Density incentives shall not be authorized on lands\nwithin the Core Preservation Area of the Central Pine Barrens Overlay\nDistrict or the Tidal Wetlands and Ocean Beach Overlay District.[Amended 12-11-2012 by L.L. No. 16-2012]"
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "General standards. All density incentives shall meet\nand be subject to the following general standards."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "In the case of transferring either development rights or pine barrens credits to the site, each development right or PBC so transferred shall authorize the Planning Board or the Chief Building Inspector under Subsection D(4) to increase the allowable density by one lot or unit, provided the development right or PBC originated in the Town of Southampton and the same school district, with the following exceptions:"
												},
												{
													"content": [
														{
															"number": "a. ",
															"content": [
																{
																	"text": "The\ntransfer is to a commercial property for purposes of providing additional\nsewage credits; or"
																}
															]
														},
														{
															"number": "b. ",
															"content": [
																{
																	"text": "The\ntransfer is out of the Town of Southampton to a site in another town."
																}
															]
														}
													]
												},
												{
													"text": "The Planning Board or Chief Building Inspector\nunder Subsection (D)4 is authorized to transfer development rights\nor PBCs from one side of the Shinnecock Canal to the other within\nthe same school district."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "In consideration of subdivisions, the Planning Board\nmay authorize a maximum density increase of 30% where development\nrights or PBCs are used. Notwithstanding, where the permitted yield\nis three lots or less, the Planning Board may authorize one additional\nbuilding lot, provided that a full development right or PBC is transferred\nto the site. Each additional development right or PBC transferred\nto the site shall allow one additional lot or dwelling unit. In addition,\nthe Planning Board may authorize a maximum density increase of up\nto 50% of the as-of-right yield for community benefit units."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Density incentives may be authorized where the Planning Board or the Chief Building Inspector under Subsection D(4) determines, after consultation with the Town's Planning and Development Administrator, that the development will be beneficial, compatible and harmonious with the surrounding land uses and will not adversely affect the environment or any special assessment district in which the subject parcel is located, and density incentives shall be consistent with the recommendations of the Town of Southampton Comprehensive Plan."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "The Planning Board and the Chief Building Inspector under Subsection D(4), of this section, may modify the dimensional regulations of the zoning district to permit increased density in accordance with the specific standards listed hereunder. Nothing herein shall be construed to limit the existing authority of the Planning Board or the Chief Building Inspector under Subsection D(4) of this section to control the design of subdivisions or site plans."
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "The Planning Board and the Chief Building Inspector under Subsection D(4) shall each have the authority to require the applicant or owner to submit the documentation required under this chapter, Chapter 244 or elsewhere to foster the transfer or redemption of development rights or PBCs."
												}
											]
										},
										{
											"number": "(6) ",
											"content": [
												{
													"text": "The Planning Board or the Chief Building Inspector under Subsection D(4), upon consultation with the Town's Planning and Development Administrator, may require the applicant or owner to execute such agreements and covenants as may be necessary to implement the purposes of this chapter or other applicable law. Said agreements or covenants shall be recorded in the Office of the Suffolk County Clerk and shall constitute a covenant running with the land. Such covenant or agreement may be modified or released only as set forth in said covenant or agreement or by a simple majority vote of the Town Board."
												}
											]
										},
										{
											"number": "(7) ",
											"content": [
												{
													"text": "Any proposals seeking to utilize the density incentives\nset forth herein shall be in writing and accompany the subdivision\nor site plan application to the Planning Board or, in the instance\nof a carriage house, shall be to the Chief Building Inspector and\naccompany the building permit application."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "Specific standards."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Increased subdivision yield utilizing the affordable housing incentive. In addition to meeting the general standards as listed in § 330-9C above, where the density incentive is sought in connection with the project's proposal to build affordable housing, at least 40% of the additional dwelling units shall be community benefit units, as defined by Chapter 216. In its determination of such an application, the Planning Board shall consider the following in consultation with the Department of Land Management:[Amended 8-12-2008 by L.L. No. 47-2008]"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "The need for affordable housing in the particular\nhamlet;"
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "Whether the applicant\nhas demonstrated:"
																},
																{
																	"content": [
																		{
																			"number": "i. ",
																			"content": [
																				{
																					"text": "The appropriateness of the proposed site;"
																				}
																			]
																		},
																		{
																			"number": "ii. ",
																			"content": [
																				{
																					"text": "The environmental suitability of the site; and"
																				}
																			]
																		},
																		{
																			"number": "iii. ",
																			"content": [
																				{
																					"text": "That the density incentive subdivision plan\nprotects community character."
																				}
																			]
																		}
																	]
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "The adequacy of applicable public resources\npursuant to Town Law."
																}
															]
														},
														{
															"number": "(d) ",
															"content": [
																{
																	"text": "Consistency with\nthe Town of Southampton's affordable housing goals as set forth in\nthe Comprehensive Plan. In conformance with the Comprehensive Plan,\nthe Planning Board shall encourage placement of affordable housing\nwhere it is most scarce. The Planning Board may only authorize a density\nincentive after it makes findings that:"
																},
																{
																	"content": [
																		{
																			"number": "i. ",
																			"content": [
																				{
																					"text": "The density incentive does not result in an\nadverse impact on the affected school district or other special assessment\ndistrict; or"
																				}
																			]
																		},
																		{
																			"number": "ii. ",
																			"content": [
																				{
																					"text": "The Planning Board authorizes, by resolution,\na waiver that states the proposed development implements or furthers\nother objectives of the Town of Southampton Comprehensive Plan, including\nupgrading existing affordable housing stock and revitalization of\nexisting dwellings in blighted areas."
																				}
																			]
																		}
																	]
																}
															]
														},
														{
															"number": "(e) ",
															"content": [
																{
																	"text": "Density incentive for affordable housing shall\nonly be authorized in those hamlets where the population density is\nequal to or less than 500 persons per square mile, exclusive of land\nowned by the state, county or Town as open space or park land. The\nDecennial Federal Census shall be the source of the population numbers."
																}
															]
														},
														{
															"number": "(f) ",
															"content": [
																{
																	"text": "Eligibility. The Planning Board shall insure affordable housing projects are subject to the eligibility, resale and sustainable affordability restrictions consistent with Chapter 216 and § 330-11.1 of this chapter, as applicable. The Planning Board may waive certain provisions of the eligibility priority for set-aside dwellings and dwelling units where federal or state subsidies are being utilized by the developer to reduce the purchase price to qualified first-time home buyers, provided it is demonstrated that said subsidy precludes the specified eligibility preference, upon the advice of the Department of Land Management."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Increased subdivision yield utilizing the transfer of development rights or pine barrens credits incentive. In addition to meeting the general standards of § 330-9C, the Planning Board may increase the density for subdivision yield using the following standards:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "A maximum increase of 30% may be authorized when development rights or PBCs are transferred to the site as authorized under Chapters 292 and 244 of the Town Code, where requirements of this section are complied with. Notwithstanding the foregoing, where the permitted yield is three lots or less, the Planning Board may authorize one additional building lot, provided that at least one development right or PBC is transferred to the site and where all other requirements of this section are complied with."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "The site on which the density incentive for\nincreased subdivision yield is to be authorized shall be no less than\n10 acres in the CR-200 Zone and no less than six acres in the CR-120,\nCR-80, CR-60, R-120, R-80 and R-60, CR-40, R-40 and R-20 Zones."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "When additional density is authorized, the dimensional requirements shall be determined by the Planning Board and indicated on the approved plan and shall not be less restrictive than those required in the R-15 Residential Zone when subdividing land in all other zones greater than R-20. However, nothing herein shall limit the provisions of Chapter 247, Open Space."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Subdivision into two undersized lots. The Planning Board may only authorize the subdivision of a single parcel of land into two nonconforming lots provided that at least one development right or PBC is transferred to the site. Further, in addition to meeting all the general standards set forth in § 330-9C above, the Planning Board must find that such density incentive meets the following standards:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "A minimum of five acres shall be required to\nseek a density incentive to establish two nonconforming lots in the\nCR-200 Zone and three acres in the CR-120 and R-120 Zones. In all\nother eligible zones, the site shall not be less than 1 1/2 times\nthe minimum lot size of the zoning district."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "The dimensional requirements shall be established by the Planning Board, delineated on the approved plan, and shall not be less restrictive than those required in the R-15 Residential Zone for subdivision of land in the R-20 Residential Zone or the R-20 Residential Zone for the subdivision of land in the R-40 or CR-40 Zones, and the R-40 Residential Zone for the subdivision of land in all other zones higher than R-40. However, nothing herein shall limit the use of Chapter 247, Open Space, on said lands, provided that all the provisions of that chapter are met."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "The Planning Board shall conduct at least one public hearing on the application, and the application shall comply with all preapplication, submission and notice requirements consistent with Chapter 292 and § 330-164I(1)."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "Carriage houses. The Chief Building Inspector may only authorize a density incentive for two dwellings on one lot (one principal and one accessory dwelling on one lot) where one or more development right or PBC is transferred to the site. The development right or PBC transfer shall not be required when one of the two dwellings is a designated Town landmark, pursuant to Town Code § 330-321, and the Town Board has determined to extinguish a Town-owned development right in favor of the application. Further, in addition to the general standards listed in § 330-9C above, the Chief Building Inspector shall determine that such development (carriage house) meets the following criteria:[Amended 6-24-2014 by L.L. No. 20-2014]"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "The minimum lot area required for the addition\nof a carriage house shall be three acres in the CR-200, CR-120 and\nR-120 Zones and not less than 1 1/2 times the minimum lot size\nof the zoning district in all other eligible zones."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "The principal dwelling shall comply with all\napplicable dimensional requirements of the code; however, the Chief\nBuilding Inspector may approve an application where a preexisting\nprincipal dwelling does not meet the applicable dimensional regulations\nwhen the proposed carriage house meets all of the principal dwelling\nsetbacks."
																},
																{
																	"content": [
																		{
																			"number": "[1] ",
																			"content": [
																				{
																					"text": "When the preexisting principal dwelling is a designated Town landmark pursuant to Town Code § 330-321 and is proposed to be converted to a carriage house in its preexisting location, said historic structure designated as a Town landmark shall not be required to meet the applicable dimensional regulations, provided the proposed new principal dwelling meets all required principal setbacks."
																				}
																			]
																		}
																	]
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "The carriage house shall have a front yard setback\nof at least 10 feet greater than the principal dwelling setback. The\ncarriage house shall have a side yard setback of not less than 30\nfeet and a rear yard setback of not less than 50 feet."
																}
															]
														},
														{
															"number": "(d) ",
															"content": [
																{
																	"text": "Lot coverage may be increased by the Chief Building\nInspector by no more than 2% However, except as explicitly authorized\nherein, the applicant must in be in conformance with all other applicable\nzoning regulations."
																}
															]
														},
														{
															"number": "(e) ",
															"content": [
																{
																	"text": "The carriage house may be one or two stories\nor added to the second floor of an accessory garage when the maximum\nheight of the building does not exceed 24 feet."
																}
															]
														},
														{
															"number": "(f) ",
															"content": [
																{
																	"text": "The total floor area of the carriage house shall\nnot exceed 50% of the floor area of the principal dwelling or a maximum\nof 3,000 square feet, exclusive of decks, stairways, patios or other\nunroofed portions of the structure."
																}
															]
														},
														{
															"number": "(g) ",
															"content": [
																{
																	"text": "The method of water supply and sewage disposal\nfor the two dwellings shall be approved by the Suffolk County Department\nof Health Services."
																}
															]
														},
														{
															"number": "(h) ",
															"content": [
																{
																	"text": "Access to the principal dwelling and carriage\nhouse shall be limited to one driveway."
																}
															]
														},
														{
															"number": "(i) ",
															"content": [
																{
																	"text": "When possible, new utility lines shall be shared;\nhowever, any new utilities to the carriage house shall be placed underground."
																}
															]
														},
														{
															"number": "(j) ",
															"content": [
																{
																	"text": "A parcel consisting of a principal structure\nand carriage house shall not be further subdivided."
																}
															]
														},
														{
															"number": "(k) ",
															"content": [
																{
																	"text": "Town Board evaluation of an application to extinguish a Town-owned development right in relation to a carriage house designated or proposed to be designated as a Town landmark pursuant to Town Code § 330-321 shall be as follows:"
																},
																{
																	"content": [
																		{
																			"number": "[1] ",
																			"content": [
																				{
																					"text": "All applications to extinguish a Town-owned development right\nin relation to a carriage house designated as a Town landmark shall\nbe available from and submitted to the Department of Land Management\nand forwarded to the Town Board for review."
																				}
																			]
																		},
																		{
																			"number": "[2] ",
																			"content": [
																				{
																					"text": "Application to extinguish a Town-owned development right may\nbe made at the same time as application for designation as a Town\nlandmark, or separately."
																				}
																			]
																		},
																		{
																			"number": "[3] ",
																			"content": [
																				{
																					"text": "The Town Board may only extinguish a Town-owned development\nright in favor of an application concerning a proposal of a carriage\nhouse to be designated as a Town landmark, or a carriage house designated\nas a Town landmark, after a public hearing in accordance with this\nsection."
																				}
																			]
																		},
																		{
																			"number": "[4] ",
																			"content": [
																				{
																					"text": "In making a determination under this section, the Town Board\nmay obtain and consider written reports from the Department of Land\nManagement and such other sources as required in the judgment of the\nTown Board and consistent with the purpose of this section."
																				}
																			]
																		},
																		{
																			"number": "[5] ",
																			"content": [
																				{
																					"text": "The Town Board may require covenants or other similar documents\nto assure that the provisions of this article are adhered to."
																				}
																			]
																		},
																		{
																			"number": "[6] ",
																			"content": [
																				{
																					"text": "Any transfer of a Town-owned development right pursuant to this section shall be subject to 6 NYCRR Part 617, provisions of the New York State Environmental Quality Review Act (SEQRA), and Chapter 157 of the Town Code (Environmental Quality Review)."
																				}
																			]
																		},
																		{
																			"number": "[7] ",
																			"content": [
																				{
																					"text": "Hearing; notice; action during process."
																				},
																				{
																					"content": [
																						{
																							"number": "[a] ",
																							"content": [
																								{
																									"text": "The Town Board shall hold such a public hearing\nwithin 60 days of receipt of a complete application."
																								}
																							]
																						},
																						{
																							"number": "[b] ",
																							"content": [
																								{
																									"text": "The Town Board shall fix a time and place for a\npublic hearing thereon and shall provide for the giving of notice\nat least 10 days prior to the date thereof in accordance with this\nsection."
																								}
																							]
																						},
																						{
																							"number": "[c] ",
																							"content": [
																								{
																									"text": "Notice shall be published in the official Town\nnewspaper at least 10 days prior to the date of the public hearing."
																								}
																							]
																						},
																						{
																							"number": "[d] ",
																							"content": [
																								{
																									"text": "The Town Board shall require the applicant to erect\na white-and-black-lettering sign or signs measuring not less than\ntwo feet long and one foot wide, which shall be prominently displayed\non the premises facing each public street on which the property abuts,\ngiving notice that an application for extinguishing a Town-owned development\nright in relation to a carriage house designated or proposed to be\ndesignated as a Town landmark is pending and the date, time and place\nwhere the public hearing will be held. The sign shall not be set back\nmore than 10 feet from the street line and shall not be less than\ntwo nor more than six feet above the grade at the street line. The\nsign shall be made of durable material and shall be furnished by the\nDepartment of Land Management. It shall be displayed for a period\nof not less than 10 days immediately preceding the public hearing\ndate. No additional posting shall be required for any adjournment\ndate. The applicant shall file an affidavit that he/she has complied\nwith the provisions of this section."
																								}
																							]
																						},
																						{
																							"number": "[e] ",
																							"content": [
																								{
																									"text": "If the land involved in an application is within\n500 feet of the boundary of any other municipality, notice of the\npublic hearing shall also be mailed to the Municipal Clerk of such\nother municipality."
																								}
																							]
																						},
																						{
																							"number": "[f] ",
																							"content": [
																								{
																									"text": "The Town Board shall require the applicant to mail\nwritten notice of the date, time and place of the hearing, together\nwith a copy of the application and survey submitted to the Town Board,\nby certified mail, return receipt requested, to every property owner,\nas shown on the current Town of Southampton assessment rolls, of parcels\nabutting and parcels directly opposite (by extension of lot lines\nthrough a street or right-of-way) of the property which is the subject\nof the application, proof of which shall be submitted to the Town\nBoard on or before the commencement of the public hearing in the form\nof an affidavit with postal receipts annexed thereto confirming mailing\nof said notices at least 10 days prior to the hearing date."
																								}
																							]
																						},
																						{
																							"number": "[g] ",
																							"content": [
																								{
																									"text": "The Town Board shall render a determination within\n45 days of the close of the public hearing and written record."
																								}
																							]
																						}
																					]
																				}
																			]
																		}
																	]
																}
															]
														}
													]
												}
											]
										}
									]
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 330-10",
			"title": "Residence Districts Table of Use Regulations.",
			"content": [
				{
					"text": "The Residence Districts Table of Use Regulations is included at the end of this chapter."
				}
			]
		},
		{
			"paragraph": "§ 330-11",
			"title": "Residence Districts Table of Dimensional Regulations.",
			"content": [
				{
					"text": "The Residence Districts Table of Dimensional Regulations is included at the end of this chapter.",
					"text": "The following regulations apply all properties in a CR-200 district:",
				}
			]
		}
	]
}