{
	"url": "http://ecode360.com/10999329",
	"paras": [
		{
			"paragraph": "§ 145-8",
			"title": "Applicability.",
			"content": [
				{
					"text": "The following regulations in this Article shall\napply in all residence districts."
				}
			]
		},
		{
			"paragraph": "§ 145-9",
			"title": "Permitted uses.",
			"content": [
				{
					"text": "No building shall be erected, altered or used\nand no lot or premises shall be used except for one or more of the\nfollowing purposes:"
				},
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "A dwelling for not over one family. An accessory building\nused as a dwelling by a separate family shall be deemed a dwelling\nand a principal use.[Amended 2-9-1961 by Ord. No. 69; 9-9-2004 by L.L. No.\n5-2004]"
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "A dwelling for not more than one family; members of\nthe family who dwell in the residence may engage in the practice of\neither medicine or dentistry, but not both professions in the same\ndwelling.[1][Amended 12-13-1990 by L.L. No. 2-1990]"
								},
								{
									"footnote": "[1]\nEditor's Note: For related provisions, see Ch. 121, Signs.\n"
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Public parks; public schools."
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "Police booths, Village Hall and other Village buildings\nand uses."
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "(Reserved)[2]"
								},
								{
									"footnote": "[2]\nEditor's Note: Former Subsection E, which dealt with provisions for real estate signs, was repealed 9-13-1990 by L.L. No. 1-1990. See now Ch. 121, Signs.\n"
								}
							]
						},
						{
							"number": "F. ",
							"content": [
								{
									"text": "Accessory uses customarily incident to the above uses\nand located on the same lot with them, including farming, gardening,\nnurseries and greenhouses, provided that such use is not for the sale\nof the products and provided that there is no display of products\nand no advertising. The office of a physician or dentist who resides\nin the dwelling shall be deemed an accessory use, on condition that\nit is used solely and exclusively by the physician or dentist who\nresides there and the area devoted to such practice shall not exceed\n25% of the gross first floor area up to a maximum of 750 square feet;\notherwise, such use is prohibited. Except as above provided, accessory\nuses shall not include business uses nor any billboards or advertising\nsigns. No use which is objectionable or detrimental to the well-being\nor harmonious character of the neighborhood shall be permitted. The\nbreeding of dogs, keeping of more than three dogs and the keeping\nof chickens, roosters, pigeons, pigs, swine, horses, cows or cattle\nshall not be permitted. Any accessory use, such as keeping of live\nanimals, must be carried on in conformity with the Sanitary Code or\nsimilar regulations or ordinances of the State of New York or of the\nTown of Hempstead or of the County of Nassau and the general ordinances\nof the Village of Hewlett Harbor.[3][Amended 9-9-2004 by L.L. No. 5-2004]"
								},
								{
									"footnote": "[3]\nEditor's Note: For related provisions, see Ch. 36, Dogs.\n"
								}
							]
						},
						{
							"number": "G. ",
							"content": [
								{
									"text": "(Reserved)[4]"
								},
								{
									"footnote": "[4]\nEditor's Note: Former Subsection G, which\nprovided for private garages in which no business is carried on, was\nrepealed 9-9-2004 by L.L. No. 5-2004.\n"
								}
							]
						},
						{
							"number": "H. ",
							"content": [
								{
									"text": "Living quarters may be permitted in accessory buildings,\nincluding garages, when they are occupied by a servant or servants\nof occupants of the principal buildings on the same plot and in connection\nwith said principal building. Living quarters so occupied may include\nseparate housekeeping units for such servants."
								}
							]
						},
						{
							"number": "I. ",
							"content": [
								{
									"text": "A club of the character described in Article VIII of this chapter, subject to the conditions and regulations therein set forth.[Added 3-23-1961 by Ord. No. 71]"
								}
							]
						},
						{
							"number": "J. ",
							"content": [
								{
									"text": "Church, temple or other place of worship, none of which shall have living quarters, but all of which shall comply with § 145-19.1 herein.[Added 8-13-1987 by L.L. No. 2-1987]"
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 145-9.1",
			"title": "Prohibited uses.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Aircraft operation and storage."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "No person shall land or take off in aircraft\nof any nature, type or description within the Incorporated Village\nof Hewlett Harbor."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "No person shall permit aircraft of any nature,\ntype or description to land on or take off from any property within\nthe Incorporated Village of Hewlett Harbor."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "The landing or taking off of aircraft of any\nnature, type or description and the standing, storage or occupancy\nof any aircraft of any nature, type or description on any property\nwithin the Incorporated Village of Hewlett Harbor is absolutely prohibited\nand shall not be deemed a lawful accessory use."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Placement of commercial vehicles on premises improved\nwith a single-family residence or waterfront property.[Added 4-14-2005 by L.L. No. 2-2005[1]]"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "No commercial vehicle shall be placed upon the\nexterior portion of any premises that is improved with a single-family\nresidence or waterfront property, except during the active loading\nor off-loading of merchandise or except during the active performance\nof any commercial service or duty undertaken by the operator of such\nvehicle in connection with said premises."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Should it become necessary for a commercial vehicle to remain on the premises of a single-family residence or waterfront property on an overnight basis, an application for a permit must be obtained from the Village, and such permit must be issued prior to the placing of a commercial vehicle on the premises for reasons specified in Subsection B(1)."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "For the purpose of Subsection B(1) above, a \"commercial vehicle\" shall be defined as a vehicle which either displays commercial registration under the New York State Vehicle and Traffic Law or the regulations adopted thereunder or which, by reason of the attachment of advertising messages and/or storage of equipment, supplies, inventory, or other commercial merchandise or hardware, presents the appearance of a vehicle that is primarily utilized in furtherance of commercial or industrial enterprise."
												}
											]
										}
									]
								},
								{
									"footnote": "[1]\nEditor's Note: This local law also relettered\nformer Subsection B as Subsection C.\n"
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Any use not expressly permitted by § 145-9.[Added 9-9-2004 by L.L. No. 5-2004]"
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 145-10",
			"title": "Building heights.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Half-acre or less."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "The height of a residential dwelling with a pitched roof shall not\nexceed 33 feet."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "The height of a residential dwelling with a flat roof shall not exceed\n28 feet."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "In the case where there shall be a combination of pitched and flat\nroofs, the height of the pitched roof portion shall not exceed 33\nfeet and the height of the flat roof portion shall not exceed 28 feet."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "No accessory structure shall be erected or altered, any part of which\nis higher than 1 1/2 stories or exceeds 18 feet above mean existing\ngrade level around such structure."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "More than 1/2 acre to one acre."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "The height of a residential dwelling with a pitched roof shall not\nexceed 35 feet."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "The height of a residential dwelling with a flat roof shall not exceed\n32 feet."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "In the case where there shall be a combination of pitched and flat\nroofs, the height of the pitched roof portion shall not exceed 35\nfeet and the height of the flat roof portion shall not exceed 32 feet."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "No accessory structure shall be erected or altered, any part of which\nis higher than 1 1/2 stories or exceeds 18 feet above mean existing\ngrade level around such structure."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "More than one acre."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "The height of a residential dwelling with a pitched roof shall not\nexceed 35 feet."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "The height of a residential dwelling with a flat roof shall not exceed\n35 feet."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "In the case where there shall be a combination of pitched and flat\nroofs, the height of the pitched roof portion shall not exceed 35\nfeet and the height of the flat roof portion shall not exceed 35 feet."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "No accessory structure shall be erected or altered, any part of which\nis higher than 1 1/2 stories or exceeds 18 feet above mean existing\ngrade level around such structure."
												}
											]
										}
									]
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 145-10.1",
			"title": "Height/setback plane.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "A height/setback plane is a theoretical inclined plane through which\nno part of a dwelling shall penetrate. The plane begins at and perpendicular\nto the street front property line rising inward toward the building\nat an angle of 38°, to a maximum height of 35 feet. The mean existing\ngrade level at the street front building wall shall be used for the\nstart point elevation at the street front property line."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 145-10.2",
			"title": "Attics.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "No attic shall be heated or air conditioned."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Attics shall be used exclusively for storage and shall not contain\nany habitable spaces, nonhabitable spaces, recreational rooms or bathrooms."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 145-10.3",
			"title": "Street wall.",
			"content": [
				{
					"text": "The street wall shall be limited to an initial maximum height\nof 21 feet at the required front yard setback. The street wall may\nbe allowed to be increased by one foot for each additional 10 feet\nin setback, to an ultimate maximum height no greater than 25 feet\nwhile maintaining prescribed rear yard setbacks."
				}
			]
		},
		{
			"paragraph": "§ 145-10.4",
			"title": "Dormers.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "A dormer\nmay be permitted to penetrate the height/setback plane, as defined\nand regulated under the relevant sections of the Village Code, but\nonly if the aggregate width of the dormer or dormers does not exceed\n33.3% of the total width of the structure along the side of the structure\non which the dormer or dormers will be situated; but in no case shall\na dormer be erected to be higher than any building and/or accessory\nstructure. Additionally, in no case shall the exposed outside walls\nof such dormer or dormers have an aggregate surface area in square\nfeet that is greater than the aggregate length of such dormer or dormers\nin feet, multiplied by five."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "A dormer\nshall not be permitted to protrude from the face of a building structure,\nbut shall always remain flush to the side of the structure on which\nthe dormer will be situated."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 145-11",
			"title": "Lot size.",
			"content": [
				{
					"text": "No building shall be erected on any lot having an area less than the minimum specified in § 145-19 for the district in which the lot is situated. There shall be erected not more than one principal building with accessory buildings for each such minimum area, except as herein provided in relation to present existing buildings."
				}
			]
		},
		{
			"paragraph": "§ 145-12",
			"title": "Building area.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "No building, together with its accessory buildings, shall occupy in the aggregate more than the percentage of the area of the lot specified in § 145-19 for the district in which the lot is situated."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "The area occupied by all accessory buildings shall not exceed the percentage of the lot specified in § 145-19 for the district in which the lot is situated."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 145-13",
			"title": "Front yards.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "The required front yard depth shall not be less than\nthe average front yard depth of existing dwellings on lots within\n300 feet on each side of the lot and within the same block and same\ndistrict."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Where there is only one existing lot within 300 feet, the required front yard depth shall not be less than the average of the existing dwelling on the existing lot and the minimum front yard specified in § 145-19 for the district in which the lot is situated."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "In any case, no front yard depth shall be less than that specified in § 145-19 for the district in which the lot is situated."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 145-14",
			"title": "Side yards.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Two side yards shall be required, which shall have a total width not less than that specified in § 145-19 for the district in which the lot is situated."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "No side yard shall have a width less than that specified in § 145-19 for the district in which the lot is situated."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 145-15",
			"title": "Rear yards.",
			"content": [
				{
					"text": "Rear yards shall have a depth not less than that specified in § 145-19 for the district in which the lot is situated."
				}
			]
		},
		{
			"paragraph": "§ 145-15.1",
			"title": "Permitted encroachments.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Permitted encroachments in any required front yard,\nside yard and rear yard: none."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Exception: a stoop serving a dwelling, open and unroofed\nnot exceeding 30 inches above grade and not exceeding 32 square feet.\nExclusion of steps may project not more than four feet into any required\nyard. Below-grade structures such as areaways and stairs may project\nnot more than four feet into any required yard.[Amended 6-14-2007 by L.L. No. 6-2007]"
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 145-15.2",
			"title": "Maintenance of Village rights-of-way and easements.",
			"content": [
				{
					"text": "It shall be the responsibility of the property\nowner whose property includes a Village right-of-way or easement adjacent\nto maintain the right-of-way, which shall include, but not be limited\nto, cutting the grass, trimming trees and bushes, and keeping the\nproperty adequately watered."
				}
			]
		},
		{
			"paragraph": "§ 145-16",
			"title": "Street frontages.",
			"content": [
				{
					"text": "No building shall be erected on any lot having a street frontage less than the minimum specified in § 145-19 for the district in which the lot is situated. For each additional principal building or use on the same lot, an additional street frontage of a similar length is required. In the case of lots, other than comer lots, adjoining more than one street, the owner may elect which street shall be used for computing street frontage; the frontage on the other street shall be disregarded."
				}
			]
		},
		{
			"paragraph": "§ 145-17",
			"title": "Depth of lot.",
			"content": [
				{
					"text": "No building shall be erected on any lot having a depth less than the minimum specified in § 145-19 for the district in which the lot is situated. For the purpose of this section, the depth shall be the average distance between the rear line of the lot and the street frontage of the lot or, where there is no street frontage, the front fine of the lot."
				}
			]
		},
		{
			"paragraph": "§ 145-18",
			"title": "Livable floor area.",
			"content": [
				{
					"text": "No principal building used, designed or intended in whole or in part for dwelling purposes shall be erected which shall have a total livable floor area, a livable floor area on the ground or first story or a livable floor area on the second story less than the minimum specified in § 145-19 for the district in which the lot is situated."
				}
			]
		},
		{
			"paragraph": "§ 145-18.1",
			"title": "Floor area ratio (F.A.R.) for a dwelling.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "The maximum gross F.A.R. for a dwelling shall not\nexceed 5,500 square feet for lots up to 17,999 square feet in area.\nFor lots 18,000 square feet or more in area, the maximum gross F.A.R.\nfor a dwelling shall not exceed 5,500 square feet plus [(lot area\nminus 18,000 square feet) times 0.15]."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "In no case shall the maximum gross F.A.R. permit a\ndwelling in excess of 12,000 square feet gross floor area."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "The maximum gross F.A.R. for all roofed accessory\nbuildings shall not exceed 8% of the maximum F.A.R. permitted for\na dwelling on the subject lot."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 145-18.2",
			"title": "Required garage.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Dwellings hereafter erected shall provide on-premises\nan enclosed garage space for not less than two cars with interior\ndimensions of not less than 20 feet depth and width."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Existing dwellings with enclosed garage space on-premises\nhereafter altered or enlarged shall maintain not less than one enclosed\ngarage space on premises with interior dimensions of not less than\n10 feet by 20 feet."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "A garage door shall not exceed 18 feet in width. No\nbuilding facade shall have multiple garage doors totaling more than\n27 feet in width and the total combined width of all garage doors\non premises shall not exceed 36 feet in width."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 145-19",
			"title": "Table of district requirements.",
			"content": [
				{
					"text": "The following are the specific requirements for the several residence districts referred to in § 145-8:"
				},
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Uses: Uses specified in § 145-9"
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Height: Height specified in § 145-10"
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Size of lot (square feet): 26,000"
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "Building area (percentage):"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Total: 25%"
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Accessory: 7%"
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "Front yards (feet): 35"
								}
							]
						},
						{
							"number": "F. ",
							"content": [
								{
									"text": "Side yards (feet): "
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Total: 45"
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Each: 20"
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "G. ",
							"content": [
								{
									"text": "Rear yards (feet): 30"
								}
							]
						},
						{
							"number": "H. ",
							"content": [
								{
									"text": "Street frontage (feet): 125"
								}
							]
						},
						{
							"number": "I. ",
							"content": [
								{
									"text": "Depth (feet): 100"
								}
							]
						},
						{
							"number": "J. ",
							"content": [
								{
									"text": "Floor area (square feet):"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Alternative A: "
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "Total: 3,000"
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "Ground Story: 2,000"
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Alternative B: "
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "Total: 2,700"
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "Ground Story: 2,700"
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Alternative C: "
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "Total: 2,700"
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "Ground Story: 1,350"
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "Second Story: 1,350"
																}
															]
														}
													]
												}
											]
										}
									]
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 145-19.1",
			"title": "Requirements for churches, temples and places of worship.",
			"content": [
				{
					"text": "A church, temple or other place of worship shall\ncomply with the following requirements, as well as all other applicable\nrequirements of this Code, not inconsistent herewith:"
				},
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Maximum height: three stories, not to exceed 35 feet."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Minimum lot area: 87,120 square feet."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Maximum building area: 15% of lot area."
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "Minimum front yard: 50 feet."
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "Minimum rear yard: 50 feet."
								}
							]
						},
						{
							"number": "F. ",
							"content": [
								{
									"text": "Minimum side yards: 50 feet each."
								}
							]
						},
						{
							"number": "G. ",
							"content": [
								{
									"text": "Minimum street frontage: 300 feet."
								}
							]
						},
						{
							"number": "H. ",
							"content": [
								{
									"text": "Minimum depth of lot: 200 feet."
								}
							]
						},
						{
							"number": "I. ",
							"content": [
								{
									"text": "Minimum off-street parking: one parking space, having\na minimum dimension of nine feet by 20 feet, for each 100 square feet\nof total floor area in the building."
								}
							]
						},
						{
							"number": "J. ",
							"content": [
								{
									"text": "Location of off-street parking: No off-street parking\nshall be located in the minimum required side yards, front yard or\nrear yard."
								}
							]
						},
						{
							"number": "K. ",
							"content": [
								{
									"text": "Curb cuts: Curb cuts shall not be located in front\nof any minimum required side yard."
								}
							]
						},
						{
							"number": "L. ",
							"content": [
								{
									"text": "Minimum screening: thick plantings of trees, shrubs\nand hedges of a type, variety and size, as may be approved by the\nBuilding Inspector, having a minimum width of 10 feet along the side\nand rear yards, and intended to screen all uses from view from adjacent\nlots. All plantings shall be of good quality and shall be adequately\nmaintained and replaced as may be required."
								}
							]
						},
						{
							"number": "M. ",
							"content": [
								{
									"text": "Conduct of activities: All activities shall be conducted\ninside the buildings, and no activities of any kind shall be conducted\noutside the building."
								}
							]
						},
						{
							"number": "N. ",
							"content": [
								{
									"text": "Noise: All reasonable steps shall be taken to confine\nnoise, music and sound within the building so as not to adversely\naffect adjacent properties."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 145-20",
			"title": "Existing buildings and uses.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Any building or premises or any use lawfully existing\nin any building or premises at the time of the passage of this chapter\nand not conforming to the regulations of the building zone district\nin which it is maintained may be continued therein, but the building\nor buildings, structures or premises involved shall not be altered\nor enlarged except in compliance with the provisions of this chapter."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "A building or lot or any part thereof which, at the\ntime of passage of this chapter or at a later time, is used for any\nof the purposes herein provided as permitted in the zone in which\nsaid building or lot is situated shall never thereafter be used for\nany purpose not permitted by the provisions of this chapter."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 145-21",
			"title": "Lot transferred between districts; conformity to requirements.",
			"content": [
				{
					"text": "Any lot in an area heretofore or hereafter transferred\nfrom one district to another district, of which the ownership at the\ntime of such transfer differed from that of the premises adjacent\nthereto, which fails to conform with the minimum area or minimum street\nfrontage or minimum depth regulations of the district to which it\nis transferred, but which conformed with the regulations of the district\nin which it was situated immediately prior to such transfer, may be\nimproved and a building erected, altered or enlarged thereon, provided\nthat such building conforms with the regulations of the district to\nwhich it has been transferred except as to minimum area or minimum\nstreet frontage or minimum depth as the case may be, and further provided\nthat, in respect to such minimum area or minimum street frontage or\nminimum depth, it conforms with the regulations of the district from\nwhich it was transferred."
				}
			]
		},
		{
			"paragraph": "§ 145-22",
			"title": "Restoration of nonconforming uses.",
			"content": [
				{
					"text": "Nothing in this chapter shall prevent the restoration,\nwithin one year and in such manner as not to violate any provision\nof this chapter to any greater extent or in any other way than at\nthe present time, of a nonconforming building or structure destroyed\nby fire, explosion, act of God or act of the public enemy to an extent\nof not more than 60% of its value or prevent the continuance of the\nuse of such building or part thereof, but any building destroyed in\nthe manner aforesaid, to an extent exceeding 60% of its value at the\ntime of such destruction, may be reconstructed and thereafter used\nonly in such a manner as to conform to all the provisions of this\nchapter. Nothing in this chapter shall prevent the restoration of\na wall declared unsafe."
				}
			]
		},
		{
			"paragraph": "§ 145-23",
			"title": "Computing building area.",
			"content": [
				{
					"text": "The area occupied by accessory buildings shall\nbe included in computing the maximum portion of the lot area which\nmay be built upon in any given zone."
				}
			]
		},
		{
			"paragraph": "§ 145-24",
			"title": "Computing lot size.",
			"content": [
				{
					"text": "In case of an irregular parcel of land, the\nBoard of Trustees shall have power to determine and designate what\nportion thereof shall be deemed to be used in connection with the\nproposed building or use and what, if any, portion thereof is not\nproperly to be deemed used in connection therewith. For the purpose\nof computing the size of the lot, only that portion of the parcel\nof land which the Board of Trustees deems to be used in connection\nwith the proposed building or use shall be included."
				}
			]
		},
		{
			"paragraph": "§ 145-25",
			"title": "Accessory buildings.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Accessory buildings and uses may be located only in\nthe rear or side yards and shall not be nearer to any property line\nthan 20 feet in the Residence A District, Residence AA District or\nResidence AB District, or 15 feet in the Residence B or Residence\nBX District."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Accessory buildings or structures consisting of air-conditioning\nequipment, swimming pool, heating and filtration equipment, emergency\ngenerators, electrical panels either freestanding or attached to a\nbuilding and similar types of equipment shall be provided with suitable\nscreening by hedges, shrubs, trellises, latticework, fencing or the\nlike, or any combination of the same, of sufficient height and location\nso as to shield such uses and equipment from view from adjacent streets\nand adjacent properties."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Sheds not exceeding 80 square feet and eight feet above surrounding grade level and located per § 145-25A do not require building permit.[Added 9-9-2004 by L.L. No. 5-2004]"
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 145-26",
			"title": "Proximity of principal buildings to waterfront.\n                                                                                          [1]",
			"content": [
				{
					"text": "No principal building or establishment or part\nthereof shall be erected or maintained nearer to Macy Channel, Hewlett\nBay, Thixton Creek or Georges Creek than 50 feet in the Residence\nA District, Residence AA District or Residence AB District, or 40\nfeet in the Residence B District or Residence BX District. For the\npurpose of this subsection, the unnamed estuary of Hewlett Bay situated\nsouth of the bridge at Seawane Drive shall be deemed part of Hewlett\nBay, but the portions of said estuary north of said bridge shall not\nbe deemed part of Hewlett Bay."
				},
				{
					"footnote": "[1]\nEditor's Note: For related provisions, see Ch. 65, Freshwater Wetlands, and Ch. 75, Art. II, Flood Damage Prevention.\n"
				}
			]
		},
		{
			"paragraph": "§ 145-27",
			"title": "Docks, boathouses and bathhouses.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "There may be constructed adjacent to and abutting\nthe waterline of any waterfront property a dock, boathouse, or bathhouse\nnot used for dwelling purposes or for the storage of automobiles,\nmotorcycles, or any other motorized boats or vehicles. The exception\nto this subsection is the storage of jet skis. The boathouse or bathhouse\nmay occupy not more than 10% of the waterfront of such property and\nmust be placed across the median of the property closest to the water\non either end of the property while complying with side-yard requirements\nand the provisions applicable to accessory building or uses. A chain-link\nor cyclone fence must be constructed along the property line of that\nportion of Albon Road between Seawane Drive and Everit Avenue for\nall waterfront property. The fence must be exactly four feet high\nand maintained in good order and repair. The chain link must be coated\nin a green vinyl or green latex permanent factory coating. Any gate\nmust be securely locked as per New York State guidelines for fences\nsurrounding pools. No trees, shrubs, hedges, accessory structures,\nor any flora may be placed in such a manner so as to block the view\nof the water from the road. The dock and/or boathouse/bathhouse may\nnot be rented without the express written consent of the Village Board\nof Trustees.[Amended 3-8-1973; 4-8-2010 by L.L. No. 1-2010]"
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Such dock or boathouse shall be used exclusively by\nthe owner or occupant of the property to which it is accessory for\nany number of boats owned by him, except that he may permit such dock\nto be used by transient boats for periods of not more than 10 days\nduring the boating season, or by not more than one boat without limitation\nof time owned by another resident of the Village on condition that\nno fee, charge or remuneration is paid or received."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 145-28",
			"title": "Swimming pools on waterfront properties.\n                                                                                          [1]",
			"content": [
				{
					"text": "As an exception to the requirement of § 145-9F that accessory uses must be located on the same lot as the principal use to which they are accessory, there may be constructed upon a lot adjoining Macy Channel, Hewlett Bay, Thixton Creek or Georges Creek a swimming pool with accessory equipment and structures which complies with all of the requirements for a swimming pool as set forth in Art. VII of this chapter and which is accessory to a one-family dwelling in the same ownership located elsewhere in the Village, within 300 feet of the swimming pool, subject to the following additional conditions:"
				},
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "That the swimming pool be so located on the lot that\na one-family dwelling may be constructed upon the lot between the\nswimming pool and the adjacent street in conformity with all of the\nrequirements of applicable ordinances and that, in the event such\ndwelling is constructed, the swimming pool shall become accessory\nto such dwelling."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "That there be planted and maintained between the swimming\npool and the adjoining street or streets trees and/or shrubbery, approved\nby the Board of Trustees, sufficient in the opinion of the Board of\nTrustees to provide reasonable concealment of the swimming pool from\nthe street."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "That the application for a building permit shall show\nconformity with these conditions and that the foregoing approval of\nthe Board of Trustees be obtained before the building permit is issued."
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "That in case the lot containing the swimming pool\nand the lot containing the principal use should come into separate\nownership, the use of the swimming pool shall cease forthwith and\nthe swimming pool and appurtenances thereto shall be removed within\none year thereafter, unless within that period of time the swimming\npool becomes a permitted accessory use under other provisions of this\nchapter."
								}
							]
						}
					]
				},
				{
					"footnote": "[1]\nEditor's Note: For related provisions, see\nArt. VII.\n"
				}
			]
		},
		{
			"paragraph": "§ 145-29",
			"title": "Corner lots.",
			"content": [
				{
					"text": "In the case of a corner lot, a building shall\nbe required to comply with the front yard restrictions on both streets."
				}
			]
		},
		{
			"paragraph": "§ 145-30",
			"title": "Lots fronting on two or more streets.",
			"content": [
				{
					"text": "In the case of a lot, other than a corner lot,\nadjoining two or more streets, a front yard is required on each street."
				}
			]
		},
		{
			"paragraph": "§ 145-31",
			"title": "Lots in more than one district.",
			"content": [
				{
					"text": "In the case of a lot situated partly in two\ndistricts, no principal building, use or establishment shall be constructed,\naltered or maintained thereon except in conformity with the regulations\napplying to the most highly restricted district in which such building,\nuse or establishment or any part thereof is situated, and no accessory\nbuilding, use or establishment shall be constructed, altered or maintained\nunless the principal building, use or establishment to which it is\naccessory is one permitted in the district in which such accessory\nbuilding, use or establishment is situated."
				}
			]
		},
		{
			"paragraph": "§ 145-32",
			"title": "District boundaries; streets and waterways in districts.",
			"content": [
				{
					"text": "Building zone districts include all public or\nprivate streets, ponds, streams and waterways adjacent thereto, whether\nor not so designated upon the Building Zone Map, including land under\nwater and land hereafter formed by filling, accretion, emergence,\navulsion or otherwise. In case a public or private street, pond, stream\nor waterway as shown on said map forms the boundary between two or\nmore districts of the same class, the district shall be considered\nas continuous. In case a public or private street, pond, stream or\nwaterway as shown on said map forms the boundary between two or more\ndistricts of different classes, each district shall be deemed to extend\nto the center of the pond or the thread of the stream or waterway\nas the case may be. A description by metes and bounds of the building\nzone boundaries is on file with the Village records, to which reference\nmay be made to determine the intention of the Board of Trustees in\ncase of any uncertainty as to the precise location of any building\nzone boundary."
				}
			]
		},
		{
			"paragraph": "§ 145-33",
			"title": "Streets on official map or master plan.",
			"content": [
				{
					"text": "For the purpose of computing the building area,\nthe size of the lot, the front yard, the side yards, the rear yard,\nthe street frontage and the minimum depth of lot, a Village parkway\nand any proposed street or streets shown on any official map or master\nplan of the Village, or any amendment or modification thereof now\nor hereafter duly adopted by the Planning Board or by the Board of\nTrustees, shall be considered a public street with the same force\nand effect as if the same had been duly opened and improved and made\navailable for public use."
				}
			]
		},
		{
			"paragraph": "§ 145-34",
			"title": "Streets and waterways excluded from lot yard areas.\n                                                                                          [1]",
			"content": [
				{
					"text": "Except as provided in § 145-33, for the purpose of computing the building area, the size of the lot, the rear yards, front yards and side yards, the land lying in the bed of any public or private street adjacent thereto and the land lying below the highwater mark of any pond, stream or waterway adjacent thereto shall be excluded, unless the application for a building permit shall also provide for the bulkheading or filling in of a portion of such pond, stream or waterway, in which case the land lying below the high-water line as so relocated shall be excluded."
				},
				{
					"footnote": "[1]\nEditor's Note: For related provisions, see § 145-66.\n"
				}
			]
		},
		{
			"paragraph": "§ 145-35",
			"title": "Poles and overhead wires.",
			"content": [
				{
					"text": "No telephone poles or poles for electric light\nor power, and no overhead wires, shall be permitted within the Village\nexcept as follows: Properties adjoining East Rockaway Road may bring\nin overhead wires to buildings erected or to be erected thereon for\na distance of not more than 100 feet from East Rockaway Road and,\nfor such purpose, may erect and maintain, within 100 feet of East\nRockaway Road, not more than one pole on each such building plot."
				}
			]
		},
		{
			"paragraph": "§ 145-35.1",
			"title": "Driveways.",
			"content": [
				{
					"text": "No pebble or gravel driveways may be constructed.\nResidents who already have a certificate of occupancy or certificate\nof completion prior to enactment of this section are exempt from this\nrequirement."
				}
			]
		},
		{
			"paragraph": "§ 145-36",
			"title": "Street frontage must extend for depth of yard.",
			"content": [
				{
					"text": "Where a street frontage of a specified minimum\nlength is required, it is not enough if such minimum is provided at\nthe street line, but such minimum must be provided throughout the\ndepth of the required front or other yard abutting the street where\nthe minimum street frontage is provided."
				}
			]
		},
		{
			"paragraph": "§ 145-36.1",
			"title": "Boats and trailers.",
			"content": [
				{
					"text": "No trailer of any kind and no boat of any kind\nshall be stored in any front, side or rear yard or on any other property\nin the Village, except that:"
				},
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "A boat that is afloat may be moored at a legally permitted\ndock, bulkhead, pier or other mooring facility."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "A boat trailer or a boat under 18 feet in length may\nonly be stored in a rear yard when wholly enclosed within a building\nwhich complies in all respects to the laws and regulations of the\nVillage."
								}
							]
						}
					]
				}
			]
		}
	]
}