{
	"url": "http://ecode360.com/10999375",
	"paras": [
		{
			"paragraph": "§ 145-8",
			"title": "Applicability.",
			"content": [
				{
					"text": "The following regulations in this Article shall\napply in all residence districts."
				}
			]
		},
		{
			"paragraph": "§ 145-9",
			"title": "Permitted uses.",
			"content": [
				{
					"text": "No building shall be erected, altered or used\nand no lot or premises shall be used except for one or more of the\nfollowing purposes:"
				},
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "A dwelling for not over one family. An accessory building\nused as a dwelling by a separate family shall be deemed a dwelling\nand a principal use.[Amended 2-9-1961 by Ord. No. 69; 9-9-2004 by L.L. No.\n5-2004]"
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "A dwelling for not more than one family; members of\nthe family who dwell in the residence may engage in the practice of\neither medicine or dentistry, but not both professions in the same\ndwelling.[1][Amended 12-13-1990 by L.L. No. 2-1990]"
								},
								{
									"footnote": "[1]\nEditor's Note: For related provisions, see Ch. 121, Signs.\n"
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Public parks; public schools."
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "Police booths, Village Hall and other Village buildings\nand uses."
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "(Reserved)[2]"
								},
								{
									"footnote": "[2]\nEditor's Note: Former Subsection E, which dealt with provisions for real estate signs, was repealed 9-13-1990 by L.L. No. 1-1990. See now Ch. 121, Signs.\n"
								}
							]
						},
						{
							"number": "F. ",
							"content": [
								{
									"text": "Accessory uses customarily incident to the above uses\nand located on the same lot with them, including farming, gardening,\nnurseries and greenhouses, provided that such use is not for the sale\nof the products and provided that there is no display of products\nand no advertising. The office of a physician or dentist who resides\nin the dwelling shall be deemed an accessory use, on condition that\nit is used solely and exclusively by the physician or dentist who\nresides there and the area devoted to such practice shall not exceed\n25% of the gross first floor area up to a maximum of 750 square feet;\notherwise, such use is prohibited. Except as above provided, accessory\nuses shall not include business uses nor any billboards or advertising\nsigns. No use which is objectionable or detrimental to the well-being\nor harmonious character of the neighborhood shall be permitted. The\nbreeding of dogs, keeping of more than three dogs and the keeping\nof chickens, roosters, pigeons, pigs, swine, horses, cows or cattle\nshall not be permitted. Any accessory use, such as keeping of live\nanimals, must be carried on in conformity with the Sanitary Code or\nsimilar regulations or ordinances of the State of New York or of the\nTown of Hempstead or of the County of Nassau and the general ordinances\nof the Village of Hewlett Harbor.[3][Amended 9-9-2004 by L.L. No. 5-2004]"
								},
								{
									"footnote": "[3]\nEditor's Note: For related provisions, see Ch. 36, Dogs.\n"
								}
							]
						},
						{
							"number": "G. ",
							"content": [
								{
									"text": "(Reserved)[4]"
								},
								{
									"footnote": "[4]\nEditor's Note: Former Subsection G, which\nprovided for private garages in which no business is carried on, was\nrepealed 9-9-2004 by L.L. No. 5-2004.\n"
								}
							]
						},
						{
							"number": "H. ",
							"content": [
								{
									"text": "Living quarters may be permitted in accessory buildings,\nincluding garages, when they are occupied by a servant or servants\nof occupants of the principal buildings on the same plot and in connection\nwith said principal building. Living quarters so occupied may include\nseparate housekeeping units for such servants."
								}
							]
						},
						{
							"number": "I. ",
							"content": [
								{
									"text": "A club of the character described in Article VIII of this chapter, subject to the conditions and regulations therein set forth.[Added 3-23-1961 by Ord. No. 71]"
								}
							]
						},
						{
							"number": "J. ",
							"content": [
								{
									"text": "Church, temple or other place of worship, none of which shall have living quarters, but all of which shall comply with § 145-19.1 herein.[Added 8-13-1987 by L.L. No. 2-1987]"
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 145-9.1",
			"title": "Prohibited uses.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Aircraft operation and storage."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "No person shall land or take off in aircraft\nof any nature, type or description within the Incorporated Village\nof Hewlett Harbor."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "No person shall permit aircraft of any nature,\ntype or description to land on or take off from any property within\nthe Incorporated Village of Hewlett Harbor."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "The landing or taking off of aircraft of any\nnature, type or description and the standing, storage or occupancy\nof any aircraft of any nature, type or description on any property\nwithin the Incorporated Village of Hewlett Harbor is absolutely prohibited\nand shall not be deemed a lawful accessory use."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Placement of commercial vehicles on premises improved\nwith a single-family residence or waterfront property.[Added 4-14-2005 by L.L. No. 2-2005[1]]"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "No commercial vehicle shall be placed upon the\nexterior portion of any premises that is improved with a single-family\nresidence or waterfront property, except during the active loading\nor off-loading of merchandise or except during the active performance\nof any commercial service or duty undertaken by the operator of such\nvehicle in connection with said premises."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Should it become necessary for a commercial vehicle to remain on the premises of a single-family residence or waterfront property on an overnight basis, an application for a permit must be obtained from the Village, and such permit must be issued prior to the placing of a commercial vehicle on the premises for reasons specified in Subsection B(1)."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "For the purpose of Subsection B(1) above, a \"commercial vehicle\" shall be defined as a vehicle which either displays commercial registration under the New York State Vehicle and Traffic Law or the regulations adopted thereunder or which, by reason of the attachment of advertising messages and/or storage of equipment, supplies, inventory, or other commercial merchandise or hardware, presents the appearance of a vehicle that is primarily utilized in furtherance of commercial or industrial enterprise."
												}
											]
										}
									]
								},
								{
									"footnote": "[1]\nEditor's Note: This local law also relettered\nformer Subsection B as Subsection C.\n"
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Any use not expressly permitted by § 145-9.[Added 9-9-2004 by L.L. No. 5-2004]"
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 145-10",
			"title": "Building heights.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Half-acre or less."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "The height of a residential dwelling with a pitched roof shall not\nexceed 33 feet."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "The height of a residential dwelling with a flat roof shall not exceed\n28 feet."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "In the case where there shall be a combination of pitched and flat\nroofs, the height of the pitched roof portion shall not exceed 33\nfeet and the height of the flat roof portion shall not exceed 28 feet."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "No accessory structure shall be erected or altered, any part of which\nis higher than 1 1/2 stories or exceeds 18 feet above mean existing\ngrade level around such structure."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "More than 1/2 acre to one acre."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "The height of a residential dwelling with a pitched roof shall not\nexceed 35 feet."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "The height of a residential dwelling with a flat roof shall not exceed\n32 feet."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "In the case where there shall be a combination of pitched and flat\nroofs, the height of the pitched roof portion shall not exceed 35\nfeet and the height of the flat roof portion shall not exceed 32 feet."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "No accessory structure shall be erected or altered, any part of which\nis higher than 1 1/2 stories or exceeds 18 feet above mean existing\ngrade level around such structure."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "More than one acre."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "The height of a residential dwelling with a pitched roof shall not\nexceed 35 feet."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "The height of a residential dwelling with a flat roof shall not exceed\n35 feet."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "In the case where there shall be a combination of pitched and flat\nroofs, the height of the pitched roof portion shall not exceed 35\nfeet and the height of the flat roof portion shall not exceed 35 feet."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "No accessory structure shall be erected or altered, any part of which\nis higher than 1 1/2 stories or exceeds 18 feet above mean existing\ngrade level around such structure."
												}
											]
										}
									]
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 145-10.1",
			"title": "Height/setback plane.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "A height/setback plane is a theoretical inclined plane through which\nno part of a dwelling shall penetrate. The plane begins at and perpendicular\nto the street front property line rising inward toward the building\nat an angle of 38°, to a maximum height of 35 feet. The mean existing\ngrade level at the street front building wall shall be used for the\nstart point elevation at the street front property line."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 145-10.2",
			"title": "Attics.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "No attic shall be heated or air conditioned."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Attics shall be used exclusively for storage and shall not contain\nany habitable spaces, nonhabitable spaces, recreational rooms or bathrooms."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 145-10.3",
			"title": "Street wall.",
			"content": [
				{
					"text": "The street wall shall be limited to an initial maximum height\nof 21 feet at the required front yard setback. The street wall may\nbe allowed to be increased by one foot for each additional 10 feet\nin setback, to an ultimate maximum height no greater than 25 feet\nwhile maintaining prescribed rear yard setbacks."
				}
			]
		},
		{
			"paragraph": "§ 145-10.4",
			"title": "Dormers.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "A dormer\nmay be permitted to penetrate the height/setback plane, as defined\nand regulated under the relevant sections of the Village Code, but\nonly if the aggregate width of the dormer or dormers does not exceed\n33.3% of the total width of the structure along the side of the structure\non which the dormer or dormers will be situated; but in no case shall\na dormer be erected to be higher than any building and/or accessory\nstructure. Additionally, in no case shall the exposed outside walls\nof such dormer or dormers have an aggregate surface area in square\nfeet that is greater than the aggregate length of such dormer or dormers\nin feet, multiplied by five."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "A dormer\nshall not be permitted to protrude from the face of a building structure,\nbut shall always remain flush to the side of the structure on which\nthe dormer will be situated."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 145-11",
			"title": "Lot size.",
			"content": [
				{
					"text": "No building shall be erected on any lot having an area less than the minimum specified in § 145-19 for the district in which the lot is situated. There shall be erected not more than one principal building with accessory buildings for each such minimum area, except as herein provided in relation to present existing buildings."
				}
			]
		},
		{
			"paragraph": "§ 145-12",
			"title": "Building area.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "No building, together with its accessory buildings, shall occupy in the aggregate more than the percentage of the area of the lot specified in § 145-19 for the district in which the lot is situated."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "The area occupied by all accessory buildings shall not exceed the percentage of the lot specified in § 145-19 for the district in which the lot is situated."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 145-13",
			"title": "Front yards.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "The required front yard depth shall not be less than\nthe average front yard depth of existing dwellings on lots within\n300 feet on each side of the lot and within the same block and same\ndistrict."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Where there is only one existing lot within 300 feet, the required front yard depth shall not be less than the average of the existing dwelling on the existing lot and the minimum front yard specified in § 145-19 for the district in which the lot is situated."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "In any case, no front yard depth shall be less than that specified in § 145-19 for the district in which the lot is situated."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 145-14",
			"title": "Side yards.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Two side yards shall be required, which shall have a total width not less than that specified in § 145-19 for the district in which the lot is situated."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "No side yard shall have a width less than that specified in § 145-19 for the district in which the lot is situated."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 145-15",
			"title": "Rear yards.",
			"content": [
				{
					"text": "Rear yards shall have a depth not less than that specified in § 145-19 for the district in which the lot is situated."
				}
			]
		},
		{
			"paragraph": "§ 145-15.1",
			"title": "Permitted encroachments.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Permitted encroachments in any required front yard,\nside yard and rear yard: none."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Exception: a stoop serving a dwelling, open and unroofed\nnot exceeding 30 inches above grade and not exceeding 32 square feet.\nExclusion of steps may project not more than four feet into any required\nyard. Below-grade structures such as areaways and stairs may project\nnot more than four feet into any required yard.[Amended 6-14-2007 by L.L. No. 6-2007]"
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 145-15.2",
			"title": "Maintenance of Village rights-of-way and easements.",
			"content": [
				{
					"text": "It shall be the responsibility of the property\nowner whose property includes a Village right-of-way or easement adjacent\nto maintain the right-of-way, which shall include, but not be limited\nto, cutting the grass, trimming trees and bushes, and keeping the\nproperty adequately watered."
				}
			]
		},
		{
			"paragraph": "§ 145-16",
			"title": "Street frontages.",
			"content": [
				{
					"text": "No building shall be erected on any lot having a street frontage less than the minimum specified in § 145-19 for the district in which the lot is situated. For each additional principal building or use on the same lot, an additional street frontage of a similar length is required. In the case of lots, other than comer lots, adjoining more than one street, the owner may elect which street shall be used for computing street frontage; the frontage on the other street shall be disregarded."
				}
			]
		},
		{
			"paragraph": "§ 145-17",
			"title": "Depth of lot.",
			"content": [
				{
					"text": "No building shall be erected on any lot having a depth less than the minimum specified in § 145-19 for the district in which the lot is situated. For the purpose of this section, the depth shall be the average distance between the rear line of the lot and the street frontage of the lot or, where there is no street frontage, the front fine of the lot."
				}
			]
		},
		{
			"paragraph": "§ 145-18",
			"title": "Livable floor area.",
			"content": [
				{
					"text": "No principal building used, designed or intended in whole or in part for dwelling purposes shall be erected which shall have a total livable floor area, a livable floor area on the ground or first story or a livable floor area on the second story less than the minimum specified in § 145-19 for the district in which the lot is situated."
				}
			]
		},
		{
			"paragraph": "§ 145-18.1",
			"title": "Floor area ratio (F.A.R.) for a dwelling.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "The maximum gross F.A.R. for a dwelling shall not\nexceed 5,500 square feet for lots up to 17,999 square feet in area.\nFor lots 18,000 square feet or more in area, the maximum gross F.A.R.\nfor a dwelling shall not exceed 5,500 square feet plus [(lot area\nminus 18,000 square feet) times 0.15]."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "In no case shall the maximum gross F.A.R. permit a\ndwelling in excess of 12,000 square feet gross floor area."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "The maximum gross F.A.R. for all roofed accessory\nbuildings shall not exceed 8% of the maximum F.A.R. permitted for\na dwelling on the subject lot."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 145-18.2",
			"title": "Required garage.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Dwellings hereafter erected shall provide on-premises\nan enclosed garage space for not less than two cars with interior\ndimensions of not less than 20 feet depth and width."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Existing dwellings with enclosed garage space on-premises\nhereafter altered or enlarged shall maintain not less than one enclosed\ngarage space on premises with interior dimensions of not less than\n10 feet by 20 feet."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "A garage door shall not exceed 18 feet in width. No\nbuilding facade shall have multiple garage doors totaling more than\n27 feet in width and the total combined width of all garage doors\non premises shall not exceed 36 feet in width."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 145-19",
			"title": "Table of district requirements.",
			"content": [
				{
					"text": "The following are the specific requirements for the several residence districts referred to in § 145-8:"
				}
			]
		},
		{
			"paragraph": "§ 145-19.1",
			"title": "Requirements for churches, temples and places of worship.",
			"content": [
				{
					"text": "A church, temple or other place of worship shall\ncomply with the following requirements, as well as all other applicable\nrequirements of this Code, not inconsistent herewith:"
				},
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Maximum height: three stories, not to exceed 35 feet."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Minimum lot area: 87,120 square feet."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Maximum building area: 15% of lot area."
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "Minimum front yard: 50 feet."
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "Minimum rear yard: 50 feet."
								}
							]
						},
						{
							"number": "F. ",
							"content": [
								{
									"text": "Minimum side yards: 50 feet each."
								}
							]
						},
						{
							"number": "G. ",
							"content": [
								{
									"text": "Minimum street frontage: 300 feet."
								}
							]
						},
						{
							"number": "H. ",
							"content": [
								{
									"text": "Minimum depth of lot: 200 feet."
								}
							]
						},
						{
							"number": "I. ",
							"content": [
								{
									"text": "Minimum off-street parking: one parking space, having\na minimum dimension of nine feet by 20 feet, for each 100 square feet\nof total floor area in the building."
								}
							]
						},
						{
							"number": "J. ",
							"content": [
								{
									"text": "Location of off-street parking: No off-street parking\nshall be located in the minimum required side yards, front yard or\nrear yard."
								}
							]
						},
						{
							"number": "K. ",
							"content": [
								{
									"text": "Curb cuts: Curb cuts shall not be located in front\nof any minimum required side yard."
								}
							]
						},
						{
							"number": "L. ",
							"content": [
								{
									"text": "Minimum screening: thick plantings of trees, shrubs\nand hedges of a type, variety and size, as may be approved by the\nBuilding Inspector, having a minimum width of 10 feet along the side\nand rear yards, and intended to screen all uses from view from adjacent\nlots. All plantings shall be of good quality and shall be adequately\nmaintained and replaced as may be required."
								}
							]
						},
						{
							"number": "M. ",
							"content": [
								{
									"text": "Conduct of activities: All activities shall be conducted\ninside the buildings, and no activities of any kind shall be conducted\noutside the building."
								}
							]
						},
						{
							"number": "N. ",
							"content": [
								{
									"text": "Noise: All reasonable steps shall be taken to confine\nnoise, music and sound within the building so as not to adversely\naffect adjacent properties."
								}
							]
						}
					]
				}
			]
		}
	]
}