{
	"url": "http://ecode360.com/29141918",
	"paras": [
		{
			"paragraph": "§ 355-20",
			"title": "Adoption of schedules.",
			"content": [
				{
					"text": "The accompanying Schedules of Regulations (§§ 355-21, 355-22, 355-23 and 355-24) list and define the use of land and buildings, the height of buildings, the yards and other open space to be provided in connection with buildings, the area of lots and other matters. The regulations listed for each district as designated are hereby adopted and prescribed for each such district, subject to the provisions of this section and, unless otherwise indicated, shall be deemed to be the minimum requirements in every instance of their application."
				}
			]
		},
		{
			"paragraph": "§ 355-21-R-3/4A",
			"title": "Schedule of Residence District Regulations.",
			"content": [
				{
					"text": "See the Schedule of Residence District Regulations included\nas an attachment to this chapter."
				},
				{
        			"content": [
        				{
        					"number": "3. ",
        					"content": [
        						{
        							"text": "Permitted Accessory Use Dimensions(stories/feet/square footage): 15/1/800"
        						}
        					]
        				},
        				{
        					"number": "4. ",
        					"content": [
        						{
        							"text": "Lot Area(square feet): 32670"
        						}
        					]
        				},
        				{
        					"number": "5. ",
        					"content": [
        						{
        							"text": "Frontage(feet): 125"
        						}
        					]
        				},
        				{
        					"number": "6. ",
        					"content": [
        						{
        							"text": "Lot Width(feet): 125"
        						}
        					]
        				},
        				{
        					"number": "7. ",
        					"content": [
        						{
        							"text": "Lot Depth(feet): 150"
        						}
        					]
        				},
        				{
        					"number": "8. ",
        					"content": [
        						{
        							"text": "Minimum Yards, Front(feet): 40"
        						}
        					]
        				},
        				{
        					"number": "9. ",
        					"content": [
        						{
        							"text": "Minimum Yards, Side(feet): 25"
        						}
        					]
        				},
        				{
        					"number": "10. ",
        					"content": [
        						{
        							"text": "Minimum Yards, Rear(feet): 40"
        						}
        					]
        				},
        				{
        					"number": "11. ",
        					"content": [
        						{
        							"text": "Maximum Building Height(stories): 2.5"
        						}
        					]
        				},
        				{
        					"number": "12. ",
        					"content": [
        						{
        							"text": "Maximum Building Height(feet): 30"
        						}
        					]
        				},
        				{
        					"number": "13. ",
        					"content": [
        						{
        							"text": "Maximum Building Coverage(%): 15"
        						}
        					]
        				},
        				{
        					"number": "14. ",
        					"content": [
        						{
        							"text": "Minimum Dwelling Unit Size(square feet): 1000"
        						}
        					]
        				}
        			]
        		}
			]
		},
		{
			"paragraph": "§ 355-22",
			"title": "Schedule of Business District Regulations.",
			"content": [
				{
					"text": "See the Schedule of Business District Regulations included as\nan attachment to this chapter."
				}
			]
		},
		{
			"paragraph": "§ 355-23",
			"title": "Schedule of Office and Industrial District Regulations.",
			"content": [
				{
					"text": "See the Schedule of Office and Industrial District Regulations\nincluded as an attachment to this chapter."
				}
			]
		},
		{
			"paragraph": "§ 355-24",
			"title": "Additional multifamily residence district regulations.\n[1]",
			"content": [
				{
					"text": "In an R-MF Multifamily District, all such uses shall be subject to site plan approval in accordance with Article VIII of this chapter."
				},
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Intent. This district is established in order to increase the supply\nof dwelling units suitable for smaller families or individuals, to\npreserve significant open space, to secure superior land planning\nand to increase the supply of moderate-cost housing. In addition,\nthis district shall promote the creation of AFFH dwelling units in\nproximity to the downtown area in order to mitigate existing parking\nconditions and to promote business activity within the hamlet area.\nSite location shall conform to the standards set forth in the Town\nDevelopment Plan.[Amended 3-24-1994 by L.L. No. 4-1994; 5-14-2014 by L.L. No.\n1-2014]"
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Allowable density.[Amended 12-13-2006 by L.L. No. 28-2006]"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Maximum density. The maximum gross density shall not exceed one density unit, as defined in § 355-4 of this chapter, per 25,000 square feet of net lot area, as defined in Subsection B(2).[Amended 5-14-2014 by L.L. No. 1-2014]"
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Net density. To further the achievement of the objectives of the State Freshwater Wetlands Act (Article 24 and Title 23 of Article 71 of the Environmental Conservation Law), the State Environmental Quality Review Act (Article 8 of the Environmental Conservation Law), Chapter 209, Wetlands and Watercourse Protection, of the Town Code, the North Castle Town Development Plan and § 355-18 of this chapter, the lot area used in the calculation of maximum density in the R-MF District shall be \"net lot area,\" as defined herein.[Amended 5-23-2012 by L.L. No. 2-2012]"
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Bedrooms. The Planning Board shall be responsible for determining\nthe number of bedrooms in each dwelling unit, in connection with its\nreview of site development plans."
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "Water and sewage facilities.[Amended 3-24-1994 by L.L. No. 4-1994]"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "All attached, semidetached, detached or multifamily dwellings shall\nbe served by public water and sewage treatment facilities, and no\ncertificate of occupancy shall be issued until all dwelling units\nare connected to approved and functioning public water and sewage\ntreatment systems. Where, in the opinion of the Planning Board, connection\nto or establishment of public water facilities is not possible, or\nnot warranted, a central water supply system shall be designed and\nconstructed to serve all dwelling units in accordance with the standards\nand subject to the approval of the Westchester County Department of\nEnvironmental Conservation. Such central system shall be designed\nand located in such a way as to readily permit its connection and/or\nconversion to an off-site system at such time as it is constructed."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Where water supply for a project is predominantly dependent upon\nwater drawn from such property and, in the opinion of the Planning\nBoard, the geology of an area is such that wells of large capacity\nwill adversely impact existing wells on nearby properties, individual\nwater meters for each dwelling unit shall be installed, this impact\nwill be studied in an environmental impact statement, sufficient measures\nas directed by the Planning Board shall be taken by the applicant\nto prevent such adverse impact or to indemnify the owners of such\nimpacted wells and/or, where feasible, an off-site source of water\nsupply shall be developed."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "Antenna system. A central television antenna, a dish antenna or cable\nservice, where available, shall be provided for each group of attached\ndwelling units as well as each detached dwelling unit.[Amended 3-24-1994 by L.L. No. 4-1994]"
								}
							]
						},
						{
							"number": "F. ",
							"content": [
								{
									"text": "Open space and recreation area. At least 50% of the gross area of the site shall be preserved as permanent open space, free of buildings and parking area, and shall be landscaped or left in its natural state in accordance with the provisions of § 355-15M."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Character. Such area shall encompass land having meaningful ecological,\naesthetic and recreational characteristics, with access, shape, dimensions,\nlocation, topography and extent of improvements suitable, in the opinion\nof the Planning Board, for the intended purposes."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Preservation in developments comprised solely of rental units. Permanent\npreservation of such open space and recreation areas shall be legally\nassured, to the satisfaction of the Planning Board, by the filing\nof appropriate covenants, deed restrictions, easements or other agreements.\nIt shall be the property owner's responsibility to maintain all open\nspace and recreation areas and such other common areas within the\nowner's control, such as but not limited to foyers, hallways, streets,\ndriveways, curbs, sidewalks, landscaping and lighting, in a safe,\nclean and orderly condition. Such maintenance shall include removal\nof snow from internal streets and driveways. In the event that the\nmaintenance, preservation and/or use of the conserved land areas ceases\nto be in compliance with any of the requirements of this section or\nany other requirements specified by the Planning Board when approving\nthe site plan, the Town shall be granted the right to take all necessary\naction to assure such compliance and to assess against the property\nowner all costs incurred by the Town for such purposes."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Preservation in all other developments. Permanent preservation of\nsuch open space and recreation areas shall be legally assured, to\nthe satisfaction of the Planning Board and the Town Attorney, by the\nfiling of appropriate covenants, deed restrictions, easements or other\nagreements. Except where all or parts of such areas are deeded to\nand accepted by the Town of North Castle or a recognized conservation\norganization, ownership of such areas shall be divided proportionally\namong all property owners within the development, and a property owners'\nassociation, membership in which shall be mandatory for all owners\nin the development, shall be incorporated, which association shall\nbe responsible for maintenance, liability insurance and local taxes.\nSuch association shall be empowered to levy assessments against property\nowners to defray the cost of maintenance and to acquire liens, where\nnecessary, against property owners for unpaid charges or assessments.\nIn the event that the property owners' association fails to perform\nthe necessary maintenance operations, the Town of North Castle shall\nbe authorized to enter upon such premises for the purpose of performing\nsuch operations and to assess the cost of so doing, plus a penalty\nof 10%, against the association and/or each individual property owner\nequally."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "Improvement. Within such common open space areas, a total of not\nless than 300 square feet per density unit shall be improved with\ncommon recreational facilities, such as swimming pools, tennis, basketball,\nvolleyball and shuffleboard courts, playground equipment, etc., for\nthe use of the residents of the premises and their guests, which facilities\nshall not be operated for profit. Where special recreational considerations\nmust be met, such as for senior citizens, the site plan shall contain\nelements encompassing and satisfying these needs."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "G. ",
							"content": [
								{
									"text": "Design considerations. In order that multifamily developments will\nbe properly planned in relation to the community and personal needs\nof people, the following design elements shall be considered by the\nPlanning Board and the Architectural Review Board in addition to the\nnormal factors examined in site plan review:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Visual privacy should be preserved for residents through the proper\ndesign of rear yards and/or patio spaces. Proper screening through\nthe use of vegetation, fencing and partially or fully enclosed patios\nshould be provided."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Audio privacy should be maintained by requiring proper standards\nfor solid party walls that will satisfactorily limit sound transmission\nbetween adjoining dwelling units."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Appropriate scale should be preserved through limiting building height\nto, in general, no more than two stories of living quarters."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "Unenclosed porches, stairs and decks may not encroach into minimum\nrequired yards except where built with sufficient vertical clearance\nand then only up to five feet into such yards.[Added 3-24-1994 by L.L. No. 4-1994]"
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "H. ",
							"content": [
								{
									"text": "Required parking."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Parking spaces shall be provided in number and design according to the provisions of Article IX of this chapter."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "At least 1/3 but not more than 2/3 of the minimum required parking\nspaces shall be enclosed within garages or carports."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "All self-propelled maintenance equipment, including accessories,\nshall be stored in enclosed structures only, which structures shall\nconform in architectural theme to the residential buildings of the\ndevelopment."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "The Planning Board may require, if deemed appropriate, the provision\nof a suitably screened parking area solely for the storage of boats,\nmotor homes, travel trailers and pickup coaches belonging to inhabitants\nof the development."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "I. ",
							"content": [
								{
									"text": "Affordable affirmatively furthering fair housing (AFFH) units and\nmiddle-income units.[Amended 3-24-1994 by L.L. No. 4-1994; 7-20-1995 by L.L. No. 5-1995; 12-18-1997 by L.L. No. 8-1997; 9-10-2008 by L.L. No. 16-2008; 5-14-2014 by L.L. No. 1-2014]"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Required affordable AFFH unit component. Within all residential developments of 10 or more units created by subdivision or site plan approval, no less than 10% of the total number of units shall be created as affordable AFFH units. In residential developments of eight units to nine units, at least one affordable AFFH unit shall be created. No preferences shall be utilized to prioritize the selection of income-eligible tenants or purchasers for affordable AFFH units. Notwithstanding the above, all such affordable AFFH units, whether for purchase or for rent, shall be marketed in accordance with the Westchester County Fair and Affordable Housing Affirmative Marketing Plan. Multifamily developments in the CB-A, R-MF-A and R-MF-SS Districts shall require additional AFFH units (pursuant to §§ 355-29B, 355-24 and 355-28, respectively). All middle-income units which have received Planning Board site plan approval, but not building permits, as of the effective date of this subsection shall be subject to the provisions of this subsection and constructed and marketed as AFFH units."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Maximum rent and sales price. The maximum monthly rent for an affordable\nAFFH unit and the maximum gross sales price for an FAH unit shall\nbe established in accordance with U.S. Department of Housing and Urban\nDevelopment guidelines as published in the current edition of the\nWestchester County Area Median Income (AMI) Sales and Rent Limits\navailable from the County of Westchester."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Time period of affordability. Units designated as affordable AFFH\nunits shall remain affordable for a minimum of 50 years from the date\nof the initial certificate of occupancy for rental properties and\nfrom the date of the original sale for ownership units."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "Property restriction. A property containing any affordable AFFH units\nshall be restricted using a mechanism such as a declaration of restrictive\ncovenants in recordable form acceptable to the Town which shall ensure\nthat the affordable AFFH unit shall remain subject to affordable regulations\nfor the minimum fifty-year period of affordability. The covenants\nshall require that the unit be the primary residence of the resident\nhousehold selected to occupy the unit. Upon approval, such declaration\nshall be recorded against the property containing the affordable AFFH\nunit prior to the issuance of a certificate of occupancy for the development."
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "Unit appearance and integration."
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "Within single-family developments, the affordable AFFH units\nshall also be single-family homes. Each such one-family home shall\nbe located on a lot meeting the minimum lot area for the single-family\nhomes in the development. All such units shall be similar and compatible\nin appearance, siting and exterior design to the other single-family\nhomes in the development, to the furthest extent possible. Interior\nfinishes and furnishings may be reduced in quality and cost to assist\nin the lowering of the cost of development of the affordable AFFH\nunits."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "Within multifamily developments, the affordable AFFH units shall\nbe physically integrated into the design of the development and shall\nbe distributed among various sizes (efficiency, one-, two-, three-\nand four-bedroom units) in the same proportion as all other units\nin the development. The affordable AFFH units shall not be distinguishable\nfrom other market-rate units from the outside or building exteriors.\nInterior finishes and furnishings may be reduced in quality and cost\nto assist in the lowering of the cost of development of the affordable\nAFFH units."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "Notwithstanding the above, where the Town Board determines that\nthe on-site location of AFFH units is not practical, the Town Board\nmay permit the applicant to construct the AFFH units at another location\nwithin the Town. However, the Town shall place a strong preference\nfor AFFH units provided on site."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(6) ",
											"content": [
												{
													"text": "Minimum floor area."
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "The minimum gross floor area per affordable multifamily AFFH\nunit shall not be less than 80% of the average floor area of nonrestricted\nhousing units in the development and no less than the following:"
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "The minimum gross floor area per affordable single-family AFFH\nunit shall not be less than 80% of the average floor area of nonrestricted\nhousing units in the development or less than the following, whichever\nis lesser. However, in no case shall the AFFH unit be less than the\nfollowing:"
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "For the purposes of this section, paved terraces or balconies\nmay be counted toward the minimum gross floor area requirement in\nan amount not to exceed 1/3 of the square footage of such terraces\nor balconies. As an alternative, the minimum gross floor area per\naffordable AFFH unit shall be in accordance with the standards set\nforth by the New York State Division of Housing and Community Renewal\nand the New York State Housing Trust Fund Corporation in Section 4.03.03\nof the most recent edition of its Joint Design Manual."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(7) ",
											"content": [
												{
													"text": "Occupancy standards. For the sale or rental of affordable AFFH units,\nthe following occupancy schedule shall apply:"
												}
											]
										},
										{
											"number": "(8) ",
											"content": [
												{
													"text": "Affirmative marketing. The affordable AFFH units created under the\nprovisions of this section shall be sold or rented, and resold and\nrerented during the required period of affordability, to only qualifying\nincome-eligible households. Such income-eligible households shall\nbe solicited in accordance with the requirements, policies and protocols\nestablished in the Westchester County Fair and Affordable Housing\nAffirmative Marketing Plan so as to ensure outreach to racially and\nethnically diverse households."
												}
											]
										},
										{
											"number": "(9) ",
											"content": [
												{
													"text": "Resale requirements."
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "In the case of owner-occupied affordable AFFH units, the title\nto said property shall be restricted so that in the event of any resale\nby the home buyer or any successor, the resale price shall not exceed\nthe then-maximum selling price for said unit, as determined in this\nsection of the Town Code, or the sum of:"
																},
																{
																	"content": [
																		{
																			"number": "[1] ",
																			"content": [
																				{
																					"text": "The net purchase price (i.e., gross sales prices minus subsidies)\npaid for the unit by the selling owner, increased by the percentage\nincrease, if any, in the Consumer Price Index for Urban Wage Earners\nand Clerical Workers in the New York-Northern New Jersey Area, as\npublished by the United States Bureau of Labor Statistics (the \"Index\")\non any date between (a) the month that was two months earlier than\nthe date on which the seller acquired the unit and (b) the month that\nis two months earlier than the month in which the seller contracts\nto sell the unit. If the Bureau stops publishing this index, and fails\nto designate a successor index, the Westchester County Department\nof Planning shall designate a substitute index; and"
																				}
																			]
																		},
																		{
																			"number": "[2] ",
																			"content": [
																				{
																					"text": "The cost of major capital improvements made by the seller of\nthe unit while said seller of the unit owned the unit as evidenced\nby paid receipts depreciated on a straight-line basis over a fifteen-year\nperiod from the date of completion, and such approval shall be requested\nfor said major capital improvement no later than the time the seller\nof the unit desires to include it in the resale price."
																				}
																			]
																		}
																	]
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "Notwithstanding the foregoing, in no event shall the resale\nprice exceed an amount affordable to a household at 80% of AMI at\nthe time of the resale."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(10) ",
											"content": [
												{
													"text": "Lease renewal requirements. Applicants for rental affordable\nAFFH units shall, if eligible and if selected for occupancy, sign\nleases for a term of no more than two years. As long as a resident\nremains eligible and has complied with the terms of the lease, said\nresident shall be offered renewal leases for terms of no more than\ntwo years each. Renewal of a lease shall be subject to the conditions\nof federal, state or county provisions that may be imposed by the\nterms of the original development funding agreements for the development\nor to the provisions of other applicable local law. If no such provisions\nare applicable and if a resident's annual gross income should subsequently\nexceed the maximum then allowable, as defined in this chapter, then\nthe renter may complete his or her current lease term, and at the\nend of that lease term, if a rental unit that is not an AFFH unit\nis available, the renter may be offered a lease for that rental unit\nthat is not an AFFH unit; or if a rental unit that is not an AFFH\nunit is not available, he or she may be allowed to sign one additional\none-year lease for the AFFH unit currently occupied but shall not\nbe offered a renewal of the lease beyond the expiration of that additional\none-year lease term."
												}
											]
										},
										{
											"number": "(11) ",
											"content": [
												{
													"text": "Administrative and monitoring agency. The County of Westchester\nor its designated agency or delegate shall administer the requirements\nof this subsection and, among other things, be responsible for monitoring\nthe AFFH units during the units' periods of affordability and for\nmonitoring compliance with the income and eligibility requirements\nand affirmative marketing responsibilities applicable to the AFFH\nunits."
												}
											]
										},
										{
											"number": "(12) ",
											"content": [
												{
													"text": "Middle-income dwelling units. All existing middle-income units\nshall be subject to the following provisions:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "Distribution. Such units shall be available for resale or continuing rental only to middle-income families as defined in § 355-4 of this chapter."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "Occupancy standards. In renting or selling, the following schedule\nshall apply to middle-income dwelling units:"
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "Maximum rent and sales price."
																},
																{
																	"content": [
																		{
																			"number": "[1] ",
																			"content": [
																				{
																					"text": "Rental. The maximum monthly rent for a middle-income dwelling unit shall not exceed 1.8%, excluding utilities (gas, oil and electricity), or 2.0%, if utilities are included, of the maximum aggregate family income for a middle-income family as defined in § 355-4 of this chapter for the maximum size of family eligible for such unit as set forth in Subsection I(12)(b) above."
																				}
																			]
																		},
																		{
																			"number": "[2] ",
																			"content": [
																				{
																					"text": "Sales. The maximum gross sales price for a middle-income unit shall not exceed two times the maximum aggregate family income for a middle-income family as defined in § 355-4 of this chapter for the maximum size of family eligible for such unit as set forth in Subsection I(12)(b) above. In addition, a one-percent inflation rate per year of ownership (not compounded) may be added to the original purchase price contingent upon the owner(s) demonstrating to the Housing Board that the MIU has been maintained in excellent condition. Application of the annual percentage increase shall be subject to the discretion of the Housing Board based solely upon the condition of the MIU."
																				}
																			]
																		},
																		{
																			"number": "[3] ",
																			"content": [
																				{
																					"text": "Mortgages. The applicant shall, if possible, obtain from the\nlending institution chosen for the development a commitment to provide,\nfor all middle-income units, mortgages for up to 95% of unit cost,\nor for the maximum amount for which the mortgagor qualifies, whichever\nis less."
																				}
																			]
																		}
																	]
																}
															]
														},
														{
															"number": "(d) ",
															"content": [
																{
																	"text": "Eligibility priority list; residency requirement."
																},
																{
																	"content": [
																		{
																			"number": "[1] ",
																			"content": [
																				{
																					"text": "Eligibility priority list."
																				},
																				{
																					"content": [
																						{
																							"number": "[a] ",
																							"content": [
																								{
																									"text": "For the purpose of these regulations, the minimum\nresidency requirement is as follows:"
																								},
																								{
																									"content": [
																										{
																											"number": "[i] ",
																											"content": [
																												{
																													"text": "North Castle: two years."
																												}
																											]
																										},
																										{
																											"number": "[ii] ",
																											"content": [
																												{
																													"text": "Westchester County: two years."
																												}
																											]
																										}
																									]
																								}
																							]
																						},
																						{
																							"number": "[b] ",
																							"content": [
																								{
																									"text": "Whenever the applicant qualifies in more than one category, the highest point value within each section applies. The point values of each section are then added together to arrive at the total point value. The \"applicant\" shall be defined as any individual member of a family whose income is included in the eligibility requirements of this § 355-24."
																								}
																							]
																						},
																						{
																							"number": "[c] ",
																							"content": [
																								{
																									"text": "The priority list shall be as follows:"
																								}
																							]
																						}
																					]
																				}
																			]
																		},
																		{
																			"number": "[2] ",
																			"content": [
																				{
																					"text": "Owner to be resident. Each MIU shall be the only residence of\nits owner. All eligible applicants who are owners of any other residence\nshall satisfy the Housing Board of the purchase of an MIU. For the\npurposes of these regulations, real estate used by the applicant to\nderive income shall be excluded. Such income is to be calculated in\ndetermining the applicant's gross annual family income."
																				}
																			]
																		}
																	]
																}
															]
														},
														{
															"number": "(e) ",
															"content": [
																{
																	"text": "Continued eligibility."
																},
																{
																	"content": [
																		{
																			"number": "[1] ",
																			"content": [
																				{
																					"text": "Rental. Applicants for middle-income rental units referred to in this section shall, if eligible and if selected for occupancy by the owner or manager of the development, sign leases for a term of no more than two years. As long as a resident remains eligible and has complied with the terms of the lease, said resident shall be offered a two-year renewal of the lease. If a resident's annual gross income should subsequently exceed by more than 20% the maximum then allowable, as defined in § 355-4 of this chapter, and if there is at that time an otherwise eligible applicant within one of the categories in Subsection I(12)(d) above, said resident may complete his current lease term and shall be offered a non-middle-income rental unit available in the development at the termination of such lease term, if available. If no such dwelling unit shall be available at said time, the resident may be allowed to sign one additional one-year lease for the middle-income dwelling unit occupied but shall not be offered a renewal of the lease beyond the expiration of said term. An MIU owner shall provide the Housing Board with a letter stating the owner's intent to make an MIU unit available for rerental. Upon receipt of the letter, the Housing Board shall make an appointment to inspect the unit prior to the unit being advertised for rent. The purpose of the inspection shall be to evaluate and document the condition of the unit. In the event an MIU is not habitable or not in resale condition, the Housing Board reserves the right to require the MIU owner to make any necessary repairs."
																				}
																			]
																		},
																		{
																			"number": "[2] ",
																			"content": [
																				{
																					"text": "Sales."
																				},
																				{
																					"content": [
																						{
																							"number": "[a] ",
																							"content": [
																								{
																									"text": "In the case of owner-occupied middle-income dwelling units, the title to said property shall be restricted, so that in the event of any resale by the home buyer or any successor, the resale price shall not exceed the then-maximum sales price for said unit, as determined in accordance with Subsection I(12)(c)[2] of this section, or the sum of the following, whichever is less:"
																								},
																								{
																									"content": [
																										{
																											"number": "[i] ",
																											"content": [
																												{
																													"text": "The amount of any principal payment made by the\nhome buyer."
																												}
																											]
																										},
																										{
																											"number": "[ii] ",
																											"content": [
																												{
																													"text": "The remaining principal on any mortgage(s)."
																												}
																											]
																										},
																										{
																											"number": "[iii] ",
																											"content": [
																												{
																													"text": "The value of any eligible fixed improvements,\nas permitted below, and not included with Subsection I(12)(e)[2][a][i]\nor [ii] above. Eligible fixed improvements for homeowners of middle-income\nunits:"
																												},
																												{
																													"content": [
																														{
																															"number": "[A] ",
																															"content": [
																																{
																																	"text": "In order to qualify as an eligible fixed improvement,\neach expenditure shall be approved conditionally in advance by the\nTown Housing Board."
																																}
																															]
																														},
																														{
																															"number": "[B] ",
																															"content": [
																																{
																																	"text": "The homeowner shall submit in advance to the Town\nHousing Board detailed plans for each proposed eligible fixed improvement\nand an itemization of the expected costs."
																																}
																															]
																														},
																														{
																															"number": "[C] ",
																															"content": [
																																{
																																	"text": "The Town Housing Board shall review the proposal\nand conditionally approve eligible fixed improvements within 30 days\nor shall indicate the reasons denying the proposal."
																																}
																															]
																														},
																														{
																															"number": "[D] ",
																															"content": [
																																{
																																	"text": "If an item wears out prior to the determined life\nexpectancy as indicated in Subsection I(12)(e)[2][a][3][L], approval\nfrom the Town Housing Board shall be obtained prior to the replacement\nof the item. Within 30 days after review of the fixed improvement\nrequest, the Town Housing Board shall notify the homeowner in writing\nwhether or not the proposed expenditure is approved conditionally\nas an eligible fixed improvement."
																																}
																															]
																														},
																														{
																															"number": "[E] ",
																															"content": [
																																{
																																	"text": "Within 60 days after a proposed eligible fixed\nimprovement has been completed, the homeowner shall apply for final\napproval by the Town Housing Board for the eligible fixed improvement.\nComplete documentation demonstrating all costs of the improvement\nshall be submitted to the satisfaction of the Housing Board and include\nthe following information:"
																																}
																															]
																														},
																														{
																															"number": "[F] ",
																															"content": [
																																{
																																	"text": "Within 60 days after the review of the fixed improvement\nrequest, the Town Housing Board shall notify the homeowner in writing\nabout the eligibility of the fixed improvement credit."
																																}
																															]
																														},
																														{
																															"number": "[G] ",
																															"content": [
																																{
																																	"text": "If bartered goods or services were included in\nthe cost, the homeowner shall submit an independent valuation of the\nvalue of those goods or services to the satisfaction of the Town Housing\nBoard. If labor of the homeowner, the homeowner's spouse, children\nor parents for construction work is included within the cost, a detailed\naccount of the work and time spent on the work shall be submitted\nalong with two current estimates of the value of that work by at least\ntwo construction contractors licensed by Westchester County to the\nsatisfaction of the Town Housing Board."
																																}
																															]
																														},
																														{
																															"number": "[H] ",
																															"content": [
																																{
																																	"text": "The Town shall have the right to inspect the property\nat times that are mutually convenient to the Town and the homeowner\nto confirm that the eligible fixed improvements have been completed\nin a workmanlike manner and the reasonable value of the improvement.\nIf the Town, in its reasonable discretion, is unsatisfied with the\ndocumentation provided by the homeowner, it may base its determination\nof the value of the improvements upon an estimation provided by an\nobjective third-party professional."
																																}
																															]
																														},
																														{
																															"number": "[I] ",
																															"content": [
																																{
																																	"text": "At the conclusion of this process, the Town Housing\nBoard shall send a written statement of determination regarding the\nfixed improvement status to the homeowner."
																																}
																															]
																														},
																														{
																															"number": "[J] ",
																															"content": [
																																{
																																	"text": "Eligible fixed improvements shall not exceed a\ntotal of 0.5% of the original purchase price for the first complete\ncalendar year during which the homeowner possessed the property if\nthe homeowner purchased the property after September 10, 2008. Thereafter,\nthe yearly limit shall be 1.0% of the original purchase price for\neach subsequent year of homeownership. The owner may include within\nthe limit for eligible capital improvements an amount up to the total\nproduced by adding together all of the yearly limits for each completed\ncalendar year during which the owner has owned the property. Fixed\nimprovements shall not exceed a total of 0.5% of the original purchase\nprice for the first complete calendar year after September 10, 2008.\nThereafter, the yearly limit shall be 1.0% of the original purchase\nprice for each subsequent year of homeownership. The owner may include\nwithin the limit for eligible capital improvements an amount up to\nthe total produced by adding together all of the yearly limits for\neach completed calendar year subsequent to September 10, 2008."
																																}
																															]
																														},
																														{
																															"number": "[K] ",
																															"content": [
																																{
																																	"text": "Improvements eligible for fixed improvement credit\nare those items which:"
																																}
																															]
																														},
																														{
																															"number": "[L] ",
																															"content": [
																																{
																																	"text": "The following improvements are normally considered\nto be of a fixed nature and may be added to the resale price (when\nthey were not included in the original purchase price). The standard\nlife expectancy is indicated in parentheses:"
																																}
																															]
																														},
																														{
																															"number": "[M] ",
																															"content": [
																																{
																																	"text": "Improvements considered to be nonfixed or cosmetic\nare not eligible. Additionally, luxury and high-end items chosen over\nstandard grades will not be eligible for fixed improvement credits\nas determined by the Town Housing Board."
																																}
																															]
																														}
																													]
																												}
																											]
																										},
																										{
																											"number": "[iv] ",
																											"content": [
																												{
																													"text": "Reasonable and necessary expenses incidental to\nthe resale."
																												}
																											]
																										}
																									]
																								}
																							]
																						},
																						{
																							"number": "[b] ",
																							"content": [
																								{
																									"text": "The deed of ownership of any MIU shall contain a covenant and restriction that it is subject to the middle-income housing provisions of Chapter 355, Zoning, of the Code of the Town of North Castle, as amended from time to time, and that such provisions include restrictions on occupancy and resale. The covenants and restrictions imposed on an MIU shall be in form and content as to enable the same to be recorded with the County Clerk, Division of Land Records, Westchester County, and shall be satisfactory to the attorneys to the Town of North Castle."
																								}
																							]
																						},
																						{
																							"number": "[c] ",
																							"content": [
																								{
																									"text": "An MIU owner shall provide the Housing Board with\na letter stating the owner's intent to make an MIU unit available\nfor resale. Upon receipt of the letter, the Housing Board shall make\nan appointment to inspect the unit prior to the unit being advertised\nfor sale. The purpose of the inspection shall be to evaluate and document\nthe condition of the unit. In the event an MIU is not habitable or\nnot in resale condition, the Housing Board reserves the right to reduce\nthe unit's selling price."
																								}
																							]
																						}
																					]
																				}
																			]
																		}
																	]
																}
															]
														},
														{
															"number": "(f) ",
															"content": [
																{
																	"text": "Administration."
																},
																{
																	"content": [
																		{
																			"number": "[1] ",
																			"content": [
																				{
																					"text": "The Town Board shall establish a Town Housing Board, which shall\nbe responsible for the administration of the middle-income housing\nrequirements of this section as well as for the promulgation of such\nrules and regulations as may be necessary to implement such requirements."
																				}
																			]
																		},
																		{
																			"number": "[2] ",
																			"content": [
																				{
																					"text": "At the time of the issuance of a building permit, the Building\nInspector shall send a copy of such certificate to the Town Housing\nBoard, which shall then inform the applicant of the maximum rental\nor sales charge which may be established for the middle-income dwelling\nunits in such development and the maximum annual gross family income\nfor eligibility for occupancy of said units."
																				}
																			]
																		},
																		{
																			"number": "[3] ",
																			"content": [
																				{
																					"text": "The Town Housing Board shall certify as eligible all applicants\nfor rental or sale middle-income dwelling units and shall annually\nreexamine or cause to be reexamined each occupancy family's income."
																				}
																			]
																		},
																		{
																			"number": "[4] ",
																			"content": [
																				{
																					"text": "On or before March 30 of each year thereafter, the Town Housing\nBoard shall notify the owner or manager of each multifamily development\ncontaining middle-income units as to the rent, sales and income eligibility\nrequirements for such units based upon figures derived from the Town\nbudget for that year."
																				}
																			]
																		},
																		{
																			"number": "[5] ",
																			"content": [
																				{
																					"text": "The owner or manager of such multifamily development shall certify\nto the Town Housing Board on or before May 31 of each year that the\ncurrent rental or sales prices of all middle-income dwelling units\ncomply with the terms of this chapter."
																				}
																			]
																		}
																	]
																}
															]
														},
														{
															"number": "(g) ",
															"content": [
																{
																	"text": "Appeals. The Town Board shall review and decide appeals from\nany determination of the Housing Board. Applicants requesting an appeal\nmust do so, in writing, within 14 days of receipt of the determination\nof the Housing Board from which the appeal is filed. The Town Board\nshall hear the appeal within 30 days of the filing of the notice of\nappeal with the Town and shall render its decision within 15 days\nthereafter."
																}
															]
														}
													]
												}
											]
										}
									]
								}
							]
						}
					]
				},
				{
					"footnote": "[1]\nEditor's Note: The title of this section was amended 12-3-2002\nby L.L. No. 11-2002.\n"
				}
			]
		},
		{
			"paragraph": "§ 355-25",
			"title": "Additional R-MF-A Residence District regulations.",
			"content": [
				{
					"text": "In an R-MF-A Multifamily District, all such uses shall be subject to site plan approval in accordance with Article VIII of this chapter."
				},
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Intent. This district is established in order to further promote\nthe goals and purposes of the Multifamily R-MF Zone and to further\npromote the goals of the Town Development Plan by providing a multifamily\nresidential density at the upper end of the density range as set forth\nin such Town Development Plan for \"Hamlet Density.\""
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Applicability. All standards and requirements as set forth in § 355-24 above for the R-MF Multifamily District shall be likewise applicable to the R-MF-A District, except as follows:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Allowable density. The average gross density shall not exceed one density unit, as defined in § 355-4 of this chapter, per 14,000 square feet of land area as defined in Subsection B(2) of § 355-24 above.[Amended 5-14-2014 by L.L. No. 1-2014]"
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Improved recreation area. Instead of the requirements of § 355-24F(4), all such uses shall comply with the requirements of Chapter 225, Parkland Reservations, of the Town Code."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Detached units. A property owner will be permitted to incorporate detached units as defined in § 355-4 at a percentage not to exceed 60% of the total proposed dwelling units, including attached, semidetached, detached and multifamily dwelling units, exclusive of AFFH units, provided that the previously approved number of AFFH units is increased by at least 100%.[Amended 5-14-2014 by L.L. No. 1-2014]"
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "Integrated lots. If middle-income units are included within a proposed\ndevelopment, and such middle-income units are located on a separate\nsite, the density requirements of this section shall apply to the\ncombined area of the two sites. All middle-income units shall be located\nwithin 1,000 feet of a retail business zone."
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "Setbacks. The Planning Board, as a part of its site plan review and\napproval process, is hereby granted the authority to modify all applicable\ndimensional requirements for sites that contain exclusively middle-income\nunits and that involve the renovation and/or expansion of existing\nstructures. The determination to modify such setback requirements\nshall take into consideration the desire to maximize the number of\nMIUs, as well as the existing shape of the lot, its size, its topography\nand the location of existing structures."
												}
											]
										}
									]
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 355-26",
			"title": "Additional one- and two-family residence district regulations.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Legislative intent."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "It is the legislative intent of the Town Board to establish additional\nregulations controlling building height, gross floor area, gross land\ncoverage and the construction of new, substantially expanded or reconstructed\none- and two-family dwellings in one- and two-family residence districts\nfor the purpose of protecting the established and attractive character\nof the Town's various neighborhoods and assuring privacy and adequate\naccess to light and air for all present and future Town residents."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "It is also the legislative intent of the Town Board to further the achievement of the objectives of the State Freshwater Wetlands Act (Article 24 and Title 23 of Article 71 of the Environmental Conservation Law), the State Environmental Quality Review Act (Article 8 of the Environmental Conservation Law), Chapter 340, Wetlands and Watercourse Protection, of the Town Code, the North Castle Town Development Plan and § 355-18 of this chapter.[Amended 5-23-2012 by L.L. No. 2-2012]"
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Maximum gross floor area. The following table establishes the maximum\npermitted gross floor area for one- and two-family dwellings on lots\nof the sizes indicated, irrespective of zoning district. Any development\nunder the maximum permitted amount shall be permitted subject only\nto obtaining a building permit unless the Residential Project Review\nCommittee determines that a project requires approval by the Planning\nBoard, Conservation Board or Architectural Review Board. In such case,\nPlanning Board, Conservation Board or Architectural Review Board approval\nmust be obtained. In any event, the maximum permitted gross floor\narea shall not be exceeded.[Amended 5-14-2008 by L.L. No. 7-2008; 11-9-2010 by L.L. No.\n9-2010]"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "For any new building lot created by subdivision subsequent to the\neffective date of this section, the \"lot area\" used for measurement\npurposes in the following table shall be \"net lot area,\" as defined\nherein. For any existing lot in a one- or two-family residence district,\nit shall be \"lot area,\" as defined herein."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "The owner of any one- or two-family dwelling which exists or is under\nconstruction as of the effective date of this section shall be permitted\na one-time gross floor area expansion of up to 10%, provided that\nsuch expansion does not exceed the maximum permitted gross floor area\nby more than 10%. If no wetland or steep slope disturbance permit\nis required, such expansion shall not require Planning Board approval.\nIf such type of permit is required, then the application shall require\nPlanning Board site plan approval."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "The Planning Board may, by special permit and subject to the standards as set forth in Subsection H below, allow an increase in the maximum permitted gross floor area for estate lots of 10 acres or larger."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "Notwithstanding the Table of Maximum Permitted Gross Floor Area limitations and the requirements of § 355-67, Restoration of damaged buildings, any one- or two-family dwelling which is damaged or destroyed by fire or other natural causes shall be permitted to be reconstructed as it existed prior to such damage or destruction. If the size, design and/or configuration of the reconstructed building and premises is the same as existed prior to the damage or destruction, no approval other than a building permit shall be required. If, however, the size of the dwelling is proposed to be increased or if, in the judgment of the Building Inspector, there is a significant change in the design or configuration of the dwelling or the site, then said application shall be referred to the Planning Board for site plan review and approval. Any proposal to reconstruct a damaged or destroyed dwelling with additional floor area shall be subject to all applicable requirements of this chapter."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Gross land coverage."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Maximum gross land coverage.[Amended 2-11-2009 by L.L. No. 3-2009; 11-9-2010 by L.L. No.\n9-2010]"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "The following table establishes the maximum permitted gross\nland coverage for one- and two-family residences on lots of the sizes\nindicated, irrespective of zoning district. Any development under\nthe maximum permitted amount shall be permitted subject only to obtaining\nBuilding Department approval unless the Residential Project Review\nCommittee determines that a project requires approval by the Planning\nBoard, Conservation Board or Architectural Review Board. In such case,\nPlanning Board, Conservation Board or Architectural Review Board approval\nmust be obtained."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "Notwithstanding said limitations, an additional 10 square feet\nof gross land coverage shall be permitted for each one foot of front\nyard setback of the principal dwelling in excess of the minimum front\nyard setback required. For any new building lot created by subdivision\nsubsequent to the effective date of this section, the \"lot area\" used\nfor measurement purposes in the following table shall be \"net lot\narea,\" as defined herein. For any existing lot in a one- or two-family\nresidence district, it shall be \"lot area,\" as defined herein."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Gross land coverage benefiting other or multiple lots. The square\nfootage of any gross land coverage on any lot containing a one- or\ntwo-family dwelling in a residence district, which land coverage is\nfor the benefit of multiple lots (e.g., common portions of common\ndriveways, subdivision stormwater basin access roads, etc.), shall\nbe excluded in its entirety in the computation of the maximum permitted\namount of gross development coverage. The square footage of any gross\nland coverage on any lot containing a one- or two-family dwelling,\nwhich improvement is solely for the benefit of a lot other than the\nlot upon which that gross land coverage has been constructed, shall\nbe applied in its entirety to the computation of the maximum permitted\ngross land coverage of the lot which benefits from the improvement.[Added 6-27-2007 by L.L. No. 9-2007]"
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "The owner of any one- or two-family dwelling shall be permitted a\none-time gross land coverage expansion of up to 250 square feet without\nthe need to seek RPRC review as long as the expansion does not require\nwetland or steep slope disturbance permits.[Added 4-8-2015 by L.L.\nNo. 5-2015]"
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "Maximum exterior wall height. Notwithstanding the maximum permitted\nbuilding height as set forth elsewhere in this chapter, the maximum\npermitted vertical differential between the lowest grade elevation\nat any point along the exterior wall of a building and the point on\nthe roof from which the building's height is measured shall not exceed\n38 feet in the R-4A and R-2A Districts; 36 feet in the R-1.5A and\nR-1A Districts, and 34 feet in all other districts. This provision\nshall apply only to new dwellings or expansions of existing dwellings\nfor which a building permit is applied for after the effective date\nof this section. This provision shall not be deemed to render any\nlegally existing dwelling nonconforming nor to prevent any expansion\nof such dwelling which does not extend or increase any height nonconformity.\nNotwithstanding the foregoing, the Planning Board is hereby granted\nthe authority, in connection with its review of any site plan for\na one- or two-family dwelling, to allow a greater maximum exterior\nwall height than set forth above, provided that said Board determines\nthat the intent of this provision will be met, after taking into consideration\nthe topographic conditions of the building site, the amount of building\nsetback provided and the size of the parcel involved."
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "Increased building height. For the purpose of bringing a greater\nnumber of existing and under-construction one-family dwellings into\nconformance with the Town's building height restrictions, and so as\nto help assure that the construction of new and/or expanded one-family\ndwellings will be consistent with the height of other such dwellings\nin the neighborhoods in which they are located, an increase in building\nheight shall be permitted in the R-1A through R-4A Districts as follows:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Any one-family dwelling which is existing or for which a building\npermit has been issued on or before December 15, 2002, and which exceeds\nthe basic permitted building height of 30 feet but does not exceed\nan average building height of 35 feet, with the highest roof section\n(plane) not exceeding 40 feet, all measured as defined herein, shall\nbe automatically deemed to be conforming with respect to its building\nheight without any further action being required."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Where the average height of the five dwellings located closest to\na proposed new or expanded one-family dwelling, as measured from the\nstreet line(s) of the lot on which it is located, but not to include\nany dwelling which is more than 500 feet distant from such street\nline(s), exceeds 30 feet in height as of December 15, 2002, and as\ncertified by a New York State licensed professional architect or engineer,\nthe Town of North Castle Building Engineer is hereby authorized to\npermit an increase in building height up to but not exceeding the\naverage height of those five dwellings but in no case more than 35\nfeet, provided that the highest roof section (plane) does not exceed\nfive feet above the permitted building height, all as measured and\ndefined herein."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "F. ",
							"content": [
								{
									"text": "Additional lot area requirements."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "The minimum lot area for any new lot proposed to be created by subdivision\nsubsequent to the effective date of this section shall be based upon\n\"net lot area,\" as defined herein."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Any new lot proposed to be created by subdivision subsequent to the effective date of this section shall also contain a minimum contiguous buildable area, excluding wetlands, water bodies, watercourses and adjacent areas, all as defined in Chapter 340, Wetlands and Watercourse Protection, of the Town Code and floodplains and steep slopes, as defined herein, of not less than the following size and with not less than a minimum dimension in every direction of at least 1/2 the minimum lot width required in the zoning district in which it is located."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "G. ",
							"content": [
								{
									"text": "Residential projects.[Amended 5-14-2008 by L.L. No. 7-2008]"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "All residential projects not requiring a special use permit from the Planning Board shall be first reviewed by the Residential Project Review Committee (RPRC) pursuant to Chapter 12, Article IV, § 12-22, of the Town Code. The RPRC shall determine whether a project shall be exempt from Planning Board and/or Architectural Review Board approval pursuant to § 12-23 of the Town Code."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "If any project requires the issuance of a special use permit or is referred to the Planning Board by the RPRC, then Planning Board approval pursuant to Subsection H below shall be required. All gross floor area measurements shall be subject to verification by the Town Building Inspector. Any expansion involving an increase in the number of bedrooms or any new dwelling construction or teardown shall be subject to Westchester County Health Department approval."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "H. ",
							"content": [
								{
									"text": "Standards and procedures."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Application. Each applicant seeking Planning Board approval, pursuant to the requirements of this section, shall first submit to the Planning Board site and building plans, prepared and sealed by a properly qualified professional, accurately depicting the location of the proposed new, expanded or reconstructed dwelling and any other existing or proposed buildings, structures and accessory uses (including subsurface sewage disposal and stormwater drainage systems) on the site, including all of the information identified below, unless waived by the Planning Board. When determined appropriate by the Planning Board, the applicant shall submit to the Architectural Review Board essential plans and information, including, but not limited to, floor plans and building elevations, as specified in Chapter 12, Article III, § 12-18, of the Town Code.[Amended 5-14-2008 by L.L. No. 7-2008]"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "Topography of the proposed building site with contours at a\nvertical interval of not more than two feet;"
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "The location of any significant natural features on and within\n100 feet of the proposed building site (limit of construction), such\nas wetlands, water bodies, watercourses, adjacent areas, floodplains,\nsteep slopes, hilltops, ridgelines, buffer areas, rock outcroppings,\nwooded areas, and individual trees to be removed and those to be preserved;"
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "The location and use of existing structures on neighboring properties,\nincluding a photograph(s) of each;"
																}
															]
														},
														{
															"number": "(d) ",
															"content": [
																{
																	"text": "Proposed building and lot cross sections, if and as appropriate\nto illustrate the relationship of the proposed building(s) to the\nsite's topography and to neighboring streets and properties;"
																}
															]
														},
														{
															"number": "(e) ",
															"content": [
																{
																	"text": "Proposed architectural elevations of all building sides;"
																}
															]
														},
														{
															"number": "(f) ",
															"content": [
																{
																	"text": "Proposed building floor plans;"
																}
															]
														},
														{
															"number": "(g) ",
															"content": [
																{
																	"text": "Proposed landscaping plan;"
																}
															]
														},
														{
															"number": "(h) ",
															"content": [
																{
																	"text": "A detailed calculation of proposed gross floor area and gross\nland coverage, unless waived by the Building Inspector based upon\nhis judgment that the maximum permitted gross floor area and/or gross\nland coverage, as appropriate, will clearly not be exceeded;[Amended 11-9-2010 by L.L. No. 9-2010]"
																}
															]
														},
														{
															"number": "(i) ",
															"content": [
																{
																	"text": "The location of existing and proposed septic systems, including\nreserve areas;"
																}
															]
														},
														{
															"number": "(j) ",
															"content": [
																{
																	"text": "The name and address of the applicant, property owner(s) if\nother than the applicant, and of the engineer, architect, landscape\narchitect, surveyor and/or other qualified professional(s) who prepared\nthe application, including their certification that the plans and\ncalculations are accurate and correct;"
																}
															]
														},
														{
															"number": "(k) ",
															"content": [
																{
																	"text": "The location of all existing easements; and"
																}
															]
														},
														{
															"number": "(l) ",
															"content": [
																{
																	"text": "Such other information as the Planning Board or Architectural\nReview Board may deem necessary or appropriate in order to arrive\nat its decision."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Procedure."
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "Within no more than 45 days of receipt of the copy of the application by the Architectural Review Board, said Board shall complete and submit its report and recommendations to the Planning Board in accordance with Chapter 12, Article III, of the Town Code."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "Following receipt of the Architectural Review Board's report\nand recommendations, the Planning Board shall schedule the application\nfor discussion at a public hearing. The applicant shall be responsible\nfor sending notice of such hearing by first class mail to all owners\nof neighboring properties within 250 feet if located in an R-3/4A\nor smaller minimum lot size zoning district and within 500 feet if\nlocated in an R-1A or larger minimum lot size zoning district. Such\nnotice shall indicate the street address and tax lot number of the\nsubject premises; the nature of the proposed application (including\nheight and gross floor area of the proposed dwelling, lot area and\nany variances which will be required); the date, time and place of\nthe Planning Board hearing; and the name, address and telephone number\nof the applicant. The notice of hearing shall be mailed at least 10\ndays before such hearing by the applicant in official envelopes provided\nby the Town of North Castle. Proof of mailing to all required property\nowners shall be demonstrated by providing the Town with a certificate\nof mailing (PS Form 3817 or 3877).[Amended 2-25-2015 by L.L. No. 2-2015; 11-18-2015 by L.L. No. 9-2015]"
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "Based upon the standards and criteria as set forth below and\nwithin no more than 90 days of its receipt of the application, the\nPlanning Board shall render its determination."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Standards and criteria. In reviewing such applications, the Planning\nBoard shall consider, and base its determination upon, the legislative\nintent of the Town Board as set forth in this chapter and, in particular,\nthe following:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "The visibility of the proposed new, expanded or reconstructed\nbuilding(s) from neighboring streets and properties;"
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "The present use and zoning of neighboring properties;"
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "The size, location, height, bulk, appearance, character and\ndesign of all buildings and facilities;"
																}
															]
														},
														{
															"number": "(d) ",
															"content": [
																{
																	"text": "The topography, landscaping and open spaces in relation to each\nother and to adjacent properties and the surrounding neighborhood;"
																}
															]
														},
														{
															"number": "(e) ",
															"content": [
																{
																	"text": "The objective of preservation of environmentally sensitive lands,\nincluding wetlands, watercourses, water bodies, adjacent areas, steep\nslopes, hilltops, ridgelines and floodplains;"
																}
															]
														},
														{
															"number": "(f) ",
															"content": [
																{
																	"text": "The objective of preservation of trees and other vegetation,\nand the protection of areas and features of historical, archaeological\nand/or cultural sensitivity;"
																}
															]
														},
														{
															"number": "(g) ",
															"content": [
																{
																	"text": "The degree to which existing or proposed landscaping, house\nsiting, grading and building design may serve to mitigate any potential\nadverse environmental impacts and/or visual impacts as viewed by persons\non neighboring streets and properties;"
																}
															]
														},
														{
															"number": "(h) ",
															"content": [
																{
																	"text": "The safety and adequacy of proposed driveway grades, curvature\nand sight lines;"
																}
															]
														},
														{
															"number": "(i) ",
															"content": [
																{
																	"text": "The location and design of proposed off-street parking areas;"
																}
															]
														},
														{
															"number": "(j) ",
															"content": [
																{
																	"text": "The adequacy and design of other proposed site improvements,\nincluding drains, culverts, retaining walls, fences, storage sheds,\netc.;"
																}
															]
														},
														{
															"number": "(k) ",
															"content": [
																{
																	"text": "The viability of proposed water supply and sewage disposal facilities\nand the proposed location of such facilities;"
																}
															]
														},
														{
															"number": "(l) ",
															"content": [
																{
																	"text": "The adequacy and design of proposed lighting, power and communications\nfacilities; and"
																}
															]
														},
														{
															"number": "(m) ",
															"content": [
																{
																	"text": "Other such similar factors as may be determined appropriate\nby the Planning Board."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "Planning Board decision. Based upon the above-established standards\nand criteria, and taking into consideration any report and recommendations\nof the Architectural Review Board and the Conservation Board, the\nPlanning Board shall approve, disapprove or approve with required\nmodifications any such application. Such modifications may include\na required reduction in proposed gross floor area, gross land coverage,\nbuilding coverage and/or building height as proposed by the applicant,\nadditional landscaping, and/or the redesign or relocation of any proposed\nnew building or building expansion on the site."
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "Performance bond. Subsequent to any such Planning Board approval,\nthe Building Inspector may require, as a condition to the issuance\nof a building permit or a certificate of occupancy, the posting of\na performance bond in an amount as said Building Inspector determines\nis necessary to restore the property to a safe, sanitary, stable and\nattractive condition in the event that construction is halted or delayed\nfor any reason."
												}
											]
										},
										{
											"number": "(6) ",
											"content": [
												{
													"text": "Amendments. Amendments to residential development plans (formerly known as \"residential site plans\") that do not require the issuance or modification of a special use permit shall be reviewed by the Residential Project Review Committee pursuant to Chapter 12, Article III, § 12-22, of the Town Code.[Added 5-14-2008 by L.L. No. 7-2008]"
												}
											]
										}
									]
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 355-27",
			"title": "Additional R-MF-SCH Residence District regulations.",
			"content": [
				{
					"text": "In an R-MF-SCH District, all uses shall be subject to site plan approval in accordance with Article VIII of this chapter."
				},
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Legislative intent. This district is established for the purpose\nof furthering the goals of the North Castle Comprehensive Plan by\nproviding a multifamily residence district specifically designed for,\nand limited in occupancy to, senior citizens. It is intended that\nthis new zoning district will be a \"floating zone\" whose implementation\nwill require a legislative determination and rezoning by the Town\nBoard on a case-by-case basis after consideration of the specific\nsite, the specific development plan and the specific housing program."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Standards and requirements. The following specific standards and\nrequirements shall be applicable to all proposed development in the\nR-MF-SCH District:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "An application for the establishment of an R-MF-SCH District shall\nbe accepted only for property served by public water supply and sewage\ntreatment facilities. No certificate of occupancy shall be issued\nuntil all dwelling units are connected to such approved and functioning\npublic water supply and sewage treatment systems."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "The maximum permitted amount of development on a site in an R-MF-SCH\nDistrict shall be in the range of 0.15 FAR to 0.4 FAR, which specific\namount shall be determined by the Town Board at the time of each zoning\napproval. FAR shall be based upon \"net lot area,\" as defined herein.\nThe determination of maximum permitted FAR, as well as other dimensional\nstandards for each individual zone, shall be based upon the Town Board's\nconsideration of the character of the neighborhood in which the zone\nwill be located; the zone's relationship to adjoining zones, properties\nand land uses; the zone's topography; the zone's proximity to shopping\nand transportation services; and other such factors which said Board\nmay determine to be appropriate."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Each senior citizen dwelling unit shall contain not fewer than one\nbedroom nor more than two bedrooms. The Planning Board shall be responsible\nfor determining the number of bedrooms in each dwelling unit in connection\nwith its review of the site development plan."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "The minimum floor area requirement shall be 800 square feet per one-bedroom unit and 1,000 square feet per two-bedroom unit, except that for AFFH unit, minimum floor areas shall be as set forth in § 355-24I(6) of this chapter.[Amended 5-14-2014 by L.L. No. 1-2014]"
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "Affordable affirmatively furthering fair housing (AFFH) units shall be provided pursuant to § 355-24I of this chapter.[Amended 11-20-2013 by L.L. No. 11-2013; 5-14-2014 by L.L. No.\n1-2014]"
												}
											]
										},
										{
											"number": "(6) ",
											"content": [
												{
													"text": "All dwelling units shall be designed to be conducive to, and attractive\nfor, occupancy by senior citizens."
												}
											]
										},
										{
											"number": "(7) ",
											"content": [
												{
													"text": "All design considerations, as required in multifamily residence districts pursuant to § 355-24G of this chapter, shall be applicable within the R-MF-SCH District, except for the enclosed parking requirement."
												}
											]
										}
									]
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 355-28",
			"title": "Additional R-MF-SS Residence District regulations.",
			"content": [
				{
					"text": "In an R-MF-SS District, all such uses shall be subject to site plan approval in accordance with Article VIII of this chapter."
				},
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Intent. This district is established in order to increase the supply\nof dwelling units suitable for smaller families or individuals, to\nsecure superior land planning and to increase the supply of moderate-cost\nhousing. In addition, this district shall promote the creation of\nAFFH dwelling units in proximity to the downtown area in order to\nmitigate existing parking conditions and to promote business activity\nwithin the hamlet area.[Amended 5-14-2014 by L.L. No. 1-2014]"
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Allowable density: a FAR of 0.9, computed in accordance with the net density requirements of § 355-24B(2) of this chapter, all within the same single structure."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "AFFH units. The single-structure building shall be provided with\none AFFH unit for every five market-rate units or fraction thereof.[Amended 5-14-2014 by L.L. No. 1-2014; 9-10-2014 by L.L. No. 3-2014]"
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "Water and sewage facilities. All single-structure multifamily dwellings\nshall be served by public water and sewage treatment facilities only,\nand no certificate of occupancy shall be issued until all dwelling\nunits are connected to approved and functioning public water and sewage\ntreatment systems."
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "Antenna system. A central television antenna, a dish antenna or cable\nservice shall be provided."
								}
							]
						},
						{
							"number": "F. ",
							"content": [
								{
									"text": "Parkland reservations: compliance with the requirements of Chapter 225, Parkland Reservations, of the Town Code."
								}
							]
						},
						{
							"number": "G. ",
							"content": [
								{
									"text": "Design considerations. In order that multifamily developments will\nbe properly planned in relation to the community and personal needs\nof people, the following design elements shall be considered by the\nPlanning Board and the Architectural Review Board in addition to the\nnormal factors examined in site plan review:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Visual privacy shall be preserved for residents through the proper\ndesign of rear yards, terraces, decks or patio spaces. Proper screening\nthrough the use of vegetation and fencing shall be provided."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Audio privacy shall be maintained by requiring proper standards for\nparty walls that will satisfactorily limit sound transmission between\nadjoining dwelling units."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Private outdoor space shall be provided through the use of decks,\nterraces or patios for each unit within the single structure, if deemed\nappropriate by the Planning Board."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "H. ",
							"content": [
								{
									"text": "Required parking. Parking spaces shall be provided in number and design according to the provisions of Article IX of this chapter."
								}
							]
						},
						{
							"number": "I. ",
							"content": [
								{
									"text": "Detached accessory garages shall not require a rear yard or side\nyard setback if the subject parcel and detached accessory garages\nare directly adjacent to public land and the location of such garages\nis deemed appropriate by the Planning Board.[Amended 9-10-2014 by L.L. No. 3-2014]"
								}
							]
						},
						{
							"number": "J. ",
							"content": [
								{
									"text": "Minimum gross floor area per dwelling market-rate unit shall not\nbe less than the following:[Added 9-10-2014 by L.L.\nNo. 3-2014]"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Efficiency:\n600 square feet."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "One-bedroom:\n900 square feet."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Two-bedroom:\n1,100 square feet, including at least two baths."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "Three-bedroom:\n1,300 square feet, including at least two baths."
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "Four-bedroom:\n1,500 square feet, including at least 2 1/2 baths."
												}
											]
										}
									]
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 355-31",
			"title": "Conservation subdivisions.",
			"content": [
				{
					"text": "Simultaneously with the approval of a subdivision plat and pursuant\nto § 278 of the Town Law, either at the written request\nof an applicant or on its own motion, the Planning Board is authorized\nto modify the zoning regulations in residence districts with respect\nto lot area and dimensions, provided that:"
				},
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Purposes. Such modifications shall result in design and development\nwhich promote the most appropriate use of the land, facilitate the\nadequate and economical provision of streets and utilities and preserve\nthe natural and scenic qualities of open lands."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Eligibility. This authorization shall be applicable to all residentially\nzoned lands within the Town of North Castle."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Permitted use. The permitted uses within a conservation subdivision shall be the same as those otherwise permitted in the zoning district in which it is located, except that single-family attached and semidetached dwelling units shall also be permitted in subdivisions the area of which, whether all or partially within the Town of North Castle, is adequate in size to accommodate 50 building lots of the minimum lot size normally required for single-family detached dwellings in the district in which it is located, or on smaller parcels when specifically authorized by resolution of the Town Board, following a determination by the Town Board that the proposed conservation subdivision is compatible with adjacent land uses as determined by the procedure set forth in Subsection D(1) below."
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "Development standards and controls. Except as specified herein, all\ndevelopment standards and controls normally applicable to other residential\nsubdivisions shall also be applicable to conservation subdivisions."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Density. The number of building lots permitted in a conservation subdivision shall in no case exceed the number which could be permitted, in the Planning Board's judgment, if the land were subdivided into lots conforming to all normally applicable requirements of this chapter, Chapter 275, Subdivision of Land, the Westchester County Health Department Regulations and all other applicable requirements. The basis for this determination by the Planning Board shall be a conventional preliminary subdivision plat for the subject property, plus such other information as may be required by said Board."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Type and arrangement of buildings. The type of residential dwelling\nunits permitted within a conservation subdivision shall be, at the\ndiscretion of the Planning Board and subject to the conditions set\nforth below, in detached, semidetached and/or attached buildings."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Minimum required lot area. In subdivisions the area of which is not adequate in size to accommodate 50 building lots of the minimum lot size normally required for single-family detached dwellings in the district in which it is located, and when not specifically authorized by the Town Board, as determined by the procedure set forth in Subsection D(1) above, the minimum required area for building lots within a conservation subdivision shall be one acre or 1/2 the minimum lot size required in the zoning district in which it is located, whichever requirement is less, except that larger minimums may be required in specific instances where determined necessary or appropriate by the Planning Board or the Westchester County Health Department. In subdivisions the area of which is adequate in size to accommodate 50 building lots of the minimum lot size normally required for single-family detached dwellings in the district in which it is located, or on smaller parcels when specifically authorized by resolution of the Town Board, as determined by the procedure set forth in Subsection D(1) above, dwelling units may be grouped on one or more separate parcels of land, or located on individual lots, for which there is no minimum size requirement."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "Minimum lot dimension requirements."
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "Where the minimum required lot area is one acre, the minimum\nlot frontage, width, depth and yard setback requirements for building\nlots within a conservation subdivision shall be the same as required\nin the R-1A Residence District, except that where a building lot within\na conservation subdivision abuts an existing residential lot complying\nwith conventional lot dimensional standards, any front, side or rear\nyard adjoining such property shall comply with the normally applicable\nsetback requirements of the zoning district in which it is located."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "Where the minimum required lot area is less than one acre, the\nminimum lot frontage, width, depth and yard setback requirements for\nbuilding lots within a conservation subdivision shall be as determined\nby the Planning Board, except that where a building lot within a conservation\nsubdivision abuts an existing residential lot complying with conventional\nlot dimensional standards, any front, side or rear yard adjoining\nsuch property shall comply with the normally applicable setback requirements\nof the zoning district in which the lot is located."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "Where there is no minimum required lot area and dwelling units\nin a conservation subdivision abut or are directly across the street\nfrom a privately owned residential property, the minimum front, side\nor rear yard adjoining or facing such property shall be equal to at\nleast twice the normally applicable setback requirement for detached\none-family dwellings in the zoning district in which it is located,\nbut not less than 100 feet, or as otherwise determined appropriate\nby the Planning Board for parcels specifically authorized by the Town\nBoard but not less than twice the normally applicable setback, measured\nfrom the boundary of the conservation subdivision. In reviewing the\ndevelopment plan, the Planning Board shall consider the setback and\nproposed screening of parking and active recreation areas and may\nrequire setbacks up to twice the normally applicable setback requirement\nfor one-family dwellings in the zoning district in which the conservation\nsubdivision is located."
																}
															]
														},
														{
															"number": "(d) ",
															"content": [
																{
																	"text": "The minimum contiguous buildable area requirement for single-family lots in a conservation subdivision shall be as determined by the Planning Board, taking into consideration the minimum contiguous buildable area requirements for similar size lots as set forth in § 355-26F(2) hereof."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "Building dimension requirements. The maximum permitted building height\nand building coverage and the minimum dwelling unit size shall be\nthe same as that normally applicable to the dwellings and buildings\nin the zoning district in which the building is located, except that\nfor semidetached and attached dwelling units, the minimum dwelling\nunit size shall be as follows:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "Efficiency: 450 square feet."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "One-bedroom: 700 square feet."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "Two-bedroom: 900 square feet."
																}
															]
														},
														{
															"number": "(d) ",
															"content": [
																{
																	"text": "Three-bedroom: 1,100 square feet."
																}
															]
														},
														{
															"number": "(e) ",
															"content": [
																{
																	"text": "Four-bedroom: 1,300 square feet."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(6) ",
											"content": [
												{
													"text": "Off-street parking."
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "Parking shall be the same as otherwise required in conventional\ndevelopment, but for attached or semidetached dwelling units the following\nstandard shall prevail: one space per dwelling unit plus 1/2 space\nper bedroom. No less than 1/3 nor more than 2/3 of the required off-street\nparking spaces shall be enclosed. Of the unenclosed parking spaces,\nan amount equal to at least 1/3 of the total number of required spaces\nshall not be reserved for specific dwelling units and shall be open\nand available for the use of visitors and guests."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "For conservation subdivisions having no minimum required lot\narea, the following shall apply:"
																},
																{
																	"content": [
																		{
																			"number": "[1] ",
																			"content": [
																				{
																					"text": "All self-propelled maintenance equipment, including accessories,\nshall be stored in enclosed structures only, which structures shall\nconform in architectural theme to the residential buildings of the\ndevelopment."
																				}
																			]
																		},
																		{
																			"number": "[2] ",
																			"content": [
																				{
																					"text": "The Planning Board may require, if deemed appropriate, the provision\nof a suitably screened parking area solely for the storage of boats,\nmotor homes, travel trailers and pickup coaches belonging to inhabitants\nof the development."
																				}
																			]
																		}
																	]
																}
															]
														}
													]
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "Design considerations. For conservation subdivisions having no minimum required lot area, in order that such subdivisions will be properly planned in relation to the community and personal needs of people, and after referral to the Architectural Review Board for review and report, the following design elements shall be considered by the Planning Board in addition to the specific provisions of Chapter 275, Subdivision of Land, and the normal factors examined in development plan review:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Need for personal privacy."
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "Visual privacy shall be preserved for residents through the\nproper design of rear yards and/or patio spaces. Proper screening\nthrough the use of vegetation, fencing and partially or fully enclosed\npatios shall be provided."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "Audio privacy shall be maintained by requiring proper standards\nfor solid party walls that will satisfactorily limit sound transmission\nbetween adjoining dwelling units."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Need for maintaining the scale of buildings to ensure compatibility\nwith natural and man-made surroundings. Four dwelling units shall\nbe the normal maximum permitted per building to ensure that attached\nand semidetached units will be compatible in scale with the character\nof surrounding development and to ensure a pleasant environment for\nthe residents of such units through maximizing views and by providing\na close relationship to immediately adjacent open space at the sides\nof units as well as to the front and rear. The Planning Board may,\nwhere it deems necessary, limit the number of dwelling units per building\nto fewer than four and may permit up to six units in circumstances\nwhere building layout or natural terrain conditions can help assure\naesthetic design, adequate private and semiprivate open space areas\nand significant views."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Need for preserving existing neighborhood identity and community\nscale. In large-scale subdivisions (such as those exceeding 100 dwelling\nunits), the Planning Board shall consider the layout of small neighborhoods\nor clusters within the development, each having some open space immediately\nsurrounding it, as a goal of proper site plan so that a large, massive\nconcentration of units, with little or no differentiation, can be\navoided, and so that the character of the conservation subdivision\nwill match the character of the neighborhood in which it is located.\nIn this manner, a sense of small neighborhood communities can be preserved,\nopen space can be provided in direct relationship to the living units\nand the sense of a semirural character can be retained. This guideline,\nhowever, should not be arbitrarily applied where intrinsic land capabilities\nand natural terrain features could not be properly respected or where\nit can be proven, to the satisfaction of the Planning Board, that\na particular design of a large subdivision would be more ecologically\nsensitive through the concentration of development on a particular\nsection of land."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "Water and sewerage facilities."
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "All dwelling units in conservation subdivisions having no minimum\nrequired lot area shall be served by public water and sewage treatment\nfacilities, and no certificate of occupancy shall be issued until\nall dwelling units are connected to approved and functioning public\nwater and sewage treatment facilities. Where, in the opinion of the\nPlanning Board, connection to or establishment of public water and/or\nsewage treatment facilities is not possible or not warranted, a central\nwater supply and sewage treatment shall be designed and constructed\nto serve all dwelling units in accordance with the standards and subject\nto the approval of the Westchester County Department of Health and\nthe New York State Department of Environmental Conservation. Such\ncentral systems shall be designed and located in such way as to readily\npermit their connection and/or conversion to off-site systems at such\ntime as they are constructed."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "Where, in the opinion of the Planning Board, the geology of\nan area is such that wells of large capacity will adversely impact\nexisting wells on adjoining properties, individual water meters for\neach dwelling unit shall be installed, sufficient measures shall be\ntaken by the applicant to prevent such adverse impact or to indemnify\nthe owners of such impacted wells and/or, where feasible, an off-site\nsource of water supply shall be developed."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "Antenna system. A central television antenna system, a dish antenna\nor cable service, where available, shall be provided for each group\nof attached dwelling units."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "F. ",
							"content": [
								{
									"text": "Conserved land areas. Conservation subdivisions shall result in the\npreservation of open space areas having meaningful scenic, ecological,\nenvironmental and/or recreational characteristics, with such access,\nshape, size and location as determined appropriate by the Planning\nBoard to satisfy the intended purpose. The permanent preservation\nof such open space areas shall be legally assured to the satisfaction\nof the Planning Board and the Town Attorney by the filing of appropriate\ncovenants, deed restrictions, easements or other agreements."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Ownership of conserved land areas. The ownership of conserved land\nareas shall be divided equally among all owners of building lots within\nthe conservation subdivision, except where all or an appropriate portion\nof the conserved land areas is deeded to a recognized conservation\norganization dedicated to the preservation of open space and such\ndedication is acceptable to the conservation organization and to the\nTown Planning Board, or offered for dedication to the Town of North\nCastle and the Town Board has voted to accept such offer. Except in\nthose cases where the ownership of the conserved land areas is to\nbe vested in the Town of North Castle or an approved conservation\norganization, the subdivider shall execute and file with the Planning\nBoard such documents as, in the opinion of the Town Attorney, will\nbe sufficient to create a property owners' association responsible\nfor the continued ownership, use and maintenance of all conserved\nland areas in accordance with the following requirements:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "Membership in the association must be mandatory for each property\nowner within the subdivision and for any successive property owners."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "All restrictions on the ownership, use and maintenance of conserved\nland areas must be permanent."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "The association must be responsible for liability insurance,\nlocal taxes and the maintenance of the conserved land areas, including\nany active recreation areas and related facilities."
																}
															]
														},
														{
															"number": "(d) ",
															"content": [
																{
																	"text": "Each lot owner within the subdivision shall be made responsible\nfor paying his proportionate share of the association's costs, and\nthe assessment levied by the association shall become a lien on the\nproperty if not paid."
																}
															]
														},
														{
															"number": "(e) ",
															"content": [
																{
																	"text": "The association shall have the power to adjust assessments to\nmeet changing needs."
																}
															]
														},
														{
															"number": "(f) ",
															"content": [
																{
																	"text": "In the event that the maintenance, preservation and/or use of\nthe conserved land area(s) ceases to be in compliance with any of\nthe above requirements or any other requirements specified by the\nPlanning Board when approving the subdivision plat, the Town shall\nbe granted the right to take all necessary action to assure such compliance\nand to assess against the association and/or each individual property\nowner within the subdivision all costs incurred by the Town for such\npurposes."
																}
															]
														},
														{
															"number": "(g) ",
															"content": [
																{
																	"text": "The establishment of such an association shall be required prior\nto the final approval of the plat."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Permitted uses in conserved land area. Except where otherwise approved\nby the Planning Board, conserved land areas shall be preserved in\ntheir natural state and the use of such areas shall be limited to\nappropriate conservation, open space and recreation purposes as determined\nby the Planning Board. A portion of the conserved land area(s) may\nbe designated \"active recreation area\" on the subdivision plat, in\na location approved by the Planning Board. Such active recreation\narea shall not exceed 5% of the total area of the proposed subdivision.\nWithin such area structures and facilities for active recreational\npurposes, including playground equipment, swimming pools, tennis courts\nand so forth, may be constructed and operated for the use of the property\nowners in the conservation subdivision and their guests. Where determined\nappropriate, the Planning Board may specify a phased construction\nschedule for such structures and facilities. Enlargement of such structures\nand facilities, or establishment of such structures and facilities\nnot shown on the filed plat, shall be subject to site plan approval\nprocedures as set forth in this chapter."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "G. ",
							"content": [
								{
									"text": "Application procedure. In addition to compliance with any special\nstandards, requirements and procedures as set forth in this section,\nconservation subdivisions shall also be subject to review and public\nhearing by the Planning Board in accordance with the same procedures\nas would otherwise be applicable to conventional subdivisions. The\nproposed development plan, as required by Town Law § 281(e)\nand including areas within which the structures may be located, the\nheight and spacing of buildings, open spaces and their landscaping,\noff-street open and enclosed parking spaces, and streets, driveways\nand all other physical features as shown on said plat or otherwise\ndescribed, accompanied by a statement setting forth the nature of\nsuch modifications, changes, or supplementations of existing zoning\nprovisions as are not shown on said development plan, and in the case\nof conservation subdivisions having no minimum required lot area,\nfloor plan of each dwelling unit design, shall likewise be subject\nto the same review and public hearing by the Planning Board. For conservation\nsubdivisions having no minimum required lot area, the Planning Board\nshall forward one copy of the proposed development plan to the Conservation\nBoard, the Architectural Review Board and the Town Engineer. Upon\nfiling of the plat in the office of the County Clerk, a copy shall\nalso be required to be filed with the Town Clerk, who shall make the\nappropriate notations and references thereto on the official copy\nof the Town Zoning Map."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 355-32",
			"title": "Golf Course Community Floating Overlay District.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Purpose and intent. It is the purpose and intent of this section\nto establish the Golf Course Community Floating Overlay (GCCFO) District,\nand provide for the development of a residential community designed\nfor active adults in which the central focus of the community is an\naffiliated membership club having an eighteen-hole golf course and\nother recreational facilities. It is the further purpose and intent\nof this section to encourage the preservation of golf courses, thereby\nproviding for the recreational needs of the Town and the maintenance\nof significant open space."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Eligibility, procedure and boundaries. The owner of one or more lots and/or parcels of land in the R-2A District having an aggregate minimum area of 150 acres and at least 1,000 feet of frontage on, and direct access from, a state highway, and on which an eighteen-hole golf course exists on the date of adoption of this section (the \"eligible land\"), may petition the Town Board to map the GCCFO District, but only on the portion of the eligible land located more than 100 feet from the perimeter property boundaries of the eligible land, it being the intent of the Town Board that the portion of the eligible land not mapped as GCCFO District shall be a buffer area and shall be used only for golf course uses, including access driveways and accessory parking, permitted in the R-2A District. The boundaries of a GCCFO District shall be fixed by amendment to the Town Zoning Map in accordance with the procedure set forth in § 355-80 of this chapter. The affiliated membership club shall be required to meet all membership club special use permit requirements pursuant to Article VII of this chapter via the issuance of a Town Board special use permit. The affiliated membership club shall also require Planning Board site plan approval pursuant to Article VIII of this chapter."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Uses. All uses permitted in the R-2A District shall continue to be permitted in accordance with the requirements of the R-2A District. In addition to uses permitted in the R-2A District, a golf course community is a permitted principal use in the GCCFO District. All uses are subject to Planning Board site plan approval and performance standards in accordance with Articles VIII and X of this chapter and are subject to the requirements of this section. All accessory uses in Column 3 of the Schedule of Residence District Regulations[1] shall be permitted accessory uses to a golf course community."
								},
								{
									"footnote": "[1]\nEditor's Note: The Schedule of Residence District Regulations\nis included as an attachment to this chapter.\n"
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "Lot, dimensional and parking requirements for a golf course community. The lot, dimensional, and parking requirements for a golf course community in this section shall supersede the Schedule of Residence District Regulations (§ 355-21 of this chapter). Lot size, lot configuration and other lot dimensional requirements within a GCCFO District shall be determined by the Planning Board in conjunction with subdivision approval. Lot size, lot configuration and other lot dimensional requirements of lots within a GCCFO District shall be based upon the Planning Board's consideration of the character of the neighborhood in which the GCCFO District will be located; the GCCFO District's relationship to adjoining districts, properties and land uses; the GCCFO District's topography; and such other factors the Planning Board may determine to be appropriate. The lots and/or parcels that together comprise a golf course community site are not required to be contiguous, provided that each such lot and/or parcel adjoins the affiliated membership club. All lot, dimensional, and parking requirements in this section, including but not limited to maximum density, maximum building coverage, minimum yards and required off-street parking, shall apply to the land area in the GCCFO District as a whole, notwithstanding that the golf course community site may be comprised of more than one lot and/or parcel, or that the site may from time to time be subdivided or resubdivided, and all determinations and calculations relating to such requirements shall be made with reference to the boundaries of the entire land area in the GCCFO District and as though such area is a single lot (as defined in § 355-4 of this chapter), even though it is or will be comprised of more than one lot and/or parcel."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Lots and dwelling units in the GCCFO District."
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "Notwithstanding any provision of this chapter or Chapter 275, Subdivision of Land, of the Town Code, a lot in a GCCFO District may consist of a fee-simple interest in the volume of air bounded by a lower, and potentially also upper, horizontal plane, and by the vertical planes that are the perimeter boundaries of that air space."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "Notwithstanding any provision of this chapter, every dwelling\nunit in a GCCFO District shall be located on or within a separate\nlot owned in fee simple, and not on or within a condominium unit."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Density. The maximum permitted density shall not exceed one density unit, as defined in § 355-4 of this chapter, per 133,000 square feet of the aggregate total lot area (as defined in § 355-4 of this chapter) in the GCCFO District and one dwelling unit, as defined in § 355-4 of this chapter, per 1.8 acres of the aggregate total lot area (as defined in § 355-4 of this chapter) in the GCCFO District."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Building coverage. The maximum building coverage shall be 3.5%."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "Maximum building height. The maximum building height shall be three\nstories and 39 1/2 feet to the mean level of the primary roof,\nmeasured from the level of the finished grade at the main entry to\nthe building."
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "Minimum floor area."
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "Minimum gross floor area per dwelling unit shall not be less\nthan the following:"
																},
																{
																	"content": [
																		{
																			"number": "[1] ",
																			"content": [
																				{
																					"text": "Efficiency: 450 square feet;"
																				}
																			]
																		},
																		{
																			"number": "[2] ",
																			"content": [
																				{
																					"text": "One-bedroom: 700 square feet;"
																				}
																			]
																		},
																		{
																			"number": "[3] ",
																			"content": [
																				{
																					"text": "Two-bedroom: 900 square feet; and"
																				}
																			]
																		},
																		{
																			"number": "[4] ",
																			"content": [
																				{
																					"text": "Three-bedroom: 1,100 square feet."
																				}
																			]
																		}
																	]
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "For purposes of this subsection, the Planning Board may allow\nbalconies or paved terraces to be counted toward the minimum gross\nfloor area requirement in an amount not to exceed 5% of that requirement."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(6) ",
											"content": [
												{
													"text": "Off-street parking. "
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "The Planning Board shall have the ability to vary off-street parking\nstall size and aisle width upon consideration of all relevant factors,\nincluding the needs of the golf course community."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "Up to 25% of enclosed residential off-street parking spaces may,\nwith Planning Board approval, be tandem spaces."
																}
															]
														}
													]
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "Privacy considerations."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Visual privacy shall be preserved for residents through the proper\ndesign of rear yards and/or patio spaces. Proper screening through\nthe use of vegetation, fencing and partially or fully enclosed patios\nshall be provided."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Audio privacy shall be maintained by requiring proper standards for\nsolid party walls that will satisfactorily limit sound transmission\nbetween adjoining dwelling units."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "F. ",
							"content": [
								{
									"text": "Water and sewerage facilities. All dwelling units shall be served\nby either public or central water and sewage treatment facilities,\nincluding facilities owned by Town improvement districts and duly\nformed water works and sewage works corporations, and no certificate\nof occupancy shall be issued for a dwelling unit until it is connected\nto approved and functioning water and sewage treatment facilities.\nWater and sewerage facilities shall be designed in accordance with\nthe standards and subject to approval of the Westchester County Department\nof Health and the New York State Department of Environmental Conservation,\nas applicable."
								}
							]
						},
						{
							"number": "G. ",
							"content": [
								{
									"text": "Affiliation with membership club."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "A golf course community must be affiliated with an adjoining membership club which is subject to a Town Board special use permit pursuant to Article VII of this chapter. Such affiliation shall be established by the requirement that, except for the initial developer/sponsor of the golf course community and successor sponsors/owners of units which have not yet been sold for owner occupancy, the owner of a dwelling unit of the golf course community must for the duration of ownership be a member (whether individually or as a family) of the membership club. The terms and conditions of membership shall be determined by the membership club."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "The golf course of the affiliated membership club functions as the\nopen space for the golf course community, and preservation of that\nopen space is a basis for the permitted density of a golf course community.\nAccordingly, as a condition of site development plan approval of a\ngolf course community, the affiliated membership club shall record\nin the Westchester County Clerk's office a permanent conservation\neasement pursuant to which the membership club agrees that the property\non which the golf course is located shall be used solely as a golf\ncourse or as open space. The conservation easement shall be in form\nand substance reasonably acceptable to the Town Board and Town Attorney."
												}
											]
										}
									]
								}
							]
						}
					]
				}
			]
		}
	]
}