{
	"url": "http://ecode360.com/8985040",
	"paras": [
		{
			"paragraph": "§ 175-19",
			"title": "Applicability.",
			"content": [
				{
					"text": "The provisions of this article shall apply in\na Residence F District."
				}
			]
		},
		{
			"paragraph": "§ 175-20",
			"title": "Commercial vehicles.",
			"content": [
				{
					"text": "The parking, storage, servicing and cleaning of commercial vehicles in the Residence F Zoning District are subject to the restrictions set forth in § 175-7 of this chapter."
				}
			]
		},
		{
			"paragraph": "§ 175-21",
			"title": "Permitted uses.",
			"content": [
				{
					"text": "A building may be erected, altered or used and\na lot or premises may be used for any of the purposes set forth in\nthis article and for no other."
				},
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Multiple dwellings conforming to the provisions of\nthe Multiple Dwelling Law and the Multiple Residence Law as amended\nfrom time to time and to the provisions of this article."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "A two-family detached dwelling."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "A single-family dwelling."
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "A regularly organized institution of learning approved\nby the State Board of Regents and supported by public funds."
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "A public library, public art gallery, public museum,\nmunicipal or voluntary firehouse, municipal park for recreational\nuse."
								}
							]
						},
						{
							"number": "F. ",
							"content": [
								{
									"text": "A church or other building used exclusively for religious\npurposes."
								}
							]
						},
						{
							"number": "G. ",
							"content": [
								{
									"text": "A parish house; parochial school."
								}
							]
						},
						{
							"number": "H. ",
							"content": [
								{
									"text": "An accessory use on the same lot with and customarily incidental to any of the above permitted uses, including the uses permitted in § 175-6K."
								}
							]
						},
						{
							"number": "I. ",
							"content": [
								{
									"text": "Signs as permitted in Article VI, § 175-58D, and § 175-60A, inclusive."
								}
							]
						},
						{
							"number": "J. ",
							"content": [
								{
									"text": "Two-family detached dwelling uses (Subsection B) shall conform to the provisions of Article II applicable to single-family dwellings except where a provision in this article shall specifically relate to a two-family detached dwelling use in which case the provisions of this article shall apply."
								}
							]
						},
						{
							"number": "K. ",
							"content": [
								{
									"text": "All buildings and uses permitted in Subsections C to G, inclusive, shall conform to the provisions of Article II relating to such uses except where a provision in this article shall specifically relate to such uses in which case the provisions of this article shall apply."
								}
							]
						},
						{
							"number": "L. ",
							"content": [
								{
									"text": "Open-air parking adjoining business districts of noncommercial automobiles accessory to and in connection with the permitted uses and buildings in the adjoining business district when authorized by the Board of Appeals pursuant to the provisions of Article IX."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 175-22",
			"title": "Height of buildings.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "No multiple dwelling shall exceed three stories with a maximum height of 33 feet measured as specified in the definition of “height of a building” in § 175-92; provided, however, that on a sloping lot a multiple dwelling may be erected within the aforesaid maximum height of 33 feet with one additional basement story having its floor on or below the level of the actual finished grade adjoining the downhill side of the building if such additional story is not used for living purposes but is used solely for garage, storage or other general utility purposes accessory to the occupancy, use and management of the dwelling. No single-family residence building shall exceed 2 1/2 stories with a maximum height of 35 feet.[Amended 7-2-1958; 3-24-1959]"
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "No building permitted pursuant to § 175-21D to G, inclusive, other than a church, shall exceed two stories with a maximum height of 30 feet."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 175-23",
			"title": "Number of dwelling units permitted; lot area; floor area ratio.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Except as provided by Subsection D hereof, which shall be applicable only to multiple dwellings situated on premises adjacent to contiguous vacant public areas, the number of apartments (dwelling units) in a multiple dwelling shall be limited by the area of the plot actually used and occupied by and appurtenant to any such multiple dwelling. For the first 15,000 square feet of plot area, there may be three apartments; for each 2,000 square feet of plot area in excess of 15,000, there may be one additional apartment in such a dwelling or dwellings.[Amended 7-2-1958; 9-11-1962; 11-12-1963]"
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "The minimum lot area for a two-family detached dwelling\nshall be 10,000 square feet."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "The minimum lot area for a single-family dwelling\nshall be 8,000 square feet."
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "For the purpose of determining allowable building\narea and the number of dwelling units for a multiple dwelling, adjacent\nto contiguous vacant public areas, and for no other purpose, there\nmay be added to and included, in accordance with and subject to the\nfollowing, the area of such contiguous vacant public areas, provided\nthat:[Added 10-11-1988 by L.L. No. 1-1988]"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "The distance across such contiguous vacant public areas from the boundary of the plot actually used by a multiple dwelling exceeds 200 feet when measured along the shorter of the two perpendiculars defined in Subsection D(2) of this subsection."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "To each end of a baseline, which shall be the shortest\nline which can be drawn parallel to the front street line (or to its\ngreatest leg of the street line if it is not straight) between the\nside boundaries of a plot, there shall be erected a perpendicular\nwhich shall run, lie and be measured along or across the contiguous\nvacant public area to the point at which the far boundary of such\ncontiguous vacant public area intersects such perpendicular."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "The maximum building area (under § 175-25) and maximum number of dwelling units (under Subsection A) for such a multiple dwelling shall be calculated on the basis of the adjusted gross plot, which shall be and include:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "The plot actually used and occupied by the building\nplus all contiguous vacant public area lying between the two aforesaid\nperpendiculars, and"
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "All such contiguous vacant public area, if any,\nas may lie outside and adjoin such perpendiculars, but only where,\nwhen and if such outside, adjoining area shall have been dedicated\nfor public use by the owner of such proposed multiple dwelling."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "The maximum allowable building area of such a multiple dwelling adjacent to public area shall not exceed 33 1/3% of the plot actually used and occupied by such multiple dwelling, unless such adjusted gross plot includes contiguous vacant public area deeded as provided in the definition of “public area” in § 175-92 hereof by the owner of such proposed building, when an area in excess of such 33 1/3% limitation shall be allowable, but in no event shall such building area exceed 20% of the adjusted gross plot; provided that:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "The same contiguous vacant public area shall\nnever be includible in computing maximum building area or maximum\nnumber of dwelling units for more than one multiple dwelling, but\nwhere (as for example on intersecting streets) such perpendiculars\nshall cross, the areas lying within two or more pairs of perpendiculars\nshall be divided proportionally and applied accordingly to each respective\nplot;"
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "Except to the extent and in the explicit respects\nby this subsection to the contrary expressly set forth and provided,\nall multiple dwellings shall strictly conform to and be limited by\nall requirements of this chapter heretofore or hereinafter enacted,\nincluding, but not restricted to, allowable exterior and interior\nyard and building dimensions and areas."
																}
															]
														}
													]
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "The floor area ratio for a two-family detached dwelling\nshall not exceed .40. The floor area ratio for a single-family detached\ndwelling shall not exceed .30.[Added 6-4-1991 by L.L. No. 1-1991]"
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 175-24",
			"title": "Parking or garage facilities for multiple dwellings.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "In the case of a multiple dwelling there shall be\nprovided within (not attached to) the main building parking or garage\nfacilities to accommodate one automobile for each one apartment."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "In the case of multiple dwellings there shall be provided\na hard-surfaced area of not less than 1,000 square feet for a three-family\napartment with an additional area of 200 square feet for each additional\nfamily over three for the outdoor parking of vehicles. The parking\narea shall be shown on the plot plan submitted on the application\nfor a building permit in an appropriate location and shall be not\nless than 10 feet from a property line and may project into any yard.\nWhere ever a parking area is within 20 feet of a property line there\nshall be provided screening by means of a fence, hedge or evergreen\nnot less than four feet in height between the parking area and the\nproperty line."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 175-25",
			"title": "Building area for certain permitted uses.",
			"content": [
				{
					"text": "Except as provided in § 175-23D hereof with regard to multiple dwellings situated on premises adjacent to contiguous vacant public areas as defined in this chapter, the building area for buildings permitted in § 175-21A through G shall not exceed 20% of the lot area."
				}
			]
		},
		{
			"paragraph": "§ 175-26",
			"title": "Floor area for multiple dwellings.",
			"content": [
				{
					"text": "Multiple dwellings shall provide habitable floor\narea of not less than 700 square feet for each apartment, except that\nnot more than 10% of the total number of apartments on any one lot,\nwhether located in one building or more than one building, may have\na habitable floor area of not less than 500 square feet for each apartment."
				}
			]
		},
		{
			"paragraph": "§ 175-27",
			"title": "Floor area.",
			"content": [
				{
					"text": "A two-family detached dwelling shall provide\nhabitable floor area of not less than 900 square feet for each family\nunit."
				}
			]
		},
		{
			"paragraph": "§ 175-28",
			"title": "Habitable space.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Required space in dwelling unit."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Every dwelling unit shall contain a minimum habitable\nfloor area of at least 150 square feet for the first occupant; at\nleast 100 square feet for each of the next two occupants; and at least\n75 square feet for each occupant thereafter. In no event shall the\nhabitable area of a dwelling unit be less than 100 square feet of\nhabitable floor area for each occupant."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Every habitable room shall have a minimum ceiling\nheight of seven feet over 50% of the floor area, and the floor area\nwhere the ceiling height is less than five feet shall not be considered\nas part of the habitable floor area in computing the minimum habitable\nfloor area."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Required space in sleeping rooms."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "In every dwelling unit of two or more habitable rooms\nevery room occupied for sleeping by one occupant shall have a minimum\nhabitable floor area of at least 70 square feet. Every room occupied\nfor sleeping purposes by more than one occupant shall have a minimum\ngross floor area of 50 square feet per occupant. In no event shall\nthere be more than three occupants consisting of no more than two\nadults together with one child under two years of age in any one bedroom\nin a dwelling unit. Children under the age of six months of age shall\nnot be counted in determining the number of occupants in a dwelling\nunit or in a bedroom of a dwelling unit."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Every room used for sleeping purposes shall have a\nminimum width of seven feet."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Kitchens shall not be used for sleeping purposes"
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "Cellars shall not be used for sleeping purposes."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "For the purposes of this section, kitchens and cellars\nshall not be deemed habitable space."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 175-29",
			"title": "Front yards.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "There shall be a front yard, the depth of which shall\nbe not less than 40 feet."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "On a corner lot a front yard shall be required on\neach street. The front yard on each street shall be not less than\n40 feet in depth."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 175-30",
			"title": "Side yards.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "On an interior lot there shall be two side yards,\none on each side of the main building, each of which shall be not\nless than 25 feet in width."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "On a corner lot there shall be only one side yard abutting an interior lot adjacent thereto. Said side yard shall have minimum width of 25 feet. The other side yard fronting on the street shall be considered a front yard and shall conform to the provisions of § 175-29B."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 175-31",
			"title": "Rear yards.",
			"content": [
				{
					"text": "There shall be a rear yard, the depth of which\nshall be not less than 25 feet."
				}
			]
		},
		{
			"paragraph": "§ 175-32",
			"title": "Accessory structures.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "No fence shall be permitted in a front yard. No fence in a side or rear yard shall exceed a height of four feet above the existing grade at the base thereof. The provisions of this section shall not apply to hedges or other shrubbery, which are not limited in height, except as provided in Article VII, § 175-65, hereof. All fences must have the good side facing the adjoining property and be on or within the property line.[Amended by L.L. No. 1-1998]"
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Retaining walls shall not extend above the surface\nof the ground which they support."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 175-33",
			"title": "Accessory buildings.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Accessory buildings and/or structures as otherwise\nprovided in this article shall not be over 15 feet in height at their\nhighest point and shall not occupy more than 40% of the area of the\nrear yard. The yard area occupied by an accessory building or structure\nshall be included in computing the maximum percentage of the lot area\nwhich may be utilized for building."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Unless otherwise provided in this article, accessory\nbuildings and/or structures shall be located in the rear yard and\nshall be not less than 10 feet distant from the main building and\nnot less than three feet distant from the rear and side lot lines."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Unless otherwise provided in this article, accessory buildings and/or structures on corner lots 100 feet or less in depth shall be located as far as possible from the front property lines while conforming to the provisions of Subsections B and D."
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "No accessory building or structure, with the exception\nof fences four feet in height, or retaining walls, shall be erected\nwithin 15 feet of a building used for residence purposes on an adjoining\nlot."
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "No accessory building or structure shall be erected in a rear yard the area of which is not sufficient to permit compliance with the requirements of Subsection A to D, inclusive."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 175-34",
			"title": "Distance between buildings.",
			"content": [
				{
					"text": "No multiple dwelling shall be erected nearer\nto another multiple dwelling on the same lot than a distance equal\nto the average of the heights of the two said buildings."
				}
			]
		},
		{
			"paragraph": "§ 175-35",
			"title": "Sewage disposal.",
			"content": [
				{
					"text": "No multiple dwelling shall be permitted unless\nprovided with municipal sewerage or unless an independent sewage disposal\nplant, approved by the Nassau County Department of Health, is constructed\nfor the sanitary disposal of the sewage of such building."
				}
			]
		},
		{
			"paragraph": "§ 175-36",
			"title": "Nonconforming uses.",
			"content": [
				{
					"text": "The lawful use of a building or premises existing\nin this district on December 1, 1954, may be continued although such\nuse does not conform with the provisions of this chapter. In the case\nof a partial or total destruction of a residence building existing\nin this district on December 1, 1954, it may be repaired or rebuilt\nin conformity to the provisions of the Building Zone Ordinance in\neffect on or immediately prior to December 1. 1954."
				}
			]
		}
	]
}