{
	"url": "http://ecode360.com/8984952",
	"paras": [
		{
			"paragraph": "§ 175-5",
			"title": "Applicability.",
			"content": [
				{
					"text": "The provisions of this article shall apply in\na Residence A District."
				}
			]
		},
		{
			"paragraph": "§ 175-6",
			"title": "Permitted uses.",
			"content": [
				{
					"text": "A building may be erected, altered or used,\nand a lot or premises may be used for any of the purposes set forth\nin this section and for no other:"
				},
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "A single-family detached dwelling."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "A regularly organized institution of learning approved\nby the State Board of Regents and supported by public funds."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "A public library, public art gallery, public museum,\nmunicipal or volunteer firehouse, municipal park for recreational\nuse, railway passenger station."
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "A church or other building used exclusively for religious\npurposes."
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "A parish house or parochial school."
								}
							]
						},
						{
							"number": "F. ",
							"content": [
								{
									"text": "Agriculture, provided there is no display of harvested\nproducts for sale and no advertising on premises."
								}
							]
						},
						{
							"number": "G. ",
							"content": [
								{
									"text": "Signs as permitted in Article VI, § 175-58D, and § 175-60A, inclusive."
								}
							]
						},
						{
							"number": "H. ",
							"content": [
								{
									"text": "Accessory uses on the same lot with and customarily incidental to any of the above permitted uses, including those specified in Subsections H, I and J."
								}
							]
						},
						{
							"number": "I. ",
							"content": [
								{
									"text": "A private garage, detached or attached or within the\nmain building."
								}
							]
						},
						{
							"number": "J. ",
							"content": [
								{
									"text": "Other accessory buildings or structures conforming to the provisions of §§ 175-16 and 175-17, and Article VII, § 175-67."
								}
							]
						},
						{
							"number": "K. ",
							"content": [
								{
									"text": "A professional office or studio of a doctor, dentist, lawyer, teacher, artist, architect, engineer, accountant or musician, provided the office or studio is located in the dwelling in which said professional person resides, and provided there is no display of advertising except a small professional plate as provided in Article VI, § 175-60A(1)."
								}
							]
						},
						{
							"number": "L. ",
							"content": [
								{
									"text": "Open air parking adjoining business districts of noncommercial automobiles accessory to and in connection with the permitted uses and buildings in the adjoining business district when authorized by the Board of Appeals pursuant to the provisions of Article IX."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 175-7",
			"title": "Parking and storage of commercial vehicles.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Definitions. As used in this section, the following\nterms shall have the meanings indicated:"
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "No commercial vehicle shall be stored or parked on\nany residential property within the Village. It shall be an affirmative\ndefense in any prosecution for a violation of this section that:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "It was reasonable or necessary for the vehicle to\nbe parked at the subject residential property while the vehicle operator\nwas actually engaged in either the loading or the unloading of the\nvehicle at the subject residential property; or"
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "It was reasonable or necessary for the vehicle to\nbe parked at the subject residential property while the vehicle operator\nwas actually engaged in performing services on the subject residential\nproperty, or improvements thereon, or performing services of a residential\nnature for a resident of the subject residential property."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "No commercial vehicle shall be serviced at any time\non any residential property within the Village, or on a public highway\nwhich is immediately adjacent to any residential property within the\nVillage. It shall be an affirmative defense in any prosecution for\na violation of this section that such service was reasonable or necessarily\nrequired before such vehicle could be safely moved to a permitted\nlocation."
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "No commercial vehicles shall be washed or otherwise\ncleaned at any time on any residential property within the Village\nor on a public highway that is immediately adjacent to any residential\nproperty within the Village."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 175-8",
			"title": "Height of buildings.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "In the case of a single-family dwelling, no building\nshall exceed 2 ½ stories, with a maximum height of 30 feet,\nmeasured from average preexisting ground level to the highest ridge\non the roof, or, with respect to a flat roof, to the highest point\nof a flat roof."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "No single-family dwelling shall have a horizontal\neaves fascia height greater than 22 feet measured vertically from\nthe finished ground level along the building facade to the top of\nthe roof eaves."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "For purposes of this section, the basement or cellar, as defined in § 175-92 of the Code, in any building subject to this section shall be deemed a story if the exposed sublevel is at least four feet in height."
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "The height of any building that is neither a single-family\ndwelling, nor a building or a structure that is accessory to a single-family\ndwelling, shall not exceed three stories, with a maximum height of\n45 feet, measured from average preexisting ground level to the highest\nridge on the roof, or, with respect to a flat roof, to the highest\npoint of a flat roof."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 175-9",
			"title": "Lot area; street frontage; floor area ratio.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "No dwelling or other building shall be constructed\non a lot containing an area of less than 8,500 square feet or having\na street frontage of less than 85 feet."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Total floor area shall not exceed:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Thirty-six percent of the lot area, where lot area\nis equal to or less than 10,000 square feet; or"
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Thirty-three percent of the lot area, where lot area\nis greater than 10,000 square feet but not greater than 16,000 square\nfeet; or"
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Thirty-one percent of the lot area, where lot area\nis greater than 16,000 square feet."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "The portion of the total floor area for any dwelling\nallocable to the attic of such dwelling shall not exceed 35% of such\ntotal floor area, with respect to a residence that has one story,\nor 25% of such total floor area with respect to a residence that has\nmore than one story."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 175-10",
			"title": "Building area.",
			"content": [
				{
					"text": "The building area shall not exceed 25% of the\nlot area."
				}
			]
		},
		{
			"paragraph": "§ 175-11",
			"title": "Habitable floor area; ground coverage.",
			"content": [
				{
					"text": "No dwelling shall be erected unless it has a habitable floor area (as defined in § 175-92, as amended) of at least 1,600 square feet, and a ground coverage of at least 800 square feet."
				}
			]
		},
		{
			"paragraph": "§ 175-12",
			"title": "Front yards.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Unless the main building on the lot is controlled by Subsection C, there shall be a front yard, the depth of which shall be not less than 35 feet."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "On a corner lot a front yard shall be required on each street and, unless the building is controlled by Subsection C, the front yard on the narrower street frontage shall be not less than 35 feet in depth and the other front yard shall be not less than 30 feet in depth; and if the street frontages are equal, a minimum front yard of 35 feet shall be required on each street front."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "The minimum front yard depth shall be the same as\nthe average front yard depth of the existing buildings within 200\nfeet on each side of the lot and within the same block front and district.\nNo front yard shall be required to have a depth greater than 50 feet."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 175-13",
			"title": "Side yards.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "A single-family dwelling on an interior lot shall\nhave two side yards, one on each side of the main building, the aggregate\nwidth of which shall be not less than 25% of the width of the lot,\nbut in no case shall the width of any side yard be less than the greater\nof 15 feet; or that distance which, when added to the actual distance\nbetween the property line shared with the abutting lot and the closest\npoint of any dwelling on the abutting lot (defined for purposes of\nthis section as the actual abutting residential lot setback), equals\n30 feet."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "A single-family dwelling on a corner lot shall have only one side yard abutting an interior lot adjacent thereto. The minimum width of said side yard shall be the greater of 15 feet; or that distance which, when added to the actual abutting residential lot setback, if any, equals 30 feet. The other yard fronting on the street of such corner lot, regardless of how same may be used or perceived, shall be deemed for purposes of this Code as a front yard and shall conform to the provisions of § 175-12B."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "A main building other than a single-family dwelling\non an interior lot shall have two side yards, each having a minimum\nwidth equal to the greater of 15 feet, or that distance which, when\nadded to the actual abutting residential lot setback, if any, equals\n30 feet, provided, that if such building is over 35 feet in height,\nthe width of each side yard shall be not less than the greater of\n20 feet, or that distance which, when added to the actual abutting\nresidential lot setback, if any, equals 35 feet."
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "A main building other than a single-family dwelling on a corner lot shall have two front yards, both of which shall conform to the provisions of § 175-12B. The minimum width of the remaining side yard shall be equal to the greater of 15 feet; or that distance which, when added to the actual abutting residential lot setback, if any, equals 30 feet, provided, that if such building is over 35 feet in height, the width of such side yard shall be not less than the greater of 20 feet; or that distance which, when added to the actual abutting residential lot setback, if any, equals 35 feet."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 175-14",
			"title": "Rear yards.",
			"content": [
				{
					"text": "There shall be a rear yard, the depth of which\nshall be not less than 20 feet."
				}
			]
		},
		{
			"paragraph": "§ 175-15",
			"title": "Permitted encroachments.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Encroachments into required yards are hereby permitted\nas provided in this section only."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Cornices, eaves and gutters projecting not more than\n24 inches; chimneys or bay windows not more than six feet in length\nand projecting not more than 24 inches."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "One-story open porches and terraces projecting not\nmore than five feet into a minimum front yard."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "A one-story enclosed vestibule not greater than six\nfeet in width and five feet in depth, extending into a minimum front\nyard."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "In any case where the Board of Appeals has diminished\na required yard by a variance, none of the foregoing encroachments\nshall be permitted in such diminished yard."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 175-16",
			"title": "Accessory structures.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "No fence shall be permitted in a front yard. No fence in a side or rear yard shall exceed a height of four feet above the existing grade at the base thereof. The provisions of this subsection shall not apply to hedges or other shrubbery which are not limited in height, except as provided in Article VII, § 175-65 hereof. All fences must have the good side facing the adjoining property and be on or within the property line.[Amended by L.L. No. 1-1998]"
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Retaining walls shall not extend above the surface\nof the ground which they support. Retaining walls may be located in\nany yard, and shall not be subject to any restrictions contained in\nthis chapter requiring a distance between any structure and a property\nline.[Amended 11-3-2011 by L.L. No. 2-2011]"
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Stationary outdoor fireplaces shall be at least 10\nfeet distant from side and rear property lines and shall not exceed\nfive feet in height."
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "Pergolas shall not exceed 10 feet in height."
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "Other accessory structures not mentioned herein shall be located in accordance with the requirements for accessory buildings as provided in § 175-17.[Amended 10-15-2007 by L.L. No. 5-2007]"
								}
							]
						},
						{
							"number": "F. ",
							"content": [
								{
									"text": "Central air-conditioning units and electric generating\nunits may be installed outside of a dwelling only to the extent the\nlocation thereof satisfies each of the following restrictions:[Added 6-5-2006 by L.L. No. 1-2006]"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Such units shall not be located within a front yard."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Such units shall not be located within 12 feet of\nany property line."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Such units shall at all times be in compliance with the provisions of Chapter 136 of the Village Code, entitled Noise, or any successor provisions thereto."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "Sound attenuation panels and landscaped screening\nshall be provided and maintained to reduce, to the extent practicable,\nthe adverse impacts of the noise and visibility of such units upon\nadjacent properties, in a manner reasonably satisfactory to the Village\nBuilding Inspector."
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "Portable generator units temporarily placed out of doors during use thereof shall not be subject to the restrictions set forth in Subsection F(1) and (2)."
												}
											]
										}
									]
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 175-17",
			"title": "Accessory buildings.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Accessory buildings and/or structures, except as otherwise\nprovided in this article, shall not be over 15 feet in height at their\nhighest point and shall not occupy more than 40% of the area of the\nrear yard. The yard area occupied by an accessory building or structure\nshall be included in computing the maximum percentage of the lot area\nwhich may be utilized for building."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Unless otherwise provided in this article, each accessory\nbuilding and/or structure shall be located in the rear yard and shall\nbe not less than 10 feet distant from the main building and not less\nthan three feet distant from the side and rear property lines.[Amended 10-15-2007 by L.L. No. 5-2007; 11-3-2011 by L.L. No. 2-2011]"
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Unless otherwise provided in this article, accessory buildings and/or structures on corner lots 100 feet or less in depth shall be located as far as possible from the front property lines while conforming to the provisions of Subsections B and D."
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "No accessory building or structure, with the exception\nof fences no more than four feet in height, or retaining walls, shall\nbe erected within 20 feet of a building used for residence purposes\non an adjoining lot."
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "No accessory building or structure shall be erected in a rear yard the area of which is not sufficient to permit compliance with the requirements of Subsections A to D, inclusive."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 175-18",
			"title": "Outdoor water pools.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Outdoor water pools, of any kind, may be installed\nor maintained in any Residence A District only as an accessory structure\nto a residence for the private use of the owner or occupants of such\nresidence and their families and guests, and only in accordance with\nall of the provisions of this chapter.[Amended 9-19-2005 by L.L. No. 1-2005]"
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Outdoor water pools shall, for the purposes of this\nchapter, be construed to mean any pool, permanent or portable, tank,\ndepression or excavation in any material, dike or berm constructed,\nerected, excavated or maintained which will permit the retaining of\nwater to a depth greater than 18 inches and having a plane surface\narea of water greater than 100 square feet, except such as shall hereinafter\nbe excluded. The word “pool” shall be construed to mean\noutdoor water pool."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "No pool, permanent or portable, shall be used, installed or maintained as authorized in Subsection A, except on the following conditions:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "A permit shall be obtained from the Building Department\nof the Village of Baxter Estates for the construction, maintenance\nand operation of any pool, existing or proposed. No permission shall\nbe granted for the installation of any pool unless the plans therefor\nmeet the approval of the Building Department construction requirements\nnor until the owner of the premises has filed with the Building Department\na certification approved by a professional engineer licensed by the\nState of New York that the drainage of such pool is adequate and will\nnot interfere with the public water supply system, with existing sanitary\nfacilities, abutting properties or with the public highways."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Applications for permits shall include complete plans\nindicating the location of the pool on the plot, with all distances\nto buildings and property lines; and all methods and materials to\nbe used for construction and means for drainage and filling. Existing\npools need not file construction plans except for plot plans. All\noutdoor water pools must be equipped with suitable ladders or stairs\nfor ingress and egress, and with at least one life ring accessible\nand large enough to support an adult in the water.[Amended 9-19-2005 by L.L. No. 1-2005]"
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Permits shall be granted for such period of time as\nthe Board of Trustees shall establish from time to time, by resolution\nduly adopted by the Board, and shall be renewable on application and\nproof of compliance with all existing provisions of this chapter.[Amended 1-5-2012 by L.L. No. 2-2012]"
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "Anything in this chapter to the contrary notwithstanding,\nthere shall be erected and maintained a good-quality, close-woven\nstockade, close-woven wire or chain-link fence four feet in height,\nenclosing the entire portion of the premises upon which such pool\nshall be installed and entirely surrounding the area in which such\npool is located. Any wire fence shall be constructed of not less than\nNumber 13 gauge galvanized wire with no greater than a one-inch mesh\nor of not less than Number 11 gauge wire with no greater than a two-inch\nmesh. If some other type of fencing than that specified above is preferred,\nplans and specifications thereof may be submitted for the approval\nof the Building Inspector. In evaluating such request for approval,\nthe Building Inspector shall give due consideration to the adequacy\nand durability of the proposed fence to ensure the safety and welfare\nof the general public. No fences for pool areas may extend beyond\nthe property lines of the subject property or into the adjoining property.\nEvery gate or other opening in the fence enclosing such pool, except\nan opening through the dwelling or other main building of the premises,\nshall be kept securely closed and locked at all times when the owner\nor occupant of the premises is not present at such pool and shall\nbe equipped with self-closing and self-locking devices. A maintenance\narea of 10 feet, minimum, shall be maintained between the pool fencing\nand the sidewalls of the pool."
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "Pools shall be permitted in the rear yards only, one\npool per premises."
												}
											]
										},
										{
											"number": "(6) ",
											"content": [
												{
													"text": "Pools shall not be installed less than 10 feet from\nrear and side lot lines."
												}
											]
										},
										{
											"number": "(7) ",
											"content": [
												{
													"text": "Such pool area shall not occupy more than 50% of the\nopen area of the rear yard."
												}
											]
										},
										{
											"number": "(8) ",
											"content": [
												{
													"text": "If the water for such pool is supplied from a private\nwell, there shall be no cross-connection with the public water supply\nsystem. The inlet shall be above the overflow level of the pool. Such\npool shall be chemically treated in a manner sufficient to maintain\nthe bacterial standards established by the provisions of the New York\nState Sanitary Code relating to public swimming pools."
												}
											]
										},
										{
											"number": "(9) ",
											"content": [
												{
													"text": "Pools shall be completely drained in winter or provided\nwith tight-fitting covers that satisfy the requirements for pool covers\nset forth in Section 303.3.9(9.1) of the Property Maintenance Code\nof New York State, as amended from time to time, or any successor\nprovision thereto.[Amended 10-15-2007 by L.L. No. 5-2007]"
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "Anything aforesaid notwithstanding, portable swimming pools of a size capable of retaining water to a depth not greater than 18 inches, or which have a plane surface area of water not greater than 100 square feet, shall not be required to comply with the provisions of Subsection C hereof, provided that the following conditions are complied with in all respects:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "The pool shall be so located on the premises as to\nbe visible from the dwelling."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "The pool shall be located in the rear yard of the\npremises and removed from all property lines a minimum distance of\nfive feet. The minimum distance to the house shall be 10 feet."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "The pool shall be equipped with a cover approved by\nthe Building Department and shall be of sufficient strength to protect\nagainst accidental entry into the pool. The pool shall be covered\nat all times when containing water and not in use."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "The water left in the pool shall be drained whenever\nthe residence it serves is left unattended for a period in excess\nof 48 hours."
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "Provisions shall be made on the premises for drainage\nof water from the pool."
												}
											]
										},
										{
											"number": "(6) ",
											"content": [
												{
													"text": "The pool shall be treated in such manner as to maintain\nthe bacterial standards satisfactory to the Nassau County Department\nof Health."
												}
											]
										},
										{
											"number": "(7) ",
											"content": [
												{
													"text": "Access to the pool, if by means of ladder or stairs,\nshall be removed when the pool is unattended or secured by self-closing,\nlocked gates."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "No loudspeaker device which can be heard beyond the\nproperty line of the premises in which any pool has been installed\nmay be operated in connection with such pool, nor may lighting be\ninstalled therewith which shall throw any rays beyond the property\nlines. No loudspeaker device of any type shall be operated after 10:00\np.m. or before 8:00 a.m."
								}
							]
						},
						{
							"number": "F. ",
							"content": [
								{
									"text": "Should the owner abandon the pool, he shall arrange\nto remove the depression and return the surface of the ground to its\noriginal grade and approximately in the same condition as before the\npool was constructed, and he shall further notify the Building Department\nof the abandonment so that an inspection of the site may be made and\nthe records of the permit be marked accordingly."
								}
							]
						},
						{
							"number": "G. ",
							"content": [
								{
									"text": "The fee for the issuance of the permit referred to in Subsection C hereof and the fee for a renewal of a permit shall be as set from time to time by resolution of the Board of Trustees. In each case, the fee shall accompany the application.[Amended 9-19-2005 by L.L. No. 1-2005]"
								}
							]
						},
						{
							"number": "H. ",
							"content": [
								{
									"text": "Existing pools."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "In the event that a pool, in existence at the effective date of this section, does not conform with the provisions of Subsection C(4), (6) or (7) hereof, the application for the permit for such pool shall be referred to the Building Inspector, who shall have the right to issue or refuse to issue the permit after consideration of the reasons why such pool fails to conform and the effect thereof upon public health, safety and general welfare. The Building Inspector shall have the authority to issue a permit in such a case upon such conditions and subject to such restrictions as he may deem to be in the best interests of public health, safety and general welfare. In any event, no such pool, or the fencing therefor, may be replaced, altered, reconstructed or rebuilt except in conformity with the provisions of this chapter. The Building Inspector shall issue or refuse to issue each permit applied for within 30 days after application therefor. The applicant may appeal any adverse action by the Building Inspector at any regular meeting of the Board of Trustees, provided notice of such appeal shall have been sent to the Village Clerk and the Building Inspector at least 10 days prior to such meeting. After hearing the applicant and the Building Inspector, the Board shall render its decision and such decision shall be recorded in the minutes of the Board for that meeting."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "In the event that a pool, in existence at the effective date of this section, does not conform with the provisions hereof, the Building Inspector, in his discretion, may issue a temporary permit for the use thereof pending the completion of the work necessary to bring such pool into conformity with the provisions of this section, or pending the outcome of an application or appeal under Subsection H(1) hereof. In exercising his discretion, the Building Inspector shall consider the time it will take to complete such work and the effect of the failure of such pool to conform on public health, safety and general welfare. The decision of the Building Inspector with respect to temporary permits shall be final."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Pools for which neither a permit nor a temporary permit has been granted shall be completely drained or covered in the manner prescribed in Subsection C(9) hereof."
												}
											]
										}
									]
								}
							]
						}
					]
				}
			]
		}
	]
}