{
	"url": "http://ecode360.com/8410570",
	"paras": [
        {
        	"paragraph": "ยง 200bR30",
        	"title": "BULK REGULATIONS FOR ONE-FAMILY RESIDENCES",
        	"content": [
        		{
        			"text": "The following regulations shall apply in an R-30 district:"
        		},
        		{
        			"content": [
        				{
        					"number": "A. ",
        					"content": [
        						{
        							"text": "Lot areas (square feet): 30000"
        						}
        					]
        				},
        				{
        					"number": "B. ",
        					"content": [
        						{
        							"text": "Lot width (feet): 125"
        						}
        					]
        				},
        				{
        					"number": "C. ",
        					"content": [
        						{
        							"text": "Lot depth (feet): 150"
        						}
        					]
        				},
        				{
        					"number": "D. ",
        					"content": [
        						{
        							"text": "Front yard (feet): 35"
        						}
        					]
        				},
        				{
        					"number": "E. ",
        					"content": [
        						{
        							"text": "1 side yard (feet): 18"
        						}
        					]
        				},
        				{
        					"number": "F. ",
        					"content": [
        						{
        							"text": "Both side yards (feet): 38"
        						}
        					]
        				},
        				{
        					"number": "G. ",
        					"content": [
        						{
        							"text": "Rear yard (feet): 36"
        						}
        					]
        				},
        				{
        					"number": "H. ",
        					"content": [
        						{
        							"text": "Livable floor area per dwelling unit (square feet): 850"
        						}
        					]
        				},
        				{
        					"number": "I. ",
        					"content": [
        						{
        							"text": "Building height(stories/feet): 2.5/35"
        						}
        					]
        				},
        				{
        					"number": "J. ",
        					"content": [
        						{
        							"text": "Building coverage (percent): 20"
        						}
        					]
        				}
        			]
        		}
        	]
        },
        {
			"paragraph": "ยง 200-25",
			"title": "Supplementary regulations applying to all residence districts.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Accessory buildings."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "An accessory building may be located in any required\nside or rear yard, provided that:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "Such building shall not exceed 15 feet in height."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "Such buildings shall be set back 10 feet from\nany lot line.[Amended 9-16-1969 by Ord. No. 73]"
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "All such buildings in the aggregate shall not\noccupy more than 30% of the area of the required rear or side yard."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Accessory buildings constructed at the same time may\nbe located in pairs or groups in the required rear or side yard along\nthe common side lot line or rear lot line of contiguous lots."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "An accessory building on that portion of a lot not\nincluded in any required yard shall conform with the height regulations\nfor principal buildings."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "No accessory building shall project nearer to the\nstreet on which the principal building fronts than such principal\nbuilding. Should topographic conditions be such that practical difficulties\nwould be caused by this requirement with respect to the location of\ngarages, the Planning Board may authorize the erection of such garages\nunder the following conditions:[Amended 9-16-1969 by Ord. No. 73]"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "If the natural slope is from 10% to 20% within\n25 feet of the street line, the Board may permit a garage not closer\nthan 10 feet to the street line."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "Where such slope exceeds 20%, a garage may be\npermitted not closer than five feet to the street line."
																}
															]
														}
													]
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Corner lots."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Obstruction to vision at street intersections. At\nall street intersections in all residence districts, no obstructions\nto vision exceeding 30 inches in height above curb level shall be\nerected or maintained on any lot within the triangle formed by the\nstreet lines of such lot and a line drawn between points along such\nstreet lines 30 feet distant from their point of intersection."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Rear and side yards. On a corner lot, front yards\nare required on both street frontages, and one yard other than the\nfront yards shall be deemed to be a rear yard and the other, or others,\nside yards."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Exceptions to lot depth requirements. The required\nlot depth at any point may be decreased by 25% if the average lot\ndepth conforms with the minimum requirement."
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "Exceptions to yard requirements."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Permitted obstructions. Cornices or cantilevered roofs\nmay project not more than three feet into a required yard. Belt courses,\nwindow sills and other ornamental features may project not more than\nsix inches into a required yard. Fences or walls over 6 1/2 feet\nin height may not be erected in front, rear or side yards. Fences\nor walls with a height in excess of 6 1/2 feet shall conform\nto the requirements set forth herein for buildings. Paved areas (other\nthan such as are needed for access to the buildings on the lot) shall\nnot project within 15 feet of a street line or four feet of lot lines.\nAll fences shall be installed with the more attractive side facing\nneighboring properties.[Amended 9-16-1969 by Ord. No. 73; 4-12-2011 by L.L. No.\n6-2011]"
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Entries and porticos. A roofed-over but unenclosed\nprojection in the nature of an entry or portico, not more than eight\nfeet wide and extending not more than six feet out from the front\nwall of the building, shall be exempt from front yard requirements\nwhen the building otherwise complies with all other yard restrictions\nof this chapter."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Existing setback. No proposed one- or two-family dwelling\nneed have a setback greater than the average setback of the existing\ndwellings within 200 feet of each side of the said proposed dwelling.[Amended 9-16-1969 by Ord. No. 73]"
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "Front yards on narrow streets. On streets with less\nthan a fifty-foot right-of-way, the front yard setback shall be measured\nfrom the center line of the existing street, and 25 feet shall be\nadded to the front yard setback."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "Existing small lots. A lot owned individually and\nseparately, and separated in ownership from any adjoining tracts of\nland on the effective date of this chapter, which has a total lot\narea or lot width less than prescribed in this chapter, may be used\nfor a one-family residence, provided that such lot shall be developed\nin conformity with all applicable district regulations other than\nthe minimum lot area, lot width and side yards.[Amended 9-16-1969 by Ord. No. 73]"
								}
							]
						},
						{
							"number": "F. ",
							"content": [
								{
									"text": "Uniformity of design. In order to avoid monotony of\narchitectural design, no building permit shall be issued for the erection\nof a home if it is substantially like any neighboring building which\nis existing or for which a building permit has been issued or is being\nconcurrently considered.[Amended 9-16-1969 by Ord. No. 73]"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "A building shall be considered neighboring if it fronts\non the same street as the building being considered and which is the\nfirst or second house along the street in either direction or which\nfaces the building site being considered from across the street."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "In considering those items listed in Subsection F(3), buildings shall be considered substantially alike in any dimension for which they differ by less than two feet, except 20 feet for setback differences. Buildings between which the only difference in relative location of elements is end-to-end or side-to-side reversal shall be deemed to be alike in related location of such elements."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Buildings shall be considered substantially alike\nunless they differ in at least three of the following respects or\ndimensions:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "Setback from the street."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "Relation of a garage visible from the street\nto the main structure."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "Length of the main roof ridge."
																}
															]
														},
														{
															"number": "(d) ",
															"content": [
																{
																	"text": "Height of the roof ridge above the first-floor\nelevation."
																}
															]
														},
														{
															"number": "(e) ",
															"content": [
																{
																	"text": "Width measured perpendicular to the main roof\nridge if the building has a gable extending from the main roof visible\nfrom the street."
																}
															]
														},
														{
															"number": "(f) ",
															"content": [
																{
																	"text": "Relationship to each other of either windows,\ndoors, chimney or any porch in the front elevation."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "The Planning Board may waive or vary any requirement\nof this subsection where the layout of the neighborhood, road pattern,\ntopography, natural features, views and the siting of individual structures\nis such as to avoid monotony of appearance despite similarity of buildings."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "G. ",
							"content": [
								{
									"text": "Portable\nstorage unit. A maximum of one portable storage unit may be placed\non any residentially used or zoned lot for a period not exceeding\nnine months during any twelve-month period if the property owner possesses\na valid building permit, or for a period not exceeding three months\nduring any twelve-month period otherwise. Said storage unit shall\nonly be placed on a driveway or in a parking area, and not on lawns\nor other vegetated areas.[Added 4-12-2011 by L.L. No. 6-2011]"
								}
							]
						}
					]
				}
			]
		}
    ]
}