{
	"url": "http://ecode360.com/8988623",
	"paras": [
		{
			"paragraph": "§ 80-37",
			"title": "Use regulations.",
			"content": [
				{
					"text": "In the Residence F District, a building or structure may be\nerected, altered or used, and a lot or premises may be used, only\nfor one or more of the purposes set forth below, and for no other:"
				},
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Those uses permitted in the Residence B District."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "A public school satisfying all requirements for public schools as\ndetermined by the New York State Education Commission, or a private\nschool, as defined for purposes of this chapter, but in either case\nonly after issuance of a special use permit therefor by the Board\nof Trustees, following a public hearing thereon, and subject to such\nreasonable conditions and safeguards with respect to traffic, parking\nand related issues as shall be determined by the Board of Trustees,\nand subject to the following further conditions:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Each accessory building, structure and detached garage shall be located\nat least 100 feet from all street lines and all other property lines."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "The building area shall not exceed 20% of the lot area."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "There shall be one off-street parking space provided for:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "Each teacher and other faculty member; and"
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "Every five seats in the auditorium, gymnasium, grandstand or\nother similar facility located on the premises that has the largest\nseating capacity."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "Said premises shall provide outdoor playground and/or playfield facilities\ndeemed adequate by the Board of Trustees in relation to the permitted\nuse of said premises, taking into account the number and ages of the\ncontemplated students."
												}
											]
										}
									]
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 80-38",
			"title": "Lot requirements.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "No building or structure shall be erected on any lot within the Residence\nF District that has less than:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "One hundred fifty feet of street frontage."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "One hundred fifty feet of lot width at any point from the front property\nline to a depth of 50 feet from the front property line."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Forty thousand square feet of lot area."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Notwithstanding any contrary provision contained in this section,\na building or structure may be erected on a lot having not less than\n100 feet of street frontage, provided that said street frontage coincides\nwith the circumference of a turnaround at the extremity of a dead-end\nstreet or a cul-de-sac."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 80-39",
			"title": "Yard requirements.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "There shall be front, rear and side yards on each\nplot of not less than the following depth or width:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Front yard: 50 feet."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Rear yard: 50 feet."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Side yard: 25 feet on each side."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "On corner lots, a front yard of at least 50 feet is\nrequired on each street."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 80-40",
			"title": "Bulk regulations.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Height restrictions. No building shall exceed 2 1/2 stories,\nor 28 feet in height measured from the average ground level at the\nperimeter of such building."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Lot coverage. The building area shall not exceed 20% of the first\n40,000 square feet of lot area, and 10% of that portion of lot area,\nif any, in excess of 40,000 square feet."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Floor area ratio. The floor area ratio shall not exceed 0.20."
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "Minimum floor area. Each dwelling shall have a minimum ground floor\narea of at least 1,000 square feet."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 80-41",
			"title": "Off-street parking.",
			"content": [
				{
					"text": "Off-street parking requirements shall be the\nsame as in the Residence E District."
				}
			]
		},
		{
			"paragraph": "§ 80-42",
			"title": "Detached garages, accessory buildings and structures.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Each detached garage, accessory building and structure, unless expressly provided to the contrary elsewhere in this chapter, shall satisfy each of the provisions of § 80-36, relating to detached garages, accessory buildings and structures in the Residence E District."
								}
							]
						}
					]
				}
			]
		}
	]
}