{
	"url": "http://ecode360.com/8988556",
	"paras": [
		{
			"paragraph": "§ 80-25",
			"title": "Use regulations.",
			"content": [
				{
					"text": "In the Residence D District, a building or structure may be\nerected, altered or used, and a lot or premises may be used, only\nfor one or more of the purposes set forth below, and for no other:"
				},
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Those uses permitted in the Residence B District."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 80-26",
			"title": "Lot requirements.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "No building or structure shall be erected on any lot within the Residence\nD District that has less than:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "One hundred feet of street frontage."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "One hundred feet of lot width at any point from the front property\nline to a depth of 40 feet from the front property line."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Fifteen thousand square feet of lot area."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Notwithstanding any contrary provision contained in this section,\na building or structure may be erected on a lot having not less than\n60 feet of street frontage, provided that said street frontage coincides\nwith the circumference of a turnaround at the extremity of a dead-end\nstreet or cul-de-sac."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 80-27",
			"title": "Yard requirements.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "There shall be front, rear and side yards on each\nplot of not less than the following depth or width:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Front yard: 40 feet."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Rear yard: 35 feet."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Side yard: 10 feet, provided that the sum of the two\nside yards shall not be less than 25 feet."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "On corner plots, a front yard of at least 40 feet\nshall be required on each street."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 80-28",
			"title": "Bulk regulations.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Height restrictions. No building erected in the Residence D District\nshall exceed 2 1/2 stories, or 28 feet in height measured from\nthe average ground level at the perimeter of such building."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Lot coverage. The building area shall not exceed 20% of the first\n15,000 square feet of lot area, and 12.5% of that portion of the lot\narea, if any, in excess of 15,000 square feet."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "The floor area ratio shall not exceed 0.35."
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "Minimum floor area. Each dwelling shall have a minimum ground floor\narea of 1,000 square feet."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 80-29",
			"title": "Off-street parking.",
			"content": [
				{
					"text": "Space for the off-street parking of at least\none car for each dwelling shall be provided on the plot."
				}
			]
		},
		{
			"paragraph": "§ 80-30",
			"title": "Detached garages, accessory buildings and structures.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Each detached garage, accessory building and structure, unless expressly\nprovided to the contrary elsewhere in this chapter, shall be located\nat least three feet from the rear property line and each side property\nline, and at least five feet from the primary building on the lot."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "No detached garage, accessory building or structure shall exceed\n12 feet in height measured from the average ground level at the perimeter\nthereof."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "No detached garage, accessory building or structure shall occupy\nmore than 500 square feet of lot area."
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "Each detached garage, accessory building and structure shall be located\nat least 70 feet from any street line; provided, however, that with\nrespect to any corner lot, any accessory building, structure or detached\ngarage shall be located only in the corner of the lot farthest removed\nfrom the abutting streets, at least three feet from the two nearest\nproperty lines, and so that the two nearest property lines do not\nabut any street."
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "No lot may contain more than one detached garage."
								}
							]
						}
					]
				}
			]
		}
	]
}