{
	"url": "http://ecode360.com/8988503",
	"paras": [
		{
			"paragraph": "§ 80-13",
			"title": "Use regulations.",
			"content": [
				{
					"text": "In the Residence B District, a building or structure may be\nerected, altered or used, and a lot or premises may be used, only\nfor one or more of the purposes set forth below, and for no other:"
				},
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "A one-family dwelling, which may include the office of a physician,\nlawyer, licensed architect, licensed engineer, surgeon, dentist, real\nestate broker, artist or musician, when situated in the same building\nused by such physician, lawyer, surgeon, dentist, real estate broker,\nartist or musician as his or her private dwelling, and which may also\ninclude customary home occupations, such as dressmaking and millinery,\nconducted by resident occupants thereof; provided, however, that any\nsuch office or occupation shall not be conducted in a basement or\ncellar, and shall not occupy more than 1/3 (33 1/3%) of the gross\nfloor area of said dwelling."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Accessory buildings, as defined and restricted in this chapter and\nin the Building Code of the Village."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "A church, synagogue or other building used exclusively for religious\npurposes, but only after issuance of a special use permit therefor,\nby the Board of Trustees, following a public hearing thereon, subject\nto such reasonable conditions and safeguards with respect to traffic,\nparking and related issues as shall be determined by the Board of\nTrustees."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 80-14",
			"title": "Lot requirements.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "No building or structure shall be erected on any lot within the Residence\nB District of the Village that has less than:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Fifty feet of street frontage."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Fifty feet of lot width at any point from the front property line\nto a depth of 40 feet from the front property line."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Five thousand square feet of lot area."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Notwithstanding any contrary provision contained in this section,\na building or structure may be erected on a lot having less than 50\nfeet of street frontage, provided that:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Said lot was in existence on the effective date of adoption of this\nchapter, is not in common ownership with any immediately adjacent\nlot, and has not less than 4,000 square feet of lot area; and"
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Such building or structure conforms to all other requirements of\nthis chapter."
												}
											]
										}
									]
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 80-15",
			"title": "Yard requirements.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Front yards. Where, at the time of the passage of\nthis chapter, at least 1/2 of the buildings situated on either side\nof a street between two intersecting streets conform to a minimum\nsetback line, no new building shall be erected and no existing building\nshall be reconstructed or altered to project beyond such a setback\nline. The foregoing rule shall, however, in no case be applied so\nas to keep the street wall or walls of buildings more than 25 feet\nfrom the street line. Where there is no existing building in the block,\nno new building shall be erected with its street wall nearer than\n20 feet to the street line."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Rear yards. A rear yard is required on every plot.\nThe depth of a rear yard shall be at least 25 feet, and not more than\n40% of the area of the rear yard shall be built upon."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Side yards. A side yard is required along each side\nof a building, which side yard must be at least six feet in width\non each side, except on corner plots, where a side yard of at least\n20 feet is required on the side toward the street."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 80-16",
			"title": "Bulk regulations.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Height restrictions. No building erected in the Residence B District\nshall exceed 2 1/2 stories, or 28 feet in height measured from\nthe average ground level at the perimeter of such building."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Lot coverage. The building area shall not exceed 25% of the first\n5,000 square feet of lot area, and 12.5% of that portion of the lot\narea, if any, in excess of 5,000 square feet."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "The floor area ratio shall not exceed 0.45."
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "Minimum floor area. Each dwelling shall have a minimum ground floor\narea of 900 square feet."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 80-17",
			"title": "(Reserved)\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t[1]",
			"content": [
				{
					"footnote": "[1]\nEditor's Note: Former § 80-17, Roof restrictions,\nwas repealed 5-20-2010 by L.L. No. 1-2010.\n"
				}
			]
		},
		{
			"paragraph": "§ 80-18",
			"title": "Detached garages, accessory buildings and structures.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Each detached garage, accessory building and structure, unless expressly\nprovided to the contrary elsewhere in this chapter, shall be located\nat least three feet from the rear property line and each side property\nline, and at least five feet from the primary building on the lot."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "No detached garage, accessory building or structure shall exceed\n12 feet in height measured from the average ground level at the perimeter\nthereof."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "No detached garage, accessory building or structure shall occupy\nmore than 500 square feet of lot area."
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "Each detached garage, accessory building and structure shall be located\nat least 75 feet from any street line, except to the extent that either\nof the following exceptions apply:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "With respect to any corner lot, any accessory building, structure\nor detached garage shall be located only in the corner of the lot\nfarthest removed from the abutting streets, at least three feet from\nthe two nearest property lines, and so that the two nearest property\nlines do not abut any street; or"
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Where the front property line and the rear property line abut streets,\nor a street and a waterfront, any accessory building, structure and\ndetached garage thereupon shall be located at least 20 feet from the\nrear property line and at least 75 feet from the front property line."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "No lot may contain more than one detached garage."
								}
							]
						}
					]
				}
			]
		}
	]
}