{
	"url": "http://ecode360.com/9280095",
	"paras": [
		{
			"paragraph": "§ 210-28",
			"title": "Scope.",
			"content": [
				{
					"text": "The following regulations shall apply in all\nResidence AA Districts."
				}
			]
		},
		{
			"paragraph": "§ 210-29",
			"title": "Permitted uses.",
			"content": [
				{
					"text": "The following uses are permitted:"
				},
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Dwellings for not more than one family."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Churches or similar places of worship, parish houses,\nconvents."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Elementary public schools, parochial schools, high\nschools and institutions for higher learning."
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "Public libraries."
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "Public parks and playgrounds and other municipal recreation\nuses."
								}
							]
						},
						{
							"number": "F. ",
							"content": [
								{
									"text": "Customary home occupations, such as the office of\na physician, dentist, surgeon or other professional person, provided\nthat such use is incidental to the primary residence use of such professional\npersons, and provided that such use shall be conducted in the principal\nbuilding."
								}
							]
						},
						{
							"number": "G. ",
							"content": [
								{
									"text": "Garage space or parking space may be provided for\nnot more than three automobiles in a detached garage and not more\nthan two automobiles in an attached garage. Commercial vehicles are\npermitted, provided that such vehicle does not exceed one-ton rated\ncapacity, is used only by the owner or occupant of said property and\nis parked in a completely enclosed garage at all times when not in\nuse. Notwithstanding the aforementioned limitations, the Board of\nAppeals shall have the power to grant permits for the establishment\nand maintenance of parking fields in this and any other zones, subject\nto the conditions and limitations provided in § 210-12(N)\nherein."
								}
							]
						},
						{
							"number": "H. ",
							"content": [
								{
									"text": "Accessory uses to the residence, including a detached\ngarage, accessory buildings, accessory structures, breezeways, decks,\nswimming pools, entry stairs/stoops, unenclosed porches, barbecue\npits, landscape arbors and planters, fences, paved patios sidewalks\nand driveways."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 210-30",
			"title": "Prohibited uses.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Any use not herein specifically permitted is prohibited."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Hospitals or sanatoriums for the treatment of human\nailments are prohibited, except that hospitals or institutions treating\nliquor-habit patients, if existing at the time of the enactment of\nthis amendment, shall be permitted to exist as a lawful nonconforming\nuse."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Tattoo parlors.[Added 5-23-1983 by L.L. No. 11-1983]"
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 210-31",
			"title": "Building height; sky exposure plane.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "No dwelling shall exceed 35 feet in height nor have more than three stories, and no structure of any kind shall be erected to a height in excess of 40 feet, except that this provision shall not apply to restrict the height of a church spire or belfry or of a monument, flagpole, water tank, elevator bulkhead, or stage tower or home television or radio receiving aerial. No building shall penetrate the sky exposure plane, except for those portions as permitted in § 210-3. No accessory building and/or detached garage shall exceed 15 feet in height if erected with a roof pitched less than six units vertically to 12 units horizontally, and 20 feet in height if erected with a roof pitched six units vertically to 12 units horizontally or steeper."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "The following sky exposure planes shall apply:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Along front and rear property lines, a SEP pitch of\none unit vertical to one unit horizontal."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Along side property lines, a SEP pitch of 1.5 units\nvertical to one unit horizontal."
												}
											]
										}
									]
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 210-32",
			"title": "Lot area; street frontage; lot width.",
			"content": [
				{
					"text": "No building shall be erected on a lot whose\narea is less than 7,500 square feet and on any lot which has a street\nfrontage of less than 75 feet and on any lot whose width is less than\n75 feet at any point between the side lines from the front property\nline up to the rear building line of the proposed structure."
				}
			]
		},
		{
			"paragraph": "§ 210-33",
			"title": "Lot coverage; floor area ratio.",
			"content": [
				{
					"text": "The principal building on any lot shall not\ncover more than 25% of the lot area, and no more than an additional\n7.5% of the total area of the lot may be used for the erection of\nan accessory building and/or detached garage with the maximum lot\ncoverage of said accessory building and/or detached garage to be limited\nto an aggregate area of a maximum of 750 square feet, and no more\nthan an additional 5% of the total area of the lot may be used for\nthe erection of an unenclosed porch with the aggregate maximum lot\ncoverage of said unenclosed porch to be limited to a maximum of 375\nsquare feet. The floor area of the principal building shall not exceed\na floor area ratio of 40% of the lot area."
				}
			]
		},
		{
			"paragraph": "§ 210-34",
			"title": "Minimum floor area.",
			"content": [
				{
					"text": "Every dwelling shall provide a minimum of 1,000\nsquare feet of residential floor area per family. Every dwelling more\nthan one story in height shall provide a minimum of 800 square feet\nof residential floor area on the first floor designed for residential\nuse."
				}
			]
		},
		{
			"paragraph": "§ 210-35",
			"title": "Required yards.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Yards of the following depths or widths shall be provided\nfor the principal building on the lot:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Front yard depth: minimum 20 feet or the average depth\nof all residential front yards on the same side of the street within\ntwo hundred 200 feet in either direction, whichever is greater, but\nin no case more than 50 feet."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Rear yard depth: minimum 20 feet or 20% of the lot\ndepth, whichever is greater, with the exception that for lots abutting\ncanals and other navigable bodies of water, the rear yard depth shall\nequal the average depths of all residential rear yards abutting the\nwater on the same side of the canal or navigable body of water within\n200 feet in either direction or 20 feet measured landwards of the\naverage line of the bulkhead, whichever is greater, or, if no bulkhead\nexists, measured 20 feet landwards of the rear property line, whichever\nis greater."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Side yards width: minimum 10 feet; the sum of the\nwidth of the two side yards shall, at minimum, equal 25% of the lot\nwidth."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "No structure or building, other than a fence, landscape\narbors and planters, entry stair/stoop, may be erected in the side\nyard of a building, and any building other than a dwelling, or an\naccessory building serving the dwelling, or a detached garage serving\nthe dwelling, or a breezeway serving the dwelling, shall have a side\nyard of not less than 40 feet measured to the side property lines."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Yards of the following depths or widths shall be provided\nfor accessory buildings, detached garages, accessory structures, barbecue\npits and breezeways on the lot:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Front yard: No accessory building, accessory structure,\nbarbecue pit, detached garage or breezeway shall be erected in any\nfront yard."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Rear yard depth: minimum five feet, except for lots\nwhich abut canals or navigable waters, a minimum depth of 20 feet\nmeasured landwards of the average line of the bulkhead shall be provided;\nif no bulkhead exists, measured 20 feet landwards of the rear property\nline."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Side yards width: No accessory building, accessory\nstructure, barbecue pit, detached garage or breezeway shall be erected\nin any side yard."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "Separation from dwellings on adjacent lots: A minimum\nseparation of 20 feet shall be provided from any existing dwellings\non adjacent lots."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "Decks extending less than 18 inches above the established\ngrade in areas mapped outside the floodplain by FEMA FIRM maps or\ndecks not extending above adjusted grade in areas mapped within the\nfloodplain by FEMA FIRM maps shall comply with the following yard\nrequirements:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Front yard depth requirements shall be the same as\nfront yard depth requirements for principal buildings."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Side yards width: minimum 3 1/2 feet from side\nproperty lines."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Rear yards depth: minimum 3 1/2 feet; except\nfor lots abutting canals or navigable water, the deck may extend to\nthe bulkhead."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "Decks extending more than 18 inches above established\ngrade in areas mapped outside the floodplain by FEMA FIRM maps or\ndecks extending above adjusted grade in areas mapped within the floodplain\nby FEMA FIRM maps shall be considered to be accessory structures if\nfreestanding and if attached to or separated by less than four feet\nfrom a building, shall be considered as a part of the principal building,\naccessory building or detached garage to which they are attached or\nadjacent and shall be regulated by the requirements for those buildings."
								}
							]
						}
					]
				}
			]
		}
	]
}