{
	"url": "http://ecode360.com/9280134",
	"paras": [
		{
			"paragraph": "§ 210-36",
			"title": "Scope.",
			"content": [
				{
					"text": "The following regulations shall apply in all\nResidence A Districts."
				}
			]
		},
		{
			"paragraph": "§ 210-37",
			"title": "Permitted uses.",
			"content": [
				{
					"text": "The following uses are permitted:"
				},
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "All uses permitted in Residence AA Districts."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "A detached garage, accessory buildings, accessory\nstructures, breezeways, decks, swimming pools, entry stairs/stoops,\nunenclosed porches, barbecue pits, landscape arbors and planters,\nfences, paved patios, sidewalks and driveways."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Boat mooring or docking."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "The mooring or docking of boats at property abutting upon any canal or waterway; provided, however, that all boats so docked shall comply with the terms and provisions of §§ 205-14 through 205-18 of Chapter 205, Waterfront Properties and Watercraft."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Nothing contained herein shall be deemed to permit\nin a zoned residential district the docking or mooring of a commercial,\ncharter, open party or similarly used boat or the loading or unloading\nof cargo or the embarking or disembarking of passengers, or to permit\nthe sailing to or from property in such a district of a commercial,\ncharter, open party or similarly used boat with its cargo, charter,\nparty or passengers. For the purposes of this subsection, a \"charter\"\nor \"open party\" boat shall only be considered as such when embarking,\ndisembarking or carrying passengers and/or when loading or unloading\ncargo or supplies."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "Dock rental."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "The renting of dock space for boats, provided that the total number of boats for which such dock space is rented does not exceed the number of boats permitted to be docked within the provisions of §§ 205-14 through 205-18 of Chapter 205, Waterfront Properties and Watercraft, and further provided that in no event shall the number of boats for which dock space is rented exceed, in number, one boat to each 30 linear feet of said property abutting upon or running parallel to the bank of any canal or waterway when the provisions of §§ 205-14 through 205-18 require parallel docking or mooring to the bank of said canal or waterway."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Nothing hereinabove contained shall be deemed to permit\nthe renting or offering for rent of such dock space for boats on any\nunimproved property abutting upon any canal or waterway."
												}
											]
										}
									]
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 210-38",
			"title": "Prohibited uses.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Any use not herein specifically permitted is prohibited."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Garage space or parking space may be provided for\nnot more than three automobiles, one of which may be a commercial\nvehicle with a rated capacity of not more than 1 1/2 tons, except\nthat no vehicle or accessory thereto, other than a pleasure car, may\nbe stored outdoors.[Added 6-21-1971; amended 9-29-1986 by L.L. No. 10-1986]"
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Hospitals or sanatoriums for the treatment of human\nailments are prohibited, except that hospitals or institutions treating\nliquor-habit patients, if existing at the time of the enactment of\nthis amendment, shall be permitted to exist as a lawful nonconforming\nuse.[Added 2-28-1977 by L.L. No. 3-1977]"
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "Tattoo parlors are prohibited.[Added 5-23-1983 by L.L. No. 11-1983]"
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 210-39",
			"title": "Building height; sky exposure plane.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "No dwelling shall exceed 35 feet in height nor have more than three stories, and no structure of any kind shall be erected to a height in excess of 40 feet, except that this provision shall not apply to restrict the height of a church spire or belfry or of a monument, flagpole, water tank, elevator bulkhead, or stage tower or home television or radio receiving aerial. No building shall penetrate the sky exposure plane, except for those portions as permitted in § 210-3. No accessory building and/or detached garage shall exceed 15 feet in height if erected with a roof pitched less than six units vertically to 12 units horizontally, and 20 feet in height if erected with a roof pitched six units vertically to 12 units horizontally or steeper."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "The following sky exposure planes shall apply:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Along front and rear property lines, a SEP pitch of\none unit vertical to one unit horizontal."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Along side property lines, a SEP pitch of two units\nvertical to one unit horizontal."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Superintendent of Buildings authority.[Added 7-8-2013 by L.L. No. 2-2013]"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "The\nSuperintendent of Buildings shall have the authority to waive the\nprovisions of this section for those homes located within the AE flood\nzone where mitigation activities are ongoing. For purposes of this\nsubsection, \"mitigation activities\" is defined as being the elevation\nof structures, demolitions and rebuilds."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "New\nentrances, staircases, and/or staircases for electric meter maintenance\nwill be permitted, and subject to this subsection, provided that all\nappropriate zoning and planning approvals have been obtained."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "This\nsubsection shall not apply to extensions and/or dormers and/or exterior\nalterations where mitigation efforts have not been undertaken."
												}
											]
										}
									]
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 210-40",
			"title": "Lot area; street frontage; lot width.",
			"content": [
				{
					"text": "No building shall be erected on a lot whose\narea is less than 5,000 square feet and on any lot which has a street\nfrontage of less than 50 feet and on any lot whose width is less than\n50 feet at a point between the side lines from the front property\nline to the rear building line of the proposed structure."
				}
			]
		},
		{
			"paragraph": "§ 210-41",
			"title": "Lot coverage; floor area ratio.",
			"content": [
				{
					"text": "The principal building on any lot shall not\ncover more than 30% of the lot area, and no more than an additional\n10% of the total area of the lot may be used for the erection of an\naccessory building(s) and/or detached garage with the aggregate maximum\nlot coverage of said accessory building(s) and/or detached garage\nto be limited to a maximum of 500 square feet, and no more than an\nadditional 5% of the total area of the lot may be used for the erection\nof an unenclosed porch with the aggregate maximum lot coverage of\nsaid porch to be limited to a maximum of 250 square feet. The floor\narea of the principal building shall not exceed a floor area ratio\nof 50% of the lot area."
				}
			]
		},
		{
			"paragraph": "§ 210-42",
			"title": "Minimum floor area.",
			"content": [
				{
					"text": "There shall be a minimum floor area of 800 square\nfeet in every dwelling."
				}
			]
		},
		{
			"paragraph": "§ 210-43",
			"title": "Required yards.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Yards of the following depths or widths shall be provided\nfor the principal building on the lot:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Front yard depth: minimum 20 feet or the average depth\nof all residential front yards on the same side of the street within\ntwo hundred 200 feet in either direction, whichever is greater, but\nin no case more than 40 feet."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Rear yard depth: minimum 20 feet or 20% of the lot\ndepth, whichever is greater, with the exception that for lots abutting\ncanals and other navigable bodies of water, the rear yard depth shall\nequal the average depths of all residential rear yards abutting the\nwater on the same side of the canal or navigable body of water within\n200 feet in either direction or 20 feet measured landwards of the\naverage line of the bulkhead, whichever is greater, or, if no bulkhead\nexists, measured 20 feet landwards of the rear property line, whichever\nis greater."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Side yards width: minimum five feet; the sum of the\nwidth of the two side yards shall, at minimum, equal 25% of the lot\nwidth."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "No structure or building, other than a fence, landscape\narbors and planters, entry stair/stoop, may be erected in the side\nyard of a building, and any building other than a dwelling, or an\naccessory building serving the dwelling, or a detached garage serving\nthe dwelling, or a breezeway serving the dwelling, shall have a side\nyard of not less than 40 feet measured to the side property lines."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Yards of the following depths or widths shall be provided\nfor accessory buildings, detached garages, accessory structures, barbecue\npits, and breezeways on the lot:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Front yard: No accessory building, accessory structure,\nbarbecue pit, detached garage or breezeway shall be erected in any\nfront yard."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Rear yard depth: minimum five feet, except for lots\nwhich abut canals or navigable waters, a minimum depth of 20 feet\nmeasured landwards of the average line of the bulkhead shall be provided;\nif no bulkhead exists, measured 20 feet landwards of the rear property\nline."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Side yards width: No accessory building, accessory\nstructure, barbecue pit, detached garage or breezeway shall be erected\nin any side yard."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "Separation from dwellings on adjacent lots: a minimum\nseparation of 15 feet shall be provided from any existing dwellings\non adjacent lots."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "Decks extending less than 18 inches above the established\ngrade in areas mapped outside the floodplain by FEMA FIRM maps or\ndecks not extending above adjusted grade in areas mapped within the\nfloodplain by FEMA FIRM maps shall comply with the following yard\nrequirements:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Front yard depth requirements shall be the same as\nfront yard depth requirements for principal buildings."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Side yards width: minimum 3 1/2 feet from side\nproperty lines."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Rear yards depth: minimum 3 1/2 feet; except\nfor lots abutting canals or navigable water, the deck may extend to\nthe bulkhead."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "Decks extending more than 18 inches above established\ngrade in areas mapped outside the floodplain by FEMA FIRM maps or\ndecks extending above adjusted grade in areas mapped within the floodplain\nby FEMA FIRM maps shall be considered to be accessory structures if\nfreestanding and if attached to or separated by less than four feet\nfrom a building, shall be considered as a part of the principal building,\naccessory building or detached garage to which they are attached or\nadjacent and shall be regulated by the requirements for those buildings."
								}
							]
						}
					]
				}
			]
		}
	]
}