{
	"url": "http://ecode360.com/6834318",
	"paras": [
		{
			"paragraph": "§ 113-35",
			"title": "Applicability.",
			"content": [
				{
					"text": "The following regulations apply to the residential\n\"districts\" established under this chapter."
				}
			]
		},
		{
			"paragraph": "§ 113-36",
			"title": "Schedule of \"use\" regulations; site plan approval.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "The accompanying schedule entitled \"Schedule of Use Regulations, Residential Districts, § 113-36,\" shall be deemed part of this article and is referred to herein as \"Use Schedule.\"[1]"
								},
								{
									"footnote": "[1]\nEditor's Note: Said Schedule of Use Regulations, Residential Districts, is located at the end of this chapter.\n"
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Site plan approval. Site plan approval by the Planning Board shall be required for (i) any new permit-required \"structure,\" or (ii) \"teardown\" as defined under the New York State Building Code, (iii) special permit \"uses\" (1) through (16) listed in the Use Schedule in accordance with all standards and requirements of Article IX of this chapter. For the purpose of protecting the health, safety and general welfare of the Town of Pound Ridge, and specifically to mitigate the potential impact of the above-referenced nonresidential \"uses\" on adjacent residential properties, a fifty-foot buffer screening area shall be maintained along all perimeter boundaries of properties containing such \"uses.\" Such buffer screening area may be modified by the Planning Board where the topography and/or other factors make it unnecessary to maintain the required 50 feet. Within the buffer area, existing vegetation and natural features shall be preserved and protected unless modified as part of a landscape plan approved by the Planning Board. Routine maintenance, including fertilization, the removal of dead or diseased vegetation, brush clearing, etc., and the planting of supplemental and/or seasonal vegetation shall be permitted. Any other construction or alteration within such buffer area shall be subject to site plan approval by the Planning Board as provided herein.[Amended 5-4-2006 by L.L. No. 5-2006]"
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 113-37",
			"title": "Schedule of bulk regulations; supplementary setback requirements.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "For convenience in administration and for the better understanding of this chapter and in order to assure that all development in the Residential, the \"Landscape Nursery and Garden Center\" and the Planned Business \"Districts\" is appropriately located on individual \"lots\" so as to achieve the purposes established in Article I of this chapter, the accompanying schedule entitled \"Schedule of Bulk Regulations, § 113-37,\" shall be deemed part of this article and is referred to herein as \"Bulk Schedule.\"[1] The requirements listed for each \"district\" as designated\nare subject to all other provisions of this chapter and, unless otherwise\nindicated, shall be deemed to be the minimum requirements in every\ninstance of their application."
								},
								{
                                	"content": [
                                		{
                                			"number": "A. ",
                                			"content": [
                                				{
                                					"text": "Lot Area(square feet): 87120"
                                				}
                                			]
                                		},
                                		{
                                			"number": "B. ",
                                			"content": [
                                				{
                                					"text": "Lot Width(feet): 200"
                                				}
                                			]
                                		},
                                		{
                                			"number": "C. ",
                                			"content": [
                                				{
                                					"text": "Lot Depth(feet): 250"
                                				}
                                			]
                                		},
                                		{
                                			"number": "D. ",
                                			"content": [
                                				{
                                					"text": "Minimum Yard Requirements Front (feet): 60"
                                				}
                                			]
                                		},
                                		{
                                			"number": "E. ",
                                			"content": [
                                				{
                                					"text": "Minimum Yard Requirements Side (principal/ accessory buildings) (feet): 50/50"
                                				}
                                			]
                                		},
                                		{
                                			"number": "F. ",
                                			"content": [
                                				{
                                					"text": "Minimum Yard Requirements Rear (principal/ accessory buildings) (feet): 50/50"
                                				}
                                			]
                                		},
                                		{
                                			"number": "G. ",
                                			"content": [
                                				{
                                					"text": "Maximum Building Coverage(%): 10"
                                				}
                                			]
                                		},
                                		{
                                			"number": "H. ",
                                			"content": [
                                				{
                                					"text": "Maximum Building Height (stories/feet): 2.5/35"
                                				}
                                			]
                                		}
                                	]
                                },
								{
									"footnote": "[1]\nEditor's Note: Said Schedule of Bulk Regulations is located at the end of this chapter.\n"
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Supplementary setback requirements."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Purpose of supplementary setbacks. The setback requirements listed in the Bulk Schedule of this chapter are considered to be the minimum standards necessary to assure the appropriate development and \"use\" of land consistent with the purposes of this chapter. In order to assure that development on newly created \"lots\" in residential \"districts\" is appropriately located so as to achieve the purposes established in Article I of this chapter, the Planning Board is hereby authorized to establish supplementary setback requirements for all \"structures\" in residential \"districts.\" Such setback requirements shall in no case be less than the existing setback requirements for the specified \"district\" in which such \"lot\" is located."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Criteria for determination. In determining whether\nsuch supplementary setback requirements should be required, the Planning\nBoard shall utilize the following criteria:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "The presence on the site of unique natural resources,\nincluding but not limited to controlled areas and the minimum activity\nsetback as defined in the Town Freshwater Wetlands Law,[2] steep slopes and rock formations, unique vegetation and\nareas of wildlife habitat."
																},
																{
																	"footnote": "[2]\nEditor's Note: See Ch. 63, Freshwater Wetlands.\n"
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "The presence on the site of unique cultural\nresources, including but not limited to \"buildings,\" \"structures,\"\nstone walls or artifacts of archaeological value."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "The existence of unique aesthetic features,\nincluding but not limited to views and vistas."
																}
															]
														},
														{
															"number": "(d) ",
															"content": [
																{
																	"text": "The relationship of the property to adjoining\nand nearby properties, \"buildings\" and \"structures.\""
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Procedures. For new subdivisions, supplementary setbacks\nshall be shown on the final plat to be filed with the County Clerk.\nApplication for modification of supplementary setback requirements\nshall be made to the Planning Board and shall include such information\nas would normally be required by the Planning Board. The Planning\nBoard shall render its decision at a regularly scheduled meeting of\nthe Board in a timely fashion, and the results of that decision shall\nbe kept on file with the Building Inspector and the Planning Board\nSecretary. If the proposed activity is regulated under the Pound Ridge\nFreshwater Wetlands Law,[3] then approval by the Water Control Commission shall also be obtained. Relief from the minimum setback requirements or other requirements listed in the Bulk Schedule shall require action by the Zoning Board of Appeals in accordance with Article XI of this chapter."
												},
												{
													"footnote": "[3]\nEditor's Note: See Ch. 63, Freshwater Wetlands.\n"
												}
											]
										}
									]
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 113-38",
			"title": "Supplementary regulations.",
			"content": [
				{
					"text": "The provisions of this article shall be subject\nto such exceptions, additions or modifications as herein provided\nby the following general supplementary regulations:"
				},
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "\"Yards\" and setbacks."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Terraces and porches. A paved terrace shall not be\nconsidered in determination of \"yard\" size or \"lot coverage\"; provided,\nhowever, that such terrace is unroofed and without walls, parapets\nor other forms of enclosure. Such terrace, however, may have an open\nguard railing not over three feet high and shall not project into\nany \"yard\" to a point closer than 25 feet from any \"lot line.\" Any\ntwo-\"story\" or any enclosed porch, or one having a roof and capable\nof being enclosed, shall be considered a part of the \"building\" in\nthe determination of the size of the \"yard\" or amount of \"lot coverage.\""
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Projecting architectural features. Cornices, eaves,\nchimneys, bay windows, windowsills, belt courses and other architectural\nfeatures may project not more than two feet into any required \"yard\"\nor into any \"parking area\" in a PB-A, PB-B or PB-C \"District.\""
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Except for \"dry\" stone walls, open horizontal board\nfarm fencing or post and rail fence, fencing may not enclose more\nthan 50% or a maximum of two acres, whichever is less, on any property\nthat is zoned R-2A or higher.[Added 5-1-2003 by L.L. No. 5-2003[1] ]"
												},
												{
													"footnote": "[1]\nEditor's Note: This local law also provided\nfor the renumbering of former Subsection A(3) through (10) as Subsection\nA(4) through (11), respectively.\n"
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "Nonelectric \"fences, walls, gates, pillars and berms.\""
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "\"Fences, walls, gates, pillars and berms\" within\n30 feet of a property line. It is the intent of this subsection to\nbalance the need for maintaining open vistas from area roadways, for\nfacilitating emergency access to \"structures,\" for providing safe\n\"sight distances\" and for maintaining the open space character of\nthe Town of Pound Ridge with the need to screen or buffer unreasonable\ninvasions of privacy which are beyond the control of the property\nowner, including but not limited to traffic noise, air pollution,\nunsightly views and proximity of house or outdoor living areas to\na heavily traveled \"street\" and disparate \"uses\" (such as residential\n\"lots\" adjacent to nonresidential \"lots,\" residential \"lots\" adjacent\nto nonconforming \"lots\" and residential \"lots\" adjacent to unusual\n\"uses\" in a residential \"district\"). All nonelectric \"fences\" greater\nthan four feet in \"height\" within the minimum vegetated buffers which\nare not shown on a construction drawing or site plan approved by the\nPlanning Board shall require Planning Board approval."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "The requirement of this article shall not be\ndeemed to prohibit any necessary retaining \"wall\" nor to prohibit\nany \"earthen berm,\" \"fence\" or \"wall,\" provided that in any residential\n\"district\" such \"berm,\" \"fence\" or \"wall\" shall not exceed the \"height\"\nrestrictions outlined in this section."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "\"Height\" of \"fences, walls and berms.\""
																},
																{
																	"content": [
																		{
																			"number": "[1] ",
																			"content": [
																				{
																					"text": "Berms throughout the Town in any \"yard\" shall\nnot exceed four feet in \"height.\""
																				}
																			]
																		},
																		{
																			"number": "[2] ",
																			"content": [
																				{
																					"text": "\"Fences\" and \"walls\" in the \"front (or streetside)\nyard\" shall not exceed four feet in \"height,\" except for those roads\nlisted on the Heavy Traffic Road List filed in the Building Department\noffice. An additional two feet of open construction or semiscreen\nfencing for a total of six feet in \"height\" for \"front (or streetside)\nyards,\" installed at least 10 feet inside the front property line,\nis permitted on roads listed on the Heavy Traffic Road List, except\nwhere such roads have a posted speed limit of 30 miles per hour or\nunder."
																				}
																			]
																		},
																		{
																			"number": "[3] ",
																			"content": [
																				{
																					"text": "Open, horizontal board fencing or post and rail\nfencing may have a maximum height of five feet.[Added 5-1-2003 by L.L. No. 5-2003[2]]"
																				},
																				{
																					"footnote": "[2]\nEditor's Note: This local law also provided\nfor the renumbering of former Subsection A(4)(c)[3] through [5] as\nSubsection A(4)(c)[4] through [6], respectively.\n"
																				}
																			]
																		},
																		{
																			"number": "[4] ",
																			"content": [
																				{
																					"text": "Any \"fence\" or \"wall\" for a landmark-designated property or for a property in an historic \"district\" is required to receive a certificate of appropriateness under Chapter 17, Historic \"Districts,\" of this Code from the Landmarks and Historic District Commission of the Town of Pound Ridge before construction begins."
																				}
																			]
																		},
																		{
																			"number": "[5] ",
																			"content": [
																				{
																					"text": "\"Fences\" and \"walls\" in side and \"rear yards\"\nshall not exceed six feet in \"height\" and may consist entirely of\nclosed construction fencing and be located next to a property line.\nIt is recommended that abutting neighbors agree on a mutually acceptable\nfence style if a fence is to be erected next to a shared property\nline.[Amended 5-1-2003 by L.L. No. 5-2003]"
																				}
																			]
																		},
																		{
																			"number": "[6] ",
																			"content": [
																				{
																					"text": "In determining \"fence height,\" posts, post caps,\npost tops, \"pillars\" and \"gates\" are excepted."
																				}
																			]
																		}
																	]
																}
															]
														},
														{
															"number": "(d) ",
															"content": [
																{
																	"text": "Pillars and gates, \"fences\" and wall openings.\nPillars up to two feet wide, whether supporting gates or standing\nalone, and extending to a maximum “height” of six feet,\nshall be permitted. The overall “height” of a gate in\nconjunction with a nonelectric “fence” may be no higher\nthan five feet on a “street” not listed on the Heavy Traffic\nRoad List, and may be no higher than six feet on “streets”\nthat are listed on the Heavy Traffic Road List. Gates shall be set\nback from the edge of the “street” pavement a minimum\nof 20 feet to allow a vehicle confronted by a closed gate to stop\nout of the lane of traffic. Pillars, gates or other barriers shall\nnot be placed any closer than 16 feet apart to allow easy access of\nemergency service apparatus to the premises. In all cases, the Building\nInspector of the Town of Pound Ridge may use his discretion in requiring\nan access width of more than 16 feet when specific site conditions\nrequire same. In no case shall pillars or gates be installed on public\nproperty.[Amended 5-17-2007 by L.L. No. 3-2007]"
																}
															]
														},
														{
															"number": "(e) ",
															"content": [
																{
																	"text": "Orientation of \"fences, walls and berms.\" If\nany \"fence, wall or berm\" located within a \"yard\" has a finished or\nmore attractive side, such side shall face the neighboring property\nor the \"street.\""
																}
															]
														},
														{
															"number": "(f) ",
															"content": [
																{
																	"text": "\"Fences, walls, gates, pillars and berms\" in nonresidential \"districts.\" \"Fences, walls, gates, pillars and berms\" in nonresidential \"districts\" shall be subject to site plan review in accordance with Article IX, Site Plan Requirements, of this chapter."
																}
															]
														},
														{
															"number": "(g) ",
															"content": [
																{
																	"text": "Existing \"fences,\" walls, gates, pillars and\nberms of all types which are made \"dimensionally nonconforming\" by\nthis legislation are to be immediately registered with the Building\nDepartment. They will be required to conform to the extent reasonable\nand practicable as determined by the Building Inspector within a period\nof time determined by the Building Inspector based on the required\nmodifications, but in no case less than two years. The Building Inspector\nmay request such cases to be reviewed by the Planning Board to mitigate\nany adverse conditions. When requiring conformance and/or mitigation\nmeasures, the Building Inspector and/or the Planning Board shall take\ninto consideration the degree of nonconformance, whether the fence\nwas constructed in accordance with the zoning in effect at the time\nand the impact and the age of the improvements relative to the public\nbenefit practicality and cost of appropriate mitigation and conformance\nmeasures."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "Electric and open wire \"fences.\" Electric and open\nwire \"fences\" up to seven feet in \"height\" are permitted under the\nfollowing conditions:[Amended 5-1-2003 by L.L. No. 5-2003]"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "A permit must be obtained from the Building\nInspector."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "Electric and open wire \"fences\" shall be set\nback a minimum of 10 feet from all property lines and buffered by\ntrees and/or shrub planting as required by the Building Inspector\nto soften the effect of the fence in areas where there is insufficient\nnatural vegetation. The Building Inspector may call on the Conservation\nBoard for recommendations and assistance in creating buffered area\nplanting requirements."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "Open wire fences must be thin gage and black\nor dark green vinyl coated. Posts supporting open wire fences are\nto be black or dark green metal posts or natural cedar posts."
																}
															]
														},
														{
															"number": "(d) ",
															"content": [
																{
																	"text": "Unless otherwise approved by the Building Inspector,\nelectric \"fence\" specifications shall be:"
																},
																{
																	"content": [
																		{
																			"number": "[1] ",
																			"content": [
																				{
																					"text": "Wire to be 12.5-gauge Class 3 galvanized high-tensil\nsteel with a life expectancy of 30 to 40 years, painted black."
																				}
																			]
																		},
																		{
																			"number": "[2] ",
																			"content": [
																				{
																					"text": "Posts of either 0.4 CCA pressure-treated pine\n(ends, corners, gates) or fiberglass and/or steel T-posts (line posts)\npainted black and set on fifteen-foot to twenty-foot centers, with\noccasional use of trees as posts using galvanized insulated J-bolts."
																				}
																			]
																		}
																	]
																}
															]
														},
														{
															"number": "(e) ",
															"content": [
																{
																	"text": "Electric \"fence\" materials and installation\nprocedures must meet Underwriters' Laboratories, Inc., standards as\nwell as the standards of construction as set forth by the Pound Ridge\nBuilding Department."
																}
															]
														},
														{
															"number": "(f) ",
															"content": [
																{
																	"text": "Electric \"fence\" construction must be inspected\nand approved by the Building Inspector for compliance with Underwriters'\nLaboratories, Inc., safety standards and must receive a certificate\nof compliance for all aspects of the installation from the Building\nDepartment before becoming operational. Failure to comply with this\nor any other subsection of this law shall be punishable by an initial\npenalty not to exceed $750, and thereafter a penalty of $100 per day\nuntil a certificate of compliance is issued."
																}
															]
														},
														{
															"number": "(g) ",
															"content": [
																{
																	"text": "Owners of electric \"fences\" located within 20\nfeet of any property line are required to post warning \"signs\" on\nthe \"fence,\" one \"sign\" for each 40 to 50 linear feet of \"fence.\"\nOne such \"sign\" must also be placed at the driveway entrance(s)."
																}
															]
														},
														{
															"number": "(h) ",
															"content": [
																{
																	"text": "Gates for vehicular access in conjunction with\nelectric “fences” shall be set back a minimum of 20 feet\nfrom the edge of the road to allow a vehicle confronted by a closed\ngate to stop out of the lane of traffic. The minimum unobstructed\naccess width shall be no less than 16 feet. In all cases, the Building\nInspector of the Town of Pound Ridge may use his discretion in requiring\nan access width of more than 16 feet when specific site conditions\nrequire same. In no case shall a gate be installed on public property.\nIf the property owner elects to have an automated or motorized gate\noperator, the property owner must also have a manual override located\non the road side of the gate for emergency service access or an approved\nlock box system.[Amended 5-17-2007 by L.L. No. 3-2007]"
																}
															]
														},
														{
															"number": "(i) ",
															"content": [
																{
																	"text": "A property owner may elect to install an electrified\ngate and/or various other types of gates for vehicular or pedestrian\naccess. In no case shall a gate be higher than six feet."
																}
															]
														},
														{
															"number": "(j) ",
															"content": [
																{
																	"text": "If a property owner elects to install an electrified\ngate, rather than a cattle guard or a gate operated by an electric\neye, the electrified gate must have insulated latch handles and must\nbe painted black."
																}
															]
														},
														{
															"number": "(k) ",
															"content": [
																{
																	"text": "If an owner elects to install a solid wooden\nor fiberglass gate, such gate must be of open construction for any\nportion above a \"height\" of 4.5 feet."
																}
															]
														},
														{
															"number": "(l) ",
															"content": [
																{
																	"text": "If an owner elects to install a cattleguard,\neither a precast reinforced concrete cattleguard insert or a unit\nof metal piping in concrete may be used. With any cattleguard the\nspace under the insert or piping shall be no less than 12 inches in\ndepth. A pedestrian gate shall be installed adjacent to any cattleguard."
																}
															]
														},
														{
															"number": "(m) ",
															"content": [
																{
																	"text": "No electric \"fence\" shall be constructed which\nwill preclude effective access to the subject property by emergency\nservice responders."
																}
															]
														},
														{
															"number": "(n) ",
															"content": [
																{
																	"text": "The Building Department shall maintain a list\nof all electric \"fence\" locations for circulation to emergency service\npersonnel."
																}
															]
														},
														{
															"number": "(o) ",
															"content": [
																{
																	"text": "All existing electric \"fences\" not previously\nregistered with the Building Department must be registered immediately\nand modified to conform to the requirements of the Zoning Law as is\nreasonable and practicable in the judgment of the Building Inspector.\nThe Building Inspector shall, in writing, indentify the required time\nperiod to implement such improvements. When requiring conformance\nand/or mitigation measures, the Building Inspector shall take into\nconsideration the degree of nonconformance, whether the fence was\nconstructed in accordance with the zoning in effect at the time and\nthe impact and the age of the improvements relative to the public\nbenefit, practicality and cost of appropriate mitigation and conformance\nmeasures. All existing electric \"fences\" predating the enactment of\nthis subsection must be registered with the Building Department so\nthat emergency services may be notified of their locations."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(6) ",
											"content": [
												{
													"text": "Pool \"fences.\" All swimming pools are required to\nbe fenced. Swimming pools constructed after January 3, 2003, must\ncomply with the Residential Code of the State of New York, Title 19\nNYCRR, Section AG105. Swimming pools constructed between October 24,\n1985, and January 2, 2003, must comply with Title 9 NYCRR Section\n720.1. Swimming pools constructed before October 25, 1985, must comply\nwith Title 9 NYCRR, Section 1243.7, and Title 19 NYCRR, and Section\n203.7.2.1 of the Property Maintenance Code of the State of New York.[Amended 5-1-2003 by L.L. No. 5-2003]"
												}
											]
										},
										{
											"number": "(7) ",
											"content": [
												{
													"text": "Construction of any \"fence\" under this subsection shall be in compliance with Chapter 63, Freshwater Wetlands."
												}
											]
										},
										{
											"number": "(8) ",
											"content": [
												{
													"text": "Prohibited \"fences.\" The following \"fences\" and fencing\nmaterials are specifically prohibited:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "Barbed, razor or ribbon wire or broken glass\nas part of any \"fence,\" unless specifically permitted."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "Pointed metal \"fences.\""
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "Poultry wire, turkey wire, chain link or other wire \"fences\" (except as specifically permitted under § 113-38A(5) above), within 30 feet of any property lines.[Amended 5-1-2003 by L.L. No. 5-2003]"
																}
															]
														},
														{
															"number": "(d) ",
															"content": [
																{
																	"text": "Temporary \"fences,\" such as snow \"fences,\" unless\non sites under construction or for snow control."
																}
															]
														},
														{
															"number": "(e) ",
															"content": [
																{
																	"text": "Chain link \"fences\" erected with the open loop\nat the top of the \"fence.\""
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(9) ",
											"content": [
												{
													"text": "Existing \"fences.\" All existing \"fences\" which do\nnot conform to the provisions of this chapter continue to be in violation.\nExisting electric \"fences\" must be registered with the Building Department.\nExisting \"fences\" shall not be \"altered,\" extended, replaced or modified\nexcept in accordance with the provisions of this chapter."
												}
											]
										},
										{
											"number": "(10) ",
											"content": [
												{
													"text": "\"Sight distances\" at intersections. At any \"street\"\nintersection in any residential \"district,\" no \"fence, wall, gate,\npillar, berm\" or other \"structure\" or planting more than three feet\nin \"height\" shall be erected, placed or maintained within the triangular\narea formed by the intersecting \"street\" lines and a straight line\njoining said \"street\" lines at points which are 75 feet distant from\nthe point of intersection, measured along said \"street\" lines. The\n\"height\" of three feet shall be measured above the road surface at\nthe nearest edge of the road. This subsection shall not apply to existing\ntrees, provided that no branches are closer than eight feet to the\nground."
												}
											]
										},
										{
											"number": "(11) ",
											"content": [
												{
													"text": "\"Corner lots.\" On a \"corner lot\" in any residential\n\"district,\" there shall be provided a \"yard\" on each \"street\" equal\nin depth to the required \"front yard\" on such \"streets.\" A \"rear yard\"\nshall be provided on each \"corner lot,\" and the owner shall elect\nwhich \"yard\" is the \"rear yard.\""
												}
											]
										},
										{
											"number": "(12) ",
											"content": [
												{
													"text": "In no case shall a private individual install\nfencing, walls, gates, pillars or berms on public property.[Added 5-1-2003 by L.L. No. 5-2003]"
												}
											]
										},
										{
											"number": "(13) ",
											"content": [
												{
													"text": "All proposed fences, walls, gates, pillars and\nberms require a permit from the Building Department.[Added 5-1-2003 by L.L. No. 5-2003]"
												}
											]
										},
										{
											"number": "(14) ",
											"content": [
												{
													"text": "Penalties for failure to comply with all requirements that relate to fencing are outlined in § 113-96 of this chapter.[Added 5-1-2003 by L.L. No. 5-2003]"
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "\"Height\" exceptions."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "The \"height\" limitations of this article shall not\napply to spires, cupolas and domes of churches or other places of\nworship, nor to chimneys, ventilators, skylights, water tanks, bulkheads\nor similar features and necessary mechanical appurtenances usually\ncarried above the roof level. Such features, however, shall be erected\nonly to such \"height\" as is necessary to accomplish the purposes they\nare intended to serve, but in no case exceeding eight feet above the\nroof line, and the total area covered by such features shall not exceed\n10% of the area of the roof on which they are located."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "The provisions of this article shall not prevent the\nerection above the \"building height\" limit of a parapet wall or cornice,\nfor ornament and without windows, extending above such \"height\" limit\nno more than five feet."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "The \"height\" limitations of this article shall not\napply to transmission towers and cables, radio, television or \"wireless\ntelecommunications services facilities\" when such \"structures\" are\notherwise permitted by this chapter.[Added 8-13-1998 by L.L. No. 7-1998]"
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "\"Dwellings\" in \"accessory buildings.\" Any \"accessory building\" on the same \"lot\" with a principal residence shall not be used for residential purposes, except as provided in § 113-39."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 113-39",
			"title": "\"Accessory apartments.\"",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "In an effort to increase housing options in the Town\nof Pound Ridge, the Town has concluded that enactment of legislation\ndesigned for this purpose is desirable and necessary. It is the specific\npurpose and intent of allowing \"accessory apartments\" in the R-2A\nand R-3A one-family residential \"districts\" to provide the opportunity\nand encouragement to owners of \"one-family dwellings\" within those\n\"districts\" to develop small, rental housing units designed to meet\nthe special housing needs of single persons and couples. It is also\nthe purpose and intent of this provision to promote the more efficient\nuse of the Town's existing inventory of \"dwellings\" and \"accessory\nbuildings,\" thereby protecting and preserving property values; providing\neconomic support for present property owners and promoting the other\nobjectives of this section. The following specific standards and requirements\nare set forth for the permitted establishment and use of such \"accessory\napartments.\""
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "\"Accessory apartments\" may be located in R-2A and R-3A Residential Districts."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "The owner of the lot on which the \"accessory apartment\"\nis located must occupy either the principal residence or the \"accessory\napartment.\""
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "There shall be no more than one \"accessory apartment\"\nper \"lot\" regardless of the amount of excess acreage."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "All new \"accessory apartments,\" whether located within\na principal residence \"building\" or in a conforming \"accessory building,\"\nshall be subject to site plan review by the Planning Board."
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "The minimum size of an \"accessory apartment,\" whether\nlocated within a principal residence or in an \"accessory building,\"\nshall be 300 square feet. In no case shall it exceed 1,200 square\nfeet."
												}
											]
										},
										{
											"number": "(6) ",
											"content": [
												{
													"text": "The size of an \"accessory apartment\" must not exceed\n30% of the \"gross floor area,\" exclusive of unfinished \"basement,\"\nattic and garage, of the principal residence."
												}
											]
										},
										{
											"number": "(7) ",
											"content": [
												{
													"text": "Whether located in a principal residence \"building\"\nor in an \"accessory building,\" there shall be no more than two bedrooms\nin an \"accessory apartment.\""
												}
											]
										},
										{
											"number": "(8) ",
											"content": [
												{
													"text": "Prior to the issuance of a building permit for the\nestablishment of an \"accessory apartment\" either in a \"principal building\"\nor an \"accessory building,\" approval of the proposed plan for septic\ndisposal and water supply, prepared and signed by a sanitary engineer\nlicensed by the State of New York, shall be obtained from the Westchester\nCounty Department of Health and confirmed by the Planning Board."
												}
											]
										},
										{
											"number": "(9) ",
											"content": [
												{
													"text": "Whether in a principal residence or located in an\n\"accessory building,\" where any proposed \"accessory apartment\" (including\nany septic, water or other systems and services used for such \"accessory\napartment\") is proposed to be located in whole or in part within the\nTown minimum one-hundred-fifty-foot wetlands activity setback area,\nthe applicant must demonstrate to the satisfaction of the Water Control\nCommission that the proposed use will have no negative impact upon\nthe surrounding wetlands. Indications of negative impact will result\nin the automatic denial of the \"accessory apartment\" application."
												}
											]
										},
										{
											"number": "(10) ",
											"content": [
												{
													"text": "During its site plan review, the Planning Board\nshall determine the adequate on-site vehicle parking requirements\nfor any proposed \"accessory apartment\" and such parking requirements\nshall be clearly shown on the approved site plan. A minimum of two\nparking spaces is required. Under no circumstances may the Planning\nBoard approve on-street vehicle parking for the occupants of the principal\nresidence or any approved \"accessory apartment.\""
												}
											]
										},
										{
											"number": "(11) ",
											"content": [
												{
													"text": "One curb cut shall access both the principal\nand the accessory residence. No \"double cut\" driveways will be permitted."
												}
											]
										},
										{
											"number": "(12) ",
											"content": [
												{
													"text": "Within 30 days of receipt of a completed application\nwhich conforms to all standards as set forth above, the Building Inspector\nshall conduct an on-site inspection of the proposed \"accessory apartment\"\nlocation to confirm the physical details of the site as it relates\nto the proposed application."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "\"Accessory apartments\" located in principal residence\n\"buildings.\""
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "\"Accessory apartments\" may be located within existing\nspace of a conforming principal residence \"building,\" provided both\nthe apartment and the principal building are in conformance with all\napplicable health codes, building codes, zoning codes, fire codes\nand this chapter."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "In the case of an \"accessory apartment\" located within\nexisting space of a conforming principal residence \"building,\" minimal\nfootprint increases shall be permitted to accommodate a separate entrance\nand/or the addition of a staircase, where appropriate. Such minimal\nfootprint increases must be approved by the Building Inspector and\nbe included as part of the site plan review by the Planning Board."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "\"Accessory apartments\" within a principal residence\n\"building\" shall not exceed a maximum of 1,200 square feet or 30%\nof the \"principal building,\" whichever is less. The minimum size of\nan \"accessory apartment\" within a principal residence is 300 square\nfeet."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "If an \"accessory apartment\" is located in a principal\nresidence \"building,\" the entry to the \"accessory apartment\" unit\nand its design shall be such that the appearance of the principal\nresidence \"building\" shall remain as a single-family residence."
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "\"Accessory apartments\" may also be added to a principal\nresidence \"building,\" provided both the \"principal building\" and the\napartment are in conformance with all applicable health codes, building\ncodes, zoning codes, fire codes and this chapter."
												}
											]
										},
										{
											"number": "(6) ",
											"content": [
												{
													"text": "\"Accessory apartments\" added to a principal residence\nshall not exceed a maximum of 1,200 square feet or 30% of the \"principal\nbuilding,\" whichever is less. The minimum size of an \"accessory apartment\"\nadded to a principal residence is 300 square feet."
												}
											]
										},
										{
											"number": "(7) ",
											"content": [
												{
													"text": "If an \"accessory apartment\" is added to a principal\nresidence \"building,\" the entry to the \"accessory apartment\" unit\nand its design shall be such that the appearance of the principal\nresidence \"building\" shall remain as a single-family residence."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "\"Accessory apartments\" located in conforming \"accessory\nbuildings.\""
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Any \"accessory building,\" which is proposed for use\nas an \"accessory apartment,\" shall comply in all respects with all\napplicable building codes and setback standards for the \"district\"\nin which it is located."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "\"Accessory apartments\" are permitted in accessory\nstructures existing as of January 1, 2002, providing the accessory\nuse is maintained within the \"accessory building\" with the apartment\nand providing both the apartment and the \"accessory building\" are\nin conformance with all applicable health codes, building codes, zoning\ncodes, fire codes and this chapter."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "To provide an \"accessory apartment\" in a conforming\n\"accessory building\" the accessory building may be increased in area\nby no more than 115% and increased in footprint by no more than 15%.\nAlternatively, the \"accessory apartment\" may increase the footprint\nof the \"accessory building\" by no more than 100% and increase the\narea by no more than 100%. In either case, the resulting apartment\nis not to exceed 1,200 square feet and in no case to exceed 30% of\nthe size of the principal residence \"building,\" whichever is less.\nAs part of the required site plan review, the Planning Board will\ndecide whether the proposed \"accessory apartment\" will comprise a\nvertical or horizontal addition in order to maintain the existing\ncharacter of the site."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "The minimum size of 300 square feet and the maximum\nsize of 1,200 square feet applies to apartments in, or added to, \"accessory\nbuildings.\""
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "Registration, application circulation, conformance."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "All \"accessory apartments\" must be registered with\nthe Building Department under this chapter."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Site plan approval by the Planning Board is required\nfor all \"accessory apartment\" applications."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Violations: See § 113-95."
												}
											]
										}
									]
								}
							]
						}
					]
				}
			]
		}
	]
}