{
	"url": "http://ecode360.com/8078386",
	"paras": [
		{
			"paragraph": "§ 163-10",
			"title": "One-Family Residence R-1 District uses.",
			"content": [
				{
					"text": "In One-Family Residence R-1 Districts, no building\nor premises shall be used and no building or part of a building shall\nbe erected or altered which is arranged, intended or designed to be\nused in whole or in part for any uses except the following:"
				},
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "One-family detached dwellings, not to exceed one such dwelling on each lot, conforming with the regulations set forth in §§ 163-12 through 163-21."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "The following commercial agricultural operations and\naccessory uses thereto, provided that there shall be no stable or\nsimilar facility for the housing of animals or the storage of manure\nor other odor- or dust-producing substance or use, except spraying\nand dusting to protect vegetation, within 150 feet of any lot line."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "The raising of field and garden crops, vineyard and orchard farming, the maintenance of nurseries and the seasonal sale of products thereof, provided that no building is erected and signs conform to Chapter 137, Signs. The seasonal sale of products shall be restricted to those grown on the premises.[Amended 4-1-1975 by L.L. No. 1-1975]"
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "The keeping, breeding and raising of cattle (including\ndairies), sheep, goats and horses and the rental of horses, on lots\nof 20 acres or more."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Any provision to the contrary notwithstanding, the\nkeeping of chickens and bantams by a special permit issued by the\nBoard of Trustees subject to the following conditions:[Amended 8-3-2010 by L.L. No. 3-2010]"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "The number of chickens or bantams shall not exceed six per 20,000\nsquare feet of lot area, in no event more than 18 on any parcel;"
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "Commercial sale of any chicken, bantam or poultry product is prohibited;"
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "Roosters are prohibited;"
																}
															]
														},
														{
															"number": "(d) ",
															"content": [
																{
																	"text": "Any coop structure, exclusive of an outdoor pen, shall not exceed\n100 square feet or 10 feet in height, shall be located in a rear yard\nonly and shall maintain a setback to any side or rear yard line of\nnot less than 20 feet;"
																}
															]
														},
														{
															"number": "(e) ",
															"content": [
																{
																	"text": "Any outdoor area used by chickens or bantams shall be fenced so as\nto prohibit harm to the chickens or bantams and so as to limit the\nchickens or bantams to within the fenced area;"
																}
															]
														},
														{
															"number": "(f) ",
															"content": [
																{
																	"text": "The Zoning Board of Appeals is not authorized to grant any variance to the requirements of this subsection, excepting that the Zoning Board of Appeals is authorized to grant area variances to the minimum lot area requirement in Subsection B(3)(a); and"
																}
															]
														},
														{
															"number": "(g) ",
															"content": [
																{
																	"text": "Any application for a special permit under this subsection shall\nrequire applicant to mail by certified mail a notice of said application\nincluding a plot plan showing any coop or other structure and fenced\narea to each bounding neighbor at least 14 days prior to any hearing\nor said application."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "Barns, silos and toolsheds accessory to any aforementioned\nuse, provided that such accessory buildings shall conform to the yard\nrequirements for principal buildings."
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "At no time shall any premises permitted in this section\nbe used in such a manner as to cause injury, annoyance or disturbance\nto any of the surrounding properties and to their owners or occupants."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Buildings, structures and uses owned and operated\nby the Village of North Haven."
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "The following uses subject to review and the issuance therefor of a special permit by the Board of Appeals in accordance with § 163-46B and the special conditions hereof. However, the site plan for each such intended use shall also be subject to review by the Planning Board, which shall make findings in accordance with the provisions of §§ 163-48 through 163-50 hereof, following approval of the Board of Appeals."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Places of worship, including parish houses. Special\nconditions are as follows:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "No building or part thereof shall be erected\nnearer than 50 feet to any street or property line."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "The sum of all areas covered by all principal\nand accessory buildings shall not exceed 20% of the area of the lot."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Schools. Special conditions shall be as follows:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "Same as conditions set forth in § 163-10D(1)(a) and (b) above."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "Any such school shall be a nonprofit organization\nwithin the meaning of the Internal Revenue Act and shall be registered\neffectively as such thereunder."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "Any such school shall occupy a lot having a\nminimum area not less than that provided by the New York State Department\nof Education. Where no minimum is provided in a particular case, then\nthe minimum area shall be not less than three acres plus one acre\nfor each 100 pupils for which the building is designed.[Amended 4-1-1975 by L.L. No. 1-1975]"
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Annual membership clubs providing outdoor recreational\nfacilities such as private playgrounds, swimming pools and tennis\ncourts, excluding common dock facilities. Special conditions shall\nbe as follows:[Amended 4-11-1988 by L.L. No. 2-1988; 9-6-1988 by L.L. No. 3-1988; 5-2-1989 by L.L. No. 2-1989; 5-2-1989 by L.L. No. 3-1989]"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "Same as conditions set forth in § 163-10D(1)(a) and (b) above."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "That any such club is incorporated pursuant\nto the provisions of the Not-For-Profit Corporation Law or the Benevolent\nOrder Law of the State of New York and caters exclusively to members\nand their guests."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "That any such use shall not be conducted as\na business enterprise."
																}
															]
														},
														{
															"number": "(d) ",
															"content": [
																{
																	"text": "That such use shall occupy a lot with an area\nof not less than five acres, except that such use may occupy a lot\nwith an area of less than five acres if said area is reserved as a\nrecreation area to be maintained by a homeowners' association pursuant\nto any prior or future approval of said recreation area by the Planning\nBoard."
																}
															]
														},
														{
															"number": "(e) ",
															"content": [
																{
																	"text": "That the use of outdoor public-address systems\nfor any purpose is prohibited."
																}
															]
														},
														{
															"number": "(f) ",
															"content": [
																{
																	"text": "That exterior lighting, other than that essential\nfor the safety and convenience of the users of the premises, shall\nbe prohibited."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "Other annual membership clubs. Special conditions\nshall be as follows:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "Same as conditions set forth in § 163-10D(3)(b), (e) and (f) above."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "That such use shall occupy a lot with an area\nof not less than one acre in the Residence R-2 District and not less\nthan two acres in the Residence R-1 District.[Amended 4-1-1975 by L.L. No. 1-1975]"
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "That no building erected under the provisions of this Subsection D(4) shall be erected nearer than 50 feet to any street or property line."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "Public utility rights-of-way and structures necessary\nto serve areas within the Village subject to such conditions as the\nBoard of Appeals may impose in order to protect and promote the health\nand safety and general welfare of the community and the character\nof the neighborhood in which the proposed structure is to be constructed."
												}
											]
										},
										{
											"number": "(6) ",
											"content": [
												{
													"text": "Cemeteries."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "Accessory uses, limited to the following:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Customary home occupations, provided that:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "No display of goods or sign is visible from the street, except as set forth in Chapter 137, Signs."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "Such occupation is incidental to the residential\nuse of the premises and is carried on in the main building by a resident\nthereon with no nonresident assistants."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "Only customary household appliances and equipment\nare used."
																}
															]
														},
														{
															"number": "(d) ",
															"content": [
																{
																	"text": "At no time shall any premises be used in such\na manner as to cause the emanation therefrom of offensive or noxious\nodors, vapors, fumes, glare, dust, smoke, gas, vibration, noise or\nradiation or be used in such a manner as to cause injury, annoyance\nor disturbance to any of the surrounding properties and to their owners\nand occupants."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "The professional office or studio of an architect,\nartist, dentist, engineer, lawyer, musician, teacher and physician,\nprovided that:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "Such office or studio is incidental to the residential\nuse of the premises and is carried on by a resident thereon with not\nmore than two nonresident assistants."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "Such office or studio shall occupy not more\nthan 30% of the area of the ground floor of the main building and\nshall be contained therein."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "Studios where dancing or music instruction is\noffered to groups in excess of four pupils at one time or where concerts\nor recitals are held are prohibited."
																}
															]
														},
														{
															"number": "(d) ",
															"content": [
																{
																	"text": "Equipment capable of causing interference with\nradio or television reception shall be prohibited unless also equipped\nwith means to prevent such interference."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Any two of the following: garden house, toolhouse, playhouse or water pool less than 18 inches in depth or 150 square feet or less in area. Such pool shall conform to the provisions of § 163-10E(8)(g) and (i) and shall be subject to the following requirement: the edge of the pool shall be kept a distance of not less than 20 feet from all property lines.[Amended 8-7-1990 by L.L. No. 4-1990[1]]"
												},
												{
													"footnote": "[1]\nEditor's Note: The resolution that adopted\nthis local law provided as follows: \"Local Law No. 4 of 1990 [shall]\nbe adopted with the clear understanding that a gazebo is to be considered\na garden house or storage shed.\"\n"
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "The incidental keeping of boarders or lodgers or accommodations\nfor tourists by a resident family, provided that no more than 1/2\nof the bedrooms in the dwelling are used for lodging purposes."
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "Boathouses, landings and docks which are not conducted\nfor a profit."
												}
											]
										},
										{
											"number": "(6) ",
											"content": [
												{
													"text": "One private garage. Two passenger automobile spaces\nin such garage may be leased to persons not resident on the premises.[Amended 8-7-1990 by L.L. No. 4-1990]"
												}
											]
										},
										{
											"number": "(7) ",
											"content": [
												{
													"text": "Stables and outdoor pens."
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "A private stable for the housing of horses,\ncattle, sheep and goats or similar domestic animals, used exclusively\nby the owner of such property, his household guests and employees,\nprovided that the lot shall have an area of at least two acres for\none or two such animals and one additional acre for each additional\nanimal; provided, however, that no stable shall be erected or maintained\nwithin 150 feet of any street or property line and that no manure\nshall be stored within 150 feet of any property line."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "The keeping of not more than two dogs or other\nhousehold pets more than six months old in outdoor shelters or pens\nis permitted, provided that such shelters or pens shall be not less\nthan 50 feet from any lot line."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(8) ",
											"content": [
												{
													"text": "Outdoor swimming pools, subject to the following requirements:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "A building permit shall be required for the\nconstruction, installation or alteration of any permanent or portable\noutdoor swimming pool which is 18 inches or more in depth or more\nthan 150 square feet in area. Such pool shall not be located in the\nfront or any side yard of the premises. Where any parcel of plot abuts\na body of water, a pool may not be constructed in a side yard.[Amended 3-14-1985 by L.L. No. 2-1985; 5-28-2015 by L.L. No. 3-2015]"
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "The setback from any property line for a swimming\npool, including any decks or slabs or structures accessory to said\nswimming pool, shall not be less than the following:[Amended 4-5-1982 by L.L. No. 1-1982; 3-14-1985 by L.L. No.\n2-1985; 9-6-1994 by L.L. No. 5-1994]"
																},
																{
																	"content": [
																		{
																			"number": "[1] ",
																			"content": [
																				{
																					"text": "On a lot in the R-1 and R-2 Zoning Districts\nhaving an area of 80,000 square feet or more, the setback shall be\nnot less than 40 feet."
																				}
																			]
																		},
																		{
																			"number": "[2] ",
																			"content": [
																				{
																					"text": "On a lot in the R-1 and R-2 Zoning Districts\nhaving an area less than 80,000 square feet but 40,000 square feet\nor more, the setback shall be not less than 30 feet."
																				}
																			]
																		},
																		{
																			"number": "[3] ",
																			"content": [
																				{
																					"text": "On existing small lots, as described in §§ 163-35 and 163-36, of this chapter, having an area less than 40,000 square feet, the setback shall be not less than 20 feet."
																				}
																			]
																		}
																	]
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "The area of the pool, including any decks or\nslabs, shall not exceed 25% of the open area of the yard in which\nthe pool is located.[Amended 4-5-1982 by L.L. No. 1-1982; 3-14-1985 by L.L. No.\n2-1985]"
																}
															]
														},
														{
															"number": "(d) ",
															"content": [
																{
																	"text": "Plans and drawings submitted with the application\nfor the building permit shall show the pool location on the plot,\nthe pool and enclosure construction details, the water supply and\ndisposal system and the electrical appurtenances."
																}
															]
														},
														{
															"number": "(e) ",
															"content": [
																{
																	"text": "A fence shall completely enclose the area containing\nthe swimming pool or shall, together with the walls of a building,\nsecurely complete the enclosure.[Amended 4-5-1982 by L.L. No. 1-1982; 3-14-1985 by L.L. No.\n2-1985; 7-1-1985 by L.L. No. 5-1985]"
																},
																{
																	"content": [
																		{
																			"number": "[1] ",
																			"content": [
																				{
																					"text": "The enclosing structure shall be not less than\nfour feet in height; be completely covered from the top to within\nthree inches of the ground level with a material having openings which\nshall measure not more than a nominal three inches in either width\nor length, except that fencing with vertical members such as pickets\nshall have the vertical members no farther apart than a nominal three\ninches; and be of sufficient strength to support the weight of at\nleast 250 pounds."
																				}
																			]
																		},
																		{
																			"number": "[2] ",
																			"content": [
																				{
																					"text": "All gates shall be self-closing and equipped\nwith a spring lock at least three feet six inches above ground level,\nopening only from the inside of the enclosure and capable of being\nsecured with a padlock or key."
																				}
																			]
																		},
																		{
																			"number": "[3] ",
																			"content": [
																				{
																					"text": "Before a swimming pool is filled with water\nand until such time as the principal residence shall obtain a certificate\nof occupancy, such pool shall be completely enclosed with a fence\ncomplying with this subsection or with a temporary fence not less\nthan three feet six inches in height and of construction equal to\na typical snow fence. Such temporary fence shall remain in place until\nthe pool is inspected and found to comply physically with construction\nspecifications of this section and until the permanent fencing is\nin place."
																				}
																			]
																		}
																	]
																}
															]
														},
														{
															"number": "(f) ",
															"content": [
																{
																	"text": "Submitted plans shall show that all water flowing\nor emptying from a pool will not flow on to abutting property or streets\nor, in the judgment of the Village Engineer, will not interfere with\nany public or private water supply system."
																}
															]
														},
														{
															"number": "(g) ",
															"content": [
																{
																	"text": "No electric current conductors shall cross the\npool either overhead or underground, and all adjacent metal fences,\nrailings or other similar installations shall be effectively grounded.\nElectrical appurtenances shall conform in type and installation with\nBoard of Underwriters standards."
																}
															]
														},
														{
															"number": "(h) ",
															"content": [
																{
																	"text": "Outdoor swimming pools shall be used and maintained\nin conformity with the New York State Sanitary Code and the rules\nand regulations of the Suffolk County Health Department."
																}
															]
														},
														{
															"number": "(i) ",
															"content": [
																{
																	"text": "Outdoor swimming pools are permitted in all\nresidential districts as accessory uses to dwellings, for the private\nuse of the dwelling occupant and his family and guests. Such use shall\nnot be conducted so as to interfere unduly, by loudspeaker devices,\nfloodlighting or other controllable distractions or unnecessary noises,\nwith the comfort, repose, health or safety of neighboring inhabitants."
																}
															]
														},
														{
															"number": "(j) ",
															"content": [
																{
																	"text": "In the event that an owner shall abandon a permanent\nor portable outdoor pool which is 18 inches or more in depth, he shall\nforthwith fill all depressions and restore the premises to approximately\nthe same grade as before the pool was constructed."
																}
															]
														},
														{
															"number": "(k) ",
															"content": [
																{
																	"text": "It shall be unlawful for any owner, lessee or\ntenant in possession of land in the Village on which is located an\noutdoor swimming pool which is 18 inches or more in depth to fail\nto provide such fence or wall enclosure as herein provided, and any\nsuch pool in existence on the date this chapter becomes effective\nshall, within 30 days from such effective date, be surrounded with\na fence or wall as herein provided."
																}
															]
														},
														{
															"number": "(l) ",
															"content": [
																{
																	"text": "All filters, heating elements and any other\nappurtenances required for the operation and/or maintenance of all\nswimming pools shall be housed in properly ventilated enclosed structures\nor screened by natural vegetation which shall provide for concealment.[Added 6-20-1996 by L.L. No. 4-1996]"
																}
															]
														},
														{
															"number": "(m) ",
															"content": [
																{
																	"text": "Water used to fill a swimming pool shall not\nbe obtained from any private well within the Village of North Haven\nand, instead, all water used for such purpose shall be obtained from\nsources outside the Village of North Haven.[Added 7-6-1999 by L.L. No. 3-1999]"
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(9) ",
											"content": [
												{
													"text": "Private tennis courts are permitted subject to the\nfollowing requirements:[Added 9-10-1979 by L.L. No. 2-1979;\namended 5-3-1982 by L.L. No. 6-1982; 8-4-1986 by L.L. No. 7-1986; 7-5-1989 by L.L. No. 4-1989]"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "A building permit shall be required. In a residence\ndistrict, a plot or parcel of land containing 10 or less acres improved\nwith a single-family residence may be used for the construction, use\nand maintenance of one tennis court. In a residence district, a plot\nor parcel of land containing more than 10 acres improved with a single-family\nresidence may be used for the construction, use and maintenance of\ntwo tennis courts."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "Application. Every application for a tennis\ncourt shall be accompanied by a plot plan drawn to scale, together\nwith plans in duplicate, in sufficient detail to show:"
																},
																{
																	"content": [
																		{
																			"number": "[1] ",
																			"content": [
																				{
																					"text": "The location and size of the plot."
																				}
																			]
																		},
																		{
																			"number": "[2] ",
																			"content": [
																				{
																					"text": "The location of the site of the proposed tennis\ncourt in relation to adjoining properties."
																				}
																			]
																		},
																		{
																			"number": "[3] ",
																			"content": [
																				{
																					"text": "Computations showing the percentage of land\nproposed to be used for the tennis court and existing improvements."
																				}
																			]
																		},
																		{
																			"number": "[4] ",
																			"content": [
																				{
																					"text": "The breakdown of estimated cost used in the\napplication."
																				}
																			]
																		},
																		{
																			"number": "[5] ",
																			"content": [
																				{
																					"text": "The location and size of all existing improvements\non the plot."
																				}
																			]
																		},
																		{
																			"number": "[6] ",
																			"content": [
																				{
																					"text": "The nature and type of materials to be used\nfor the playing surface of the tennis court."
																				}
																			]
																		}
																	]
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "No permitted tennis court shall exceed 7,400\nsquare feet, including the enclosure."
																}
															]
														},
														{
															"number": "(d) ",
															"content": [
																{
																	"text": "Location. The tennis court and any fence enclosing\nthe same shall be located within the rear yard. A tennis court and\nany fence enclosing same may be located in a front yard if the setback\nis not less than 250 feet from the front yard lot line.[Amended 6-6-2000 by L.L. No. 3-2000]"
																}
															]
														},
														{
															"number": "(e) ",
															"content": [
																{
																	"text": "Setbacks. No part of the tennis court or of\nany fence enclosing any part thereof shall be located within 20 feet\nof any rear or side lot line."
																}
															]
														},
														{
															"number": "(f) ",
															"content": [
																{
																	"text": "Fences. The tennis court shall be enclosed by\na chain link fence, and the fence fabric shall be covered with a green,\nblack or dark brown plastic coating. The fence may have such opening\nor openings as the owner deems appropriate, subject to the approval\nof the Building Inspector. The fence shall not exceed a height of\n10 feet above the natural grade of the land at the places where erected.\nNo covering or decoration of any kind shall be attached to any fence,\nother than living plants or solid green, black or dark brown wind\nscreens or wind fences without any other design or decoration."
																}
															]
														},
														{
															"number": "(g) ",
															"content": [
																{
																	"text": "Landscaping. The tennis court and all fencing\nsurrounding the same shall be completely screened from adjoining properties\nby a living screen of plantings which shall have a height of at least\neight feet when planted and shall be planted five feet on center between\nsaid fencing enclosing the tennis court and all the lot lines of the\nplot on which said tennis court is located, excepting only that side\nof the tennis court which faces the dwelling. Said plantings shall\nbe maintained and replaced so long as said fencing and the tennis\ncourt remain on the premises. Any provision foregoing to the contrary\nnotwithstanding, in the event that the tennis court is located entirely\nor substantially below existing grade not less than two feet, and\nin the further event that the fencing, if any, does not exceed four\nfeet on each side or in the further event that vegetated berms rather\nthan fencing are installed, then the plantings otherwise required\nhereinabove may be of any height and spacing, subject to the finding\nof the Building Inspector that plantings of a lesser height and/or\ndifferent spacing are the functional equivalent in terms of screening\nadjoining properties.[Amended 5-2-2000 by L.L. No. 2-2000]"
																}
															]
														},
														{
															"number": "(h) ",
															"content": [
																{
																	"text": "Drainage. The height of the playing surface\nof the tennis court shall not be above the existing mean level of\nthe ground immediately adjoining the tennis court area prior to its\nconstruction, and said tennis court shall be so constructed and maintained\nso as to prevent any drainage or surface water from flowing onto any\nadjacent properties or public streets."
																}
															]
														},
														{
															"number": "(i) ",
															"content": [
																{
																	"text": "Use. The tennis court shall be used only by\nthe residents of the dwelling on the subject property and their guests.\nSaid tennis courts shall not be used prior to 9:00 a.m. of any day\nor later than sunset of any day. No lights or other illumination of\nany kind shall be installed, used or maintained in connection with\nthe use or maintenance of the tennis court, nor shall any loudspeaker\nor sound amplification device or system be permitted."
																}
															]
														},
														{
															"number": "(j) ",
															"content": [
																{
																	"text": "The tennis court shall be an outdoor tennis\ncourt only, and no part of the same shall be housed or enclosed by\nany enclosure, covering, roof or any other device, whether of a temporary\nor permanent nature."
																}
															]
														},
														{
															"number": "(k) ",
															"content": [
																{
																	"text": "It shall be the duty of the occupant of the\npremises to avoid and prevent any noises, whether made by people or\nany other means, which may disturb the peace and tranquility of the\nneighborhood or interfere with the repose and comfort of the occupants\nof any adjoining or abutting dwelling."
																}
															]
														}
													]
												}
											]
										}
									]
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 163-11",
			"title": "One-Family Residence R-2 District uses.",
			"content": [
				{
					"text": "In a One-Family Residence R-2 District, no building\nor premises shall be used and no building or part of a building shall\nbe erected or altered which is arranged, intended or designed to be\nused in whole or in part for any uses except the following:"
				},
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "One-family detached dwellings, not to exceed one dwelling on each lot and conforming with regulations set forth in §§ 163-12 through 163-30."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Any other use permitted in One-Family Residence R-1\nDistricts."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 163-12",
			"title": "Minimum lot area.",
			"content": [
				{
					"text": "The minimum lot area in an R-1 District shall\nbe 80,000 square feet, and the minimum lot area in an R-2 District\nshall be 40,000 square feet."
				}
			]
		},
		{
			"paragraph": "§ 163-13",
			"title": "Maximum lot coverage.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "The maximum lot coverage by main and accessory buildings\nshall be 15% in an R-1 District and 20% in an R-2 District. Open terraces\nconstructed of pervious brick and sand or similar combination of materials\nas natural grade shall not be included in lot coverage in either the\nR-1 District or the R-2 District."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Any provision foregoing to the contrary notwithstanding,\nthe gross floor area of any house, measured as the sum of the gross\nfloor area of all floors of a structure measured to the exterior of\nthe outside walls, including all accessory structures except as is\notherwise provided herein, shall not exceed the maximum permitted\nfloor area ratio (FAR) as follows:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Lots of 40,000 square feet or less: 2,000 square feet\ngross floor area plus (lot area minus 10,000 square feet times 0.100)\nequals maximum gross floor area."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Lots greater than 40,000 square feet and less than\n80,000 square feet: 5,000 square feet gross floor area plus (individual\nlot area minus 40,000 square feet times 0.050) equals maximum gross\nfloor area."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Lots 80,000 square feet or greater: 7,000 square feet\ngross floor area plus (individual lot area minus 80,000 square feet\ntimes 0.0325) equals maximum gross floor area, except as limited hereinbelow."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Lot area shall include all of that area of a lot which is within the definition of \"lot\" as set forth in § 163-5, exclusive of open spaces as set forth in said subsection. Gross floor area shall not include the following improvements and structures which shall be exempt from inclusion in the calculation of gross floor area: unroofed decks, unroofed patios, open terraces as set forth above in this section, tennis courts, unroofed and unenclosed swimming pools, unroofed and unenclosed porches, basements and cellars to the extent the exterior exposed wall or walls thereof are four feet or less above natural grade (or four feet or less above base flood elevation where the premises are regulated under Chapter 85 of the Village Code) after construction and attics. In determining maximum lot coverage, whether under FAR or the percentage of lot coverage allowances otherwise provided above in this section or under any standard or guideline in § 163-66, the most restrictive standard shall in all events prevail. In no event shall gross floor area of any house, measured as the sum of the gross floor area of all floors of a structure measured to the exterior of the outside walls including all accessory structures except as exempted hereinabove, exceed 15,000 square feet of gross floor area. In calculating gross floor area: i) any interior space with a floor to ceiling height in excess of 15 feet shall be counted twice; ii) any first floor space used for the placement and location of mechanical (heating, ventilation, air conditioning, water pumps, and the like) systems, not in excess of 200 square feet, shall not be counted at all, provided said residence is prohibited by regulatory provision or local flooding conditions from placement of the same systems below the first floor; and iii) space improved with roofed but unenclosed and unscreened porches and/or an attached or accessory detached garage or other roofed accessory structures shall not be counted to the extent same are equal to or are less than an area which is 15% of gross floor area otherwise allowed (but in no event less than 400 square feet) or, by way of illustration, if the lot area is 72,360 square feet, then the maximum gross floor area is 6,618 square feet (72,360 minus 40,000 equals 32,360 times 0.050 equaling 1,618 plus 5,000 or 6,618 square feet) allowing up to 993 square feet (15% of 6,618 equals 993) of roofed but unenclosed and unscreened porches and/or an accessory garage or other roofed accessory structure in addition to 6,618 square feet maximum gross floor area otherwise allowed."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 163-14",
			"title": "Minimum lot width.",
			"content": [
				{
					"text": "The minimum lot width shall be 175 feet in an\nR-1 District and 150 feet in an R-2 District."
				}
			]
		},
		{
			"paragraph": "§ 163-15",
			"title": "Minimum street frontage.",
			"content": [
				{
					"text": "The minimum street frontage on a public or private\nstreet shall be 175 feet in an R-1 District and 150 feet in an R-2\nDistrict. However, flag lots shall be permitted in a subdivision,\nprovided that such lots have a minimum street frontage of 40 feet\non a public or private street."
				}
			]
		},
		{
			"paragraph": "§ 163-16",
			"title": "Minimum lot depth.",
			"content": [
				{
					"text": "The minimum depth of a lot in an R-1 District\nshall be 250 feet and in an R-2 District shall be 200 feet."
				}
			]
		},
		{
			"paragraph": "§ 163-17",
			"title": "Minimum yards for principal buildings.",
			"content": [
				{
					"text": "The minimum yards for principal buildings shall\nbe as follows:"
				},
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "The minimum front yard shall be 75 feet in an R-1\nDistrict and 50 feet in an R-2 District."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "The minimum for one side yard shall be 30 feet in\nan R-1 District and 30 feet in an R-2 District."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "The minimum total of both side yards shall be 80 feet\nin an R-1 District and 68 feet in an R-2 District."
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "The minimum rear yard shall be 60 feet in an R-1 District\nand 40 feet in an R-2 District."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 163-18",
			"title": "Minimum yards for accessory buildings.",
			"content": [
				{
					"text": "The minimum yards for accessory buildings shall\nbe as follows:"
				},
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "The minimum distance from the street shall be 90 feet\nin an R-1 District and 70 feet in an R-2 District."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "The minimum distance from side and rear lot lines\nshall be 30 feet in an R-1 District and 20 feet in an R-2 District."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "The provisions of § 163-18B shall not apply to such lots as are described in § 163-35. Use of such lots shall be governed by the provisions of §§ 163-35 and 163-36."
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "The minimum distance from the side and rear lot lines for a swimming pool, including any decks or slabs or structures accessory to said swimming pool, shall be in accordance with § 163-10E(8)(b).[Amended 12-11-1986 by L.L. No. 13-1986; 9-6-1994 by L.L. No. 5-1994]"
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 163-19",
			"title": "Minimum livable ground-floor area per dwelling.",
			"content": [
				{
					"text": "The minimum livable ground-floor area per dwelling unit shall\nbe 1,200 square feet in an R-1 District and 1,200 square feet in an\nR-2 District.[1]"
				},
				{
					"footnote": "[1]\nEditor’s Note: Former Subsection B, regarding the minimum\nlivable area of floors other than the ground floor, was repealed 4-6-2010\nby L.L. No. 2-2010.\n"
				}
			]
		},
		{
			"paragraph": "§ 163-20",
			"title": "Clearing limitations.",
			"content": [
				{
					"text": "In the R-1 and R-2 Residence Districts of the\nVillage of North Haven, it shall be unlawful for any person, without\nobtaining an approval from the Village, to remove, damage, cause to\nbe removed or damaged, clear, grade or otherwise disturb existing\nand naturally occurring indigenous vegetation except in accordance\nwith the provisions contained hereinafter."
				},
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "The natural vegetation on a lot or tract in any district\nshall not be disturbed until such time a building permit, site plan\napproval or final subdivision approval is received or until such time\nthe Planning Board has granted clearing approval based upon a clearing\nplan, submitted pursuant to this section."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "The clearing plan shall be shown on a recent survey\nof the property at a minimum scale of one inch equals 40 feet and\nshall depict the existing vegetated areas and the areas proposed to\nbe disturbed. All wetlands and watercourses shall be shown on the\nproposed clearing plan."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "The request to the Planning Board to review the clearing\nplan shall be made by the landowner or an agent authorized by the\nlandowner and shall include an affidavit which advises the Planning\nBoard why the proposed clearing is necessary. The Planning Board may\napprove the plan, approve the plan with modifications or conditions\nor disapprove the plan if it is found to be inconsistent with the\nintent and provisions of this section. In no event shall the clearing\nbe approved except as a necessary incident to the structural improvement\nof a parcel as otherwise allowed by this chapter, it being intended\nthat clearing not occur absent the simultaneous residential improvement\nof a parcel.[Amended 5-13-1996 by L.L. No. 2-1996]"
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "If restoration or revegetation is required as a condition\nof approval of any clearing plan, the Planning Board may require the\napplicant to post a performance bond in an amount to be determined\nby the Village Engineer. The release of said performance bond shall\nnot occur until written notification is received from the Village\nEngineer that the disturbance has been satisfactorily completed in\naccordance with the approved plans."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "To ensure maximum water recharge to the groundwater\ntable, natural vegetation occurring on a lot shall be preserved to\nthe maximum extent practicable; however, in no case shall clearing\nexceed the following table:"
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "On all lots which front freshwater wetlands, tidal\nwetlands or coastal fresh marshes, ponds, creeks or streams, no clearing\nshall be permitted within 75 feet landward of the landward edge of\nsaid wetlands, and on all lots which contain or front a bluff facing\nShelter Island Sound, Noyac Bay or Sag Harbor Cove, no clearing shall\nbe permitted within 75 feet landward of the crest of the bluff. The\nPlanning Board shall have authority to grant relief from the seventy-five-foot\nsetback requirement provided that any such application shall be heard\nat a public hearing and applicant shall bear the burden of establishing:[Amended 11-5-2001 by L.L. No. 4-2001; 10-4-2011 by L.L. No.\n7-2011]"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Applicant\nis without a feasible alternative;"
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "The\nrelief sought is not substantial;"
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Any grant of relief shall be consistent with the purposes of § 163-20;"
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "Any\ngrant of relief shall not cause or allow any adverse environmental\neffect;"
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "Any\nrelief requested shall not be a self-created difficulty or a mere\ndesign election; and"
												}
											]
										},
										{
											"number": "(6) ",
											"content": [
												{
													"text": "Any grant of relief shall be subject to any reasonable conditions imposed by the Planning Board in furtherance of the purposes of § 163-20."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "To minimize potential groundwater contamination from the use of fertilizers, pesticides, herbicides and other substances, fertilized vegetation shall not exceed 20% of the total lot area of any lot or 20,000 square feet, whichever is less. Fertilized vegetation (including trees, shrubs, flower beds, lawns and the like) shall be confined to the areas cleared in conformance with and under the authority of § 163-20. Landscape irrigation, whether from permanent or temporary systems, shall also be confined to the areas cleared in conformance with and under the authority of § 163-20, except that temporary irrigation incident to a replanting plan approved by the Planning Board shall be permitted subject to permit conditions.[Amended 11-5-2001 by L.L. No. 4-2001]"
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "For the development of a parcel within a residential\nsubdivision approved by the Planning Board after the adoption of this\nchapter, the extent of disturbance of natural vegetation shall not\nexceed the total maximum clearing permitted for the minimum required\nlot area of the zoning district in which the tract lies."
								}
							]
						},
						{
							"number": "F. ",
							"content": [
								{
									"text": "Where an applicant has agreed to utilize the provisions of Article III of this chapter, Clustered Zoning, the Planning Board may, at its discretion, modify the provisions of this subsection to allow the creation of adequately sized building envelopes for the lots created pursuant to the approval of the subdivision."
								}
							]
						},
						{
							"number": "G. ",
							"content": [
								{
									"text": "When clearing is proposed on a lot which already contains preexisting nonconforming clearing, the Building Inspector shall have the power to review and approve plans for additional clearing where, as a condition of said clearing, a vegetation plan is submitted and approved demonstrating how the lot shall be brought into compliance through the relandscaping of existing cleared areas with plant materials consistent with the intent of this § 163-20. Where deemed appropriate, the Building Inspector may attach reasonable conditions to the issuance of the approval so as to ensure compliance with this § 163-20.[Amended 11-5-2001 by L.L. No. 4-2001]"
								}
							]
						},
						{
							"number": "H. ",
							"content": [
								{
									"text": "The Building Inspector shall be empowered to grant building permits without site plan approval for any clearing, landscaping or revegetation work on an individual lot; provided, however, that said work conforms to the requirements of § 163-20B and the following:[Added 11-5-2001 by L.L. No. 4-2001]"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "The building permit application shall be accompanied by a survey, at a scale of not less than one inch equals 40 feet, which clearly delineates the edges of the existing and proposed limits of clearing and landscaping, along with calculations of the areas to be cleared to demonstrate conformance to the requirements of § 163-20B. The survey shall also illustrate the location of all easements, buffer zones and restricted areas contained on the lot proposed for clearing."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "The request for a clearing permit shall be accompanied\nby a statement signed by the property owner that no vegetation outside\nof the areas delineated on the survey shall be disturbed, cleared,\ntrimmed or thinned without further review and approval by the Building\nInspector and, if appropriate, the Planning Board."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Where deemed necessary or appropriate, the Building\nInspector may attach reasonable conditions to the building permit\nto ensure compliance with the clearing limitations established herein\n(for example, installation of temporary fencing, surveying of clearing\nlimit, etc.)."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "Prior to the issuance of a certificate of compliance for said work, the property owners shall submit an updated survey which shows the actual completed limits of clearing based upon a field survey along with the calculations demonstrating compliance with § 163-20B."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "I. ",
							"content": [
								{
									"text": "For any lot seeking to clear and relandscape properties in excess of the areas contained in § 163-20B, site plan approval for a clearing and revegetation plan shall be required by the Planning Board prior to the issuance of a building permit permitting the commencement of work.[Added 11-5-2001 by L.L. No. 4-2001]"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "In all instances where clearing and revegetation of areas exceed the area limitations established in § 163-20B, the Planning Board shall have the authority to approve a clearing and revegetation plan for areas proposed to be cleared beyond the prescribed limitation, provided all plant material proposed is considered indigenous, native and non-fertilizer-dependent and is consistent with the goals and objectives for the protection of groundwater and native habitat."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "The clearing and revegetation plan shall be shown\non either a survey of the property, at a minimum scale of one inch\nequals 40 feet, or on a drawing prepared by a licensed landscape architect.\nThe clearing and revegetation plan shall depict the existing vegetated\nareas and the areas proposed to be disturbed, along with specific\nplanning details (type and size of plant material as well as planting\ndensity). All wetlands and watercourses shall be shown on the proposed\nclearing plan, along with all easements, buffer zones and restricted\nareas."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "The request to the Planning Board to review the clearing\nplan shall be made by the landowner or an agent authorized by the\nlandowner and shall include an affidavit which advises the Planning\nBoard why the proposed clearing is necessary. The Planning Board may\napprove the plan, approve the plan with modifications or conditions\nor disapprove the plan if it is found to be inconsistent with the\nintent and provisions of this section. In no event shall the clearing\nbe approved except as a necessary incident to the structural improvement\nof a parcel as otherwise allowed by this section, it being intended\nthat clearing not occur absent the simultaneous residential improvement\nof a parcel."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "If restoration or revegetation is required as a condition\nof approval of any clearing plan, the Planning Board may require the\napplicant to post a bond in an amount to be determined by the Village\nEngineer. The release of said performance bond shall not occur until\nwritten notification is received from the Village Engineer that the\ndisturbance has been satisfactorily completed in accordance with the\napproved plans."
												}
											]
										}
									]
								}
							]
						}
					]
				},
				{
					"footnote": "[1]\nEditor's Note: This local law also provided\nfor the redesignating of former § 163-20, Minimum livable\nnon-ground-floor area per dwelling, as amended, as § 163-19B.\n"
				}
			]
		},
		{
			"paragraph": "§ 163-21",
			"title": "Maximum building heights.",
			"content": [
				{
					"text": "No building shall exceed 2 1/2 stories\nin height in an R-1 District and 2 1/2 stories in height in an\nR-2 District. No building shall exceed 35 feet in height in an R-1\nDistrict and 35 feet in height in an R-2 District."
				}
			]
		},
		{
			"paragraph": "§ 163-31",
			"title": "Accessory buildings.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "An accessory building may be located in any required\nside or rear yard, provided that:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Such building shall not exceed 15 feet in height."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Accessory building yard requirements of §§ 163-12 through 163-21 are complied with."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "All such buildings in the aggregate shall not occupy\nmore than 30% of the area of required rear or side yard, with the\nexception of swimming pools, which shall not occupy more than 25%\nof the rear yard area.[Amended 4-5-1982 by L.L. No. 5-1982]"
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "No living quarters shall be permitted in an accessory\nbuilding."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "An accessory building on that portion of a lot not\nincluded in any required yard shall not exceed 15 feet in height,\nwith the exception of a detached garage which shall not exceed 20\nfeet in height.[Amended 11-4-1985 by L.L. No. 6-1985]"
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "No accessory building shall project nearer to the\nstreet on which the principal building fronts than such principal\nbuilding. In appropriate cases where properties are bounded by Shelter\nIsland Sound or any natural bodies of water, the Board of Appeals\nmay vary this provision, provided that no accessory building may be\nlocated within a required front yard."
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "Any provision foregoing to the contrary notwithstanding,\nthe term \"accessory buildings\" shall include any structure upon or\nwithin which public utility equipment, including by way of illustration,\nnot limitation, electric junction boxes and meters, is located or\naffixed except that any said structure may be located in any required\nyard, provided that said structure is approved by the Board of Architectural\nReview and Historic Preservation after said Board finds that the location,\ndesign and features of said structure neither detract from nor render\nunsightly the appearance of the premises at which said structure is\nproposed or any adjacent premises.[Added 4-4-1994 by L.L. No. 2-1994]"
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 163-32",
			"title": "Corner lots.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "At all street intersections in all residence districts,\nno obstructions to vision exceeding 30 inches in height above curb\nlevel shall be erected or maintained on any lot within the triangle\nformed by the street lines of such lot and a line drawn between points\nalong such street lines 30 feet distant from their point of intersection."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "On a corner lot, front yards are required on both\nstreet frontages, and one yard other than the front yards shall be\ndeemed to be a rear yard and the other or others, side yards. The\nminimum district requirements for each shall be complied with."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 163-33",
			"title": "Exceptions to lot depths.",
			"content": [
				{
					"text": "The minimum lot depth at any point may be decreased\nby 25% if the average lot depth conforms to the minimum requirement."
				}
			]
		},
		{
			"paragraph": "§ 163-34",
			"title": "Projections into required lots.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Permitted projections."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Cornices, eaves or cantilevered roofs may project\nnot more than two feet into a required yard."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Belt courses, window sills and other ornamental features\nmay project not more than six inches into a required yard."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Fences or walls with a height in excess of four feet\nshall conform to the requirements set forth herein for buildings."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "Paved terraces, steps and walks (other than such as\nare needed for access to the buildings on the lot) shall not project\nwithin 15 feet of a street line or four feet of a property line."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "A roofed-over but unenclosed projection in the nature\nof an entry or portico, not more than eight feet wide and extending\nnot more than six feet out from the front wall of the building, shall\nbe exempt from the requirements of this article when the building\notherwise complies with the regulations of this article. In computing\nthe average setback, the presence of such entries and porticos shall\nbe ignored."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 163-35",
			"title": "Existing nonconforming lots.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Any lot having a width of not less than 100 feet which does not conform to the minimum lot area, width or depth limitations of §§ 163-12 through 163-21 of this chapter may be used for the erection on such lot of a one-family residence which, as so erected, complies with all of the other provisions of this chapter, provided that such lot either:[Amended 4-18-1983 by L.L. No. 3-1983]"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Was individually and separately owned on June 13,\n1961, was not at any time on or after June 13, 1961, reduced in area,\nwidth or depth and did not at any time on or after June 13, 1961,\nadjoin another parcel of land owned or controlled by the owner of\nsuch lot;"
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Existed as a lot, duly filed and recorded in the office\nof the Clerk of Suffolk County on or before September 18, 1966, was\nnot at any time on or after September 18, 1966, reduced in area, width\nor depth and complies with the applicable provisions of the Zoning\nOrdinance of the Village of North Haven with respect to minimum lot\narea, width and depth, which were in effect between June 13, 1961,\nand September 18, 1966; or"
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Existed in a subdivision, duly approved by the Planning\nBoard and filed in the offices of the Clerks of the Village of North\nHaven and Suffolk County on or before September 18, 1966, and which\nof itself, or combined with others, forms a recorded lot within the\nmeaning of this chapter, complying in all respects with the provisions\nof the Zoning Ordinance in effect between June 13, 1961, and September\n18, 1966."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "It is the intent of § 163-35 to permit the use for a one-family residence of any recorded lot or lots which would have qualified for such use under the provisions of the Zoning Ordinance in effect from June 13, 1961, to September 18, 1966. Therefore, the Zoning Board of Appeals may vary the provision of § 163-35A above to the extent necessary to permit compliance with the intent of this section.[Added 4-18-1983 by L.L. No. 3-1983]"
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Attention is called to the provisions of Chapter 55, Building Construction and Fire Prevention, § 55-4, relative to applications for building permits.[Added 3-1-1982 by L.L. No. 3-1982;\namended 1-4-2007 by L.L. No. 2-2007]"
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 163-36",
			"title": "Minimum side and rear yards in nonconforming lots.",
			"content": [
				{
					"text": "The minimum side yard and rear yard requirements for any lot described in §§ 163-35 and 163-36 are hereby reduced as follows:"
				},
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "The total minimum dimensions of both side yards for\na principal building and accessory building shall be computed on the\nbasis of 0.4 of the lot width; however, no dimension for any one side\nyard of a principal and accessory building shall be less than 10 feet."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "The total minimum rear yard dimension for a principal\nand accessory building shall be computed on the basis of 0.4 of the\nlot width; however, no dimension for the rear yard of a principal\nbuilding shall be less than 25 feet or, for an accessory building,\nless than 15 feet.[1][Amended 8-4-1986 by L.L. No. 7-1986]"
								},
								{
									"footnote": "[1]\nEditor's Note: Original §§ 5.2, 5.3, 5.4 and 5.5 which followed this section, were removed 8-4-1986 by L.L. 7-1986 and included in the Code as follows: § 5.2 as Ch. 137, Signs; § 5.3 as Ch. 74, Fences, Walls and Berms; § 5.4 as Ch. 128, Poles, Towers and Antennas; § 5.5 as Ch. 47, Assemblies, Mass.\n"
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 163-36.1",
			"title": "Underground passageways.",
			"content": [
				{
					"text": "Any passageway used to connect parts of a residence or accessory structure shall in no event exceed a length of 15 feet or constitute a design feature in more that one location on any one residential parcel and shall in no event enable a construction of § 163-31D which converts or changes an accessory structure to be part of the principal structure, it being required that any accessory building shall not project nearer to the street on which the principal building fronts than the principal building whether or not the accessory building and principal building are connected by an underground passageway, except as is otherwise expressly provided in § 163-31D where properties are bounded by Shelter Island Sound or any natural bodies of water."
				}
			]
		},
		{
			"paragraph": "§ 163-36.2",
			"title": "(Reserved)\n                                                                                          [1]",
			"content": [
				{
					"footnote": "[1]\nEditor's Note: Former § 163-36.2, Wireless communications\ntowers, added 5-3-2011 by L.L. No. 1-2011, was repealed 7-5-2011 by\nL.L. No. 3-2011.\n"
				}
			]
		}
	]
}