{
	"url": "http://ecode360.com/8316437",
	"paras": [
	    {
			"paragraph": "ยง 195-12",
			"title": "Residence C District.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Building height. No building shall exceed 2 1/2\nstories, with a maximum height of 30 feet.[Amended 9-11-1995 by L.L. No. 1-1995; 11-3-2003 by L.L. No.\n2-2003]"
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Front yards. Front yards shall be not less than 30\nfeet in depth."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Side yards. Side yards shall be not less than 20 feet\nin width."
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "Rear yards. Rear yards shall be not less than 30 feet\nin depth."
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "Accessory buildings. Accessory buildings may be located only in the rear yard and shall not be nearer than 30 feet to the street line nor nearer than 20 feet to any rear or inside lot line or side lot line, nor nearer than 40 feet to any part of the dwelling on another lot. This subsection shall not apply to swimming pools as regulated by ยง 195-21F, or exterior air-conditioning units as regulated by ยง 195-26.1.[Amended 1-5-1998 by L.L. No. 1-1998; 5-5-2008 by L.L. No.\n2-2008]"
								}
							]
						},
						{
							"number": "F. ",
							"content": [
								{
									"text": "No principal building, including the accessory building\nincident thereto, shall occupy a lot of less than 30,000 square feet,\nnor shall there be more than one principal building to each 30,000\nsquare feet, except as herein provided in relation to present existing\nbuildings."
								}
							]
						},
						{
							"number": "G. ",
							"content": [
								{
									"text": "Maximum gross floor area. The maximum gross floor\narea of the principal building shall be equal to 5,800 square feet\nplus [(lot area in square feet minus 20,000 square feet) times 0.1].[Added 11-3-2003 by L.L. No. 2-2003]"
								}
							]
						},
						{
							"number": "H. ",
							"content": [
								{
									"text": "Lot width and street frontage. Lot width and public\nstreet frontage shall not be less than 125 feet in length.[Added 9-6-2005 by L.L. No. 3-2005]"
								}
							]
						}
					]
				}
			]
		}
	]
}	