{
	"url": "http://ecode360.com/10899916",
	"paras": [
		{
			"paragraph": "§ 175-7",
			"title": "District uses.",
			"content": [
				{
					"text": "In all Districts principal buildings or structures\nmay be erected, altered or used and lots or premises may be used only\nfor one of the following purposes:"
				},
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Single-family dwelling."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Village municipal buildings, including the Village\nHall and Fire House and water supply system and such other buildings\nor uses as may be necessary or convenient in connection with the administration\nand operation of the business and affairs of the Village."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "School or church, synagogue, temple or other bona\nfide place of public worship, clubhouses and buildings used for bathing\npurposes situated not more than 200 feet from the shore of Manhasset\nBay, railroad station or post office, with approval from the Board\nof Trustees of a conditional use certificate subject to such conditions\nas said Board may impose and the issuance of a building permit and\ncertificate of occupancy."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 175-7.1",
			"title": "Rentals.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Renting,\nleasing or letting of a single-family dwelling by a homeowner to another\nsingle family or individual for 90 consecutive days or more while\nthe owner does not occupy the premises is a permitted use. No more\nthan two such rentings, leasings or lettings may occur in any three-hundred-sixty-five-day\nperiod. The rental, leasing or letting for a term of less than 90\nconsecutive days in a three-hundred-sixty-five-day period is prohibited.\nThe homeowner must notify the Village Clerk and Police Department\nof the name and contact telephone number of the individual(s) occupying\nthe premises upon any renting, leasing or letting authorized under\nthis section."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "In the\nevent that this section causes a severe and substantial financial\nhardship to any property owner, an application may be made in writing\nto the Board of Trustees requesting an exemption from the provisions\nof this section. After due notice and a public hearing on such application,\nthe Board of Trustees may grant such exemption and impose any conditions\nas may be deemed reasonable or necessary. No exemption shall be granted\npursuant to this section, except upon a determination in the sole\ndiscretion of the Board of Trustees that severe and substantial financial\nhardship exists as a result of the application of the provisions of\nthis section."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 175-8",
			"title": "Conformance required.",
			"content": [
				{
					"text": "No structure or building shall be erected, altered or used unless it complies with the standards and requirements set forth in § 175-15 and all other provisions of this chapter."
				}
			]
		},
		{
			"paragraph": "§ 175-9",
			"title": "Merger of lots; nonconforming lots and building permits.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "If a nonconforming improved or vacant lot shall be,\nor come to be, in the same ownership as an adjoining lot, it shall\nlose its status as a separate nonconforming lot and shall merge with\nand become part of the adjoining lot in the same ownership; except\nto the extent that the new lot created by the merger shall remain\nnonconforming in the same respect as the original nonconforming lot\nif not cured by the merger. In the case of two adjoining lots with\nprincipal dwellings that come to be in the same ownership, the lots\nshall not merge."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "The Building Inspector may issue a building permit\nfor additional work on a nonconforming improved lot only if the new\nconstruction:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Conforms to all provisions of this Code; and"
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "When combined with the existing structure(s) would\nnot create a violation of this code or increase an existing nonconformity."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "The Building Inspector may issue a building permit\nfor work on a vacant nonconforming lot only if a variance for the\nnonconformity is obtained from the Zoning Board of Appeals prior to\nthe issuance of such permit."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 175-10",
			"title": "Lot area.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "In determining compliance with the minimum lot area\nrequirements within any given zoning district in the Village, the\nfollowing areas shall be excluded from the lot area computation:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Any area located below the mean high water mark of\na tidal waterway."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Any area located in a tidal or freshwater wetland\nas determined by the Department of Environmental Conservation of the\nState of New York."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Any land lying in the bed of any public or private\nstreet adjacent thereto."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "Any land in the bed of a private right-of-way providing\naccess to an adjacent lot."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "There shall be erected not more than one principal\nbuilding with accessory structures for each such minimum area."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 175-11",
			"title": "(Reserved)",
			"content": []
		},
		{
			"paragraph": "§ 175-12",
			"title": "(Reserved)",
			"content": []
		},
		{
			"paragraph": "§ 175-13",
			"title": "Height-setback ratio requirements.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "No part of a building shall be permitted to extend beyond the inclined plane of the height-setback ratio as given in § 175-15, except as provided herein."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Minor architectural features, including but not limited\nto chimneys, flues, skylights and dormer windows, may extend above\nthe inclined plane of the height-setback ratio, but collectively such\npenetrations of the plane shall be limited to 25% of the total roofline/length\nalong any given side of the building."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 175-14",
			"title": "Front yard setbacks to conform.",
			"content": [
				{
					"text": "Wherever two or more buildings exist on the\nsame side of the street within 200 feet on either side of a proposed\nnew building, the front setback of such new building shall conform\nto the average setback of such existing buildings, except that:"
				},
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "No building shall have its front wall nearer to the street than the required front yard setback specified in § 175-15, Table I, for the district in which the lot is located, and"
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "No building need be set back more than 50 feet from\nthe street."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 175-15",
			"title": "Regulation of lot area and dimensional requirements for all districts.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "The following are the requirements and standards for\nall lots, structures and buildings unless otherwise indicated for\nthe several districts referred to in this chapter. Dimensions are\nin feet, unless otherwise indicated. Minimum lot area (square feet) 16,000, Maximum building area of lot 30%, Maximum building height Peaked roof 30 Flat roof 25 Accessory Peaked Roof 12.5 Flat Roof 11, Minimum yards of principal buildings Front yard 30, Rear yard 20, Side yard 20, Minimum street frontage 100, Minimum livable floor area (square feet) Total 1,800 Ground story 1,000, Lot size(square feet) Up to 16,000  Maximum FAR .32 Maximum GFA(squarefeet) 5,120, More than 16,000 and less than 31,999 Use formula 5,920 - .05(L)/15,999=X, FAR CalculationFormula(L=lot size in square feet; X=maximumFAR), Lot size(square feet) 31,999 and up Maximum FAR .27, Maximum GFA(squarefeet) 8,640"
								},
								{
									"footnote": "[1]\nEditor's Note: Appendix No. 1 is included\nat the end of this chapter.\n[2]\nEditor's Note: Appendix No. 2 is included\nat the end of this chapter.\n"
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Interpretation and application of provisions. In their\ninterpretation and application, the provisions of this chapter shall\nbe held to be minimum requirements and as not interfering with, abrogating\nor annulling any easements, covenants or other agreements between\nparties; provided, however, that where this chapter imposes a greater\nrestriction or limitation upon the use of buildings, premises or lots\nor upon the height and size of buildings or requires larger yards\nor other open spaces than are imposed or required by existing provisions\nof law or ordinances or by easements, covenants or agreements, the\nprovisions of this chapter shall control."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 175-15.1",
			"title": "Overall height limitations.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "A principal building shall not exceed 2 1/2 stories\nin height."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "An accessory building shall not exceed 1 1/2 half\nstories in height."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "A basement shall be counted as a story."
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "The highest point of a principal building having a\npeaked roof shall not exceed 35 feet above mean ground level measured\nalong the foundation of the building."
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "The highest point of an accessory building having\na peaked roof shall not exceed 16 feet above mean ground level measured\nalong the foundation of the building."
								}
							]
						},
						{
							"number": "F. ",
							"content": [
								{
									"text": "Chimneys may extend no more than three feet above\nthe highest point of the roof."
								}
							]
						},
						{
							"number": "G. ",
							"content": [
								{
									"text": "That portion of a principal building over space in a basement or\ncellar that is designed for use as a garage shall not exceed 1 1/2\nstories in height.[Added 5-11-2015 by L.L.\nNo. 3-2015]"
								}
							]
						}
					]
				}
			]
		}
	]
}