{
	"url": "http://ecode360.com/10480265",
	"paras": [
		{
			"paragraph": "§ 265-32",
			"title": "Scope of provisions.",
			"content": [
				{
					"text": "In Residential R-1 Districts, the following\nregulations shall apply."
				}
			]
		},
		{
			"paragraph": "§ 265-33",
			"title": "Permitted uses.",
			"content": [
				{
					"text": "No building or premises shall be used and no\nbuilding shall be erected or altered for other than one or more of\nthe following specified uses:"
				},
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "One-family dwellings including the office of a professional\n(limited to a physician, dentist, chiropractor, podiatrist, physical\ntherapist, occupational therapist, attorney, accountant, architect\nor professional engineer), when actually used as the private dwelling\nof the aforesaid professional person, and the same individual who\noccupies the office shall reside within said premises and shall be\nthe owner of record. No other professional shall use said office,\nregardless of his/her relationship to the owner-professional. The\noffice space for said physician, dentist, chiropractor, podiatrist,\nphysical therapist or occupational therapist may contain the following\nand shall not exceed the same: a waiting room, consultation room,\ntwo treatment and/or examining rooms and one bathroom with a total\nfloor area not to exceed 600 square feet. The office space shall be\nentirely on the first floor of the premises and shall have a direct\naccess by means of one entrance door to the interior of the residential\nportion.[Amended 7-7-2014 by L.L. No. 8-2015]"
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Places of worship.[Amended 3-6-1967; 10-6-1997 by L.L. No. 9-1997]"
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Libraries, public museums and also schools as herein\ndefined.[Amended 3-6-1967]"
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "Clubs maintained or conducted by any religious, philanthropic\nor patriotic organization.[Amended 3-6-1967]"
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "Accessory uses, customarily incident to the above\nuses, but not including a business or building or use not located\non the same lots with the building or use to which it is accessory.\nA garage or a group of garages for more than two motor vehicles shall\nnot be permitted as an accessory use. Each and every garage shall\nbe at least 25 feet from any street line except on plots having a\nwidth of less than 50 feet located on a corner in which case such\ngarage shall be placed on said property at a point as far distant\nas possible from any street line. Garages comprising a portion of\nthe main dwelling shall be deemed a portion of that building and the\nfront, side and rear yard restrictions shall be applicable thereto.[Amended 3-6-1967[1] ][2]"
								},
								{
									"footnote": "[1]\nEditor's Note: This resolution also deleted\nformer Subsection (f), prohibited living quarters in accessory buildings.\n[2]\nEditor's Note: Former Section 18-57, Uses\nprohibited, amended 3-6-1967, which immediately preceded this section,\nwas repealed 9-14-1981 by L.L. No. 11-1981.\n"
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 265-34",
			"title": "Mother-daughter residences.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "A mother-daughter residence shall be permitted on\na temporary basis only for a period of five years, subject to renewal\nor extension thereof upon application by said homeowner. Any owner\nseeking such mother-daughter use or occupancy shall obtain the same\nby application and approval by the Superintendent of the Building\nDepartment acting in consultation with the Village Attorney. Any permit\ngranted by said Superintendent of the Building Department shall terminate\nprior to such five-year period upon the happening of one or more of\nthe following events:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "The sale or lease of the premises;"
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "The death of any individual upon whose relationship\nsaid application and permit were granted; and/or"
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Any other change of occupancy of the premises from\nthat occupancy stated and approved in the application for such mother-daughter\npermit."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Any owner seeking a mother-daughter permit shall make\napplication to the Superintendent of the Building Department in such\nform as may be promulgated and/or required by said Superintendent\naccompanied by copies of the applicant's deed; a plot plan and/or\nsurvey; a diagram or layout of the premises indicating the use as\nproposed; and such other and/or additional materials as may be required\nby the Superintendent, including but not limited to documents to prove\nand/or verify the family relationship between the owner and the proposed\nother occupants."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Each application shall be accompanied by an application\nfee and, if granted, there shall be an annual permit fee. The application\nfee and annual permit fee shall be in such amount as may be fixed,\nfrom time to time, by a resolution of the Board of Trustees.[1]"
								},
								{
									"footnote": "[1]\nEditor's Note: The fee schedule is on file\nin the Village offices.\n"
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "The Superintendent of the Building Department or any\nVillage inspector designated by the Superintendent shall have the\nright to enter and inspect the premises during reasonable hours to\nascertain and/or verify whether or not the use of the premises is\nin compliance with the permit and any conditions that may be imposed\nin granting the permit. The Superintendent shall have the right and\nauthority to impose such conditions in granting any permit, as he\nor she may deem reasonable, necessary and/or desirable to preserve\nand protect the spirit and objectives of this chapter and to insure\nthe proper compliance therewith."
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "Upon the granting of any mother-daughter permit and\nprior to the issuance of the permit each applicant/owner shall be\nrequired to submit a restrictive covenant in such form as may be required\nby and approved by the Village Attorney, to be prepared and filed\nor recorded at the expense of the applicant/owner, which said restrictive\ncovenant shall declare the limitations on the use of said mother-daughter\nresidence in accordance with the determination of the Superintendent\nof the Building Department."
								}
							]
						},
						{
							"number": "F. ",
							"content": [
								{
									"text": "In the event that an application for a mother-daughter permit is denied, then and in such event the aggrieved applicant/owner shall have the right of appeal to the Board of Zoning Appeals of the Village of Cedarhurst, in accordance with the provisions of Article IV of this chapter."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 265-35",
			"title": "Principal use of first story; classification of accessory spaces.",
			"content": [
				{
					"text": "The first story above the curb level of the\nstreet shall be constructed and used principally for living quarters.\nGarages, furnace spaces and other accessory spaces are not to be classified\nas living quarters."
				}
			]
		},
		{
			"paragraph": "§ 265-36",
			"title": "Height.",
			"content": [
				{
					"text": "No building shall be raised and no building\nor any part thereof shall be erected or altered in a Residential R-1\nDistrict which is higher than two-and-one-half stories above the curb\nlevel of the street. In no event shall the top of the ridge be more\nthan 30 feet above the level of the curb. Houses located in the flood\nzone may be raised/altered to a height of 33 feet. (The ridge may\nnot be more than 33 feet above the curb level.)"
				}
			]
		},
		{
			"paragraph": "§ 265-37",
			"title": "Accessory buildings.",
			"content": [
				{
					"text": "Accessory buildings may occupy 40% of the required\narea of the rear yard up to an average height of 12 feet. The yard\narea occupied by such accessory building shall, however, be included\nin computing the maximum percentage of the lot area which may be built\nupon. No accessory building shall be nearer any front property line\nthan 45 feet."
				}
			]
		},
		{
			"paragraph": "§ 265-38",
			"title": "Building area.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "The first story of any building constructed pursuant\nto this section shall have a minimum area of 800 square feet exclusive\nof porches and garages."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "The phrase \"minimum usable space\" as above provided\nshall not at any part thereof be less than seven feet six inches in\nheight."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "The total building area, including all accessory buildings,\nshall not exceed 30% of the lot area."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 265-39",
			"title": "Size and area of plot.",
			"content": [
				{
					"text": "No building shall be erected on any plot which\nhas a frontage of less than 60 feet and a total area of less than\n6,000 square feet. However, the foregoing shall not affect plots presently\nhaving a frontage of less than 60 feet but 40 feet or more where such\nowners do not own contiguous plots of land fronting on the same street\nand where such plots were in single and individual ownership prior\nto August 4, 1952, and have been so maintained to date."
				}
			]
		},
		{
			"paragraph": "§ 265-40",
			"title": "Front yards.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "A front yard of 25 feet shall be required."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "In the case of a corner lot, the front yard on each\nstreet shall be as noted above, except that as to plots which were\nin single and separate ownership prior to August 4, 1952, and have\nbeen so maintained to date and which have a frontage of less than\n60 feet and on which a residence may be lawfully erected in accordance\nwith the ordinances of this Village, the required side yard toward\nthe street shall be reduced to the extent of one foot for every two\nfeet of total plot width which is less than 60 feet."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 265-41",
			"title": "Side yards.",
			"content": [
				{
					"text": "A side yard is required along each side of a\nbuilding."
				},
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "The side yards along the sides of a building used\nexclusively as a single-family dwelling shall have an aggregate width\nof no less than 16 feet. Neither side shall be less than six feet\nin width, except on corner plots, the side yard shall be six feet."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Other than a one-family dwelling."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "On a corner lot, a building other than a single-family\ndwelling shall have only one side yard. Said side yard shall have\na width of no less than 15 feet."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "On an interior lot, a building other than a single-family\ndwelling shall have two side yards, neither of which shall be less\nthan 20 feet."
												}
											]
										}
									]
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 265-42",
			"title": "Rear yards.",
			"content": [
				{
					"text": "A rear yard of not less than 25 feet shall be\nrequired on every plot."
				}
			]
		},
		{
			"paragraph": "§ 265-42.1",
			"title": "Character of roofs.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "All buildings permitted by this chapter shall be erected\nwith roofs other than those of the character and description known\nas \"flat roofs.\" Such flat roofs are permitted for one-story extensions\nand appurtenances only, and are not to exceed 240 square feet in the\naggregate.[Amended 2-7-2005 by L.L. No. 2-2005]"
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Should a variance from this section be granted by\nthe Board of Zoning Appeals, then in no event shall a building exceed\nthe prescribed height as set forth hereinafter:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "One-story building: eighteen feet zero inches\nto the high point of the roof above the mean level of the curb. A\nparapet shall not exceed three feet zero inches above the high point\nof the roof."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Two-story buildings: twenty-one feet zero inches\nto the high point of the roof above the mean level of the curb. A\nparapet shall not exceed three feet zero inches above the high point\nof the roof."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "All buildings permitted in this article shall be erected with pitched roofs as defined in § 265-1, which roofs with a slope of 4.5 to 12, or greater.[Added 2-7-2005 by L.L. No. 2-2005]"
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 265-43",
			"title": "Permitted encroachments.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "In a front, rear and side yard, a roof eave may project\nnot more than 12 inches into the required setback."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "In a side and rear yard, a chimney may project not\nmore than 20 inches into the required side or rear yard setback."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Side entrance steps may project into the side yard\nnot more than 36 inches into the required setback. The height of such\nsteps and/or platform shall not exceed 36 inches above the height\nof the curb and shall not have any cover or other structure over the\nsame. Where the steps are covered, the same shall be considered part\nof the building and no encroachment will be permitted."
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "Entrance and exit steps may encroach into the required\nfront or rear yard. The platform for such steps may not exceed three\nfeet in projection and six feet in width. A three-foot projection\nand six-foot width one-story open (not enclosed) roof overhang may\nencroach three feet into the required setback."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 265-44",
			"title": "Open decks and patios.",
			"content": [
				{
					"text": "A permit and certificate of completion shall\nbe required for the construction of an open (uncovered) deck and/or\npatio built eight inches or more above grade. A deck exceeding 36\ninches in height above the level of the curb shall be deemed a structure\nand shall comply with all requirements of this Code pertaining to\nstructures, including setbacks. An open (uncovered) deck and/or patio,\nbuilt eight inches or more above grade, but which is not more than\n36 inches in height above the level of the curb, shall, in any event,\nconform to the following setbacks:"
				},
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "In the front yard, the front yard setback for all\nstructures in such district;"
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "In the rear yard, not less than 10 feet; and"
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "In the side yard, not less than six feet."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 265-45",
			"title": "Signs; provisions applicability to all residential districts.",
			"content": [
				{
					"text": "One real estate sign, not larger than three\nfeet by four feet on one lot, advertising the sale or letting of only\nthe premises on which it is maintained and set back not less than\n15 feet from the street line and not less than 10 feet from each side\nline, shall be allowed; except where acreage, available for or in\nprocess of subdivision, is advertised for sale or letting, one real\nestate sign, not larger than three feet high and eight feet long,\nwill be permitted on each 500 feet to 1,000 feet of frontage or one\nreal estate sign three feet high by four feet long on each 500 or\nless feet of street frontage, provided that said signs are set back\nnot less than 30 feet from the street line; said three feet of height\nshall be construed to mean the height of the sign itself and not the\nheight from the ground or curb line. This regulation shall apply not\nonly to Residential R-1 Districts, but also to all residential districts."
				}
			]
		}
	]
}