{
	"url": "http://ecode360.com/10480316",
	"paras": [
		{
			"paragraph": "§ 265-46",
			"title": "Permitted uses.",
			"content": [
				{
					"text": "In Residential R-2 Districts, no buildings or\npremises shall be used and no building shall be erected or altered\nfor other than one or more of the following uses:"
				},
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Any use permitted in Residential R-1 Districts."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "A dwelling for not more than two families and in compliance with the provisions in § 265-45 and § 265-47 through 265-55."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Where the premises contains residential use as a professional\noffice as defined in Residential R-1 Districts, only one such office\nmay be used and only with regard to a professional residing and owning\nthe premises therein."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 265-47",
			"title": "Height.",
			"content": [
				{
					"text": "No building shall be raised and no building\nor any part thereof shall be erected or altered in a Residential R-2\nDistrict which is higher than two-and-one-half stories above the curb\nlevel of the street. In no event shall the top of the ridge be more\nthan 30 feet above the level of the curb. Houses located in the flood\nzone may be raised/altered to a height of 33 feet. (The ridge may\nnot be more than 33 feet above the curb level.)"
				}
			]
		},
		{
			"paragraph": "§ 265-48",
			"title": "Accessory buildings.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Accessory buildings may occupy 40% of the required\narea of the rear yard up to an average height of 12 feet."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "The area occupied by an accessory building shall be\nincluded in computing the maximum percentage of the lot area which\nmay be built upon."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "No accessory building shall be nearer any front property\nline than 45 feet."
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "Wood frame accessory structures shall have side and\nrear yard set backs of no less than four feet."
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "Masonry accessory structures shall have side and rear\nyard set backs of no less than two feet."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 265-49",
			"title": "Building area.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "The first story of any building constructed pursuant\nto this section shall have a minimum area of 800 square feet exclusive\nof porches and garages."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "The phrase “minimum usable space” as above\nprovided shall not at any part thereof be less than seven feet six\ninches in height."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "The total building area, including all accessory buildings,\nshall not exceed 30% of the lot area."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 265-50",
			"title": "Size and area of plot.",
			"content": [
				{
					"text": "No building shall be erected on any plot which\nhas a frontage of less than 60 feet and a total area of less than\n6,000 square feet. However, the foregoing shall not affect plots presently\nhaving a frontage of less than 60 feet but 40 feet or more where such\nowners do not own contiguous plots of land fronting on the same street\nand where such plots were in single and individual ownership prior\nto August 4, 1952, and have been so maintained to date."
				}
			]
		},
		{
			"paragraph": "§ 265-51",
			"title": "Front yards.",
			"content": [
				{
					"text": "A front yard of 25 feet shall be required. In\nthe case of a corner lot the front yard on each street shall be as\nnoted above, except that as to plots which were in single and separate\nownership prior to August 4, 1952, and have been so maintained to\ndate and which have a frontage of less than 60 feet and on which a\nresidence may be lawfully erected in accordance with the ordinances\nof this Village, the required side yard toward the street shall be\nreduced to the extent of one foot for every two feet of total plot\nwidth which is less than 60 feet."
				}
			]
		},
		{
			"paragraph": "§ 265-52",
			"title": "Side yards.",
			"content": [
				{
					"text": "A side yard is required along each side of a\nbuilding."
				},
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "The side yards along the sides of a building used\nexclusively as a one- or two-family dwelling, shall have an aggregate\nwidth of no less than 16 feet. Neither side shall be less than six\nfeet in width, except on corner plots, the side yard shall be six\nfeet."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Other than one- or two-family dwelling."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "On a corner lot, a building other than a one- or two-family\ndwelling shall have only one side yard. Said side yard shall have\na width of no less than 15 feet."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "On an interior lot, a building other than a one- or\ntwo-family dwelling shall have two side yards, neither of which shall\nbe less than 20 feet."
												}
											]
										}
									]
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 265-53",
			"title": "Rear yards.",
			"content": [
				{
					"text": "A rear yard of not less than 25 feet shall be\nrequired on every plot."
				}
			]
		},
		{
			"paragraph": "§ 265-54",
			"title": "Character of roofs; maximum heights.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "All buildings permitted by this chapter shall be erected\nwith roofs other than those of the character and description known\nas \"flat roofs.\" Such flat roofs are permitted for one-story extensions\nand appurtenances only and are not to exceed 240 square feet in the\naggregate.[Amended 2-7-2005 by L.L. No. 2-2005]"
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Should a variance from this section be granted by\nthe Board of Zoning Appeals, then in no event shall a building exceed\nthe prescribed height as set forth hereinafter:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "One-story building: eighteen feet zero inches to the\nhigh point of the roof above the mean level of the curb. A parapet\nshall not exceed three feet zero inches above the high point of the\nroof."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Two-story buildings: twenty-one feet zero inches to\nthe high point of the roof above the mean level of the curb. A parapet\nshall not exceed three feet zero inches above the high point of the\nroof."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "All buildings permitted in this article shall be erected with pitched roofs as defined in § 265-1, which are roofs with a slope of 4.5 to 12, or greater.[Added 2-7-2005 by L.L. No. 2-2005]"
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 265-55",
			"title": "Permitted encroachments.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "In a front, rear and side yard, a roof eave may project\nnot more than 12 inches into the required setback."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "In a side and rear yard, a chimney may project not\nmore than 20 inches into the required side or rear yard setback."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Side entrance steps may project into the side yard\nnot more than 36 inches into the required setback. The height of such\nsteps and/or platform shall not exceed 36 inches above the height\nof the curb and shall not have any cover or other structure over the\nsame. Where the steps are covered, the same shall be considered part\nof the building and no encroachment will be permitted."
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "Entrance and exit steps may encroach into the required\nfront or rear yard. The platform for such steps may not exceed three\nfeet in projection and six feet in width. A three-foot projection\nand six-foot width one-story open (not enclosed) roof overhang may\nencroach three feet into the required setback."
								}
							]
						}
					]
				}
			]
		}
	]
}