{
	"url": "http://www.southfloralpark.org/wp-content/uploads/2012/02/Chap-210-Zoning.pdf",
	"paras": [
        {
        	"paragraph": "§ 210-5",
        	"title": "Uses.",
        	"content": [
        		{
        			"text": "In the Residence District, a building may be erected, altered or used, or a lot or premises may be used for any of the following purposes and for no other: "
        		},
        		{
        			"content": [
        				{
        					"number": "A. ",
        					"content": [
        						{
        							"text": "Single-family detached dwelling houses shall have a roof other than one of the character or description known as a flat roof."
        						}
        					]
        				},
        				{
        					"number": "B. ",
        					"content": [
        						{
        							"text": "Church, private or public school, public library. "
        						}
        					]
        				},
        				{
        					"number": "C. ",
        					"content": [
        						{
        							"text": "Club, except one, the chief activity of which is customarily carried on as a business"
        						}
        					]
        				},
        				{
        					"number": "D. ",
        					"content": [
        						{
        							"text": "Municipal firehouses. "
        						}
        					]
        				},
        				{
        					"number": "E. ",
        					"content": [
        						{
        							"text": "Farming, truck gardening, nursery or greenhouse, provided that there is no display for commercial purposes or advertisements on the premises. "
        						}
        					]
        				},
        				{
        					"number": "F. ",
        					"content": [
        						{
        							"text": "The office of a doctor, artist, lawyer or other professional person, or a customary home occupation, such as dressmaking, millinery and similar unharmful house occupations, conducted by resident occupants only, provided that there is no display or advertisement of any kind, other than an ordinary small nameplate or sign not larger than six inches by 12 inches and bearing only the name and occupation, and provided, further, that no goods or wares are publicly displayed on the premises. Such occupations shall not be conducted in a basement or cellar or in an accessory building. "
        						}
        					]
        				},
        				{
        					"number": "G. ",
        					"content": [
        						{
        							"text": "A billboard, sign, board or other advertisement sign shall not be allowed, except that a real estate sign, not larger than four square feet, for the sale or rental of the property upon which it appears may be used. The placement of a real estate sign upon the property requires a permit to be issued by the Village Administrator. The fee for said permit will be $50. The permit shall be renewed annually. [Amended 9-5-1991 by L.L. No. 3-1991; 4-1-1993 by L.L. No. 1-1993] "
        						}
        					]
        				},
        				{
        					"number": "H. ",
        					"content": [
        						{
        							"text": "Accessory uses on the same lot with and customarily incidental to any of the above permitted uses, including a private garage, greenhouse, small announcement or professional sign. "
        						}
        					]
        				}
        			]
        		}
        	]
        },
        {
        	"paragraph": "§  210-6",
        	"title": "Height of dwellings",
        	"content": [
        		{
        			"text": "In case of a dwelling house, no building shall be less than 1 1/2 nor greater than 2 1/2 stories in height. "
        		}
        	]
        },
        {
        	"paragraph": "§ 210-7",
        	"title": "Height of buildings which are not dwellings",
        	"content": [
        		{
        			"text": "In the case of a building other than a dwelling house, no building shall be greater than three stories or 45 feet in height, except a church. "
        		}
        	]
        },
        {
        	"paragraph": "§  210-8",
        	"title": "Setbacks.",
        	"content": [
        		{
        			"text": "No building or part thereof, exclusive of steps, shall be erected or altered that is nearer the street line upon which it fronts than 20 feet. On corner lots, the setback distance from both front and side street lines shall be not less than 20 feet. "
        		}
        	]
        },
        {
        	"paragraph": "§ 210-9",
        	"title": "Side yards.",
        	"content": [
        		{
        			"text": "A side yard is required along each side of each building, which side yard must be at least five feet in width. "
        		}
        	]
        },
        {
        	"paragraph": "§ 210-10",
        	"title": "Rear yards.",
        	"content": [
        		{
        			"text": "A rear yard is required on every lot. The depth of a rear yard shall be at least 15 feet."
        		}
        	]
        },
        {
        	"paragraph": "§ 210-11",
        	"title": "Maximum size.",
        	"content": [
        		{
        			"text": "In all districts, no buildings shall be erected or extended and no lot or premises may be used for the accommodation of more than two cars."
        		}
        	]
        },
        {
        	"paragraph": "§ 210-12",
        	"title": "Commercial vehicles.",
        	"content": [
        		{
        			"text": "In the Residence District, only one vehicle may be commercial, and it shall be garaged on the same lot with the main residence building. For purposes of this section, a commercial vehicle shall be defined generically. The registration of such vehicle as a commercial vehicle shall be presumptive evidence of its status as a commercial vehicle. "
        		}
        	]
        },
        {
        	"paragraph": "§ 210-13",
        	"title": "Accessory use on lot with main building.",
        	"content": [
        		{
        			"text": "A garage shall be permitted for an accessory use only when on the same lot with the main building. "
        		}
        	]
        },
        {
        	"paragraph": "§ 210-14",
        	"title": "Proximity to street and lot line. ",
        	"content": [
        		{
        			"text": "In the Residence District, no part of any garage shall be nearer to the street line than the greatest setback distance of the street wall of the main building; nor shall any garage, which is nearer to the street line than the rear wall of a dwelling, be nearer than three feet to any side lot line; nor shall any garage be nearer than 10 feet to the street line of a street other than that upon which the main building fronts. "
        		}
        	]
        },
        {
        	"paragraph": "§ 210-15",
        	"title": "Attached garages.",
        	"content": [
        		{
        			"text": "A garage may be erected, altered or used, as part of a main building, provided that it is constructed wholly of fireproof material with doors, if any, leading to the main building constructed so as to be fireproof and to close automatically. "
        		}
        	]
        },
        {
        	"paragraph": "§ 210-16",
        	"title": "Windows and skylights required.",
        	"content": [
        		{
        			"text": "Every room in which persons live, sleep, work or congregate shall be adequately lighted and ventilated by at least one window or ventilating skylight opening directly upon a street or yard, court or other open space which is located on the same lot. These provisions shall not be deemed to apply to courts or shafts for bathrooms, toilets, hallways or stairways."
        		}
        	]
        },
        {
        	"paragraph": "§ 210-17",
        	"title": "Cellars and accessory buildings as residences.",
        	"content": [
        		{
        			"text": "No cellar or accessory building shall be used for residence purposes."
        		}
        	]
        },
        {
        	"paragraph": "§ 210-18",
        	"title": " Buildings for dwellings behind buildings fronting on streets. ",
        	"content": [
        		{
        			"text": "No building used for dwelling purposes shall be located in the rear of any building fronting on the street. "
        		}
        	]
        },
        {
        	"paragraph": "§ 210-19",
        	"title": "Lot size.",
        	"content": [
        		{
        			"text": "No building shall be constructed on a lot having an area of less than 4,800 square feet nor having a frontage of less than 56 feet and a depth of less than 87 feet unless authorized by the Board of Appeals. "
        		}
        	]
        },
        {
        	"paragraph": "§ 210-20",
        	"title": "Conformance to lot requirements. ",
        	"content": [
        		{
        			"text": "No building shall be erected or altered and no lot areas shall be so reduced that thereby the required minimum dimensions of yards or other open spaces shall be less than prescribed by this chapter, except as herein otherwise provided. "
        		}
        	]
        },
        {
        	"paragraph": "§ 210-21",
        	"title": "Projections.",
        	"content": [
        		{
        			"text": "No building or part of a building shall be erected in or shall project into a rear, front or side yard, with the following exceptions: A. Cornices, eaves, gutters or chimneys, projecting not more than 18 inches.  B. Open balconies, steps and terraces. "
        		}
        	]
        },
        {
        	"paragraph": "§ 210-22",
        	"title": "Outer and inner court widths. ",
        	"content": [
        		{
        			"text": "The width of an outer or inner court shall be not less than eight feet."
        		}
        	]
        },
        {
        	"paragraph": "§ 210-23",
        	"title": "Size of single-family detached dwellings. ",
        	"content": [
        		{
        			"text": "No building shall be erected or altered and no lot areas shall be so reduced that thereby the required minimum dimensions of yards or other open spaces shall be less than prescribed by this chapter, except as herein otherwise provided. "
        		},
        		{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "No single-family detached dwelling house shall be erected having less than 1,000 square feet of clear usable floor area, exclusive of cellar, nor having an average width or length of less than 22 1/2 feet. [Amended 12-2-1999 by L.L. No. 5-1999; 1-5-2012 by L.L. No. 1-2012] "
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "No such dwelling shall hereafter be altered to accommodate or make provisions for more than one family except when authorized by the Board of Appeals as provided in §§ 210-29 through 210-32 hereof. "
								}
							]
						}
					]
				}

        	]
        },
        {
        	"paragraph": "§ 210-24",
        	"title": "Accessory building heights and proximity to lot lines. ",
        	"content": [
        		{
        			"text": "No accessory building may be erected, altered or used which has a height greater than 10 feet. No part of an accessory building shall be nearer the rear or side lot lines than one foot six inches. "
        		}
        	]
        }
    ]
}    