{
	"url": "http://ecode360.com/5130985",
	"paras": [
		{
			"paragraph": "§ 116c ",
			"title": "RESIDENCE DISTRICTS – TABLE OF DIMENSIONAL REGULATIONS",
			"content": [
				{
					"text": "Lot area Minimum (square feet): 20,000"
				},
				{
					"text": "Lot width, minimum (feet): 120"
				},
				{
					"text": "Height, maximum(Stories): 2 1/2"
				}
			]
		},
		{
			"paragraph": "§ 116-9",
			"title": "Placement of accessory buildings and uses.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "In all districts."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "General provisions.[Amended 7-22-1987 by L.L. No. 3-1987]"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "Accessory buildings, including garages, if detached\nfrom a main building or if connected only by an open breezeway-type\nstructure, shall be not less than five feet from the main building."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "The square-foot area of an accessory building\nshall not exceed the following limitations:"
																},
																{
																	"content": [
																		{
																			"number": "[1] ",
																			"content": [
																				{
																					"text": "In districts requiring 20,000 or less square\nfeet of lot area, an accessory building shall not exceed 520 square\nfeet in area; and"
																				}
																			]
																		},
																		{
																			"number": "[2] ",
																			"content": [
																				{
																					"text": "In districts requiring more than 20,000 square\nfeet of lot area, an accessory building shall not exceed 800 square\nfeet in area."
																				}
																			]
																		}
																	]
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "The square-foot area of such accessory buildings\nshall be included in the computation of lot coverage."
																}
															]
														},
														{
															"number": "(d) ",
															"content": [
																{
																	"text": "Such accessory buildings shall not exceed 16\nfeet in height, measured from the natural grade of the lot before\nthe placement of any material on the parcel to the highest point of\nsuch building."
																}
															]
														},
														{
															"number": "(e) ",
															"content": [
																{
																	"text": "No such accessory building shall be constructed\nwith a cellar or below-grade story, and no heating shall be installed\nin any part of such accessory building."
																}
															]
														},
														{
															"number": "(f) ",
															"content": [
																{
																	"text": "No part of any such building shall be designed\nor used for sleeping purposes, and no cooking facilities shall be\nplaced or permitted therein.[1]"
																},
																{
																	"footnote": "[1]\nEditor's Note: Former Subsection A(1)(f),\nregarding building permits for accessory buildings, was repealed 3-9-1990\nby L.L. No. 5-1990. This local law also redesignated former Subsection\nA(1)(g) and (h) as Subsection A(1)(f) and (g), respectively.\n"
																}
															]
														},
														{
															"number": "(g) ",
															"content": [
																{
																	"text": "Any accessory building designated as a poolhouse\nshall be located no further than 25 feet from the swimming pool to\nwhich it shall be accessory."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "A private garage may be constructed as a structural\npart of a main building, provided that when so constructed, the garage\nwalls shall be regarded as the walls of the main building in applying\nthe front, rear and side yard regulations of this chapter."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Accessory buildings and structures, including private\ngarages, shall not be placed within a front yard, a required side\nyard nor the total required side yards for a principal building.[Amended 6-20-1989 by L.L. No. 10-1989]"
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "An access driveway may be located within a required\nyard."
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "Accessory off-street parking or truck loading areas\nshall be improved in accordance with municipal specifications."
												}
											]
										},
										{
											"number": "(6) ",
											"content": [
												{
													"text": "Required accessory off-street parking area or truck\nloading space shall not be encroached upon by buildings, open storage\nor any other use."
												}
											]
										},
										{
											"number": "(7) ",
											"content": [
												{
													"text": "The storage of manure or of odor- or dust-producing\nsubstances as an accessory use shall not be permitted within 50 feet\nof any side or rear lot line or within 100 feet of any front lot line."
												}
											]
										},
										{
											"number": "(8) ",
											"content": [
												{
													"text": "The keeping of more than two dogs more than six months\nold in outdoor shelters or pens, or the keeping of any horses on the\npremises, is prohibited, except for riding horses, which shall be\npermitted in the following cases and subject to the following requirements:[Amended 12-12-1975 by L.L. No. 8-1975; 9-13-2001 by L.L. No. 9-2001]"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "A temporary permit for one year may be issued\nby the Building Inspector upon application to permit riding horses\non premises within the Village, provided that:"
																},
																{
																	"content": [
																		{
																			"number": "[1] ",
																			"content": [
																				{
																					"text": "The vacant land on the premises which is the subject of the application is presently devoted to agricultural use or has been so used within a period of one year prior to the application or within one year of the first granting of a temporary permit. If the premises for which a temporary permit is requested shall not have been so devoted to agricultural use, then application may be made to the Board of Appeals for such permit. The Board may issue such a temporary permit for one year upon making a finding that the pertinent standards of § 116-22 of this chapter have been complied with, and shall impose such conditions as it may deem proper in order to prevent other nearby premises from being adversely affected."
																				}
																			]
																		},
																		{
																			"number": "[2] ",
																			"content": [
																				{
																					"text": "The area of the lot upon which such accessory\nuse is to take place shall be not less than two acres, and the number\nof horses shall be limited to one horse for each acre, with an overall\nmaximum of five horses. The Board of Appeals, on application, shall\nhave the power to vary this minimum area requirement to an extent\nnot exceeding 20%, provided that it finds that other conditions which\nit shall impose shall be sufficient to prevent adjoining or nearby\npremises from being adversely affected."
																				}
																			]
																		},
																		{
																			"number": "[3] ",
																			"content": [
																				{
																					"text": "The stable, barn or shed used to shelter such\nhorses shall be located not less than 200 feet from a residence on\nany adjoining premises and any building to house such horses shall\nbe located not less than 200 feet from a residence on any adjoining\npremises; provided, however, that an application to the Board of Appeals\nmay be made to vary this requirement, which Board may grant such application,\nprovided that it finds that other conditions which it shall impose\nshall be sufficient to prevent adjoining or nearby premises of others\nfrom being adversely affected."
																				}
																			]
																		}
																	]
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "Prior to the expiration of such a temporary permit issued for one year, the permittee may apply to the Building Inspector for renewal thereof for a two-year period and thereafter subsequent renewals for successive two-year periods may be applied for and granted. Upon receipt of such renewal application or any subsequent renewal application, the Building Inspector shall make an inspection of the premises and review the nature and extent of the use, including any complaints made to the Building Inspector or other Village agencies regarding such use. If it appears from such review that adjoining or nearby premises have been adversely affected by such use, the renewal application shall be denied. The applicant may then apply to the Board of Appeals for a temporary permit for one year. Before the Board of Appeals shall issue such temporary permit, it shall make a finding that such standards of § 116-22 of this chapter as may be pertinent have been complied with and shall impose such other conditions as it may deem proper in order to prevent other nearby premises from being adversely affected. If the Board finds that other nearby premises have been and will continue to be adversely affected by the requested use, or that any condition theretofore imposed has been violated or that any violation of this chapter exists with respect to the premises, then the Board shall deny the temporary permit or renewal thereof."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "Any temporary permit issued by the Board of Appeals pursuant to Subsection A(8)(b) above shall be issued for one year only, but may be renewed by the Building Inspector as if originally issued by him upon his making the review of the use as provided in said Subsection A(8)(b)."
																}
															]
														},
														{
															"number": "(d) ",
															"content": [
																{
																	"text": "The following requirements shall be applicable\nin any case where a temporary permit has been issued:"
																},
																{
																	"content": [
																		{
																			"number": "[1] ",
																			"content": [
																				{
																					"text": "All grain-type feed shall be kept in rodentproof\ncontainers."
																				}
																			]
																		},
																		{
																			"number": "[2] ",
																			"content": [
																				{
																					"text": "No manure shall be stored within 100 feet of\nany boundary line, and all such manure shall be stored, treated and/or\nremoved in such a manner as not to create any odor or attract any\nrodents, flies or other insects."
																				}
																			]
																		},
																		{
																			"number": "[3] ",
																			"content": [
																				{
																					"text": "A roofless enclosure for such horses shall be\nprovided on the premises, which shall be located not less than 20\nfeet from any side or rear boundary line and not less than 75 feet\nfrom any front boundary line. This provision may be varied on application\nto the Board of Appeals, provided it finds that other conditions which\nit shall impose shall be sufficient to prevent adjoining or nearby\npremises from being adversely affected."
																				}
																			]
																		}
																	]
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(9) ",
											"content": [
												{
													"text": "Breezeway-type connections.[Amended 7-14-2000 by L.L. No. 5-2000]"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "Any building or structure connected to another\nbuilding by an unenclosed breezeway-type structure shall be deemed\nto be a separate building or structure."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "Any building connected to the main building\nby an enclosed breezeway-type structure shall be deemed to be a separate\nbuilding if the width of the breezeway is less than 1/2 of the length\nof the breezeway. No part of the main building shall be connected\nto another part of the main building by an unenclosed breezeway-type\nstructure. No part of the main building shall be connected to another\npart of the main building by a breezeway-type structure which is not\nenclosed with a roof and sides. No part of the main building shall\nbe connected to another part of the main building by an enclosed breezeway-type\nstructure having a width which is less than 1/2 of the length of the\nbreezeway."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "A part of the main building may be connected\nto another part of the main building by an enclosed breezeway-type\nstructure, provided that the breezeway is enclosed with a roof and\nsides, and provided that the width of the breezeway is at least 1/2\nof the length of the breezeway."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(10) ",
											"content": [
												{
													"text": "A swimming pool shall be deemed a structure and subject\nto the provisions of this chapter relating to structures. Such a swimming\npool may be installed and maintained on a lot in any district as an\naccessory use for purposes customarily incidental to the principal\nuse conducted on the lot, provided that:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "Such pool is installed in the rear yard or a\nside yard of the premises (if the pool is an outdoor swimming pool)."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "Such pool is completely enclosed by a fence\nor wall not less than four feet in height, which shall be so constructed\nas not to have openings, holes or gaps larger than four inches in\nany dimension, except for doors and gates. Such doors or gates shall\nbe equipped with self-closing and self-latching devices for keeping\nthe gates or doors securely closed when not in actual use. A dwelling\nor accessory building may be used as part of the required enclosure.\nThe door of a dwelling which forms a part of the enclosure need not\nbe equipped with a self-closing and self-latching device."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "Such pool shall not be installed nearer than\n20 feet to any lot line."
																}
															]
														},
														{
															"number": "(d) ",
															"content": [
																{
																	"text": "The area of the swimming pool shall be included\nin computing the building area of the lot for the purpose of determining\ncompliance with the maximum building area percentage requirements\nof this chapter."
																}
															]
														},
														{
															"number": "(e) ",
															"content": [
																{
																	"text": "A lot shall not contain more than one swimming\npool.[Added 6-23-1998 by L.L. No. 4-1998]"
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(11) ",
											"content": [
												{
													"text": "A tennis court shall be deemed a structure and subject\nto the provisions of this chapter relating to structures. Such a tennis\ncourt may be installed and maintained on a lot in any district as\nan accessory use for purposes customarily incidental to the principal\nuse conducted on the lot, provided that:[Added 4-11-1980 by L.L. No. 1-1980]"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "Such tennis court is installed in the rear yard\nor a side yard of the premises (if the tennis court is an outdoor\ntennis court)."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "Such tennis court shall not be installed nearer\nthan 20 feet to any lot line."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "The area of the tennis court shall be included\nin computing the building area of the lot for the purpose of determining\ncompliance with the maximum building area percentage requirements\nof this chapter.[Amended 4-9-1999 by L.L. No. 1-1999]"
																}
															]
														},
														{
															"number": "(d) ",
															"content": [
																{
																	"text": "No lights or other illumination of any kind\nshall be installed, used or maintained in connection with the use\nor maintenance of an outdoor tennis court."
																}
															]
														},
														{
															"number": "(e) ",
															"content": [
																{
																	"text": "The fencing or barrier around a tennis court\nshall not exceed eight feet in height at the ends and for a distance\nfrom the ends of 20 feet on the sides toward the center, and, except\nfor such parts of the side, the height along the side shall not exceed\nfour feet. Such height shall be measured from the playing surface.[Added 4-22-1986 by L.L. No. 4-1986]"
																}
															]
														},
														{
															"number": "(f) ",
															"content": [
																{
																	"text": "No permit for the construction of a tennis court\nshall be issued until the site and landscape plan therefor shall have\nbeen approved by the Planning Board. Such plan shall provide, among\nother things, for the screening of such tennis court and its fence\nfrom the view from adjoining parcels, and the required landscaping\nshall, unless otherwise specifically provided, be deemed to be a continuing\ncondition to use of the tennis court.[Added 4-22-1986 by L.L. No. 4-1986]"
																}
															]
														},
														{
															"number": "(g) ",
															"content": [
																{
																	"text": "A lot shall not contain more than one tennis\ncourt.[Added 6-23-1998 by L.L. No. 4-1998]"
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(12) ",
											"content": [
												{
													"text": "Supplemental accessory use regulations applicable\nto livestock.[Added 7-8-1983 by L.L. No. 6-1983; amended 9-13-2001 by L.L. No. 9-2001]"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "The keeping, raising or harboring of horses for personal use or other accessory purpose is prohibited in all districts, except for riding horses to the extent permitted by and subject to the requirements of § 116-9A(8)."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "The keeping, raising or harboring of all other livestock (all livestock other than horses) for personal use, personal consumption or other accessory purpose is prohibited in all districts, except to the extent permitted by and subject to the requirements of § 116-9A(12)(c)."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "A temporary permit for one year may be issued\nby the Board of Trustees, upon application to the Board of Trustees,\nto permit the keeping, raising or harboring of small numbers of livestock\n(other than horses) for personal use, personal consumption or other\naccessory purpose on premises used for agricultural or residential\nuse. The following provisions shall be applicable to a temporary permit\nto permit such use."
																},
																{
																	"content": [
																		{
																			"number": "[1] ",
																			"content": [
																				{
																					"text": "Such temporary permit shall not be issued unless\nthe Board of Trustees finds as follows: that such use will be in harmony\nwith and promote the general purposes and intent of this chapter;\nthat the lot area is sufficient, appropriate and adequate for such\nuse; that such use will be compatible with adjoining and nearby residential\nuse; that such use will not produce an undesirable change in the character\nof the neighborhood; that such use will not adversely affect adjoining\nor nearby premises; that adequate buffer yards and screening are provided\nwhere necessary to protect adjoining or nearby premises."
																				}
																			]
																		},
																		{
																			"number": "[2] ",
																			"content": [
																				{
																					"text": "In determining whether to grant or deny an application\nfor such temporary permit, the Board of Trustees may consider all\nmatters related to the public health, safety and general welfare."
																				}
																			]
																		},
																		{
																			"number": "[3] ",
																			"content": [
																				{
																					"text": "The burden of proof shall be on the applicant\nto establish that such use meets the standards for issuance of such\ntemporary permit and to establish that issuance of such temporary\npermit is consistent with the public health, safety and general welfare.\nThere shall be no presumption that such use is generally compatible\nwith adjoining or nearby residential use."
																				}
																			]
																		},
																		{
																			"number": "[4] ",
																			"content": [
																				{
																					"text": "The area of the lot upon which such use is to\ntake place shall be not less than 60,000 square feet. The Board of\nTrustees shall have the power to modify and reduce said minimum lot\narea requirement on a particular application, provided that the Board\nfinds that said minimum lot area requirement as applied to the circumstances\nof a particular application is not requisite in the interest of the\npublic health, safety and general welfare, and provided that the Board\nfinds that other conditions which it shall impose shall be sufficient\nto prevent adjoining or nearby premises from being adversely affected."
																				}
																			]
																		},
																		{
																			"number": "[5] ",
																			"content": [
																				{
																					"text": "If the Board of Trustees grants an application\nfor such temporary permit, the Board shall impose such conditions\nas it may deem proper in order to prevent adjoining or nearby premises\nfrom being adversely affected and in order to protect the public health,\nsafety and general welfare."
																				}
																			]
																		},
																		{
																			"number": "[6] ",
																			"content": [
																				{
																					"text": "If the Board of Trustees grants an application\nfor such temporary permit, the Board shall impose a condition limiting\nthe number and type of livestock permitted on the premises."
																				}
																			]
																		},
																		{
																			"number": "[7] ",
																			"content": [
																				{
																					"text": "If the Board of Trustees grants an application\nfor such temporary permit, the Board shall impose a condition requiring\nthat the livestock be kept at all times in an appropriate enclosure\nsufficient to assure that the livestock cannot escape from such enclosure,\nand the Board shall impose a condition establishing appropriate setback\nrequirements for such enclosure."
																				}
																			]
																		},
																		{
																			"number": "[8] ",
																			"content": [
																				{
																					"text": "Any violation of the conditions imposed incident to granting an application for such temporary permit shall be deemed a violation of this chapter, punishable under the provisions of § 116-40."
																				}
																			]
																		},
																		{
																			"number": "[9] ",
																			"content": [
																				{
																					"text": "Prior to the expiration of such a temporary\npermit issued for one year, the permittee may apply to the Building\nInspector for renewal thereof for a one-year period and thereafter\nfor subsequent renewals for successive one-year periods. Upon receipt\nof such renewal application or any subsequent renewal application,\nthe Building Inspector shall make an inspection of the premises and\nreview the nature and extent of the use, including any complaints\nmade to the Building Inspector or other Village agencies regarding\nsuch use. If it appears from such review that adjoining or nearby\npremises have not been adversely affected by such use and that no\nviolation of applicable conditions has occurred, the Building Inspector\nmay renew such temporary permit for one year. If it appears from such\nreview that adjoining or nearby premises have been adversely affected\nby such use or that a violation of applicable conditions has occurred,\nthe Building Inspector shall deny the renewal application. If the\nBuilding Inspector denies the renewal application, the applicant may\napply to the Board of Trustees for a new temporary permit for one\nyear."
																				}
																			]
																		},
																		{
																			"number": "[10] ",
																			"content": [
																				{
																					"text": "The keeping, raising or harboring of any livestock\npursuant to a temporary permit shall only be permitted so long as\na temporary permit for same is in full force and effect."
																				}
																			]
																		},
																		{
																			"number": "[11] ",
																			"content": [
																				{
																					"text": "The fee for temporary permit applications (including\nrenewal applications) shall be as established from time to time by\nresolution of the Board of Trustees."
																				}
																			]
																		},
																		{
																			"number": "[12] ",
																			"content": [
																				{
																					"text": "Temporary permit applications shall constitute\na Type II action under SEQRA."
																				}
																			]
																		},
																		{
																			"number": "[13] ",
																			"content": [
																				{
																					"text": "Prior to taking action on any temporary permit application, the Board of Trustees shall hold a public hearing thereon. Public notice of said hearing shall be required in the same manner as provided for in § 116-25B(1) and (4)."
																				}
																			]
																		}
																	]
																}
															]
														},
														{
															"number": "(d) ",
															"content": [
																{
																	"text": "Compulsory termination of nonconforming uses."
																},
																{
																	"content": [
																		{
																			"number": "[1] ",
																			"content": [
																				{
																					"text": "Anything to the contrary in this chapter notwithstanding,\nin any situation in which the keeping, raising or harboring of any\nlivestock (other than horses) for personal use, personal consumption\nor other accessory purpose lawfully exists as of the effective date\nof this provision, such use (the keeping, raising or harboring of\nany such livestock other than horses for personal use, personal consumption\nor other accessory purpose) shall become an unlawful use on the date\n90 days after the effective date of this provision and shall thereupon\nbe terminated, and any continuation of such use thereafter shall constitute\na violation of this chapter."
																				}
																			]
																		},
																		{
																			"number": "[2] ",
																			"content": [
																				{
																					"text": "This compulsory termination provision is not intended to preclude the owner of any premises used for such use (the keeping, raising or harboring of any such livestock other than horses for personal use, personal consumption or other accessory purpose) as of the effective date of this provision from making application to the Board of Trustees for a temporary permit pursuant to § 116-9A(12)(c). However, it is the intent of this compulsory termination provision that any such existing use (existing as of the effective date of this provision) shall be deemed to be a nonconforming use as of the effective date of this provision, that such nonconforming use shall become an unlawful use on the date 90 days after the effective date of this provision and shall thereupon be terminated, and that any continuation of such nonconforming use thereafter shall constitute a violation of this chapter. If an application by such owner (the owner of any premises used for such nonconforming use as of the effective date of this provision) for such temporary permit is made and granted, the use permitted by such temporary permit shall be deemed to be a new use (rather than continuation of the existing nonconforming use) as of the date of issuance of said temporary permit, said new use being a permitted use to the extent permitted by and subject to the requirements of said temporary permit and § 116-9A(12)(c)."
																				}
																			]
																		}
																	]
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(13) ",
											"content": [
												{
													"text": "A parabolic dish antenna for the reception of television\nsignals and other similar dish antennas having a diameter in excess\nof three feet, located outside of a building, are hereby prohibited.\nSuch an antenna having a diameter not exceeding three feet and not\nelevated more than one foot above ground level is permitted as an\naccessory structure, provided that it is screened in such a manner\nas not to be visible from adjacent streets and property lines when\nviewed from six feet above ground level.[Added 3-9-1984 by L.L. No. 2-1984]"
												}
											]
										},
										{
											"number": "(14) ",
											"content": [
												{
													"text": "Garbage, trash, rubbish and refuse, when stored outside\na building, shall be placed in securely fastened containers, and such\ncontainers shall be placed only in a side or rear yard, and in no\nevent shall the same be placed any nearer than 30 feet from the street\nline of a parcel.[Added 11-24-1987 by L.L. No. 5-1987]"
												}
											]
										},
										{
											"number": "(15) ",
											"content": [
												{
													"text": "All man-made bodies of water, including fish ponds\nand decorative ponds, regardless of size or depth, shall be deemed\nstructures and shall be fenced or enclosed as required for swimming\npools.[Added 6-20-1989 by L.L. No. 6-1989]"
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "In residence districts."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Accessory off-street parking areas.[Amended 8-13-2009 by L.L. No. 4-2009]"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "Accessory off-street parking areas may be located in required front,\nside or rear yards, provided that they are set back at least five\nfeet from all property lines in required front and side yards and\nat least 10 feet from all property lines in a required rear yard.[Amended 7-21-2015 by L.L. No. 3-2015]"
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "No accessory off-street parking area shall be constructed or installed\nwithout a permit therefor from the Building Inspector. Application\nfor such permit shall include a parking layout plan and landscape\nplan for the purpose of minimizing any adverse impact on the neighborhood\nor community. Such permit shall not be issued until a parking layout\nplan and landscape plan designed to minimize any adverse impact on\nthe neighborhood or community shall have been approved by the Building\nInspector. Unless otherwise specifically provided in the permit, the\nrequired landscaping approved by the Building Inspector shall be deemed\nto be a continuing condition to use of the accessory off-street parking\narea.[Amended 7-21-2015 by L.L. No. 3-2015]"
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "The filing fee for an application for such permit shall be $150 or\nsuch other amount as the Village Board of Trustees may hereafter fix\nand establish from time to time by resolution."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "No commercial vehicles nor any house trailer, mobile\nhome, boat or boat trailer or any similar equipment shall be parked\nin any front yard or in any required side yard or within 10 feet of\nany property line in a required rear yard.[2]"
												},
												{
													"footnote": "[2]\nEditor's Note: As to the further regulation of trailers within the Village, see Ch. 105, Trailers.\n"
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "In nonresidential districts."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Accessory off-street parking areas may be located in required front, side or rear yards, provided that they are set back at least 10 feet from all property lines, and further provided that they do not encroach upon required transitional yards established in accordance with § 116-11D(7) of this chapter."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "Supplemental accessory use regulations applicable\nto a retail store or shop.[Added 9-19-1995 by L.L. No. 6-1995]"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "The sale or service of food for consumption on the\npremises shall constitute a prohibited accessory use, except as otherwise\nhereinafter expressly allowed. No accommodations for on-premises consumption\nof food shall be provided, except as otherwise hereinafter expressly\nallowed."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "The sale or service of alcoholic beverages for consumption\non the premises shall constitute a prohibited accessory use."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "The sale or service of food for consumption on the\npremises shall constitute a permitted accessory use to a retail food\nstore or shop in the VB District, provided that the principal use\n(that is, the main use) and such accessory use comply with the provisions\nhereinafter set forth. A retail food store or shop in the VB District\nmay provide accommodations for on-premises consumption of food as\nan accessory use, provided that the principal use and such accessory\nuse comply with the provisions hereinafter set forth."
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "The principal use shall be a retail store or\nshop whose primary business activity consists of retail sale of food\nto the public for consumption off the premises."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "Such accessory use shall be clearly subordinate\nand incidental to the principal use."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "Such accessory use shall not be commenced unless\nand until a certificate of occupancy or certificate of compliance\nfor such accessory use has been obtained from the Building Inspector."
																}
															]
														},
														{
															"number": "(d) ",
															"content": [
																{
																	"text": "The application for such certificate shall include\nthe following:"
																},
																{
																	"content": [
																		{
																			"number": "[1] ",
																			"content": [
																				{
																					"text": "A floor plan showing the proposed layout of\nthe total floor area of the retail store or shop (including the portion\nto be devoted to the principal use and the portion to be devoted to\nsuch accessory use), which shall clearly delineate the proposed accommodations\nfor on-premises consumption of food."
																				}
																			]
																		},
																		{
																			"number": "[2] ",
																			"content": [
																				{
																					"text": "Such information as the Building Inspector may\ndeem necessary in order to establish compliance with the applicable\nprovisions of this chapter."
																				}
																			]
																		},
																		{
																			"number": "[3] ",
																			"content": [
																				{
																					"text": "Such information as the Building Inspector may\ndeem necessary in order to establish compliance with the applicable\nprovisions of the State Uniform Fire Prevention and Building Code."
																				}
																			]
																		},
																		{
																			"number": "[4] ",
																			"content": [
																				{
																					"text": "A permit to operate a food establishment issued\nby the Suffolk County Department of Health Services or, in the event\nthat the applicant claims that the Suffolk County Sanitary Code does\nnot require such a permit, proof establishing that such a permit is\nnot required."
																				}
																			]
																		}
																	]
																}
															]
														},
														{
															"number": "(e) ",
															"content": [
																{
																	"text": "A certificate of occupancy or certificate of\ncompliance for such accessory use shall identify and refer to the\nfloor plan layout approved by the Building Inspector in connection\nwith issuance of such certificate. Such accessory use shall be conducted\nin accordance with the approved floor plan layout, and no accommodations\nfor on-premises consumption of food shall be provided except as shown\non the approved floor plan layout. No alterations or modifications\nshall be made with respect thereto unless and until a floor plan layout\nshowing the revisions has been approved by the Building Inspector\nand a new certificate of occupancy or certificate of compliance therefor\n(identifying and referring to such approved layout) has been issued\nby the Building Inspector."
																}
															]
														},
														{
															"number": "(f) ",
															"content": [
																{
																	"text": "The accommodations for on-premises consumption\nof food may consist of table or counter seating or table or counter\nstanding. The extent of such accommodations shall be clearly delineated\nand limited so as to be clearly subordinate and incidental to the\nprincipal use."
																}
															]
														},
														{
															"number": "(g) ",
															"content": [
																{
																	"text": "Such accessory use may include nonalcoholic\nbeverages but shall not include alcoholic beverages."
																}
															]
														},
														{
															"number": "(h) ",
															"content": [
																{
																	"text": "Off-street parking spaces shall be provided\nfor such accessory use. The number of off-street parking spaces required\nfor such accessory use shall be one space per three persons accommodated\nby the accommodations for on-premises consumption of food."
																}
															]
														},
														{
															"number": "(i) ",
															"content": [
																{
																	"text": "The off-street parking space requirement set forth in § 116-9D(3)(h) above shall be deemed to be set forth in § 116-14D, and such accessory use shall be deemed to be a component use for the purpose of determining off-street parking space requirements pursuant to § 116-14B."
																}
															]
														},
														{
															"number": "(j) ",
															"content": [
																{
																	"text": "Off-street parking spaces shall be provided for such accessory use in accordance with § 116-9D(3)(h) above, whether or not the retail store or shop is exempt from providing off-street parking spaces pursuant to § 116-14J. It is intended by this provision that the number of off-street parking spaces required by § 116-9D(3)(h) above shall be provided, notwithstanding any provision to the contrary in § 116-14J."
																}
															]
														}
													]
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "Supplemental accessory use regulations applicable\nto a restaurant.[Added 4-20-1999 by L.L. No. 2-1999]"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Outdoor dining shall constitute a prohibited accessory\nuse to a restaurant, except as otherwise hereinafter expressly allowed.\nOutdoor dining shall constitute a special exception accessory use\nto an existing restaurant in the VB District."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Outdoor dining as a special exception accessory use to an existing restaurant in the VB District shall require special exception use approval pursuant to Article IV of this chapter. Such use shall also require site plan approval."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Outdoor dining as a special exception accessory use to an existing restaurant in the VB District shall require compliance with the special conditions and safeguards set forth in § 116-23B(25). Outdoor dining as a special exception accessory use to an existing restaurant in the VB District shall also require compliance with the applicable general standards set forth in § 116-22."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "Where an existing restaurant in the VB District is located on a parcel situate within 500 feet of a public parking lot owned or operated by the Village, outdoor dining as a special exception accessory use to said restaurant shall not require compliance with the standard set forth in § 116-22I (off-street parking spaces), and said restaurant shall not be required to provide off-street parking spaces for said accessory use."
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "Where an existing restaurant in the VB District is located on a parcel situate more than 500 feet from a public parking lot owned or operated by the Village, outdoor dining as a special exception accessory use to said restaurant shall require compliance with the standard set forth in § 116-22I (off-street parking spaces), and said restaurant shall be required to provide off-street parking spaces for said accessory use. The number of off-street parking spaces required for said accessory use shall be one space per three seats."
												}
											]
										},
										{
											"number": "(6) ",
											"content": [
												{
													"text": "Valet parking for outdoor dining as a special exception\naccessory use to an existing restaurant in the VB District (to wit,\nprovision for parking, via valet service on a lot other than the parcel\non which said restaurant is located) shall not be deemed to constitute\nproviding off-street parking spaces."
												}
											]
										},
										{
											"number": "(7) ",
											"content": [
												{
													"text": "Expiration and annual renewal."
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "Pursuant to § 116-23B(25), all special exception authorizations for outdoor dining as an accessory use to an existing restaurant in the VB District shall expire on January 1 of the year following their issuance. A special exception authorization for such accessory use may be annually renewed and reissued (to expire on January 1 of the following year) by resolution of the Board of Appeals without a further public hearing, provided that:"
																},
																{
																	"content": [
																		{
																			"number": "[1] ",
																			"content": [
																				{
																					"text": "A written request for such renewal and reissuance\nhas been filed with the Building Inspector for transmittal to the\nBoard of Appeals; and"
																				}
																			]
																		},
																		{
																			"number": "[2] ",
																			"content": [
																				{
																					"text": "The Building Inspector has issued a written\nreport to the Board of Appeals reporting that the Building Inspector\ndid not observe any violations of applicable conditions during the\npreceding year; and"
																				}
																			]
																		},
																		{
																			"number": "[3] ",
																			"content": [
																				{
																					"text": "The Police Department has issued a written report\nto the Board of Appeals reporting whether any complaints regarding\noutdoor dining activities have been made to the Police Department\nduring the preceding year."
																				}
																			]
																		}
																	]
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "Except as otherwise set forth above, annual\nrenewal and reissuance (to expire on January 1 of the following year)\nof a special exception authorization for such accessory use shall\nrequire a formal application and public hearing. Renewal shall not\nbe denied without a public hearing."
																}
															]
														}
													]
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "F. ",
							"content": [
								{
									"text": "Supplemental accessory use regulations applicable\nto garage sales as an accessory use to a residence.[Added 11-23-1999 by L.L. No. 7-1999]"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Pursuant to other provisions of this chapter, a customary accessory use to a residence is permitted (except those which are prohibited by this chapter). It is the intent of this Subsection F to recognize that a garage sale which is clearly subordinate to and customarily incidental to a residence is a customary accessory use to a residence and to regulate and restrict such customary accessory use. It is not the intent of this Subsection F to permit as an accessory use to a residence any type of sale which is not clearly subordinate to and customarily incidental to a residence, or any type of sale which is prohibited by other provisions of this chapter."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "As used herein, the term \"garage sale\" shall have\nthe meaning indicated:"
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Garage sales shall offer only used items of personal\nproperty owned by the resident of the property where the sale is held.\nNo new merchandise shall be offered for sale."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "Garage sales shall not commence before 8:00 a.m. and\nshall terminate by 6:00 p.m."
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "A garage sale shall not extend for a period of more\nthan three consecutive days."
												}
											]
										},
										{
											"number": "(6) ",
											"content": [
												{
													"text": "No more than two garage sales shall be conducted at\na residence by the resident thereof in any one calendar year. A garage\nsale which extends for a period not exceeding three consecutive days\nshall be deemed to be one garage sale."
												}
											]
										}
									]
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 116-10",
			"title": "Agriculture, gardening and animal husbandry as principal uses.",
			"content": [
				{
					"text": "In any district, agricultural and gardening\nuses shall comply with the following requirements:"
				},
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Cover crops shall be planted or sown on all cultivated\nland of one acre or more within two weeks of the date when crops are\nharvested therefrom and in no event later than October 30 of any year.\nSuch crops shall be grown and maintained in such condition as to protect\nthe soil against wind erosion at all times to the full extent possible\nafter the use of such due diligence as a reasonably prudent farmer\nor gardener would employ or exercise under all circumstances."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "During the months of July and August, motor-driven\nmachinery used in connection with working the land shall not be employed\non any weekday before 6:00 a.m. or after 9:00 p.m. or at any time\non Sundays, except with the specific approval of the municipal governing\nbody."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 116-11",
			"title": "Lot area, coverage, width and yards.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "With respect to lot area. The minimum required lot area shall not include any underwater or tidal lands below the mean high-tide level, except that in a Tidal Wetland and Ocean Beach Overlay District, marshlands customarily flooded at high tide may be included as a part of such required lot area pursuant to the provisions of § 116-7 of this chapter."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "With respect to lot coverage. The calculation of the\npercentage of lot coverage shall include those lot areas covered by\ntemporary structures and open storage of more than an incidental transitory\ncharacter."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "With respect to lot width. The minimum lot width at the street line shall be at least 40 feet in all districts, except in those districts where there is no minimum lot area requirement, where the minimum width at the street line shall be 20 feet and also in the case of flagpole lots, where the minimum lot width at the street line shall be 20 feet. Notwithstanding the foregoing, in the case of flagpole lots created after the effective date of § 116-11F(7), the minimum lot width at the street line shall be as provided in § 116-11F(7).[Amended 9-23-2003 by L.L. No. 6-2003]"
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "With respect to yards."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "The following accessory structures may be located\nin any required front or rear yard:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "An awning or movable canopy not exceeding 10\nfeet in height.[1]"
																},
																{
																	"footnote": "[1]\nEditor's Note: As to the construction of theater marquees, see Ch. 95, Streets and Sidewalks, Art. II, Encroachments.\n"
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "An open arbor or trellis."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "A retaining wall, fence or masonry wall pursuant to § 116-18 of this chapter.[2]"
																},
																{
																	"footnote": "[2]\nEditor's Note: Former Subsection D(1)(d),\nregarding unroofed steps; patio or terrace not higher than one foot\nabove ground level, which immediately followed this subsection, was\nrepealed 5-14-1999 by L.L. No. 3-1999.\n"
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "The space in a required front yard shall be open and unobstructed except for structures provided for in Subsection D(1) above and the following:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "An unroofed balcony projecting not more than\neight feet into the yard."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "Other projections specifically authorized in Subsection D(3) and (4) below."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "An unroofed entry porch and unroofed steps projecting\nnot more than eight feet into the yard.[Added 5-14-1999 by L.L. No. 3-1999]"
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Every part of a required yard shall be open to the\nsky, unobstructed except for retaining walls and for accessory buildings\nin a rear yard, and except for the ordinary projection of sills, belt\ncourses and ornamental features projecting not to exceed six inches.\nCornices and eaves shall not project more than 18 inches."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "Open or lattice-enclosed fireproof fire escapes or\nstairways, required by law, projecting into a yard not more than four\nfeet, and the ordinary projections of chimneys and pilasters shall\nbe permitted by the Building Inspector when placed so as not to obstruct\nlight and ventilation."
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "Where a lot extends through from street to street,\nthe applicable front yard regulations shall apply on both street frontages."
												}
											]
										},
										{
											"number": "(6) ",
											"content": [
												{
													"text": "The lot area and width of a lot improved with an existing\nresidence located in a district in which a new dwelling is not a permitted\nor special exception use shall not be reduced in area or width below\nthe minimum required for the R-20 Residence District nor below that\nrequired for the district in which it is located, whichever is greater.\nIf the lot area of such a lot is reduced the lot coverage, width,\nheight and yard requirements of the R-20 Residence District shall\napply to the lot containing the existing residence."
												}
											]
										},
										{
											"number": "(7) ",
											"content": [
												{
													"text": "The following minimum required transitional yards\nand screening shall be provided within nonresidential districts in\norder to assure orderly and compatible relationships along certain\nboundary lines:[3]"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "Adjoining residential districts."
																},
																{
																	"content": [
																		{
																			"number": "[1] ",
																			"content": [
																				{
																					"text": "Minimum required transitional side and rear yards shall be 50 feet and the minimum required screening with such transitional side and rear yards shall be a six-foot-high stockade-type fence or equal and landscape plantings to be erected and maintained by the nonresidential property owner along the side and rear property lines; provided, however, that the Board of Appeals, subject to the applicable provisions of § 116-27 of this chapter, may waive or modify these requirements for screening where the same screening effect is accomplished by the natural terrain or foliage."
																				}
																			]
																		},
																		{
																			"number": "[2] ",
																			"content": [
																				{
																					"text": "Notwithstanding the foregoing, the minimum required transitional side and rear yards shall be 20 feet where HA Hospital Accessory property abuts a residential district. The minimum screening therein shall be as provided in Subsection D(7)(a)[1] above.[Added 5-25-1993 by L.L. No. 2-1993; amended 6-22-1993 by L.L. No. 3-1993]"
																				}
																			]
																		}
																	]
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "Adjoining limited access highways."
																},
																{
																	"content": [
																		{
																			"number": "[1] ",
																			"content": [
																				{
																					"text": "The minimum required transitional front yard\nshall be 20 feet and the minimum required screening within such transitional\nfront yard shall be landscaped plantings, including evergreen shrubs\nnot less than one foot nor more than three feet high and street trees\nin accordance with municipal specifications."
																				}
																			]
																		}
																	]
																}
															]
														}
													]
												},
												{
													"footnote": "[3]\nEditor's Note: As to restrictions on the height of yard plantings, see Ch. 41, Brush, Obnoxious Growth and Trash.\n"
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "With respect to front yards in residence districts\non certain lots having frontage on more than one street.[Added 1-14-2000 by L.L. No. 1-2000]"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "As used herein, the following terms shall have the\nindicated meanings to the extent indicated:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "Nonaccess private road. Where a lot fronts on\na private road but does not have a legal right of access to such private\nroad, such private road shall be deemed a nonaccess private road in\nrelation to said lot."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "Access private road. Where a lot fronts on a\nprivate road and does have a legal right of access to such private\nroad, such private road shall be deemed an access private road in\nrelation to said lot."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Where a lot in a residence district fronts on a nonaccess\nprivate road and another street (an access private road or a public\nroad):"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "The applicable front yard regulations shall\napply on the frontage on such other street (the access private road\nor public road)."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "The front yard regulation applicable to the\nprincipal building shall also apply on the frontage on the nonaccess\nprivate road."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "The front yard regulations applicable to accessory\nbuildings and structures shall not apply on the frontage on the nonaccess\nprivate road. For purposes of placement of accessory buildings and\nstructures on such lot, the lot line fronting on the nonaccess private\nroad shall be deemed to be a rear lot line or a side lot line (rather\nthan a front lot line), but the minimum required setback from the\nlot line fronting on the nonaccess private road shall be 10 feet more\nthan the minimum distance from side and rear lot lines applicable\nto accessory buildings and structures."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Intent."
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "Pursuant to other provisions of this chapter,\nwhere a lot fronts on more than one street (such as a corner lot or\na lot extending through from street to street), the applicable front\nyard regulations apply on both street frontages. The applicable front\nyard regulations include the front yard regulation applicable to the\nprincipal building (the minimum required front yard or street setback\nfor the principal building). The applicable front yard regulations\nalso include the front yard regulations applicable to accessory buildings\nand structures (the minimum required street setback for accessory\nbuildings and structures and the provision which prohibits accessory\nbuildings and strictures within a front yard)."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "In the absence of Subsection E, the applicable front yard regulations would apply on both street frontages even in cases where one of the streets is a private road to which the lot does not have a legal right of access. Where a lot in a residence district fronts on a nonaccess private road and another street, it is the intent of Subsection E that the front yard regulation applicable to the principal building shall still apply on both street frontages, but that the front yard regulations applicable to accessory buildings and structures shall only apply on the frontage on such other street (the access private road or the public road). In exempting the frontage on the nonaccess private road from the front yard regulations applicable to accessory buildings and structures, it is the intent of Subsection E to establish a minimum setback requirement from the lot line fronting on the nonaccess private road for accessory buildings and structures which is greater than (10 feet more than) the minimum distance from side and rear lot lines applicable to accessory buildings and structures."
																}
															]
														}
													]
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "F. ",
							"content": [
								{
									"text": "With respect to flagpole lots:[Added 6-12-2003 by L.L. No. 4-2003]"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "The land area within the pole portion of a flagpole\nlot shall be excluded in determining the lot area of a flagpole lot."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "One of the internal lot lines of a flagpole lot shall\nbe designated as the front lot line to be used for determination of\nlot width and the required front yard. The internal lot line opposite\nthe designated front lot line shall constitute the rear lot line,\nand the other internal lot lines shall constitute side lot lines.\nThe applicable front yard and distance from street requirements shall\napply to the designated front lot line."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "The Planning Board may designate one of the internal\nlot lines of a flagpole lot as the front lot line incident to granting\nsubdivision approval involving a flagpole lot or incident to granting\nsite plan approval for a flagpole lot. If the Planning Board does\nnot so designate the front lot line, then the owner of the flagpole\nlot shall designate the front lot line."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "No flagpole lot shall be permitted in the R-7.5 Residence\nDistrict unless it has a lot area of at least 20,000 square feet.\nNo flagpole lot shall be permitted in the R-12.5 Residence District\nunless it has a lot area of at least 20,000 square feet. No flagpole\nlot shall be permitted in the R-20 Residence District unless it has\na lot area of at least 30,000 square feet. No flagpole lot shall be\npermitted in the R-40 Residence District unless it has a lot area\nof at least 60,000 square feet. No flagpole lot shall be permitted\nin the R-60 Residence District unless it has a lot area of at least\n80,000 square feet. No flagpole lot shall be permitted in the R-80\nResidence District unless it has a lot area of at least 100,000 square\nfeet. No flagpole lot shall be permitted in the R-120 Residence District\nunless it has a lot area of at least 150,000 square feet.[Amended 9-23-2003 by L.L. No. 6-2003]"
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "In the case of a flagpole lot having a lot area of less than 20,000 square feet, the yard requirements (including front, side and rear yard requirements for a principal building and distance from street, side lot line and rear lot line requirements for accessory buildings and structures) applicable to lots having a lot area of 20,000 square feet or greater but less than 40,000 square feet (see § 116-11.1 for such requirements) shall apply to such flagpole lot having a lot area of less than 20,000 square feet.[Amended 9-23-2003 by L.L. No. 6-2003; 4-8-2005 by L.L. No. 2-2005]"
												}
											]
										},
										{
											"number": "(6) ",
											"content": [
												{
													"text": "No building permit shall be issued for a flagpole\nlot until the site and landscape plan therefor shall have been approved\nby the Planning Board. Such plan shall provide for adequate screening\nand buffering of the flagpole lot in relation to adjacent lots. The\nrequired screening and buffering shall be deemed to be a continuing\ncondition to use of the flagpole lot."
												}
											]
										},
										{
											"number": "(7) ",
											"content": [
												{
													"text": "In the case of flagpole lots created after the effective\ndate of this provision, the minimum lot width at the street line shall\nbe 25 feet, and the minimum width of the pole portion along its entire\nlength (from the street line to the flag portion) shall be 25 feet.\n[Note: The \"effective date of this provision\" means the effective\ndate of the local law enacting this provision.][Added 9-23-2003 by L.L. No. 6-2003]"
												}
											]
										}
									]
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 116-11.1",
			"title": "Yard regulations in certain residence districts.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Except as otherwise hereinafter provided, the minimum\nyard dimensional regulations (including front, side and rear yard\nrequirements for a principal building and distance from street, side\nlot line and rear lot line requirements for accessory buildings and\nstructures) within all one-family residence districts (the R-120,\nR-80, R-60, R-40, R-20, R-12.5 and R-7.5 Residence Districts) and\nthe MF-20 Multifamily Residence District shall be based on the lot\narea of the lot and shall be as set forth in the following table:"
								},
								{
									"text": "The following dimensions apply to a lot with a square footage of 20,000 or Greater, but Less Than 40,000:"
								},
								{
									"text": "Yards, principal building, minimum (feet) Front: 40"
								},
								{
									"text": "Yards, principal building, minimum (feet) Side, minimum for 1: 20"
								},
								{
									"text": "Yards, principal building, minimum (feet) Side, total for both on interior lot: 45"
								},
								{
									"text": "Yards, principal building, minimum (feet) Side, abutting side street on corner lot: 40"
								},
								{
									"text": "Yards, principal building, minimum (feet) Rear: 60"
								},
								{
									"text": "Yards, accessory buildings and structures, minimum (feet) Distance from street: 50"
								},
								{
									"text": "Yards, accessory buildings and structures, minimum (feet) Distance from side and rear lot lines: 15"
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Minimum front yard requirement."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "The minimum front yard requirement for a principal\nbuilding within each of the following residence districts shall not\nbe less than the dimension set forth in the following schedule for\nthe district within which the lot is situated:"
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "If the minimum front yard dimension for a principal building determined pursuant to the table in Subsection A above is greater than the minimum front yard dimension determined pursuant to the schedule in this Subsection B, the minimum front yard dimension for a principal building determined pursuant to the table in Subsection A above shall be the applicable minimum front yard requirement. If the minimum front yard dimension for a principal building determined pursuant to the table in Subsection A above is less than the minimum front yard dimension determined pursuant to the schedule in this Subsection B, the minimum front yard dimension determined pursuant to the schedule in this Subsection B shall be the applicable minimum front yard requirement."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Minimum distance from street."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "The minimum distance from street requirement\nfor accessory buildings and structures within each of the following\nresidence districts shall not be less than the dimension set forth\nin the following schedule for the district within which the lot is\nsituated:"
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "If the minimum distance from street dimension for accessory buildings and structures determined pursuant to the table in Subsection A above is greater than the minimum distance from street dimension determined pursuant to the schedule in this Subsection C, the minimum distance from street dimension for accessory buildings and structures determined pursuant to the table in Subsection A above shall be the applicable minimum distance from street requirement. If the minimum distance from street dimension for accessory buildings and structures determined pursuant to the table in Subsection A above is less than the minimum distance from street dimension determined pursuant to the schedule in this Subsection C, the minimum distance from street dimension determined pursuant to the schedule in this Subsection C shall be the applicable minimum distance from street requirement."
												}
											]
										}
									]
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 116-11.2",
			"title": "Lot coverage in certain residence districts.",
			"content": [
				{
					"text": "The maximum lot coverage (maximum lot coverage\nby main and accessory buildings and structures) within all one-family\nresidence districts (the R-120, R-80, R-60, R-40, R-20, R-12.5 and\nR-7.5 Residence Districts) and the MF-20 Multifamily Residence District\nshall be 14% of the lot area of the lot plus 1,500 square feet. In\nno case in such districts shall lot coverage exceed 30% of lot area."
				}
			]
		},
		{
			"paragraph": "§ 116-11.3",
			"title": "Dimensional regulations in VB district.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Lot area."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Where public sewerage is not available, no lot shall be built\nupon which has insufficient space for a private sanitary waste disposal\nsystem, as determined by the municipality and the Suffolk County Health\nDepartment."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "No minimum lot area required."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "No minimum lot area per dwelling unit required."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Lot width."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Minimum lot width shall be 20 feet."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Lot coverage."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Maximum coverage by main and accessory buildings and structures\nshall be 70%."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Maximum depth of building footprint from front property line\nshall be 75 feet for lots with frontage on North Main Street, Main\nStreet and Jobs Lane."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Maximum depth of building footprint from front property line\nshall be 120 feet for lots with frontage on all streets other than\nNorth Main Street, Main Street and Jobs Lane."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "Height."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "With respect to property located in a designated historic district under Chapter 65 of the Village Code, maximum building height shall be 35 feet, and maximum number of stories shall be 2 1/2 stories."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "With respect to property located outside of a designated historic district under Chapter 65 of the Village Code, maximum building height shall be 35 feet, and maximum number of stories shall be 2 1/2 stories unless special exception approval is obtained from the Board of Appeals to exceed such limitations. Subject to the limitation set forth in Subsection D(3), the Board of Appeals may grant special exception approval to exceed 35 feet in height in order to allow a height not exceeding 40 feet, and in conjunction therewith, the Board of Appeals may grant special exception approval to exceed 2 1/2 stories in order to allow three stories."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "One or more adjacent buildings above 35 feet in height shall\nnot continue more than 60 feet along the street, or be located within\n150 feet of another building above 35 feet in height."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "Building height of one or more adjacent buildings shall not\nremain constant for more than 65 feet along the street. A change in\nbuilding height shall consist of a minimum of three feet."
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "Maximum height of a single-story building is 20 feet. One or\nmore adjacent single-story buildings shall continue for no more than\n50 feet along the street."
												}
											]
										},
										{
											"number": "(6) ",
											"content": [
												{
													"text": "One or more adjacent multiple story buildings shall not continue\nfor more than 120 feet along the street without an eight foot setback\nof the upper story or stories."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "Yards for principal buildings and accessory buildings."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "No minimum yard setbacks are required."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Maximum front yard setback for first story is three feet. "
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Principal building must span a minimum of 90% of the frontage."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "Where a drainage easement is required, front yard setback shall\nbe measured from the easement."
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "Maximum front yard setback for upper stories is eight feet beyond\nthe first story setback."
												}
											]
										},
										{
											"number": "(6) ",
											"content": [
												{
													"text": "Recesses to accommodate entrances shall be a minimum of three\nfeet and a maximum of 12 feet in depth and shall be provided at intervals\nof no more than 45 feet."
												}
											]
										}
									]
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 116-12",
			"title": "Height regulations.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Nothing herein contained shall restrict the height\nof the following architectural and structural features:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "On any public or semipublic building, a spire, cupola,\ndome, belfry or clock tower."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Flagpole, chimney flue, elevator or stair bulkhead,\nwater tank, stage tower or scenery loft as accessory facilities to\npermitted or special exception uses in a given district."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Barns, silos or similar farm structures in districts\nwhere agriculture is a permitted use."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "Radio or television tower, transmission line or tower\nor similar structure (including a wireless facility) necessary as\na public service facility only after approval as a special exception\nuse by the Board of Appeals.[Amended 2-23-2016 by L.L. No. 1-2016]"
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "No building or structure erected pursuant to Subsection A above to a height in excess of the height limit for the district in which it is situated shall:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Have a lot coverage in excess of 10% of the lot area."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Be used for residence or tenancy purposes."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Have any sign, nameplate display or advertising device\nof any kind whatsoever inscribed upon or attached to such building\nor structure."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "No private radio or television antenna, mast or tower\nshall exceed the maximum permitted height prescribed for the district\nin which such proposed structure is located."
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "Natural grade.[Added 4-22-1986 by L.L. No. 2-1986; amended 8-13-2015 by L.L. No. 5-2015]"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "The existing natural grade of a lot shall not be changed on any part\nof the lot, except as permitted under the terms and conditions of\na building permit."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Where the natural grade of a lot is permitted to be changed under\nthe terms and conditions of a building permit, such terms and conditions\nmay impose reasonable restrictions and limitations for the purpose\nof minimizing any adverse impact on the neighborhood or community."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "Pyramid Law in certain residence districts.[Added 9-23-2003 by L.L. No. 7-2003]"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "In the R-7.5, R-12.5 and R-20 Residence Districts,\nall buildings and structures (except chimneys, flagpoles, church spires\nand decorative railings) must remain inside the sky plane of the lot."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "In the case of lots other than flagpole lots, the\nsky plane shall begin at the front and rear lot lines at the average\nelevation of the existing natural grade, shall begin at the side lot\nlines five feet above the average elevation of the existing natural\ngrade, and shall extend to the building or structure at an angle of\n45°."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "In the case of flagpole lots, the sky plane shall\nbegin at the front, rear and side lot lines at the average elevation\nof the existing natural grade and shall extend to the building or\nstructure at an angle of 45°."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "The average elevation of the existing natural grade\nshall be certified by a licensed surveyor."
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "An illustration showing a typical sky plane is included\nat the end of this chapter."
												}
											]
										},
										{
											"number": "(6) ",
											"content": [
												{
													"text": "Notwithstanding any language in this Pyramid Law (Subsection E), the maximum height limitation set forth in the Table of Dimensional Regulations shall not be exceeded."
												}
											]
										},
										{
											"number": "(7) ",
											"content": [
												{
													"text": "Notwithstanding any provision in this Pyramid Law (Subsection E) to the contrary, in the case of a lawfully existing (existing as of the effective date of this Pyramid Law) one-family dwelling having a height in excess of the height limitation imposed by this Pyramid Law, the height of any addition or improvement thereto may exceed the height limitation imposed by this Pyramid Law, provided that the height of such addition or improvement does not exceed the maximum height limitation set forth in the Table of Dimensional Regulations, and provided that the height of such addition or improvement does not exceed the height of the highest point of the roof of such existing one-family dwelling.[1]"
												},
												{
													"footnote": "[1]\nEditor's Note: Former Subsection F, Height\nin certain residence districts, and G, Space above the second story\nin certain residence districts, both added 4-8-2005 by L.L. No. 2-2005,\nwhich immediately followed this subsection, were repealed 11-10-2005\nby L.L. No. 7-2005.\n"
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "F. ",
							"content": [
								{
									"text": "Height in certain residence districts.[Added 7-21-2015 by L.L.\nNo. 4-2015]"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Except as otherwise hereinafter provided, the maximum height in feet\nfor all structures within all one-family residence districts (the\nR-120, R-80, R-60, R-40, R-20, R-12.5 and R-7.5 Residence Districts)\nand the MF-20 Multifamily Residence District shall be based on the\nlot area of the lot and shall be as set forth in the following table:"
												},
												{
													"text": "Lot Area Less than 20,000(square feet): Maximum Height: 30(feet)"
												},
												{
													"text": "Lot Area 20,000 or greater but less than 40,000(square feet): Maximum Height: 33(feet)"
												},
												{
													"text": "Lot Area 40,000 or greater(square feet): Maximum Height: 35(feet)"
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Notwithstanding the foregoing, the maximum height in feet dimension\nfor any residential building with a roof pitch flatter than 7/12 (i.e.,\nseven inches of rise for every 12 inches of run) shall be seven feet\nless than the maximum height set forth in the above table."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "G. ",
							"content": [
								{
									"text": "Measurement of height of certain elevated buildings.[Added 8-13-2015 by L.L.\nNo. 5-2015]"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "As used herein, the term \"elevated building\" shall mean a building elevated pursuant to the elevation requirements of Chapter 62 (the Village Flood Damage Prevention Code)."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Notwithstanding the provision in the definition of height of a building (see § 116-2B) to the effect that the height of a building be measured from the average elevation of the finished grade along the side of the building fronting on the nearest street, in the case of an elevated building, the height of such elevated building shall be measured from the elevation two feet above the applicable base flood elevation (the base flood elevation applicable to such elevated building pursuant to Chapter 62)."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "In the case of an elevated building, the terms and conditions of\na building permit for such elevated building may require that the\nnatural grade of the lot be increased vertically for the purpose of\nminimizing any adverse impact on the neighborhood or community."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "H. ",
							"content": [
								{
									"text": "Pyramid Law for certain elevated buildings.[Added 8-13-2015 by L.L.\nNo. 5-2015]"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "As used herein, the term \"elevated building\" shall mean a building elevated pursuant to the elevation requirements of Chapter 62 (the Village Flood Damage Prevention Code)."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "The sky plane requirements hereinafter set forth shall be applicable\nto elevated buildings."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "The front yard sky plane shall begin at a line parallel to and situate\n40 feet from the front lot line at the elevation equivalent to the\napplicable base flood elevation (to Wit, the front yard sky plane\nshall be measured from and along the applicable base flood elevation\nwith the fulcrum offset 40 feet from the front lot line) and shall\nextend to the building at an angle of 33º."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "The side yard sky plane shall begin at the side lot lines at the\nelevation five feet above the applicable base flood elevation (to\nwit, the side yard sky plane shall be measured from and along the\nelevation five feet above the applicable base flood elevation with\nthe fulcrum offset at the side lot lines) and shall extend to the\nbuilding at an angle of 33º."
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "An elevated building must remain inside the front yard and side yard\nsky planes, except for the following permitted encroachments:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "Cornices and eaves up to 24 inches on first floor roof only."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "Cornices and eaves up to 12 inches on second-floor roof and\nhalf-story roof only."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "Roof feature. Dormers (gable, hip, shed, barrel style) shall\nbe limited to no greater than eight feet wide each, no taller than\nsix feet of vertical encroachment, and shall not be within the same\nvertical plane as the exterior wall below by at least a two-foot offset\n(breaking of plane requires offset, not interruptions). Ridge of dormers\nshall be at least 12 inches lower vertically than the primary roof\nstructure it is a feature upon."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(6) ",
											"content": [
												{
													"text": "The height of an elevated building shall not exceed the height limitations imposed by this Pyramid Law (Subsection H). The height of an elevated building shall not exceed the maximum height limitations imposed by other applicable dimensional regulations of this chapter."
												}
											]
										}
									]
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 116-13",
			"title": "Sign regulations.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Sign definitions. As used in this chapter, the following\nterms shall have the indicated meanings:[Amended 11-23-1999 by L.L. No. 7-1999]"
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Identification signs.[Amended 9-19-1995 by L.L. No. 7-1995; 11-23-1999 by L.L. No.\n7-1999]"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "A home professional office or home occupation may\nhave one identification sign on each public street frontage of its\nproperty. Such sign shall bear only the name and profession or occupation\nof the resident. Such sign shall have a maximum area of two square\nfeet and may be located on the building wall or in the required front\nyard, provided that it is set back at least five feet from all property\nlines and is not more than six feet above the natural ground level\nat its location. Such sign may be double-faced. A detached or ground\nsign shall not be supported by a pylon or metal pole."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "A church or other place of worship may have one announcement\nsign, not over 12 square feet in area, on each public street frontage\nof its property, either fixed on the main wall of the building or\nlocated in the required front yard, provided that it is set back at\nleast five feet from the front property line and at least 25 feet\nfrom all other property lines. Such sign may be double-faced. A detached\nor ground sign shall not be supported by a pylon or metal pole."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "A parish house, club, school or public or semipublic\nbuilding may have one announcement sign, not over six square feet\nin area, on each public street frontage of its property, either fixed\non the main wall of the building or located in the required front\nyard, provided that it is set back at least five feet from the front\nproperty line and at least 25 feet from all other property lines.\nSuch sign may be double-faced. A detached or ground sign shall not\nbe supported by a pylon or metal pole."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "All other identification signs (all identification\nsigns other than for a home professional office, home occupation,\nchurch or other place of worship, parish house, club, school or public\nor semipublic building):"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "Are prohibited in all residence districts."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "Are permitted in nonresidential districts pursuant\nto the schedule set forth in Item (5) below."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "The following schedule of permitted identification\nsigns shall apply to such identification signs in nonresidential districts,\naccording to the district in which the lot is located on the Zoning\nMap:[1]"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "In Village Business and Highway Business Districts, one wall sign on each public street frontage of the lot or municipal off-street parking lot frontage and one detached or ground sign pursuant to § 116-13C."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "In all other nonresidential districts, one wall sign on each public street frontage of the lot or municipal off-street parking lot frontage and one detached or ground sign pursuant to § 116-13D."
																}
															]
														}
													]
												},
												{
													"footnote": "[1]\nEditor's Note: The Zoning Map is located at\nthe back of this Code.\n"
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Village and Highway Business District identification\nsigns."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "A wall identification sign shall be attached to or\nincorporated in a building wall. Such sign shall not:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "Exceed in total area 1 1/2 square feet\nfor each horizontal foot of such wall on which it is mounted.[Amended 11-23-1999 by L.L. No. 7-1999]"
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "Exceed in width 75% of the horizontal measurement\nof the wall on which it is mounted."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "Project more than one foot from such wall."
																}
															]
														},
														{
															"number": "(d) ",
															"content": [
																{
																	"text": "Exceed 60 square feet in total area.[Added 11-23-1999 by L.L. No. 7-1999]"
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "A detached or ground identification sign may only\nbe erected where the building is set back from the street line a distance\nof 40 feet or more. Such sign shall not:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "Exceed in total area 24 square feet."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "Exceed six feet in height measured from the\nground level.[Amended 9-19-1995 by L.L. No. 7-1995]"
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "Be supported by a pylon or metal pole.[Amended 9-19-1995 by L.L. No. 7-1995]"
																}
															]
														},
														{
															"number": "(d) ",
															"content": [
																{
																	"text": "Be set back less than 10 feet from any property\nline, except that if the average front setback of existing buildings\nwithin the same block is less than 10 feet, then the average setback\nso established shall be applied to such sign."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "When a wall identification sign is permitted on a\nbuilding wall, a portion of the sign area permitted on such building\nwall may be incorporated into an awning attached to such building\nwall, subject to the following limitations:[Added 9-19-1995 by L.L. No. 7-1995] "
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "The awning shall have seven feet of head clearance,\nshall be flame retardant and shall be retractable. The top of the\nawning shall follow the header of the window."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "A sign permit shall be required for the sign\narea incorporated into such awning. In reviewing the design thereof,\nthe Board of Architectural Review and Historic Preservation may consider\nthe design of the awning (including its color and material) and the\nsign area incorporated therein."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "No back lighting shall be provided. The awning\nshall be nonilluminated.[Amended 11-23-1999 by L.L. No. 7-1999]"
																}
															]
														},
														{
															"number": "(d) ",
															"content": [
																{
																	"text": "The lettering shall be on the bib of the awning\nonly and shall be a single line of lettering not exceeding six inches\nin height."
																}
															]
														},
														{
															"number": "(e) ",
															"content": [
																{
																	"text": "The awning graphics shall indicate only the\nname, type of business and/or address of the enterprise or premises."
																}
															]
														},
														{
															"number": "(f) ",
															"content": [
																{
																	"text": "The sign area incorporated into such awning\nshall be deemed to be part of the permitted wall identification sign\nand shall be debited against the sign area permitted on such building\nwall."
																}
															]
														}
													]
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "All other nonresidential district identification signs."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "A wall identification sign shall be attached to or\nincorporated in a building wall. Such sign shall not:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "Exceed in total area one square foot for each\nhorizontal foot of such wall on which it is mounted."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "Exceed in width 75% of the horizontal measurement\nof the wall on which it is mounted."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "Project more than one foot from such wall."
																}
															]
														},
														{
															"number": "(d) ",
															"content": [
																{
																	"text": "Exceed 40 square feet in total area.[Added 11-23-1999 by L.L. No. 7-1999]"
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "A detached or ground identification sign may only\nbe erected where the building is set back from the street line a distance\nof 40 feet or more. Such sign shall not:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "Exceed in total 24 square feet."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "Exceed six feet in height measured from the\nground level.[Amended 9-19-1995 by L.L. No. 7-1995]"
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "Be supported by a pylon or metal pole.[Amended 9-19-1995 by L.L. No. 7-1995]"
																}
															]
														},
														{
															"number": "(d) ",
															"content": [
																{
																	"text": "Be set back less than 20 feet from any property\nline, except that if the average front setback of existing buildings\nwithin the same block is less than 10 feet, then the average setback\nso established shall be applied to such sign."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "When a wall identification sign is permitted on a\nbuilding wall, a portion of the sign area permitted on such building\nwall may be incorporated into an awning attached to such building\nwall, subject to the following limitations:[Added 9-19-1995 by L.L. No. 7-1995]"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "The awning shall have seven feet of head clearance,\nshall be flame retardant and shall be retractable. The top of the\nawning shall follow the header of the window."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "A sign permit shall be required for the sign\narea incorporated into such awning. In reviewing the design thereof,\nthe Board of Architectural Review and Historic Preservation may consider\nthe design of the awning (including its color and material) and the\nsign area incorporated therein."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "No back lighting shall be provided. The awning\nshall be nonilluminated.[Amended 11-23-1999 by L.L. No. 7-1999]"
																}
															]
														},
														{
															"number": "(d) ",
															"content": [
																{
																	"text": "The lettering shall be on the bib of the awning\nonly and shall be a single line of lettering not exceeding six inches\nin height."
																}
															]
														},
														{
															"number": "(e) ",
															"content": [
																{
																	"text": "The awning graphics shall indicate only the\nname, type of business and/or address of the enterprise or premises."
																}
															]
														},
														{
															"number": "(f) ",
															"content": [
																{
																	"text": "The sign area incorporated into such awning\nshall be deemed to be part of the permitted wall identification sign\nand shall be debited against the sign area permitted on such building\nwall."
																}
															]
														}
													]
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "Window signs and menu box signs.[Amended 9-19-1995 by L.L. No. 7-1995; 11-23-1999 by L.L. No.\n7-1999]"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Window signs are permitted in all nonresidential districts,\nsubject to the following limitations:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "The total area of window signs that are affixed\nto or painted on or placed within one foot of the glass of a door\nshall not exceed 10% of such glass area, except as follows. If such\ndoor provides access for more than one business, such total area shall\nnot exceed 10% of such glass area per business."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "The total area of window signs that are affixed\nto or painted on or placed within one foot of a window shall not exceed\n20% of the area of the window."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "Window sign area shall be debited against the permitted wall sign area, except as follows. Window signs indicating hours of operation, business affiliations, emergency information and the like (excluding product or service information) are exempt from being debited against the permitted wall sign area, provided that the aggregate area of all such signs for a single business does not exceed one square foot per window or door. Posters referred to in Subsection E(1)(d) and (e) below are exempt from being debited against the permitted wall sign area."
																}
															]
														},
														{
															"number": "(d) ",
															"content": [
																{
																	"text": "A permit is not required for window signs that\nconsist of posters affixed to or placed within one foot of a window\nfor the purpose of advertising special events or activities of local\npublic interest scheduled to occur at sites other than the property\nwhere the posters are located. Such posters shall be removed no later\nthan five days after the occurrence of the special event or activity.\nSuch posters shall not be subject to the above window sign area limitations."
																}
															]
														},
														{
															"number": "(e) ",
															"content": [
																{
																	"text": "A permit is not required for window signs that\nconsist of posters affixed to or placed within one foot of a window\nfor the purpose of advertising special sales or promotions of the\non-site business. Such posters shall not be subject to the above window\nsign area limitations. A particular poster shall not be displayed\nfor a period of more than 30 consecutive days, nor re-displayed (displayed\nagain after removal to interrupt a period of consecutive days) more\nthan three times per calendar year."
																}
															]
														},
														{
															"number": "(f) ",
															"content": [
																{
																	"text": "The aggregate area of window signs subject to the twenty-percent limitation in Subsection E(1)(b) above plus posters referred to in Subsection E(1)(e) above shall not exceed 25% of the area of the window. The aggregate area of window signs subject to the twenty-percent limitation in Subsection E(1)(b) above plus posters referred to in Subsection E(1)(d) above shall not exceed 30% of the area of the window. The aggregate area of window signs subject to the twenty-percent limitation in Subsection E(1)(b) above plus posters referred to in Subsection E(1)(d) and (e) above shall not exceed 30% of the area of the window."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Menu box signs are permitted in all nonresidential\ndistricts, subject to the following limitations:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "A menu box sign shall be one-sided and shall\nbe attached to a building wall."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "A menu box sign shall be as small as practicable."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "A menu box sign may be illuminated with white\nartificial light only, not exceeding 30 watts. The source of illumination\nshall be shielded and directed solely at the menu box sign."
																}
															]
														},
														{
															"number": "(d) ",
															"content": [
																{
																	"text": "One menu box sign per business is permitted."
																}
															]
														},
														{
															"number": "(e) ",
															"content": [
																{
																	"text": "No menu box sign shall be placed on the Village\nright-of-way."
																}
															]
														}
													]
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "F. ",
							"content": [
								{
									"text": "General provisions."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "The area of a sign shall be determined by the smallest\nrectangle that encompasses all of the letters or symbols that make\nup the sign, together with the area of any background of a different\ncolor or material from the general finish of the building, whether\npainted or applied."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "The outlining by direct illumination of all or part\nof a building, such as a gable, roof, wall, side or corner, is prohibited\nexcept during the Christmas season."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "No rooftop signs shall be permitted in any district.[Amended 9-19-1995 by L.L. No. 7-1995]"
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "Illumination of signs shall be accomplished by means\nof shielded, direct, external, white light sources not exceeding 75\nwatts and in such a manner that no glare shall extend beyond the property\nlines or disturb the vision of passing motorists or constitute a hazard\nto traffic.[Amended 9-19-1995 by L.L. No. 7-1995; 11-23-1999 by L.L. No.\n7-1999]"
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "Portable signs are prohibited in all districts.[Added 11-23-1999 by L.L. No. 7-1999]"
												}
											]
										},
										{
											"number": "(6) ",
											"content": [
												{
													"text": "No sign shall distract from or obstruct historical\nbuildings and sites and unique natural or scenic features from public\nview.[Amended 9-19-1995 by L.L. No. 7-1995]"
												}
											]
										},
										{
											"number": "(7) ",
											"content": [
												{
													"text": "Billboard signs are prohibited in all districts, except\nthat the municipality may establish special public information centers\nwherein approved directional signs for businesses may be located."
												}
											]
										},
										{
											"number": "(8) ",
											"content": [
												{
													"text": "Nothing contained in this chapter shall be construed\nto prohibit the municipality or any other governmental agency from\nerecting and maintaining public signs deemed to be necessary in the\npublic interest."
												}
											]
										},
										{
											"number": "(9) ",
											"content": [
												{
													"text": "No flashing or moving signs shall be permitted in\nany district, except that such a sign may be permitted if the Board\nof Architectural Review and Historic Preservation finds that such\na sign contributes to a building's architectural or historic significance.[Amended 9-19-1995 by L.L. No. 7-1995]"
												}
											]
										},
										{
											"number": "(10) ",
											"content": [
												{
													"text": "Neon and neon-type signs, including all signs\nand designs consisting of glass tubing or other tubular arrangements\ncontaining gasses which, when permeated by electrical charge, result\nin production of light and which, when on the exterior of a building\nor in an interior portion of the building, are visible from the street,\nare prohibited in all districts of the Village, except that such a\nsign may be permitted if the Board of Architectural Review and Historic\nPreservation finds that such a sign contributes to a building's architectural\nor historic significance.[Added 4-13-1992 by L.L. No. 3-1992; amended 9-19-1995 by L.L. No. 7-1995]"
												}
											]
										},
										{
											"number": "(11) ",
											"content": [
												{
													"text": "Interior-lit translucent signs, including all\nsigns constructed of a translucent material and lit from behind by\na light source that causes the translucent material to be illuminated,\nare prohibited in all districts, unless such a sign is necessary to\ndirect the attention of the public to an emergency service facility.\nInterior-lit translucent signs located in an interior portion of a\nbuilding are included within the foregoing prohibition if such signs\nare visible from the street.[Added 9-19-1995 by L.L. No. 7-1995; amended 11-23-1999 by L.L. No.\n7-1999]"
												}
											]
										},
										{
											"number": "(12) ",
											"content": [
												{
													"text": "In the event that any business sign erected\nfor the purpose of denoting a business conducted or product sold on\nthe property where the sign is located no longer denotes a business\nactually conducted or product actually sold on the property where\nthe sign is located, such sign shall be removed within 30 days after\nwritten notice from the Building Inspector to the effect that such\nsign must be removed by reason of the occurrence of said event.[Added 11-23-1999 by L.L. No. 7-1999]"
												}
											]
										},
										{
											"number": "(13) ",
											"content": [
												{
													"text": "A detached or ground sign shall not be supported\nby a pylon or metal pole.[Added 11-23-1999 by L.L. No. 7-1999]"
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "G. ",
							"content": [
								{
									"text": "Procedures, permits and fees."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "No sign shall be erected within the Village of Southampton\nwithout first obtaining a permit from the Building Inspector and paying\nthe required fee for such permit, except as follows:[Amended 9-19-1995 by L.L. No. 7-1995]"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "Residence nameplates, street number signs, \"beware\" or \"caution\" signs, all not exceeding two square feet, accessory to one-family and two-family dwellings, shall not require a permit. A real estate sign (other than a real estate agency/brokerage sign) which advertises a one-family or two-family dwelling for sale or for rent shall not require a permit; such sign shall be subject to § 116-13I(1).[Amended 11-23-1999 by L.L. No. 7-1999]"
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "\"Exit\" and \"entrance\" signs shall not require\na permit. Such signs shall not exceed four feet in height measured\nfrom the ground level, shall have a maximum area of 200 square inches,\nand shall say \"exit\" or \"entrance\" only."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "A sign indicating that the property has an alarm\nsystem shall not require a permit. Such sign shall have a maximum\narea of one square foot.[Added 11-23-1999 by L.L. No. 7-1999]"
																}
															]
														},
														{
															"number": "(d) ",
															"content": [
																{
																	"text": "A permit is not required for the following:[Added 11-23-1999 by L.L. No. 7-1999] "
																},
																{
																	"content": [
																		{
																			"number": "[1] ",
																			"content": [
																				{
																					"text": "Window signs that consist of posters affixed to or placed within one foot of a window for the purposes set forth in and pursuant to § 116-13E(1)(d) or (e)."
																				}
																			]
																		},
																		{
																			"number": "[2] ",
																			"content": [
																				{
																					"text": "A garage sale sign pursuant to § 116-13I(3)."
																				}
																			]
																		},
																		{
																			"number": "[3] ",
																			"content": [
																				{
																					"text": "A political sign pursuant to § 116-13I(4)."
																				}
																			]
																		}
																	]
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Applications for sign permits shall be made upon forms\nprovided by the Building Inspector and shall include plans, specifications\nand other such information as the Building Inspector may require."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "The Building Inspector shall determine that such proposed\nsign complies with all the requirements of this chapter and all other\napplicable laws and regulations of the Village of Southampton before\nauthorizing issuance of a sign permit."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "No sign permit shall be issued prior to payment of\na fee of $75.[Amended 12-9-1988 by L.L. No. 8-1988; 11-9-2006]"
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "Each sign permit issued shall be assigned a permit\nnumber by the Building Inspector.[Amended 9-19-1995 by L.L. No. 7-1995]"
												}
											]
										},
										{
											"number": "(6) ",
											"content": [
												{
													"text": "Each sign for which a sign permit has been issued\nshall be inspected for adequate maintenance, freedom from any hazardous\ncondition and structural soundness each year. If such sign is found\nto be unsafe, the Building Inspector shall notify the owner, and the\nsign shall then become an illegal sign unless the condition is corrected\nwithin five days."
												}
											]
										},
										{
											"number": "(7) ",
											"content": [
												{
													"text": "No existing sign shall be structurally altered, rebuilt,\nenlarged, extended, relocated or modified in any way except in conformity\nwith the provisions of this section."
												}
											]
										},
										{
											"number": "(8) ",
											"content": [
												{
													"text": "Any sign requiring a sign permit which does not have\nsuch a permit or which has had its permit revoked shall be deemed\nto be an illegal sign.[Amended 4-9-1976 by L.L. No. 1-1976; 9-19-1995 by L.L. No. 7-1995]"
												}
											]
										},
										{
											"number": "(9) ",
											"content": [
												{
													"text": "No permit for a sign shall be issued by the Building\nInspector until the design thereof shall have been approved by the\nBoard of Architectural Review and Historic Preservation or a committee\nthereof if authorized by such Board to give such approval in its behalf.[Amended 9-19-1995 by L.L. No. 7-1995]"
												}
											]
										},
										{
											"number": "(10) ",
											"content": [
												{
													"text": "A real estate firm may obtain an annual permit from the Building Inspector for the real estate agency/brokerage sign to be utilized by such real estate firm during a particular calendar year. The application for such permit shall set forth the name and address of the real estate firm as well as the lettering to be included on such sign and shall include an annual permit fee of $75. Upon issuance of such permit, such real estate agency/brokerage sign may be placed on any lot or lots as to which signed consents are filed pursuant to § 116-13I(1)(h), subject to § 116-13I(1). Such annual permit shall expire on December 31 of each year. No real estate agency/brokerage sign shall be placed on any lot unless such real estate firm has obtained such annual permit.[Added 11-23-1999 by L.L. No. 7-1999; amended 11-9-2006]"
												}
											]
										},
										{
											"number": "(11) ",
											"content": [
												{
													"text": "A contractor and/or architect may obtain an annual permit from the Building Inspector for the construction sign to be utilized by such contractor and/or architect during a particular calendar year. The application for such permit shall set forth the name and address of the contractor and/or architect as well as the lettering to be included on such sign and shall include an annual permit fee of $75. Upon issuance of such permit, such construction sign may be placed on any lot or lots as to which signed consents are filed pursuant to § 116-13I(2)(c), subject to § 116-13I(2). Such annual permit shall expire on December 31 of each year. No construction sign shall be placed on any lot unless such contractor and/or architect has obtained such annual permit.[Added 11-23-1999 by L.L. No. 7-1999; amended 11-9-2006]"
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "H. ",
							"content": [
								{
									"text": "Design guidelines.[Added 9-19-1995 by L.L. No. 7-1995]"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Color. In selecting the principal colors for a sign,\ncolors which are in harmony with the general tone of the building\nshould be chosen. The use of neon, metallic or day-glow type colors\nare discouraged, and the use of muted and earth tone colors with a\nmatte finish are strongly encouraged."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Materials. Sign materials should be consistent with\nand complement the original construction materials and architectural\nstyle of the building on which they are to be displayed."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Lettering. Lettering styles should complement the\nstyle and period of the building on which they appear."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "I. ",
							"content": [
								{
									"text": "Additional regulations.[Added 11-23-1999 by L.L. No. 7-1999]"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Real estate signs. One real estate sign may be placed\non a lot, subject to the following regulations:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "If the lot is situate in a residence district,\nthe sign shall have a maximum area of three square feet. If the lot\nis situate in a nonresidential district, the sign shall have a maximum\narea of four square feet."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "The sign shall be of white post construction."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "The sign, including the post or posts when placed\nin the ground, shall not have a height of more than four feet above\nfinished grade or, if there is no finished grade, the sign shall not\nhave a height of more than four feet above the grade of the street\non which the property is located."
																}
															]
														},
														{
															"number": "(d) ",
															"content": [
																{
																	"text": "The sign shall display only \"for sale\" or \"for\nrent,\" \"exclusive\" or \"by appointment,\" the name of the real estate\nfirm or property owner and its, his or her telephone number and logo\nin nonmetallic medium or color. The sign may also display \"open house\"\nonly on the day of an \"open house.\" If the lot is situate in a nonresidential\ndistrict, the sign may also display the zoning district."
																}
															]
														},
														{
															"number": "(e) ",
															"content": [
																{
																	"text": "The sign shall be placed only parallel to the\nstreet."
																}
															]
														},
														{
															"number": "(f) ",
															"content": [
																{
																	"text": "The sign may be at the property line but shall\nbe off the Village right-of-way."
																}
															]
														},
														{
															"number": "(g) ",
															"content": [
																{
																	"text": "\"SOLD\" or \"IN CONTRACT\" signs are prohibited."
																}
															]
														},
														{
															"number": "(h) ",
															"content": [
																{
																	"text": "No real estate agency/brokerage sign shall be\nplaced on any lot unless there is filed with the Building Inspector\na written signed consent to the placement of such sign by the owner\nof such lot. The consent shall set forth the name of the owner, the\naddress and Tax Map number of the property, the name of the real estate\nfirm as to which consent has been given and the length of time the\nconsent shall be effective. The owner shall have the right to revoke\nthe consent at any time by filing a written revocation with the Building\nInspector. The revocation shall set forth the name of the owner, the\naddress and Tax Map number of the property, the name of the real estate\nfirm as to which consent has been revoked, the date the revocation\nis to be effective, which date cannot be less than five days from\nthe date of the filing of the revocation, and a statement that the\nreal estate firm has been notified in writing of the revocation and\nthe effective date of revocation."
																}
															]
														},
														{
															"number": "(i) ",
															"content": [
																{
																	"text": "The sign shall be removed no later than five\ndays of the date of the following (whichever first occurs):"
																},
																{
																	"content": [
																		{
																			"number": "[1] ",
																			"content": [
																				{
																					"text": "The termination date of the consent or the revocation\ndate of the consent."
																				}
																			]
																		},
																		{
																			"number": "[2] ",
																			"content": [
																				{
																					"text": "The transfer of title to the property in the\nevent of a sale."
																				}
																			]
																		},
																		{
																			"number": "[3] ",
																			"content": [
																				{
																					"text": "The execution of a lease by all parties in the\nevent of a rental."
																				}
																			]
																		}
																	]
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Construction signs. One construction sign may be placed\non a lot, subject to the following regulations:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "The sign shall have a maximum area of three square feet, except as otherwise provided in Subsection I(2)(b) below for a special construction sign.[Amended 4-14-2000 by L.L. No. 3-2000]"
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "A \"special construction sign\" shall mean a construction\nsign consisting of sign area for one contractor and sign area for\none architect. A special construction sign shall have a maximum area\nof five square feet, and thus the total of the sign area for the contractor\nand the sign area for the architect shall not exceed five square feet.[Amended 4-14-2000 by L.L. No. 3-2000]"
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "No construction sign shall be placed on any\nlot unless there is filed with the Building Inspector a written signed\nconsent to the placement of such sign by the owner of such lot. The\nconsent shall set forth the name of the owner, the address and the\nTax Map number of the property, the name of the contractor and/or\narchitect as to which consent has been given and the length of time\nthe consent shall be effective. The owner shall have the right to\nrevoke the consent at any time by filing a written revocation with\nthe Building Inspector. The revocation shall set forth the name of\nthe owner, the address and Tax Map number of the property, the name\nof the contractor and/or architect as to which consent has been revoked,\nthe date the revocation is to be effective, which date cannot be less\nthan five days from the date of the filing of the revocation, and\na statement that the contractor and/or architect has been notified\nin writing of the revocation and the effective date of revocation."
																}
															]
														},
														{
															"number": "(d) ",
															"content": [
																{
																	"text": "The sign shall be removed no later than five\ndays of the date of the following (whichever first occurs):"
																},
																{
																	"content": [
																		{
																			"number": "[1] ",
																			"content": [
																				{
																					"text": "The termination date of the consent or the revocation\ndate of the consent."
																				}
																			]
																		},
																		{
																			"number": "[2] ",
																			"content": [
																				{
																					"text": "The last day the contractor or architect completes\nthe work for which the contractor or architect was employed."
																				}
																			]
																		},
																		{
																			"number": "[3] ",
																			"content": [
																				{
																					"text": "The certificate of occupancy/compliance has\nbeen issued."
																				}
																			]
																		}
																	]
																}
															]
														},
														{
															"number": "(e) ",
															"content": [
																{
																	"text": "No construction sign shall be placed on any\npart of a lot facing the water; the sign must be placed only facing\nthe street."
																}
															]
														},
														{
															"number": "(f) ",
															"content": [
																{
																	"text": "The sign may be at the property line but shall\nbe off the Village right-of-way."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Garage sale signs."
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "One garage sale sign may be placed on the property\nwhere the sale is being conducted, subject to the following regulations:"
																},
																{
																	"content": [
																		{
																			"number": "[1] ",
																			"content": [
																				{
																					"text": "The sign shall have a maximum area of four square\nfeet."
																				}
																			]
																		},
																		{
																			"number": "[2] ",
																			"content": [
																				{
																					"text": "The sign shall be nonilluminated."
																				}
																			]
																		},
																		{
																			"number": "[3] ",
																			"content": [
																				{
																					"text": "The sign shall be displayed only during the\nsale and shall be immediately removed after the sale."
																				}
																			]
																		},
																		{
																			"number": "[4] ",
																			"content": [
																				{
																					"text": "The sign shall be displayed for a maximum period\nof three consecutive days. The sale shall not exceed a period of three\nconsecutive days."
																				}
																			]
																		}
																	]
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "A permit is not required for a garage sale sign."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "No garage sale sign shall be placed on the Village\nright-of-way. No garage sale sign shall be placed on property other\nthan the property where the sale is being conducted."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "Political signs."
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "Political signs may be displayed for no more\nthan 70 days prior to an election and 10 days after an election."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "Political signs shall be located off the Village\nright-of-way."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "A permit is not required for a political sign."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "Noncommercial messages on signs."
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "The term \"noncommercial message\" includes any\nmessage which constitutes constitutionally protected noncommercial\nspeech."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "Nothing in this chapter shall be construed to prohibit a sign which is otherwise permitted by this chapter from containing a noncommercial message in place of the message provided for in this chapter, subject to all other requirements (all requirements other than the content of the message) of this chapter. Since § 116-13F(7) prohibits billboard signs in all districts (except for special public information centers which may be established by the municipality), the foregoing provision [to wit, § 116-13I(5)(b)] shall not be construed as allowing a sign containing a noncommercial message in place of a prohibited billboard sign."
																}
															]
														}
													]
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "J. ",
							"content": [
								{
									"text": "Compulsory termination of nonconforming signs.[Added 11-23-1999 by L.L. No. 7-1999]"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Anything to the contrary in this chapter notwithstanding, every nonconforming sign which lawfully exists as of the effective date of this Subsection J shall become an unlawful structure on the date hereinafter specified and shall thereupon be removed, except as otherwise provided in Subsection J(2)."
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "Any nonconforming sign (except a portable sign and a nonretractable awning) which lawfully exists as of the effective date of this Subsection J on property used for a business use shall become an unlawful structure upon a transfer of ownership occurring prior to January 1, 2003, and shall be removed within 30 days after the date of said transfer. In the event that a transfer of ownership does not occur prior to January 1, 2003, compulsory termination of said sign is governed by Subsection J(1)(b) and (c) below. As used herein, a transfer of ownership includes the following: a transfer of ownership of said sign; a transfer of ownership of the entity which conducts said business; a transfer of the right to use said sign from the entity which conducts said business to an entity which conducts another business."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "Any nonconforming sign (except a portable sign and a nonretractable awning) which lawfully exists as of the effective date of this Subsection J pursuant to a permit issued after January 1, 1998, shall become an unlawful structure on the date five years after issuance of said permit and shall thereupon be removed."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "Every other nonconforming sign (except a portable sign and a nonretractable awning) which lawfully exists as of the effective date of this Subsection J shall become an unlawful structure on January 1, 2003, and shall thereupon be removed."
																}
															]
														},
														{
															"number": "(d) ",
															"content": [
																{
																	"text": "Every portable sign which lawfully exists as of the effective date of this Subsection J shall become an unlawful structure on January 1, 2000, and shall thereupon be removed."
																}
															]
														},
														{
															"number": "(e) ",
															"content": [
																{
																	"text": "Every nonretractable awning which lawfully exists\nas of the effective date of this Subsection J shall become an\nunlawful structure on January 1, 2004, and shall thereupon be removed."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Exceptions."
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "A nonconforming sign which lawfully exists as of the effective date of this Subsection J by reason of and pursuant to a variance for said sign granted by the Zoning Board of Appeals is hereby excepted from the compulsory termination provisions set forth in Subsection J(1)."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "A nonconforming identification sign which lawfully exists as of the effective date of this Subsection J on property situate in a residence district is hereby excepted from the compulsory termination provisions set forth in Subsection J (1)."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Intent of Subsection J."
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "The effective date of this Subsection J means the effective date of the local law enacting Subsection J."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "Every nonconforming sign which lawfully exists as of the effective date of this Subsection J includes signs which were nonconforming prior to enactment of said local law and signs which became nonconforming as a result of enactment of said local law (to wit, signs which became nonconforming as a result of other provisions in the local law enacting Subsection J)."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "With respect to a nonconforming sign which lawfully exists as of the effective date of Subsection J pursuant to a permit issued prior to the effective date of Subsection J, it is the intent of Subsection J(1)(b) and (c) to require removal of such nonconforming sign on the date about three years after the effective date of Subsection J (on January 1, 2003, the anticipated effective date of Subsection J being prior to or about January 1, 2000) or the date five years after issuance of the permit, whichever date provides a longer period. If the permit was issued prior to January 1, 1998, Subsection J(1)(c) would apply (January 1, 2003, would provide a longer period); if the permit was issued after January 1, 1998, Subsection J(1)(b) would apply (the date five years after issuance of the permit would provide a longer period)."
																}
															]
														},
														{
															"number": "(d) ",
															"content": [
																{
																	"text": "It is the intent of Subsection J(1) that every nonconforming sign required to be removed pursuant thereto shall be removed on January 1, 2003, the date specified in Subsection J(1)(c), unless a different removal date is applicable pursuant to Subsection J(1)(a), (b), (d) or (e)."
																}
															]
														},
														{
															"number": "(e) ",
															"content": [
																{
																	"text": "It is the intent of Subsection J(1) to require removal of every nonconforming sign which lawfully exists as of the effective date of Subsection J, except for the exceptions expressly set forth in Subsection J(2)."
																}
															]
														},
														{
															"number": "(f) ",
															"content": [
																{
																	"text": "Since identification signs are generally prohibited in all residence districts, existing identification signs directing attention to nonconforming business uses in residence districts would generally be nonconforming identification signs. If a nonconforming business use in a residence district were required to remove its lawfully existing identification sign, such use would be prohibited from having any identification sign. Rather than prohibiting such use from having any identification sign, Subsection J(2)(b) provides that a nonconforming identification sign which lawfully exists on property situate in a residence district is excepted from the compulsory termination provisions set forth in Subsection J(1)."
																}
															]
														}
													]
												}
											]
										}
									]
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 116-14",
			"title": "Off-street parking, truck loading space and curb cut construction.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "General. Off-street parking and truck loading spaces\nshall be provided and kept available as an accessory use to all permitted\nand special exception uses of buildings, structures and lots in amounts\nnot less than those specified in this section."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Method of determining off-street parking space requirements."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "The requirement for a single use (e.g., a one-family\ndwelling or a retail store) shall be determined directly from the\nschedule of such requirements which is a part of this section."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "The requirement for a combination use made up of several\ncomponent uses (e.g., a bowling alley combined with an auditorium,\nand a restaurant and bar, or a retail store combined with an office\nbuilding) shall be determined by establishing the requirement for\neach component use from the schedule of such requirements which is\na part of this section and adding them together."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "When the required number of spaces is determined to\nresult in a fraction, it shall be increased to the next highest whole\nnumber."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "If the use is not specifically listed in the schedule\nof such requirements, the requirement shall be the same as for the\nmost similar use listed."
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "A garage or carport may be used to meet the requirements\nof this section. A driveway may only be used to meet the requirements\nof this section where it serves a one-family or two-family dwelling."
												}
											]
										},
										{
											"number": "(6) ",
											"content": [
												{
													"text": "Uses which require approval pursuant to the special exception use procedure set forth in § 116-21 of this chapter may be required to provide off-street parking spaces in excess of the requirements of this section, as indicated in § 116-22I of this chapter."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Schedule of off-street parking space requirements\nfor residential uses."
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "Schedule of off-street parking space requirements\nfor nonresidential uses."
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "Off-street truck loading space requirements. Every\nbuilding or structure or lot used for nonresidential purposes shall\nbe provided with off-street truck loading spaces in accordance with\nthe following schedule:"
								}
							]
						},
						{
							"number": "F. ",
							"content": [
								{
									"text": "Supplemental regulations for private garage or off-street\nparking areas in residence districts."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Not more than two parking spaces per dwelling unit\nmay be rented to persons living off the premises in the case of a\none-family or two-family dwelling use; nor more than one parking space\nper each two dwelling units may be rented to persons living off the\npremises in the case of any other residence use."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Not more than one commercial vehicle shall be housed\nor parked in a private garage or off-street parking area. Such commercial\nvehicle shall not exceed a gross motor vehicle weight of 10,000 pounds\nor 25 feet in length."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "G. ",
							"content": [
								{
									"text": "Access driveway requirements."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Private garages, public parking areas, filling stations\nand repair garages may have separate or combined entrances."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Every separate entrance or exit driveway shall have\na minimum unobstructed width of 12 feet on the street. Every combined\nentrance and exit driveway shall have a minimum unobstructed width\nof 24 feet on the street, except for one-family residence, where the\nminimum shall be 10 feet.[Amended 3-19-1991 by L.L. No. 2-1991]"
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "The intersection of a separate or combined exit and entrance driveway of a public parking area with the public street shall have the same corner clearance as prescribed for intersecting streets in § 116-16 of this chapter."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "The gradient of driveways shall be such as to facilitate\nentrance and exit traffic flow."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "H. ",
							"content": [
								{
									"text": "Driveway, curb and sidewalk construction.[Added 10-17-1989 by L.L. No. 15-1989[1]]"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "No driveway, curb cut, curb return or sidewalk will\nbe constructed connecting the abutting property to a Village street\nwithout a permit therefor, as hereinafter provided, and except in\nconformity with the provisions of this Article. The filing fee for\nsuch application for such permit shall be $200 or such other amount\nas the Village Board of Trustees may hereafter fix and establish from\ntime to time by resolution.[Amended 8-13-2009 by L.L. No. 4-2009]"
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Driveways crossing curblines and sidewalks shall not\nbe less than 10 feet."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Not more than one curb cut shall be permitted for\neach parcel, except that one additional curb cut may be permitted\nfor a parcel which has at least 100 feet of frontage on a Village\nstreet. In the case of a corner lot, such corner lot shall be permitted\nto have one curb cut on each street on which such lot has frontage\n(amounting to a total of two curb cuts), and in the event that such\ncorner lot has at least 100 feet of frontage on one of the streets,\none additional curb cut may be permitted on such street (amounting\nto a total of three curb cuts).[Amended 8-13-2009 by L.L. No. 4-2009]"
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "Application for a permit to construct a driveway,\ncurb cut, curb return or sidewalk shall be made to the Building Inspector\nof the Village and shall contain such information as the Building\nInspector shall require, including a description of the proposed construction\nand its location. Application for such permit shall include a survey\nlocating any existing driveway and the proposed driveway, locating\nexisting trees within the right-of-way of the Village street and locating\nany proposed trees within the right-of-way of the Village street.\nIf removal of any existing tree within the right-of-way of the Village\nstreet is proposed, or if planting of any tree within the right-of-way\nof the Village street is proposed, such permit shall not be issued\nwithout the written approval of the Superintendent of Public Works.[Amended 10-9-2008 by L.L. No. 8-2008]"
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "All driveways, curb cuts, curb returns and sidewalks\nand similar improvements shall be constructed at the total expense\nof the abutting property owner. The surface between the property line\nand the pavement of the Village street shall be asphalt, concrete\nor Belgian block."
												}
											]
										},
										{
											"number": "(6) ",
											"content": [
												{
													"text": "In any case where a circular driveway is proposed to be constructed, no permit shall be issued therefor unless the plans therefor include an accessory off-street parking area for the off-street parking as required by this chapter. In residence districts, a permit for the accessory off-street parking area is required pursuant to § 116-9B(1) of this chapter.[Amended 8-13-2009 by L.L. No. 4-2009; 7-21-2015 by L.L. No. 3-2015]"
												}
											]
										},
										{
											"number": "(7) ",
											"content": [
												{
													"text": "The owner of the premises responsible for such construction\nof a driveway, curb cut, curb return or sidewalk, without a permit\nor otherwise in conformity with a permit, may be required to remove\nthe same; and, upon failure to do so, the same may be removed by the\nVillage and the cost thereof certified to the Board of Trustees, by\nthe Building Inspector, and assessed against the property of such\nowner or collected by the Village from such owner by other legal proceedings."
												}
											]
										}
									]
								},
								{
									"footnote": "[1]\nEditor's Note: Pursuant to the inclusion of this local law, former Subsections H and I were redesignated as Subsections I and J, respectively.\n"
								}
							]
						},
						{
							"number": "I. ",
							"content": [
								{
									"text": "Design requirements for nonresidential parking and\ntruck loading areas."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "All accessory off-street parking and truck loading areas shall be located in accordance with the provisions of § 116-9A of this chapter."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "The physical improvements of off-street parking and\ntruck loading areas shall include:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "Curbs, paving, sidewalks and drainage facilities\ncomplying with the standards established in municipal ordinances,\nregulations or specifications."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "Adequate lighting in public parking areas to\nassure the general safety and convenience of the public."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "Appropriate screening for the protection of adjacent properties, particularly along district boundary lines as provided in § 116-11D(7) of this chapter."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "All aisles within parking areas shall have a minimum\nwidth of 24 feet when the parking spaces are at a ninety-degree angle\nwith the aisle; 18 feet when the parking spaces are at a sixty-degree\nangle; and 12 feet when the parking spaces are at a forty-five-degree\nangle."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "Aisles and turning areas shall provide good internal\ncirculation with adequate radii to assure ease of mobility, ample\nclearance and convenient access. All aisles not adjacent to parking\nstalls and permitting two-way traffic flow shall have a minimum width\nof 24 feet. All aisles not adjacent to parking stalls and permitting\nonly one-way traffic flow shall have a minimum width of 12 feet.[Amended 3-19-1991 by L.L. No. 2-1991]"
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "Center-line gradients of aisles shall not exceed 8%."
												}
											]
										},
										{
											"number": "(6) ",
											"content": [
												{
													"text": "Accessory off-street parking areas shall be marked\noff into parking spaces either with a minimum width of nine feet and\na minimum length of 19 feet or with a minimum width of 10 feet and\na minimum depth of 18 feet or, in the case of parking spaces for trucks\nor special equipment, parking spaces of a minimum size to be determined\nby the municipality, based on the nature of the parked vehicle.[Amended 3-19-1991 by L.L. No. 2-1991]"
												}
											]
										},
										{
											"number": "(7) ",
											"content": [
												{
													"text": "An accessory off-street truck loading space shall\nhave a minimum width of 12 feet, a minimum length of 25 feet and a\nminimum clear height of 14 feet. The related aisles or driveways shall\nhave the same minimum width and clear height."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "J. ",
							"content": [
								{
									"text": "Exemptions and waivers. Existing buildings and uses\nare exempt as follows:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "The provisions of this section shall not apply to\nany building or structure or lot lawfully in use at the effective\ndate of this chapter, whether continued as a permitted use or as a\nlegal nonconforming use or thereafter converted or changed without\nenlargement to a different lawful use having the same parking and\ntruck loading requirements."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "However, no building or structure or lot lawfully\nin use at the effective data of this chapter shall be enlarged unless\nthe off-street parking and truck loading space requirements of this\nsection are complied with to the same extent as would be required\nif the entire preexisting building or structure or lot and the proposed\nenlargement were being submitted as if it were a new application for\na building permit for the entire project; except that credit shall\nbe given for the off-street parking and loading spaces that would\nhave been required for the existing buildings, structures and uses\nif they did not have preexisting status. It is intended by this provision\nthat additional off-street parking and truck loading spaces shall\nbe provided with respect to the proposed enlargement, but no additional\nspaces shall be required with respect to the preexisting portions.\nHowever, spaces actually provided at or prior to the time of the application,\neven if voluntary or informal and unpaved, shall be charged to the\npreexisting portions and shall be formalized and paved incident to\nconstruction of the addition.[Amended 12-9-1983 by L.L. No. 13-1983]"
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "K. ",
							"content": [
								{
									"text": "VB District.[Added 4-11-2013 by L.L. No. 2-2013]"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "In accordance with the Village comprehensive plan update for the VB District (entitled Southampton Village Center Zoning & Architectural Design Guidelines, dated January 7, 2013) and § 116-38B(2), in order to eliminate multiple entrances and exits, reduce traffic hazards, gain a higher efficiency in vehicular and pedestrian circulation, conserve space and to promote orderly development, shared parking facilities shall be provided between adjacent lots to serve a number of uses in such a manner as to obtain the maximum efficiency in parking and vehicular circulation, except where it is not physically feasible."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Shared\nalleyways for pedestrian and/or vehicular traffic shall be provided\nto connect public streets to parking areas to the rear of buildings.\nAlleyways shall be provided a maximum of 235 feet from the nearest\nintersection or alleyway and shall include a minimum sidewalk depth\nof five feet."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Vehicular\naccess to parking areas shall be provided by shared alleyways in lieu\nof individual lot curb cuts."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "Permeable\npavement shall be used for all alleyways and parking areas."
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "Parking requirements shall be 60% of the spaces set forth in § 116-14D, Schedule of off-street parking space requirements for nonresidential uses."
												}
											]
										},
										{
											"number": "(6) ",
											"content": [
												{
													"text": "Parking\nrequirements for residential uses shall be one space for a one-bedroom\nunit, 1.5 spaces for a two-bedroom unit, and an additional 0.5 space\nfor each additional bedroom."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "L. ",
							"content": [
								{
									"text": "Method of determining off-street parking space requirements for one-family\ndwellings.[Added 7-21-2015 by L.L.\nNo. 3-2015]"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Pursuant to § 116-14C, the required number of off-street parking spaces for a one-family dwelling consists of two spaces, plus one additional space for each bedroom in excess of three bedrooms. For the purpose of determining such required number of off-street parking spaces:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "Rooms designed or designated as bedrooms shall be counted as\nbedrooms and shall be included in the overall bedroom count for the\ndwelling."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "The following rooms shall not be counted as bedrooms and shall\nnot be included in the overall bedroom count for the dwelling:"
																},
																{
																	"content": [
																		{
																			"number": "[1] ",
																			"content": [
																				{
																					"text": "Kitchen."
																				}
																			]
																		},
																		{
																			"number": "[2] ",
																			"content": [
																				{
																					"text": "One living room."
																				}
																			]
																		},
																		{
																			"number": "[3] ",
																			"content": [
																				{
																					"text": "One dining room."
																				}
																			]
																		},
																		{
																			"number": "[4] ",
																			"content": [
																				{
																					"text": "One family room (if omitted from floor plan, another room such\nas a den, study or office may be substituted in its place)."
																				}
																			]
																		},
																		{
																			"number": "[5] ",
																			"content": [
																				{
																					"text": "Bathrooms."
																				}
																			]
																		},
																		{
																			"number": "[6] ",
																			"content": [
																				{
																					"text": "Open basement/utility room."
																				}
																			]
																		},
																		{
																			"number": "[7] ",
																			"content": [
																				{
																					"text": "Foyer."
																				}
																			]
																		},
																		{
																			"number": "[8] ",
																			"content": [
																				{
																					"text": "Garage."
																				}
																			]
																		}
																	]
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "The following rooms shall be counted as bedrooms and shall be\nincluded in the overall bedroom count for the dwelling:"
																},
																{
																	"content": [
																		{
																			"number": "[1] ",
																			"content": [
																				{
																					"text": "Studies."
																				}
																			]
																		},
																		{
																			"number": "[2] ",
																			"content": [
																				{
																					"text": "Offices."
																				}
																			]
																		},
																		{
																			"number": "[3] ",
																			"content": [
																				{
																					"text": "Play rooms."
																				}
																			]
																		},
																		{
																			"number": "[4] ",
																			"content": [
																				{
																					"text": "Media rooms."
																				}
																			]
																		},
																		{
																			"number": "[5] ",
																			"content": [
																				{
																					"text": "Any other room not listed in Subsection L(1)(b) above."
																				}
																			]
																		}
																	]
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Notwithstanding the foregoing, the Building Inspector may exclude from the overall bedroom count for the dwelling any room listed in Subsection L(1)(c) above if the Building Inspector reasonably determines that future use of such room as a bedroom is not feasible or practical, provided that such determination is made in a written determination setting forth the basis for same."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Notwithstanding any provision in this chapter to the contrary, in the case of reconstruction of an existing one-family dwelling in whole or in part, the provisions set forth in Subsection L(1) above shall apply if the cost of the proposed reconstruction equals or exceeds 50% of the full replacement cost of the existing dwelling at the time of reconstruction. It is the intent of the foregoing that, with respect to a project involving an existing one-family dwelling, whether characterized as involving demolition of the existing dwelling and construction of a new dwelling or characterized as involving reconstruction of the existing dwelling, the provisions set forth in Subsection L(1) above shall apply if the cost of the proposed project equals or exceeds 50% of the full replacement cost of the existing dwelling at the time of the project."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "M. ",
							"content": [
								{
									"text": "Design requirements for accessory off-street parking areas for one-family\ndwellings.[Added 7-21-2015 by L.L.\nNo. 3-2015]"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Off-street parking areas shall be designed so that each required\noff-street parking space has a minimum width of 10 feet and a minimum\nlength of 18 feet."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Off-street parking areas shall be designed so that each required\noff-street parking space is provided convenient access at a time when\nmotor vehicles are parked in all required off-street parking spaces.\nIf at such time access from a particular required off-street parking\nspace to the street would necessitate moving more than one other motor\nvehicle (more than one motor vehicle other than the motor vehicle\nparked in such particular required-off-street parking space) parked\nin required off-street parking spaces, such particular off-street\nparking space does not meet the standard that such particular off-street\nparking space be provided convenient access. In other words, stacking\nof required off-street parking spaces in a manner which does not meet\nsuch standard of convenient access is not allowed."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Where a driveway is used to provide required off-street parking spaces, use of a driveway for such purpose shall be subject to the design requirements set forth in this Subsection M, and the term \"off-street parking area\" shall be deemed to include each required off-street parking space provided in a driveway."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "Off-street parking areas in residence districts are required to be located in accordance with the setback requirements set forth in § 116-9B(1)."
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "Off-street parking areas in residence districts require a permit from the Building Inspector in accordance with the provisions set forth in § 116-9B(1)."
												}
											]
										}
									]
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 116-15",
			"title": "Courts and spacing of buildings.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Outer courts or spaces."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "The least width at the lowest level of an outer court\nor of a space between building walls shall be not less than the largest\nof the following three dimensions:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "One-third of the maximum building height above\nsuch lowest level of the building walls erected on the same spot and\nbounding such court or space."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "Two-thirds of the horizontal depth of such court\nor space."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "Fifteen feet."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "The horizontal depth of an outer court or of a space\nbetween building walls shall not exceed 1 1/2 times the least\nwidth."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Inner courts or spaces. The least horizontal dimension\nof an inner court at its lowest level shall be not less than the larger\nof the following two dimensions:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Two-thirds of the maximum building height above such\nlowest level of the building walls erected on the same lot and bounding\nsuch court or space."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Fifteen feet."
												}
											]
										}
									]
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 116-16",
			"title": "Corner clearance.",
			"content": [
				{
					"text": "On a corner lot in any district, except in districts\nwhere there is no minimum lot area requirement, within the triangular\narea determined as provided in this section, no wall or fence or other\nstructure shall be erected to a height in excess of 30 inches, and\nno vehicle, object or any other obstruction of a height in excess\nof 30 inches shall be parked or placed, and no hedge, shrub or other\ngrowth shall be maintained at a height in excess of 30 inches, except\nthat trees whose branches are trimmed away to a height of at least\n10 feet above the curb level, or pavement level where there is no\ncurb, shall be permitted. Such triangular area shall be determined\nby two points, one on each intersecting street line, each of which\npoints is 20 feet from the intersection of such street lines."
				}
			]
		},
		{
			"paragraph": "§ 116-17",
			"title": "Minimum residential floor area.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Statement of purpose. The requirements contained in\nthis section are designed to promote and protect the public health,\nto prevent overcrowded living conditions, to guard against the development\nof substandard neighborhoods, to conserve established property values\nand to contribute to the general welfare."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Minimum schedule. Every dwelling or other building\ndevoted in whole or in part to a residential use which is hereafter\nerected or is hereafter converted to accommodate additional families\nshall provide a minimum floor area per family, on floors with clear\nceiling height of not less than seven feet six inches, in conformity\nwith the following schedule and with the other provisions of this\nsection. The minima stipulated herein shall be deemed to be exclusive\nof unenclosed porches, breezeways, garage areas and basement and cellar\nrooms or areas."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "One-family and two-family detached dwellings."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Apartment dwelling units, where permitted."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Mobile homes: not permitted."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Least overall dimension. The least overall dimension\nof any minimum required first floor area of a dwelling shall be 20\nfeet."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 116-17.1",
			"title": "Maximum gross floor area of dwellings in certain residence districts (R-120, R-80, R-60, R-40, R-20, R-12.5, R-7.5 and MF-20).",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "As used herein, the term \"gross floor area of a dwelling\"\nshall include the total gross horizontal area of all floors of a dwelling\nmeasured to the exterior of the outside walls, including the horizontal\nfloor area of any enclosed breezeway-type structure that is part of\nthe dwelling and the horizontal floor area of any enclosed porch,\nbut excluding the following:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "The floor area of a cellar shall be excluded\nin calculating the gross floor area."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "The floor area of a half story shall be excluded\nin calculating the gross floor area to the extent that the half story\nhas a ceiling height of at least 7 1/2 feet over not more than\n1/3 of the total floor area of the half story. If the half story has\na ceiling height of at least 7 1/2 feet over more than 1/3 of\nthe total floor area of the half story, the excess (the portion of\nthe floor area having a ceiling height of at least 7 1/2 feet\nwhich exceeds 1/3 of the total floor area of the half story) shall\nbe included in calculating the gross floor area.[Amended 10-11-2007 by L.L. No. 10-2007]"
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Any floor area under the roof of a roofed porch,\ndeck, patio, balcony or similar roofed structure attached to the dwelling\nshall be excluded in calculating the gross floor area, provided that\nthe roofed porch, deck, patio, balcony or similar roofed structure\nis not enclosed so as to be habitable space."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "The floor area of a garage that is part of the\ndwelling shall be excluded to the following extent in calculating\nthe gross floor area:[Amended 10-11-2007 by L.L. No. 10-2007]"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "In districts requiring 20,000 square feet of\nlot area or less, the floor area of such garage shall be excluded\nto the extent of 520 square feet. (If the floor area of such garage\nexceeds 520 square feet, the excess shall be included in calculating\nthe gross floor area.)"
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "In districts requiring more than 20,000 square\nfeet of lot area, the floor area of such garage shall be excluded\nto the extent of 800 square feet. (If the floor area of such garage\nexceeds 800 square feet, the excess shall be included in calculating\nthe gross floor area."
																}
															]
														}
													]
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "The maximum gross floor area of a dwelling within\nall one-family residence districts (the R-120, R-80, R-60, R-40, R-20,\nR-12.5 and R-7.5 Residence Districts) and the MF-20 Multifamily Residence\nDistrict shall be 12% of the lot area of the lot, plus 1,500 square\nfeet.[Amended 10-11-2007 by L.L. No. 10-2007]"
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "In the case of a lot where the maximum gross floor area limitation calculated pursuant to Subsection B above would permit a dwelling having more than 18,000 square feet of gross floor area, the maximum gross floor area limitation applicable to such lot shall be 18,000 square feet. It is the intent of this provision that, notwithstanding Subsection B above, the gross floor area of a dwelling shall not exceed 18,000 square feet under any circumstance."
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "Gross floor area shall be calculated and certified\nas correct by a New York State licensed architect, professional engineer\nor surveyor."
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "Supplemental regulations in the R-7.5, R-12.5 and R-20 Residence Districts. It is the intent of this Subsection E to provide an incentive to further reduce the size of dwellings in the R-7.5, R-12.5 and R-20 Residence Districts. Pursuant to Subsection A(4) above, the floor area of a garage that is part of a dwelling is excluded in calculating the gross floor area of the dwelling to the extent of 520 square feet. Pursuant thereto, a dwelling may consist of the maximum gross floor area plus 520 square feet of attached garage floor area. In order to provide an incentive to modify and reduce the size of such a dwelling by eliminating the plus 520 square feet of attached garage floor area, this subsection E provides for modifying and reducing the minimum setback requirement from side and rear lot lines for a detached garage from the minimum setback which would otherwise be applicable under § 116-11.1 to a minimum setback of five feet. A detached garage to be constructed pursuant to this authorization would be subject to all other applicable requirements and regulations, including the Pyramid Law (§ 116-12E) and landscape screening (§ 116-32G).[Added 10-11-2007 by L.L. No. 10-2007]"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Notwithstanding the minimum setback requirement from side and rear lot lines for accessory buildings set forth in § 116-11.1, a detached garage having a minimum setback of five feet from side and rear lot lines may be permitted on lots having a lot area of 20,000 square feet or less in the R-7.5, R-12.5 and R-20 Residence Districts, provided that the detached garage conforms with all other applicable requirements, provided that the modified minimum setback from side and rear lot lines for the detached garage is approved by the Board of Architectural Review and Historic Preservation incident to granting architectural review approval pursuant to § 116-32, and provided that the dwelling on such lot complies with the provisions set forth in Subsection E(2) below."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "The exclusion from gross floor area set forth in Subsection A(4) above shall not be applicable in the case of a lot which utilizes the modified minimum setback for a detached garage authorized by Subsection E(1) above. In the case of such a lot, the entire floor area of a garage that is part of the dwelling shall be included in calculating the gross floor area. In the case of such a lot, the gross floor area of the dwelling, including the entire floor area of any garage that is part of the dwelling, shall not exceed the maximum gross floor area set forth in Subsection B above."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "In the event of approval by the Board of Architectural Review and Historic Preservation pursuant to Subsection E(1) above, the modified minimum setback from side and rear lot lines approved by said Board shall constitute the applicable minimum setback requirement from side and rear lot lines for the approved detached garage. Use of such detached garage shall be limited to garage use and shall not be changed to any other use without a variance."
												}
											]
										}
									]
								}
							]
						}
					]
				},
				{
					"footnote": "[1]\nEditor's Note: This local law also provided\nthat applications for building permits filed prior to 2-1-2003 would\nbe exempt from the provisions of this section.\n"
				}
			]
		},
		{
			"paragraph": "§ 116-18",
			"title": "Permitted fences and walls.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "In a residence district."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "No fence or wall in a required front yard shall have\na height greater than four feet."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "No fence or wall in a required rear or side yard shall\nhave a height greater than six feet."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Any such fence shall have the face or finished side\nthereof facing the property line of the adjacent owner or adjacent\nstreet. The Building Inspector shall designate which side of the fence\nis the finished or face side of the fence.[Added 3-11-1977 by L.L. No. 1-1977]"
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "A gate and/or gateposts at a driveway entrance or\nexit may exceed the foregoing height limitation but shall not exceed\neight feet in height and for not more than an aggregate width of 25\nfeet.[Added 12-9-1983 by L.L. No. 11-1983]"
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "A gate and/or gateposts at a driveway entrance or\nexit shall have a minimum setback of 18 feet from the edge of street\npavement on the street right-of-way and shall not encroach upon the\nstreet right-of-way. In a case where the distance from the edge of\nstreet pavement on the street right-of-way to the front lot line is\nless than 18 feet, the foregoing is intended to require a setback\nfrom the front lot line sufficient to achieve a setback of 18 feet\nfrom the edge of street pavement on the street right-of-way. In a\ncase where the distance from the edge of street pavement on the street\nright-of-way to the front lot line is more than 18 feet, the foregoing\nis intended to require a setback of more than 18 feet from the edge\nof street pavement on the street right-of-way, so that the gate and/or\ngateposts will not encroach upon the street right-of-way.[Added 11-13-2008 by L.L. No. 11-2008]"
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "In a nonresidence district."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "No fence or wall within 10 feet of a lot line in a\nrequired front or side yard shall have a height greater than six feet."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "No fence or wall within 10 feet of a lot line in a\nrequired rear yard shall have a height greater than 10 feet."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Any such fence shall have the face or finished side\nthereof facing the property line of the adjacent owner or adjacent\nstreet. The Building Inspector shall designate which side of the fence\nis the finished or face side of the fence.[Added 3-11-1977 by L.L. No. 1-1977]"
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Method of measuring the height of a fence or wall. The height of a fence or wall shall be measured from the ground level at the base of the fence; except that where there is a retaining wall, the height shall be measured from the average of the ground levels at each side of the retaining wall, and, further, except that any fence or wail on the uphill side of such retaining wall may be at least four feet high, notwithstanding the provisions of Subsections A and B above."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 116-18.1",
			"title": "Berms.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Construction and vegetation."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "All berms shall be constructed so that all sides\nof the berm shall not have a slope greater than one to three feet.\nFor the purposes of this section, the slope shall refer to the ratio\nof a vertical rise of one foot to a horizontal run of three feet."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "All berms shall be constructed out of clean\nfill or an approved equal. Said fill shall be given sufficient time\nto settle before final shaping and topsoil are applied. After the\nsettled fill has been shaped, a uniform six-inch layer of approved\nhorticultural topsoil shall be placed and fine graded."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "All berms shall be properly vegetated and landscaped,\nas approved by the Planning Board, before any erosion occurs in the\ntopsoil on the berm, or, in the alternative, the berm shall be covered\nwith an approved ground cover until such time as the berm can be properly\nlandscaped."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "No fence or wall shall be constructed on a berm.\nHowever, a retaining wall may be placed on the sides of a berm where\nthe Planning Board finds said retaining wall will promote aesthetic\nconsiderations and the height of same does not exceed the grade of\nthe berm."
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "The construction of berms and the berm itself\nshall not interfere with the natural drainage."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Berm height."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "In all residence districts, no berm shall have\na height greater than three feet in a required front yard or four\nfeet in a required rear or side yard."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "In all nonresidence districts, no berm shall\nhave a height greater than six feet in a required front, rear or side\nyard. Notwithstanding the foregoing, the Planning Board may approve\nmodifications to such height limitations where the Planning Board\nmakes specific findings that such modification is necessary in order\nto limit adverse impacts or promote aesthetic considerations and that\nsuch modification will promote the public interest without detrimental\neffect on any adjoining property or street. However, in no event shall\na berm in a required yard exceed a height of 10 feet."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "The height of a berm shall be the vertical distance\nfrom the top of the berm to the natural existing grade at the base\nof the berm."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Permit required for construction of berms."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "All berms shall require a building permit."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "All applications for a building permit for a\nberm shall include the following:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "A detailed grading plan of the entire site,\nindicating the existing topography in contour intervals no greater\nthan five feet and the proposed topography in contour intervals no\ngreater than two feet. The scale of the grading plan shall be no greater\nthan one inch equals 20 feet."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "A cross-section of the berm indicating the type\nof materials to be used in constructing the berm (i.e., fill, topsoil)\nand the location of landscaping. The scale of cross-section shall\nbe no greater than one inch equals four feet."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "A detailed landscaping plan indicating the location,\nsize and quality of the species to be planted."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "All applications for a building permit for a\nberm shall be referred to the Planning Board for its approval with\nrespect to the compatibility of the berm with the surrounding properties\nand associated land uses, drainage considerations and landscaping.\nThe Building Inspector shall not issue a permit for a berm until Planning\nBoard approval has been received."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "Construction and other activities in a coastal erosion hazard area as defined in Chapter 49 of the Village Code are regulated by Chapter 49 of the Village Code. The regulations of this chapter (Chapter 116) with respect to berms are not intended to regulate or allow berms in a coastal erosion hazard area and are not intended to regulate dunes in a coastal erosion hazard area."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 116-19",
			"title": "Nonconforming uses, buildings and structures.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Application of regulations. These provisions shall\napply to all buildings or structures and all uses of buildings or\nstructures or lots lawfully existing prior to the effective date of\nthis chapter or of subsequent amendments, revisions or reenactments\nof such chapter, which do not conform to the provisions of said original\nZoning Ordinance or to such revisions or reenactments on their effective\ndates."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Unlawful buildings, structures or uses not to be construed\nas nonconforming. No unlawful building or structure or unlawful use\nof a building or structure or lot existing at the effective date of\nthis chapter shall be deemed to be a nonconforming building, structure\nor use."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Continuance."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Any lawful use occupying any building, structure, lot or land at the time of the effective date of this chapter or any amendment thereto, which does not comply, after the effective date of this chapter or any amendment thereto, with the use regulations of the district in which it is situated, may be continued in the building or structure or upon the lot or land so occupied, except as provided in Subsection G below."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "A conforming building or structure used by a nonconforming\nuse shall not be reconstructed, structurally altered, restored or\nrepaired to an extent exceeding 100% of the replacement cost of such\nbuilding or structure, exclusive of foundations, unless the use of\nsuch building or structure is changed to a conforming use."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "A nonconforming building or structure that is devoted to a conforming use may be enlarged, reconstructed, structurally altered, restored or repaired in whole or in part and the provisions of Subsection C(2) above shall not apply, except that the degree of nonconformity shall not be increased."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "A nonconforming lot separately owned and not adjoining\nany lot or land in the same ownership at the effective date of this\nchapter and not adjoining any lot or land in the same ownership at\nany time subsequent to such date may be used, or a building or structure\nmay be erected on such lot for use, in accordance with all the other\napplicable provisions of this chapter, provided that proof of such\nseparate ownership is submitted in the form of an abstract of title\nshowing the changes of title to said lot. Such abstract shall be certified\nby an attorney or by a title insurance company duly licensed to examine\nand insure titles to real property in Suffolk County and shall contain\na certification that no contiguous property was owned by an owner\nof the property involved since the date of any previously applicable\nZoning Ordinance. If such a lot is nonconforming with respect to lot\nwidth, such lot shall be granted relief for side yard dimensions as\nfollows:[Amended 9-24-1991 by L.L. No. 9-1991; 4-8-2005 by L.L. No. 2-2005"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "The total dimensions of both side yards for\na principal building shall be computed on the basis of 4/10 of the\nlot width; however, no side yard dimension shall be less than 4/10\nof the total dimensions of both side yards, computed as aforesaid,\nand no side yard dimension shall be less than 10 feet."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "An existing building or structure designed and used\nfor a conforming use but located on a nonconforming lot, whether the\nbuilding is conforming or nonconforming with respect to lot coverage\nand minimum yard requirements, may be enlarged, reconstructed, structurally\naltered, restored or repaired, in whole or in part, except that the\ndegree of nonconformity shall not be increased."
												}
											]
										},
										{
											"number": "(6) ",
											"content": [
												{
													"text": "Notwithstanding any other provision of this chapter,\nwhere a legally existing substandard lot comes into the same record\nownership as one or more adjacent lots solely by reason of the death\nof a previous record owner, the owner of said lots in the same record\nownership shall have three years from the date of death of the previous\nowner causing the lots to be in the same ownership to place the lots\ninto single and separate ownership. Failure to place such lots in\nsingle and separate ownership within such period shall result in the\nmerger of substandard lots for zoning purposes.[Added 8-20-1991 by L.L. No. 8-1991]"
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "Extension. A nonconforming use shall not be enlarged or extended nor shall the degree of nonconformity of a nonconforming building be increased, except as provided in § 116-28C of this chapter."
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "Change. A nonconforming use shall be changed only to a conforming use, except as provided in § 116-28C of this chapter."
								}
							]
						},
						{
							"number": "F. ",
							"content": [
								{
									"text": "Abandonment."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "A nonconforming use shall be deemed to have been abandoned:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "When it is changed to a conforming use."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "In cases where such nonconforming use is of\na building or structure designed for such use, when it has been voluntarily\ndiscontinued for a period of 12 consecutive months, and in cases where\nsuch nonconforming use is of a building or structure designed for\nsuch use, when it has not in fact been actually used for a continuous\nperiod of three years."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "In cases where such nonconforming use is of\na building or structure not designed for such use or is of a lot or\nland whereon there is no consequential building or structure devoted\nto such use, when it has been voluntarily discontinued for a period\nof six consecutive months, and in such cases, when it has not in fact\nbeen actually used for a continuous period of 18 months."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "A nonconforming use that has been abandoned shall\nnot thereafter be reinstated."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "G. ",
							"content": [
								{
									"text": "Compulsory termination of nonconforming structure\nor use."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "A nonconforming structure or nonconforming use may\nbe subject to compulsory termination by the municipal legislative\nbody when it is found detrimental to the conservation of the value\nof the surrounding land and improvements or to future development\nof surrounding lands and therefore is tending to deteriorate or blight\nthe neighborhood.[1]"
												},
												{
													"footnote": "[1]\nEditor's Note: As to the removal of hazardous structures, see Ch. 47, Buildings, Unsafe.\n"
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "In ordering the compulsory termination of a nonconforming\nstructure or nonconforming use, the municipal legislative body will\nestablish a definite and reasonable amortization period during which\nthe nonconforming use may continue while the investment value remaining\nafter the date of the termination order is amortized. Determination\nof the amount to be amortized shall be based on the value and condition\nof the land and improvements for the nonconforming use less their\nvalue and condition for a conforming use and such other reasonable\ncosts as the termination may cause. The rate of amortization shall\nbe in accordance with reasonable economic practice."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Anything to the contrary in this chapter notwithstanding,\nany nonconforming billboard or any flashing or moving sign, wherever\nlocated, shall become an unlawful structure on June 1, 1976, and shall\nthereupon be removed.[Amended 11-23-1999 by L.L. No. 7-1999]"
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "Any owner of any such nonconforming billboard or flashing\nor moving sign, who alleges that the period herein provided for amortization\nof such sign is unreasonable as to a particular sign, may apply to\nthe municipal legislative body for an extension of time for amortization\nof such sign. If the municipal legislature finds that the construction\ncost of a particular sign may not be reasonably amortized by the aforesaid\ndate, then the municipal legislature may extend the amortization period\nto a date which it finds will provide a reasonable amortization period.\nIn no event, however, shall the total amortization period for a particular\njob extend beyond a date which would result in amortization of the\nconstruction cost of a particular sign at a rate of less than $100\nper year, computed on a straight-line basis.[Amended 11-23-1999 by L.L. No. 7-1999]"
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "Anything to the contrary in § 116-19G notwithstanding, nonconforming signs other than billboard signs may be subject to compulsory termination by the municipal legislative body pursuant to provisions set forth in § 116-13, in which event, removal of such nonconforming signs shall be governed by the provisions set forth in § 116-13 rather than by § 116-19G.[Added 11-23-1999 by L.L. No. 7-1999]"
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "H. ",
							"content": [
								{
									"text": "Accessory buildings used for residential purposes\nnotwithstanding any provision of this chapter to the contrary.[Added 9-12-1980 by L.L. No. 5-1980]"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Within any one-family residence district (R-80 Residence\nDistrict, R-60 Residence District, R-40 Residence District, R-20 Residence\nDistrict, R-12.5 Residence District, R-7.5 Residence District), where\na lot contains a one-family detached dwelling and a separate, existing\nbuilding lawfully used in whole or in part for residential purposes\nincidental to the use of the one-family detached dwelling (such as\nwhere the separate, existing building is lawfully used for occupancy\nfor residential purposes by servants or guests of the occupants of\nthe one-family detached dwelling), such separate, existing building\nshall be deemed an accessory building used for a nonconforming accessory\nuse. Such separate, existing building shall not be considered a one-family\ndetached dwelling."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Where such an accessory building is used for such a nonconforming accessory use, such accessory building shall not be used in whole or in part as a one-family detached dwelling (for occupancy for residential purposes by a person or family independent from the existing one-family detached dwelling) nor as an independent one-family dwelling unit (such as rental to a tenant or tenants for occupancy for residential purposes by a person or family independent from the occupants of the existing one-family detached dwelling) unless and until a variance authorizing the same is granted by the Board of Appeals, except as provided in Subsection H(3) below."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Where such an accessory building is used for such\na nonconforming accessory use and where it is proposed to subdivide\nsuch lot in such a manner that such accessory building would be located\non a separate lot from the existing one-family detached dwelling,\nsuch accessory building may be used as a one-family detached dwelling\n(after subdivision approval by the Planning Board) without a variance\nauthorizing the same, provided that the lot on which such building\nis proposed to be located would be a conforming lot, and further provided\nthat such building would be conforming in all respects with the requirements\nof this chapter applicable to a new one-family detached dwelling."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "I. ",
							"content": [
								{
									"text": "Approved cluster developments. Notwithstanding any\nother provision of this chapter, lots on the approved cluster developments\nhereinafter identified shall be granted relief from dimensional regulations\nto the following extent:[Added 3-25-2003 by L.L. No. 2-2003]"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "The dimensional regulations applicable to lots on\nthe final plat entitled \"Subdivision Map of Halsey Family Limited\nPartnership, Section 1,\" which plat was approved by resolution of\nthe Planning Board dated July 6, 1998, shall be as follows:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "The minimum required lot area shall be the lot\nareas as shown on said final plat."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "The minimum required lot width shall be the\nlot widths as shown on said final plat."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "All other dimensional regulations shall be those\nprescribed for the R-40 Resident District as of the date of approval\nof said final plat."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "The dimensional regulations applicable to lots on\nthe final plat entitled \"Subdivision Map of Halsey Family Limited\nPartnership, Section 2,\" which plat was approved by resolution of\nthe Planning Board dated August 7, 2000, shall be as follows:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "The minimum required lot area shall be the lot\nareas as shown on said final plat."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "The minimum required lot width shall be the\nlot widths as shown on said final plat."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "All other dimensional regulations shall be those\nprescribed for the R-40 Resident District as of the date of approval\nof said final plat."
																}
															]
														}
													]
												}
											]
										}
									]
								}
							]
						}
					]
				}
			]
		}
	]
}