{
	"url": "http://ecode360.com/7728112",
	"paras": [
		{
			"paragraph": "§ 340-4",
			"title": "Uses.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "The purpose of the Residence A District is to provide\nfor areas of relatively open character for single-family detached\ndwellings, to provide for additional residential units that are consistent\nwith the residential environment and to provide for facilities and\nuses which serve residents of these areas and which are benefited\nby a stable residential environment."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "In the Residence A District, no building or premises\nshall be used and no building shall be erected or altered which is\narranged, intended or designed to be used except for one or more of\nthe following uses:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Single-family detached dwellings, which shall have\na roof other than one of the character or description known as a \"flat\nroof.\""
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "The office of a doctor, artist, lawyer, dentist, architect\nor a professional engineer, when not located outside of the building\nin which he resides, provided that there is no display other than\nthe ordinary professional nameplate not larger than eight inches by\n15 inches, and provided that, where the plot is an interior plot,\nthe entrance to such office shall be approximately at the front building\nsetback line and, where the plot is a corner plot, the entrance shall\nbe approximately at the building setback line of either street frontage,\nand provided, always, that such use shall not be so conducted as to\nbe an annoyance or nuisance to the neighborhood."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Accessory uses customarily incident to the above uses.\nThe term \"accessory use,\" however, shall not include a business or\nany building or use not located on the same lot with the building\nto which it is accessory.[1][2]"
												},
												{
													"footnote": "[1]\nEditor's Note: Former Subsection B(4), regarding real estate signs, which immediately followed this subsection, was repealed 1-23-1989 by L.L. No. 3-1989. See now Ch. 335, Art. III, Real Estate Signs.\n[2]\nEditor's Note: Former Subsection B(5), regarding\ntwo-family detached dwellings, which followed this subsection, was\nrepealed 7-11-1994 by L.L. No. 1-1994.\n"
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "If, prior to the effective date of this local law, a one-family or a two-family dwelling was constructed on a lot having a street frontage or a total area less than that described in § 340-5, such dwelling shall be deemed conforming for the purposes of this article. Should such dwelling be destroyed or demolished, a one-family dwelling may be reconstructed with the consent of the Board of Appeals upon a showing that such dwelling will comply with all the conditions of this article other than § 340-5.[3][Amended 7-11-1994 by L.L. No. 2-1994]"
								},
								{
									"footnote": "[3]\nEditor's Note: Former Subsection D, regarding\ntwo-family dwellings, which immediately followed this subsection,\nwas repealed 7-11-1994 by L.L. No. 3-1994.\n"
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 340-5",
			"title": "Lot size.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "The lot for each single-family dwelling shall have\na street frontage of not less than 80 feet on each street on which\nthe lot abuts and have a total area of not less than 8,000 square\nfeet; provided, however, that the provisions of this subsection shall\nnot be applicable to any lot having a street frontage of not less\nthan 60 feet nor less than a total area of 6,000 square feet shown\non a plat filed with the Planning Board of the Village, whether or\nnot the same has been approved by the Planning Board prior to the\neffective date of this local law.[1]"
								},
								{
									"footnote": "[1]\nEditor's Note: Former Subsection B, regarding\ntwo-family dwellings, which immediately followed this subsection,\nwas repealed 7-11-1994 by L.L. No. 4-1994.\n"
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Notwithstanding the provisions of Subsection A above, subject to the prior approval of the Board of Appeals, a one-family house on a lot with less than said frontage or area may be permitted if the Board, in specific cases, after public notice and hearing, and subject to appropriate conditions and safeguards, determines to vary the street frontage and area requirements, in harmony with the purposes enumerated in the Village Law of the State of New York and the purpose and intent of this local law, on lots having a street frontage and area size consistent with the area in which such lot is located.[Amended 7-11-1994 by L.L. No. 5-1994[2]]"
								},
								{
									"footnote": "[2]\nEditor's Note: This local law also provided\nfor the renumbering of former Subsection C as Subsection B.\n"
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 340-6",
			"title": "Building area and lot coverage; floor area ratio.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "For lots with an area of 8,000 square feet or more, the principal\nbuilding area shall not exceed 25%, and the total building area, including\naccessory buildings, shall not exceed 30%. For lots with an area less\nthan 8,000 square feet, the total building area, including accessory\nbuildings, shall not exceed 30%. The impervious surface area of any\nlot shall not exceed 40%; provided, however, that sidewalks, swimming\npools and entrance pathways that lead to a front door shall not be\nincluded in the calculation of impervious surface area for the purposes\nof this section. Notwithstanding the provisions of this subsection,\nimpervious surface coverage may exceed 40%, but shall not exceed 45%,\nwhere it is established to the reasonable satisfaction of the Superintendent\nof Buildings that the disposition of rainfall and other surface water\nwill comply with standard engineering practices/calculations of water\npercolation, or that the property will provide dry wells with sufficient\ncapacity to retain and dispose of rainfall and surface water on site.)[Amended 1-5-2015 by L.L.\nNo. 2-2015]"
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "The floor area ratio on any lot or premises shall not exceed the\nfollowing maximum amounts:[Amended 11-21-2011 by L.L. No. 13-2011]"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Lots\nhaving an area of 7,200 square feet or less: 50.0% floor area ratio;"
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Lots\nhaving area more than 7,200 square feet: 42.0% floor area ratio."
												}
											]
										}
									]
								}
							]
						}
					]
				},
				{
					"footnote": "[1]\nEditor's Note: This local law also provided that it take\neffect upon adoption and filing; provided, however that the amendments\neffectuated by it not be applicable with respect to any substantially\ncompleted building permit application filed with the Village Building\nDepartment on or before 3-4-2011, and provided further that such application\nnot thereafter be amended in any manner which would cause the construction\nor development to exceed the parameters or limitations enacted by\nthis law to any degree greater than proposed in such application as\nof 3-4-2011.\n"
				}
			]
		},
		{
			"paragraph": "§ 340-7",
			"title": "Building height.",
			"content": [
				{
					"text": "No building shall be greater in height than 32 feet. For the\nmain roof area of all dwellings, the slope shall be not less than\nsix vertical over 12 horizontal. For gambrel or other main roof profiles\ncomposed of two or more segments of differing slope, the average slope\nof all segments shall be no less than six vertical over 12 horizontal.\nThe slope ratio requirement shall not be applicable to dormers, one-story\nwings on multistory buildings, or secondary roof area."
				}
			]
		},
		{
			"paragraph": "§ 340-8",
			"title": "Front yard.",
			"content": [
				{
					"text": "No dwelling shall be erected or altered so that\nthe front yard setback shall be less than the average setback distance\nof the dwellings on the same side of the street within the same block,\nbut need not be more than 30 feet. In no event shall the front yard\nsetback be less than 25 feet."
				}
			]
		},
		{
			"paragraph": "§ 340-9",
			"title": "Side yards.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "There shall be two side yards, one on each side of the main building\n(See table below.):"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Where the average lot width of a parcel is less than 80 feet, the\naggregate widths of the side yards shall be equal to at least 20%\nof the average lot width, and no side yard shall be less than eight\nfeet wide."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Where the average lot width of a parcel is 80 feet or greater, the\naggregate widths of the side yards shall be equal to at least 25%\nof the average lot width, and no side yard shall be less than 10 feet\nwide."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "No projections shall extend nearer to the lot lines than the limits\nherein set forth."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Table:"
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "No projections shall extend nearer to the lot lines\nthan the limits herein set forth."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 340-10",
			"title": "Rear yards.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "A rear yard shall be required on every lot. The depth\nof a rear yard shall be at least 25 feet.[Amended 3-1-2011 by L.L. No. 6-2011]"
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "No projections shall extend nearer to the lot lines\nthan the limits herein set forth."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 340-11",
			"title": "Corner plots.",
			"content": [
				{
					"text": "On corner plots only, the main foundation wall of any house\nshall not exceed, on the side having the shortest street frontage,\nbeyond the setback line established for the fronts of houses on the\nsame side of the street within the same block; but no foundation wall\nof a house need set back more than 30 feet, nor shall the setback\nbe less than 25 feet. On the side having the longest street frontage,\nthe setback of the house shall be at least 20% of the average width\nof the lot on the shortest street frontage, but in no case less than\n20 feet. The yard opposite the greatest setback shall be not less\nthan 20 feet in depth and the remaining yard not less than 10 feet\nin width."
				},
				{
					"footnote": "[1]\nEditor’s Note: This local law also provided that it\ntake effect upon adoption and filing; provided, however that the amendments\neffectuated by it not be applicable with respect to any substantially\ncompleted building permit application filed with the Village Building\nDepartment on or before 3-4-2011, and provided further that such application\nnot thereafter be amended in any manner which would cause the construction\nor development to exceed the parameters or limitations enacted by\nthis law to any degree greater than proposed in such application as\nof 3-4-2011.\n"
				}
			]
		},
		{
			"paragraph": "§ 340-12",
			"title": "Parking and garage requirements.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Parking space and garage requirements are set forth in Chart IV of the Rockville Centre Zoning Code. Chart IV is entitled \"Schedule of Minimum Required Off-Street Parking.\"[1]"
								},
								{
									"footnote": "[1]\nEditor's Note: Chart IV is included at the end of this chapter.\n"
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Commercial vehicles, school buses and vehicles seating\n14 passengers or fewer bearing school, car or taxi license plates\nand used to transport pupils to and from school shall not be parked\nor left standing on any out-of-doors off-street parking area between\nthe hours of 11:00 p.m. and 7:00 a.m."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "New single-family dwellings shall have a garage, detached\nfrom or attached to the main dwelling, such garage to be sufficiently\nlarge to accommodate at least one automobile."
								}
							]
						}
					]
				}
			]
		}
	]
}