{
	"url": "http://ecode360.com/7728180",
	"paras": [
		{
			"paragraph": "ยง 340-25",
			"title": "Permitted uses.",
			"content": [
				{
					"text": "In the Residence A-M District, no building or\nstructure shall be used, and no building or structure shall be erected\nor structurally altered which is arranged, intended or designed to\nbe used, for other than one or more of the following uses:"
				},
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Any use permitted in a Residence A District."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Hospitals, other than for the insane or feebleminded\nor for alcoholics or drug addicts."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "College or university."
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "Skilled nursing facility when utilized in connection\nwith a hospital permitted under this chapter.[Amended 3-24-1999 by L.L. No. 4-1999]"
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "Professional medical building."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "ยง 340-26",
			"title": "Other regulations.",
			"content": [
				{
					"text": "Single- and two-family houses shall comply with the regulations set forth in this chapter in Article IV, Residence A District, with respect to lot size, front yard, side yard, rear yard and corner plot setbacks, and building height and area. Hospitals, colleges, universities, professional medical buildings and nursing homes shall comply with the same lot size, front yard, side yard, rear yard and corner lot setbacks and building height and area regulations as required for apartment houses as set forth in Article V, Residence B District. In addition to the setback requirements as contained herein for any use other than those uses permitted in a Residence A District, a forty-foot buffer zone shall be provided and maintained in its natural state, between such usage and any adjoining Residence A District."
				}
			]
		},
		{
			"paragraph": "ยง 340-27",
			"title": "Parking requirements.",
			"content": [
				{
					"text": "Parking space requirements are set forth in Chart IV of the Rockville Centre Zoning Code. Chart IV is entitled \"Schedule of Minimum Required Off-Street Parking.\"[1]"
				},
				{
					"footnote": "[1]\nEditor's Note: Chart IV is included at the end of this chapter.\n"
				}
			]
		}
	]
}