{
	"url": "http://ecode360.com/7728139",
	"paras": [
		{
			"paragraph": "§ 340-13",
			"title": "Uses.",
			"content": [
				{
					"text": "In the Residence B District, no buildings or\npremises shall be used, and no building shall be erected or altered,\nfor other than one or more of the following uses:"
				},
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Any use permitted in the Residence A District and subject to the same limitations and requirements as are contained in Article IV."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Two-family detached dwellings, which shall have a\nroof other than one of the character or description known as the \"flat\nroof,\" subject to the prior approval of the Board of Appeals, which\nmay, in specific cases, after public notice and hearing, and subject\nto appropriate conditions and safeguards, determine and vary the application\nof the provisions herein established, in harmony with the purposes\nenumerated in the Village Law of the State of New York and the general\npurpose and intent of this chapter, by granting permission to erect\nor alter a building for use as a two-family detached house in the\nResidence B District, when said Board finds as a fact:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "A two-family dwelling will not tend to depreciate\nthe value of existing dwellings in the neighborhood."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "A two-family dwelling will not conflict with the type\nand character of existing dwellings or of dwellings under construction\nor reconstruction in a neighborhood."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "A two-family dwelling is not prohibited by covenant\nor restriction contained in a deed or other instrument affecting the\npremises."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "The applicant has consented, as a condition for the\nissuance of a permit to construct a new dwelling or to alter an existing\nbuilding, to construct the same in accordance with plans and specifications\nto be approved by both the Board of Appeals and the Board of Architectural\nReview so that it will harmonize with the neighboring dwellings both\nas to appearance and utility."
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "Such construction, alterations and improvements, among\nother things, will provide suitable safeguards against fire hazards\nand provide for the construction of but one front entrance to the\nbuilding."
												}
											]
										},
										{
											"number": "(6) ",
											"content": [
												{
													"text": "The applicant has consented to comply with and abide\nby all requirements of the municipal departments having jurisdiction."
												}
											]
										},
										{
											"number": "(7) ",
											"content": [
												{
													"text": "A minimum of four off-street spaces shall be provided."
												}
											]
										},
										{
											"number": "(8) ",
											"content": [
												{
													"text": "The Board shall take into consideration the lot sizes\nand parking requirements of existing properties within 500 feet of\nthe lot on which permission is sought to construct a two-family house."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Multifamily uses. No multifamily dwelling shall contain\nmore than 18 units per acre. No more than 10% of the units shall contain\nthree or more bedrooms. A den that is separated from a living room\nshall be counted as a bedroom.[Amended 5-22-2006 by L.L. No. 9-2006; 10-16-2007 by L.L. No.\n6-2007]"
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "(Repealed)[1][Amended 4-10-2006 by L.L. No. 2-2006]"
								},
								{
									"footnote": "[1]\nEditor's Note: Former Subsection D, regarding private parking fields, was repealed 4-10-2006 by L.L. No. 2-2006. The Board of Trustees has determined that the elimination of the permitted use formerly set forth in § 340-13D establishes the existing lots in the Residence B District as nonconforming. As such, the existing lots are governed by § 340-3 of the Code of the Village of Rockville Centre. In addition, the existing lots must continue to adhere to the requirements and restrictions of § 340-13D, including those that pertain to surfacing, landscaping, fencing, and lighting. In addition, the limitations with regard to the uses and the prohibition of uses of the lots shall remain applicable to these nonconforming lots. In pertinent part, § 340-13D had provided as follows: \"Parking fields shall be surfaced and constructed in accordance with the rules and regulations governing the construction of new residential streets within the Village of Rockville Centre. The space contained in the setback areas shall be adequately landscaped and, in addition thereto, the entire area shall be fenced in except where such field may abut a public highway or business-zoned property. No lighting of such area shall be permitted, except that minimum security-type lighting may be installed upon approval of the Chief Engineer. Such parking fields shall be used only for private parking of vehicles of an owner, employee or customer of a business operated in the adjoining Business A, Business AA, Business AAA or Residence C District. Under no conditions shall these parking fields be used by trucks or commercial vehicles for either parking, loading or unloading or ingress or egress from any highways or any adjoining property zoned either residential or business. The use or installation of any mechanical device or structure designed to raise, lift or otherwise support a vehicle with the intent of increasing on-site vehicle storage or parking in a private parking field is prohibited in Residence B.\"\n"
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 340-14",
			"title": "Lot size.",
			"content": [
				{
					"text": "The lot for each such dwelling shall have a\nstreet frontage of not less than 50 feet on each street on which the\nlot abuts, and a total area of not less than 5,000 square feet for\none- or two-family dwelling houses. For an apartment house a frontage\nof 100 feet and a plot area of 15,000 square feet shall be the minimum\nrequirement."
				}
			]
		},
		{
			"paragraph": "§ 340-15",
			"title": "Building area.",
			"content": [
				{
					"text": "The building area, including all accessory buildings,\nshall not exceed 40% of the lot area."
				}
			]
		},
		{
			"paragraph": "§ 340-16",
			"title": "Building height.",
			"content": [
				{
					"text": "No building except a church or school shall\nbe raised, altered or erected greater in height than two stories,\nwhich height shall not exceed an aggregate of 30 feet, including false\npeaks or gables."
				}
			]
		},
		{
			"paragraph": "§ 340-17",
			"title": "Front yards.",
			"content": [
				{
					"text": "No one-family, two-family or multifamily use\nshall be erected or altered so that the front yard setback shall be\nless than 20 feet."
				}
			]
		},
		{
			"paragraph": "§ 340-18",
			"title": "Side yards.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "A side yard is required along each side of the main\nbuilding."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "In the case of all buildings other than multifamily\nuses, the side yard setback requirements shall be the same as specified\nin the Residence A District."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "On all plots developed for multifamily uses, each\nside yard shall be not less than 20 feet in width, except where such\nplot adjoins a plot in the Residence A District, in which case the\nside yard adjoining a Residence A District plot shall be not less\nthan 30 feet in width."
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "In all classes of dwellings, no part of any projection,\nincluding an open porch, shall extend nearer to the lot line than\nthe limits herein set forth."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 340-19",
			"title": "Rear yards.",
			"content": [
				{
					"text": "A rear yard is required on every lot. The depth\nof a rear yard shall be at least 20 feet, except that on all plots\ndeveloped for multifamily uses where such plots adjoins a plot in\na Residence A District, such rear yard shall be not less than 30 feet\nin depth."
				}
			]
		},
		{
			"paragraph": "§ 340-20",
			"title": "Corner plots.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "On corner plots, the setback of any buildings other\nthan multifamily uses shall be the same as specified in the Residence\nA District, but need not exceed 20 feet."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "In the case of multifamily uses, the setback of the\ndwelling shall not be less than 20 feet to any street line or municipal\nparking field line upon which the plot adjoins, and shall not be less\nthan 20 feet to the property line where such plot adjoins privately\nowned property in other than a Residence A District, and 30 feet where\nsuch plot adjoins privately owned property in a Residence A District."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 340-21",
			"title": "Parking regulations.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Parking space and garage requirements are set forth in Chart IV of the Rockville Centre Zoning Code. Chart IV is entitled \"Schedule of Minimum Required Off-Street Parking.\"[1]"
								},
								{
									"footnote": "[1]\nEditor's Note: Chart IV is included at the end of this chapter.\n"
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "In the Residence B District, no premises, except multifamily uses and the uses permitted by § 340-13D, shall provide space for more than four motor vehicles. Not more than one commercial vehicle shall be allowed on premises developed for a one- or two-family house, and the capacity of such commercial vehicle shall be limited to 3/4 ton or limited to a cubical capacity, including the driving compartment, not in excess of 160 cubic feet. On premises developed for multifamily uses, no commercial vehicle shall be allowed."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Whenever a multifamily use shall be erected or altered\nfor the purpose of housing three or more families, provision shall\nbe made on the same or an adjacent plot for off-street parking space\nfor private passenger automobiles in a number equal to 150% of the\nnumber of housekeeping or professional apartments in such dwelling.\nAll outdoor parking shall be within the area to the rear of the front\nor side street building lines, and such outdoor parking area shall\nbe set back a minimum distance of four feet from all property lines\nof the plot, and there shall be a minimum distance of eight feet between\nsuch parking area and the multifamily use for which said parking area\nis used."
								}
							]
						}
					]
				}
			]
		}
	]
}