{
	"url": "http://ecode360.com/7728112",
	"paras": [
		{
			"paragraph": "§ 340-4",
			"title": "Uses.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "The purpose of the Residence A District is to provide\nfor areas of relatively open character for single-family detached\ndwellings, to provide for additional residential units that are consistent\nwith the residential environment and to provide for facilities and\nuses which serve residents of these areas and which are benefited\nby a stable residential environment."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "In the Residence A District, no building or premises\nshall be used and no building shall be erected or altered which is\narranged, intended or designed to be used except for one or more of\nthe following uses:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Single-family detached dwellings, which shall have\na roof other than one of the character or description known as a \"flat\nroof.\""
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "The office of a doctor, artist, lawyer, dentist, architect\nor a professional engineer, when not located outside of the building\nin which he resides, provided that there is no display other than\nthe ordinary professional nameplate not larger than eight inches by\n15 inches, and provided that, where the plot is an interior plot,\nthe entrance to such office shall be approximately at the front building\nsetback line and, where the plot is a corner plot, the entrance shall\nbe approximately at the building setback line of either street frontage,\nand provided, always, that such use shall not be so conducted as to\nbe an annoyance or nuisance to the neighborhood."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Accessory uses customarily incident to the above uses.\nThe term \"accessory use,\" however, shall not include a business or\nany building or use not located on the same lot with the building\nto which it is accessory.[1][2]"
												},
												{
													"footnote": "[1]\nEditor's Note: Former Subsection B(4), regarding real estate signs, which immediately followed this subsection, was repealed 1-23-1989 by L.L. No. 3-1989. See now Ch. 335, Art. III, Real Estate Signs.\n[2]\nEditor's Note: Former Subsection B(5), regarding\ntwo-family detached dwellings, which followed this subsection, was\nrepealed 7-11-1994 by L.L. No. 1-1994.\n"
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "If, prior to the effective date of this local law, a one-family or a two-family dwelling was constructed on a lot having a street frontage or a total area less than that described in § 340-5, such dwelling shall be deemed conforming for the purposes of this article. Should such dwelling be destroyed or demolished, a one-family dwelling may be reconstructed with the consent of the Board of Appeals upon a showing that such dwelling will comply with all the conditions of this article other than § 340-5.[3][Amended 7-11-1994 by L.L. No. 2-1994]"
								},
								{
									"footnote": "[3]\nEditor's Note: Former Subsection D, regarding\ntwo-family dwellings, which immediately followed this subsection,\nwas repealed 7-11-1994 by L.L. No. 3-1994.\n"
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 340-5",
			"title": "Lot size.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "The lot for each single-family dwelling shall have\na street frontage of not less than 80 feet on each street on which\nthe lot abuts and have a total area of not less than 8,000 square\nfeet; provided, however, that the provisions of this subsection shall\nnot be applicable to any lot having a street frontage of not less\nthan 60 feet nor less than a total area of 6,000 square feet shown\non a plat filed with the Planning Board of the Village, whether or\nnot the same has been approved by the Planning Board prior to the\neffective date of this local law.[1]"
								},
								{
									"footnote": "[1]\nEditor's Note: Former Subsection B, regarding\ntwo-family dwellings, which immediately followed this subsection,\nwas repealed 7-11-1994 by L.L. No. 4-1994.\n"
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Notwithstanding the provisions of Subsection A above, subject to the prior approval of the Board of Appeals, a one-family house on a lot with less than said frontage or area may be permitted if the Board, in specific cases, after public notice and hearing, and subject to appropriate conditions and safeguards, determines to vary the street frontage and area requirements, in harmony with the purposes enumerated in the Village Law of the State of New York and the purpose and intent of this local law, on lots having a street frontage and area size consistent with the area in which such lot is located.[Amended 7-11-1994 by L.L. No. 5-1994[2]]"
								},
								{
									"footnote": "[2]\nEditor's Note: This local law also provided\nfor the renumbering of former Subsection C as Subsection B.\n"
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 340-6",
			"title": "Building area and lot coverage; floor area ratio.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "For lots with an area of 8,000 square feet or more, the principal\nbuilding area shall not exceed 25%, and the total building area, including\naccessory buildings, shall not exceed 30%. For lots with an area less\nthan 8,000 square feet, the total building area, including accessory\nbuildings, shall not exceed 30%. The impervious surface area of any\nlot shall not exceed 40%; provided, however, that sidewalks, swimming\npools and entrance pathways that lead to a front door shall not be\nincluded in the calculation of impervious surface area for the purposes\nof this section. Notwithstanding the provisions of this subsection,\nimpervious surface coverage may exceed 40%, but shall not exceed 45%,\nwhere it is established to the reasonable satisfaction of the Superintendent\nof Buildings that the disposition of rainfall and other surface water\nwill comply with standard engineering practices/calculations of water\npercolation, or that the property will provide dry wells with sufficient\ncapacity to retain and dispose of rainfall and surface water on site.)[Amended 1-5-2015 by L.L.\nNo. 2-2015]"
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "The floor area ratio on any lot or premises shall not exceed the\nfollowing maximum amounts:[Amended 11-21-2011 by L.L. No. 13-2011]"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Lots\nhaving an area of 7,200 square feet or less: 50.0% floor area ratio;"
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Lots\nhaving area more than 7,200 square feet: 42.0% floor area ratio."
												}
											]
										}
									]
								}
							]
						}
					]
				},
				{
					"footnote": "[1]\nEditor's Note: This local law also provided that it take\neffect upon adoption and filing; provided, however that the amendments\neffectuated by it not be applicable with respect to any substantially\ncompleted building permit application filed with the Village Building\nDepartment on or before 3-4-2011, and provided further that such application\nnot thereafter be amended in any manner which would cause the construction\nor development to exceed the parameters or limitations enacted by\nthis law to any degree greater than proposed in such application as\nof 3-4-2011.\n"
				}
			]
		},
		{
			"paragraph": "§ 340-7",
			"title": "Building height.",
			"content": [
				{
					"text": "No building shall be greater in height than 32 feet. For the\nmain roof area of all dwellings, the slope shall be not less than\nsix vertical over 12 horizontal. For gambrel or other main roof profiles\ncomposed of two or more segments of differing slope, the average slope\nof all segments shall be no less than six vertical over 12 horizontal.\nThe slope ratio requirement shall not be applicable to dormers, one-story\nwings on multistory buildings, or secondary roof area."
				}
			]
		},
		{
			"paragraph": "§ 340-8",
			"title": "Front yard.",
			"content": [
				{
					"text": "No dwelling shall be erected or altered so that\nthe front yard setback shall be less than the average setback distance\nof the dwellings on the same side of the street within the same block,\nbut need not be more than 30 feet. In no event shall the front yard\nsetback be less than 25 feet."
				}
			]
		},
		{
			"paragraph": "§ 340-9",
			"title": "Side yards.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "There shall be two side yards, one on each side of the main building\n(See table below.):"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Where the average lot width of a parcel is less than 80 feet, the\naggregate widths of the side yards shall be equal to at least 20%\nof the average lot width, and no side yard shall be less than eight\nfeet wide."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Where the average lot width of a parcel is 80 feet or greater, the\naggregate widths of the side yards shall be equal to at least 25%\nof the average lot width, and no side yard shall be less than 10 feet\nwide."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "No projections shall extend nearer to the lot lines than the limits\nherein set forth."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Table:"
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "No projections shall extend nearer to the lot lines\nthan the limits herein set forth."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 340-10",
			"title": "Rear yards.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "A rear yard shall be required on every lot. The depth\nof a rear yard shall be at least 25 feet.[Amended 3-1-2011 by L.L. No. 6-2011]"
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "No projections shall extend nearer to the lot lines\nthan the limits herein set forth."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 340-11",
			"title": "Corner plots.",
			"content": [
				{
					"text": "On corner plots only, the main foundation wall of any house\nshall not exceed, on the side having the shortest street frontage,\nbeyond the setback line established for the fronts of houses on the\nsame side of the street within the same block; but no foundation wall\nof a house need set back more than 30 feet, nor shall the setback\nbe less than 25 feet. On the side having the longest street frontage,\nthe setback of the house shall be at least 20% of the average width\nof the lot on the shortest street frontage, but in no case less than\n20 feet. The yard opposite the greatest setback shall be not less\nthan 20 feet in depth and the remaining yard not less than 10 feet\nin width."
				},
				{
					"footnote": "[1]\nEditor’s Note: This local law also provided that it\ntake effect upon adoption and filing; provided, however that the amendments\neffectuated by it not be applicable with respect to any substantially\ncompleted building permit application filed with the Village Building\nDepartment on or before 3-4-2011, and provided further that such application\nnot thereafter be amended in any manner which would cause the construction\nor development to exceed the parameters or limitations enacted by\nthis law to any degree greater than proposed in such application as\nof 3-4-2011.\n"
				}
			]
		},
		{
			"paragraph": "§ 340-12",
			"title": "Parking and garage requirements.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Parking space and garage requirements are set forth in Chart IV of the Rockville Centre Zoning Code. Chart IV is entitled \"Schedule of Minimum Required Off-Street Parking.\"[1]"
								},
								{
									"footnote": "[1]\nEditor's Note: Chart IV is included at the end of this chapter.\n"
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Commercial vehicles, school buses and vehicles seating\n14 passengers or fewer bearing school, car or taxi license plates\nand used to transport pupils to and from school shall not be parked\nor left standing on any out-of-doors off-street parking area between\nthe hours of 11:00 p.m. and 7:00 a.m."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "New single-family dwellings shall have a garage, detached\nfrom or attached to the main dwelling, such garage to be sufficiently\nlarge to accommodate at least one automobile."
								},
								{
									"paragraph": "§ 340-119",
									"title": "Garages and accessory buildings on lots developed with residence buildings.",
									"content": [
										{
											"content": [
												{
													"number": "A. ",
													"content": [
														{
															"text": "On both interior lots and corner lots developed with\nresidence buildings, attached garages and accessory buildings shall\nnot project beyond the setback line as established."
														}
													]
												},
												{
													"number": "B. ",
													"content": [
														{
															"text": "On interior lots developed with residence buildings,\nall detached garages and accessory buildings shall be located wholly\non the rear third of the lot."
														}
													]
												},
												{
													"number": "C. ",
													"content": [
														{
															"text": "On corner lots developed with residence buildings,\nall detached garages and accessory buildings shall be so located that\nno part thereof shall encroach upon the area between each respective\nstreet and a line drawn parallel to such street in a manner to divide\nthe lot into two equal parts."
														}
													]
												},
												{
													"number": "D. ",
													"content": [
														{
															"text": "Detached garages and accessory buildings shall in\nall cases be located at least four feet from the interior side and\nrear lines of lots. No portion of any detached garage or other accessory\nbuilding shall be nearer than eight feet to the main building on the\nsame plot or nearer than six feet to any other accessory building.\nNo detached garage or accessory building shall be more than 15 feet\nin height."
														}
													]
												},
												{
													"number": "E. ",
													"content": [
														{
															"text": "A garage where no service or business for vehicles\nis conducted shall be permitted only when located on the same lot\nwith a dwelling in a residence district.[1]"
														},
														{
															"footnote": "[1]\nEditor's Note: Former Subsection F, regarding\nfencing requirements for parking fields, which immediately followed\nthis subsection, was repealed 1-24-1983 by L.L. No. 2-1983.\n"
														}
													]
												}
											]
										}
									]
								},
								{
									"paragraph": "§ 340-120",
									"title": "Public garages and service stations.",
									"content": [
										{
											"content": [
												{
													"number": "A. ",
													"content": [
														{
															"text": "In a public garage, service station or automobile\nsalesroom, no workshop shall be located and no repair work shall be\ncarried on nearer than 25 feet to any street. No automobile commercial\nwork, except emergency work, shall be carried on out-of-doors."
														}
													]
												},
												{
													"number": "B. ",
													"content": [
														{
															"text": "In any district, no pump or other apparatus for the\nfurnishing or dispensing of gasoline, oil, air or water to motor vehicles\nshall be altered, erected or installed unless the same be so located\nso as to be not less than 15 feet from the street property line."
														}
													]
												}
											]
										}
									]
								},
								{
									"paragraph": "§ 340-121",
									"title": "Fences and other accessory structures.",
									"content": [
										{
											"content": [
												{
													"number": "A. ",
													"content": [
														{
															"text": "In residence districts, fences may be erected but\nshall not be more than four feet in height, except that a six-foot-high\nfence may be erected enclosing the rear yard. Fences shall be situated\nso that the finished side of the fence faces away from the property\nfenced. No fence shall be erected on corner property unless the same\nshall be set back from the abutting streets in conformity with the\nprovisions of other applicable Village laws. In business districts,\nthe erection and maintenance of fences shall be in conformity with\nthe provisions of the Village Code.[Amended 12-3-2012 by L.L. No. 5-2012]"
														}
													]
												},
												{
													"number": "B. ",
													"content": [
														{
															"text": "Pergolas, clothes yards and poles, play yards, trellises\nand similar structures shall conform in location to the requirements\nfor garages. In the case of a trellis or pergola, such structure shall\nnot exceed 10 feet in height; in the case of a clothes yard or clothes\npole, eight feet in height; in the case of a play yard, three feet\nin height. No pool deeper than two feet shall be constructed except\nin compliance with this chapter."
														}
													]
												},
												{
													"number": "C. ",
													"content": [
														{
															"text": "Parking fields required in connection with any use\npermitted in any use district under this chapter shall be enclosed\nwith a four-foot chain-link fence situate on the property line abutting\nsaid parking field."
														}
													]
												}
											]
										}
									]
								},
								{
									"paragraph": "§ 340-121.1",
									"title": "Central air-conditioning equipment at one- and two-family dwellings.",
									"content": [
										{
											"content": [
												{
													"number": "A. ",
													"content": [
														{
															"text": "Purpose and intent. The Board of Trustees of the Village\nof Rockville Centre finds that it is necessary to regulate the installation\nand location of outdoor central heating, ventilating, or air-conditioning\n(hereinafter referred to as \"central air conditioning\") equipment\nat one- and two-family dwellings to protect and preserve property\nwithin the Village as described in this section. As used in this section,\nthe term \"central air conditioning\" shall mean a heating, ventilating\nand/or air conditioning system, located in whole or in part outside\nthe dwelling, which consists of heat exchangers, blowers, filters,\nsupply, exhaust and return ducts to distribute heated, cooled or dehumidified\nair to more than one room, or uses pipes to distribute chilled water\nto heat exchangers in more than one room, and which is not plugged\ninto a standard electrical outlet."
														}
													]
												},
												{
													"number": "B. ",
													"content": [
														{
															"text": "Central air-conditioning and other related mechanical\nequipment or systems at one- or two-family dwellings shall be installed,\nlocated and maintained, or replaced, so that under normal conditions\nof use such equipment and systems will not be a danger to health or\nwelfare and will not create excessive noise or otherwise become a\nnuisance. Related equipment or systems include, but are not limited\nto, apparatus, devices, fixtures, piping, pipe hangers, pipe covering,\nwiring, fittings and materials used as part of or in connection with\ncentral air-conditioning installations."
														}
													]
												},
												{
													"number": "C. ",
													"content": [
														{
															"text": "Moving parts of central air-conditioning equipment\nwhich may be a potential hazard shall be guarded as may be required\nby the Superintendent of Buildings to protect against accidental contact."
														}
													]
												},
												{
													"number": "D. ",
													"content": [
														{
															"text": "Location. All outdoor compressors used in connection\nwith central air-conditioning systems shall be installed at grade\nand shall be set back a minimum of 20 feet from the front property\nline and a minimum of 15 feet from the rear property line. No outdoor\ncompressor may be located in a side yard unless it is located not\nmore than six feet from the dwelling and at least three feet from\nthe nearest property line, except that in the case of a corner lot\nan outdoor compressor may be located in a side yard which abuts two\nstreets, provided that it is located not more than six feet from the\ndwelling and at least 10 feet from the nearest property line.[Amended 4-3-2012 by L.L. No. 1-2012]"
														}
													]
												},
												{
													"number": "E. ",
													"content": [
														{
															"text": "In addition to any other requirement for a building\npermit, no person shall install or replace central-air conditioning\nequipment at a one- or two-family dwelling without first obtaining\na permit as provided by this section."
														}
													]
												},
												{
													"number": "F. ",
													"content": [
														{
															"text": "Central air-conditioning permits shall be issued by\nthe Superintendent of Buildings upon written application, which shall\ninclude, at a minimum:"
														},
														{
															"content": [
																{
																	"number": "(1) ",
																	"content": [
																		{
																			"text": "A completed building application form, including\na completed one-family affidavit and a no-plumbing affidavit, if applicable;"
																		}
																	]
																},
																{
																	"number": "(2) ",
																	"content": [
																		{
																			"text": "Proof that the contractor is duly licensed to\nperform the proposed installation, and documentation of the contractor's\nworkers' compensation policy and liability insurance policy;"
																		}
																	]
																},
																{
																	"number": "(3) ",
																	"content": [
																		{
																			"text": "Two copies of an accurate and legible survey\nprepared by a duly authorized person indicating with sufficient clarity\nand detail the location of the air-conditioning equipment;"
																		}
																	]
																},
																{
																	"number": "(4) ",
																	"content": [
																		{
																			"text": "An electrical underwriter's application, including\na current copy of the electrician's worker's compensation policy and\nliability insurance policy;"
																		}
																	]
																},
																{
																	"number": "(5) ",
																	"content": [
																		{
																			"text": "Such other information as the Superintendent\nof Buildings shall require as reasonably necessary to the determination\nwhether a permit should issue hereunder, including documentation demonstrating\nthat the levels of sound emitted by the proposed unit(s) complies\nwith the requirements of this Code; and[Amended 4-3-2012 by L.L. No. 1-2012]"
																		}
																	]
																},
																{
																	"number": "(6) ",
																	"content": [
																		{
																			"text": "Payment of any required permit fee."
																		}
																	]
																}
															]
														}
													]
												},
												{
													"number": "G. ",
													"content": [
														{
															"text": "In granting a permit pursuant to this section, the\nSuperintendent of Buildings may impose reasonable requirements for\nthe remediation of sound when such remediation is necessary in the\nopinion of the Superintendent of Buildings to protect occupants of\nadjoining properties. Such requirements may include, but are not limited\nto, the integration of sound-deadening materials or sound-absorbing\nmaterials, or the addition of landscaping or other buffering."
														}
													]
												},
												{
													"number": "H. ",
													"content": [
														{
															"text": "In granting any permit pursuant to this section for\nreplacement of an existing central air-conditioning system, the Superintendent\nof Buildings may waive or vary the setback requirements otherwise\nrequired by this section, upon satisfactory demonstration that the\nexisting central air-conditioning unit:"
														},
														{
															"content": [
																{
																	"number": "(1) ",
																	"content": [
																		{
																			"text": "Is being replaced in kind; and"
																		}
																	]
																},
																{
																	"number": "(2) ",
																	"content": [
																		{
																			"text": "Was lawfully installed"
																		}
																	]
																}
															]
														}
													]
												},
												{
													"number": "I. ",
													"content": [
														{
															"text": "Upon completion of the installation authorized by\na permit described in this section, submission of a completed underwriter's\ncertificate, and payment of any applicable fee, the Superintendent\nof Buildings shall issue a notice of completion."
														}
													]
												}
											]
										}
									]
								},
								{
									"paragraph": "§ 340-121.2",
									"title": "Green space buffer required between residential property and any adjoining nonresidential property.",
									"content": [
										{
											"content": [
												{
													"number": "A. ",
													"content": [
														{
															"text": "A professionally landscaped green space buffer shall be located and\nmaintained on every property in a nonresidential zoning district or\nused for nonresidential purposes and which adjoins property in a residential\ndistrict or used for residential purposes."
														}
													]
												},
												{
													"number": "B. ",
													"content": [
														{
															"text": "Such buffer shall consist of a minimum depth of five feet from the\nproperty line between the properties, and shall be located and maintained\nalong the entire length of the lot line and/or boundary separation\nbetween the properties. The buffer area may contain suitable trees,\nshrubs and grass, and shall include a six-foot-high fence of suitable\ndesign located on the property line separating the nonresidential\nproperty from the adjoining residential property."
														}
													]
												},
												{
													"number": "C. ",
													"content": [
														{
															"text": "Where the approval of the Board of Appeals, Planning Board, or Exterior\nDesign Review Board is required for the use of the nonresidential\nproperty, each such board shall have jurisdiction to enforce this\nrequirement and approve the proposed buffer. Where no approval is\nrequired from any of such boards, the Building Department shall enforce\nthis requirement and approve the proposed buffer before any building\npermit issued for construction on the nonresidential property."
														}
													]
												},
												{
													"number": "D. ",
													"content": [
														{
															"text": "The requirements of this section shall not be applicable to nonresidential\nproperties adjacent to residential properties if the nonresidential\nproperty is lawfully being used without such buffer at the time of\nadoption of this section. However, in the event of any subsequent\nconstruction, enlargement or alteration of any building or structure\non such property, or other development of such property requiring\na permit or approval from the Village, such buffer shall be required\nto be installed and maintained as provided in this section unless\ndetermined by the appropriate authority not to be feasible after consideration\nof existing conditions on the site."
														}
													]
												},
												{
													"number": "E. ",
													"content": [
														{
															"text": "Where adjoining properties in a residential district and in a nonresidential\ndistrict lawfully are being used for a common use, the buffer zone\nrequired by this section shall be located along each exterior property\nline of such property which separates such entire property from any\nadjoining residential use or district."
														}
													]
												}
											]
										}
									]
								},
								{
									"paragraph": "§ 340-122",
									"title": "Swimming pools.\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t[1]",
									"content": [
										{
											"content": [
												{
													"number": "A. ",
													"content": [
														{
															"text": "Swimming pools as defined in this chapter and in compliance with\nthe Uniform Fire Prevention and Building Code are permitted in any\nresidential use district as an accessory to a residential dwelling\nfor the private use of the owner of such dwelling and the families\nand guests of such owner, provided that a permit is obtained in accordance\nwith the provisions of this chapter, other provisions of this Code,\nand the provisions of the New York State Uniform Fire Prevention and\nBuilding Code."
														}
													]
												},
												{
													"number": "B. ",
													"content": [
														{
															"text": "Location."
														},
														{
															"content": [
																{
																	"number": "(1) ",
																	"content": [
																		{
																			"text": "On lots other than corner lots, swimming pools shall be located\nin the rear third of the lot and shall be set back a minimum of 10\nfeet from all property lines."
																		}
																	]
																},
																{
																	"number": "(2) ",
																	"content": [
																		{
																			"text": "On corner lots, swimming pools shall be located within the rear\nquadrant and/or the rear third of the lot, taken from a forty-five-degree\nangle from the adjacent street frontage/corner, and shall be set back\nat least 10 feet from all property lines. In no case shall any part\nof the swimming pool be located in a required setback area of a front,\nrear or side yard."
																		}
																	]
																},
																{
																	"number": "(3) ",
																	"content": [
																		{
																			"text": "In all cases, swimming pools shall be set back at least eight\nfeet from every part of the principal dwelling on the property and\nat least six feet from any accessory building or structure and detached\ngarage on the property."
																		}
																	]
																}
															]
														}
													]
												},
												{
													"number": "C. ",
													"content": [
														{
															"text": "Fence required."
														},
														{
															"content": [
																{
																	"number": "(1) ",
																	"content": [
																		{
																			"text": "In all cases there shall be erected and maintained a fence,\napproved by the Superintendent of Buildings, not less than six feet\nin height, entirely surrounding and enclosing the swimming pool from\nall adjoining lots. Such fence shall be constructed of quality materials\nand shall be designed to contain no openings or projections which\nwould permit hand or toe holds sufficient for climbing, as determined\nby the Superintendent of the Building Department."
																		}
																	]
																},
																{
																	"number": "(2) ",
																	"content": [
																		{
																			"text": "On lots other than corner lots, such required fencing shall\nbe located within the rear setback line of the principal dwelling,\nas determined by the Superintendent of the Building Department."
																		}
																	]
																},
																{
																	"number": "(3) ",
																	"content": [
																		{
																			"text": "On corner lots, such required fencing shall be located within\nthe rear setback line of the principal dwelling, except that an estate-type\nfence not less than six feet in height may be located beyond the front\nsetback line along the longest street frontage, provided that such\nfence is set back at least three feet from the property line, as determined\nby the Superintendent of Building Department, and further provided\nthat evergreen arborvitae or similar landscaping is planted and maintained,\nas approved by the Superintendent, between such fence and such property\nline."
																		}
																	]
																},
																{
																	"number": "(4) ",
																	"content": [
																		{
																			"text": "On all lots, in addition to all other fencing requirements,\na fence not less than four feet high shall be installed and continuously\nmaintained to separate the swimming pool from the principal dwelling."
																		}
																	]
																}
															]
														}
													]
												},
												{
													"number": "D. ",
													"content": [
														{
															"text": "Fence gates; openings. Every gate or other opening in the fence surrounding\nsuch swimming pool shall be equipped with a self-closing and self-latching\ndevice designed to keep, and capable of keeping, such gate or opening\nsecurely closed. Such gate or opening shall be kept locked at all\ntimes the swimming pool is not in actual use."
														}
													]
												},
												{
													"number": "E. ",
													"content": [
														{
															"text": "Percentage of lot coverage. The area of such swimming pool shall\nbe added to the area of all main buildings, garages and accessory\nbuildings in computing the permitted building area in a use district."
														}
													]
												},
												{
													"number": "F. ",
													"content": [
														{
															"text": "Lighting. There shall be installed minimum security lighting surrounding\nsuch swimming pool, as approved by the Superintendent of Buildings.\nLighting devices installed in connection with a swimming pool shall\nbe designed so as to prevent glare or rays therefrom from going beyond\nthe property lines."
														}
													]
												},
												{
													"number": "G. ",
													"content": [
														{
															"text": "Water supply connections and drainage facilities. All water supply\nconnections and drainage facilities to and from a swimming pool must\nbe approved by the Superintendent of Public Utilities and Superintendent\nof Public Works and shall be designed to safeguard and protect the\nwater supply system of the Village in compliance with the rules and\nregulations of said departments. All swimming pools, whether indoor\nor outdoor, shall comply with said rules and regulations."
														}
													]
												},
												{
													"number": "H. ",
													"content": [
														{
															"text": "Materials and construction standards. All swimming pools shall be\nconstructed and maintained of materials having adequate strength to\nretain the water designed to be contained therein."
														}
													]
												},
												{
													"number": "I. ",
													"content": [
														{
															"text": "Drainage. All swimming pools shall have proper drainage sufficient\nin size, capacity and scope to be able to drain the swimming pool\nonsite within a proper time frame, in accordance with generally acceptable\nstandards, as determined by the Superintendent of the Building Department\nand the Superintendent of Public Works. No person shall cause or permit\na swimming pool to be drained onto public property or onto private\nproperty owned by any person other than the owner of the property\non which the swimming pool is located."
														}
													]
												},
												{
													"number": "J. ",
													"content": [
														{
															"text": "Code requirements. All electric services, devices, pumps, filters\nand associated swimming pool appurtenances, including alarms, shall\nbe installed, maintained and operated in accordance with the New York\nState Uniform Fire Prevention and Building Code, and to the reasonable\nsatisfaction of the Superintendent of Electric Department and the\nSuperintendent of the Building Department, and with certification\nfrom an approved electrical inspection agency where applicable. Further,\nthe swimming pool and all electrical components or related equipment\nshall comply with clearance requirements of the National Electrical\nCode and the National Electrical Safety Code to the satisfaction of\nthe Superintendent of the Electrical Department."
														}
													]
												}
											]
										},
										{
											"footnote": "[1]\nEditor's Note: See also Ch. 291, Swimming Pools.\n"
										}
									]
								}
							]
						}
					]
				}
			]
		}
	]
}