{
	"url": "http://ecode360.com/7728170",
	"paras": [
		{
			"paragraph": "ยง 340-22",
			"title": "Uses.",
			"content": [
				{
					"text": "In the Residence C District, no building or\nstructure shall be used, and no building or structure shall be erected\nor structurally altered which is arranged, intended or designed to\nbe used, for other than one or more of the following uses:"
				},
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Any use permitted in Residence A or B Districts."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Office buildings, including professional and medical\noffice buildings."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Hospitals, other than for the mentally ill or for\nalcoholics or drug addicts."
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "College or university."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "ยง 340-23",
			"title": "Other regulations.",
			"content": [
				{
					"text": "Single- , two-family and multifamily uses shall comply with the regulations set forth in this chapter in Article V, Residence B District, with respect to front yard, side yard, rear yard and corner plot setbacks, building heights and density. Office buildings, including professional and medical office buildings, hospital and medical buildings shall comply with the same front yard, side yard, rear yard and corner plot setbacks and building heights as multifamily uses."
				}
			]
		},
		{
			"paragraph": "ยง 340-24",
			"title": "Parking requirements.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Parking space requirements are set forth in Chart IV of the Rockville Centre Zoning Code. Chart IV is entitled \"Schedule of Minimum Required Off-Street Parking.\"[1]"
								},
								{
									"footnote": "[1]\nEditor's Note: Chart IV is included at the end of this chapter.\n"
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Upon premises used for professional medical buildings\nor hospitals, parking spaces shall be maintained upon the same plot."
								}
							]
						}
					]
				}
			]
		}
	]
}