{
	"url": "http://ecode360.com/8080531",
	"paras": [
		{
			"paragraph": "§ 140-3",
			"title": "Permitted uses.",
			"content": [
				{
					"text": "No building or structure shall be erected, used\nor maintained nor shall any building, structure or premises be altered\nor remodeled nor any lot used for other than 1 or more of the following\nuses:"
				},
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "A single-family detached dwelling with private garage,\nthe dimensions of which garage shall be at least 10 feet wide and\n20 feet deep.[Amended 10-5-1987; 4-28-2011 by L.L. No. 1-2011]"
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "A nonprofit institution of learning approved by the\nState Board of Regents and supported by public funds."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "A Village park for recreational use."
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "A Village Hall or other buildings necessary in connection\nwith the administration of the affairs of the Village."
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "A church or other buildings used exclusively for religious\npurposes. A parish house."
								}
							]
						},
						{
							"number": "F. ",
							"content": [
								{
									"text": "Professional office, provided that the office is located\nin the dwelling in which the professional person resides and provided\nthere is no display of advertising, except for doctors and dentists\nwho may have a small professional name plate which may be illuminated\nby an electric lamp not exceeding 15 watts of power contained within\nthe sign."
								}
							]
						},
						{
							"number": "G. ",
							"content": [
								{
									"text": "Private garage detached or attached or within the\nmain building."
								}
							]
						},
						{
							"number": "H. ",
							"content": [
								{
									"text": "No signs except as mentioned in Subsection F shall be permitted, except the following:[Amended 12-4-1989 by L.L. No. 2-1989]"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Small sign, which may be illuminated, not exceeding\n1/2 square foot to identify name or number of a resident."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "One sign only for sale or rental of real estate on\nproperty on which same is located, said sign not to exceed 3 square\nfeet and to contain only the words \"for sale\" or \"for rent\" and a\ntelephone number, and, if not attached to the building, the same shall\nconform with the minimum front and side yard setbacks herein stated\nin this chapter."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Notices or advertisements required by law, or any\nlegal proceedings, or signs put up for public notices."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "Signs for the directions, regulation or information\nfor the safety of the public, in each case when authorized in writing\nby the Village Clerk.[Amended 10-7-1996 by L.L. No. 1-1996]"
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "I. ",
							"content": [
								{
									"text": "Other accessory buildings or structures conforming to the provisions of Article III."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 140-4",
			"title": "Height.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "In the case of a single-family dwelling no building\nshall exceed 2 1/2 stories, with a maximum height of 30 feet."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Buildings other than a single-family dwelling shall\nnot exceed 35 feet in height, except a church spire or belfry."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Sky exposure plane/height setback ratio limitation.[Added 5-5-2014 by L.L. No. 2-2014]"
								},
								{
									"content": [
										{
											"number": "(a) ",
											"content": [
												{
													"text": "No\nportion of any principal building on a residential lot shall invade\nthe sky exposure plane, based upon the distance between the side of\nthe building to be measured and the nearest side property line, and\nwhich shall be a ratio of two feet vertical to one foot horizontal.\nThis regulation applies to all side yards and to all sides of buildings\nfacing any side property line."
												}
											]
										},
										{
											"number": "(b) ",
											"content": [
												{
													"text": "For\npurposes of this section, all distances shall be measured along the\nshortest horizontal line between the nearest side lot line and a vertical\nplane running through the point being measured, which plane is parallel\nto such side lot line."
												}
											]
										}
									]
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 140-5",
			"title": "Plot area.",
			"content": [
				{
					"text": "No dwelling or other building shall be constructed\non a lot containing an area of less than 1/4 acre (10,890 square feet)\nand having a frontage of not less than 90 feet. The area shall be\ncomputed on the basis of a reasonable flat lot. Berms more than 3\nfeet in height shall be excluded from the computations. Slopes of\nberm shall measure not less than 2 on the horizontal and 1 on the\nvertical."
				}
			]
		},
		{
			"paragraph": "§ 140-6",
			"title": "Building area.",
			"content": [
				{
					"text": "The building area shall not exceed 25% of the\nlot area."
				}
			]
		},
		{
			"paragraph": "§ 140-7",
			"title": "Floor area.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "No dwelling shall be erected unless it has a habitable\nfirst floor area in a 1-story building of at least 1,300 square feet."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "The floor area ratio of the lot shall not exceed 0.40."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 140-8",
			"title": "Front yard.",
			"content": [
				{
					"text": "On an interior lot there shall be a front yard,\nthe depth of which shall be not less than 35 feet from the front property\nline. Where a front yard setback has been established, the front yard\ndepth shall conform to the established front yards of adjacent residential\nbuildings but shall not be less than 25 feet from the street line."
				}
			]
		},
		{
			"paragraph": "§ 140-9",
			"title": "Corner lot.",
			"content": [
				{
					"text": "On a corner lot a dwelling shall have a front yard on each street conforming with the provisions of § 140-8."
				}
			]
		},
		{
			"paragraph": "§ 140-10",
			"title": "Front of building.",
			"content": [
				{
					"text": "The principal entrance of any building shall\nface the street which the property adjoins through the wall or side\nof such building nearest to such adjoining street."
				}
			]
		},
		{
			"paragraph": "§ 140-11",
			"title": "Side yards.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "On an interior lot there shall be 2 side yards, 1\non each side of the main building, the aggregate width of which shall\nbe not less than 40 feet, and either side yard shall be not less than\n15 feet wide. Buildings over 30 feet in height shall have a side yard\non each side of the building of not less than 20 feet."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "On a corner lot there shall be only 1 side yard of not less than 15 feet. Said yard shall be on the side adjoining the interior lot opposite the front yard having the greater street frontage. The remaining yard shall be considered the rear yard and shall conform to the provision of § 140-12."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 140-12",
			"title": "Rear yard.",
			"content": [
				{
					"text": "There shall be a rear yard the depth of which\nshall be not less than 30 feet. No building to be used for dwelling\npurposes shall be erected in back of or to the rear of a building\non the same lot. No building situated in back of or to the rear of\na building on the same lot at the effective date of this chapter shall\nbe altered and used for dwelling purposes."
				}
			]
		},
		{
			"paragraph": "§ 140-13",
			"title": "Planning Board.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Establishment and powers. A Planning Board is hereby\nestablished with all of the powers and duties set forth in New York\nState Village Law."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Appointment and membership. Members of the Planning Board shall be appointed by the Mayor with the approval of the Board of Trustees as provided in Chapter 1, General Provisions, Article IV, Boards, of this Code."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 140-14",
			"title": "Subdivision and merger.",
			"content": [
				{
					"text": "No parcel of land shall be subdivided to create\n1 or more new lots, nor shall the lot lines of existing lots be altered\nunless approved by the Planning Board in conformity with this chapter\nand in accordance with New York State Village Law, and such other\nrules and regulations established by resolution of the Board of Trustees."
				}
			]
		},
		{
			"paragraph": "§ 140-15",
			"title": "Change in plans or construction.",
			"content": [
				{
					"text": "Nothing herein contained shall require any change\nin the plans or construction of a building under construction, provided\nthat at the effective date of this chapter the construction shall\nhave proceeded to the completion of the foundation, and provided,\nfurther, that the work thereon shall be diligently prosecuted to completion\nwithin 1 year from the effective date of this chapter."
				}
			]
		},
		{
			"paragraph": "§ 140-16",
			"title": "Extensions to existing buildings.",
			"content": [
				{
					"text": "In the case of a building erected prior to the\neffective date of this chapter, and having existing side yards less\nthan permitted in this chapter, extensions to the rear of the main\nbuilding shall be permitted as follows:"
				},
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "If the minimum existing side yard is less than 10\nfeet, extension to the rear of the main building must maintain a minimum\nside yard of not less than 10 feet."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "The aggregate width of side yards at the extension\nshall be not less than 40 feet."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "The extension of the building to the rear may be extended\nto the minimum rear yard requirement, provided the building, including\nthe extension, does not exceed the limitations of lot coverage and\nfloor area ratio requirements."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 140-17",
			"title": "Cellars.",
			"content": [
				{
					"text": "A cellar shall not be used or occupied for other\nthan utility and recreation purposes."
				}
			]
		},
		{
			"paragraph": "§ 140-18",
			"title": "Basement.",
			"content": [
				{
					"text": "A basement may be used as habitable space."
				}
			]
		},
		{
			"paragraph": "§ 140-19",
			"title": "Impervious surface.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "The impervious\nsurface of any lot shall not exceed 45% of the lot area."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "The impervious\nsurface of any front yard shall not exceed 30% of the lot area of\nsuch front yard."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 140-20",
			"title": "Driveway widths.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Single-car garage. A driveway from the street to a\nsingle-car garage may have a maximum width of 20 feet.[Amended 7-1-2013 by L.L. No. 1-2013]"
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Two-car garage. A driveway from the street to a 2-car\ngarage may have a maximum width of 20 feet, except that it may fan\nout to a width of 22 feet at a distance 3 feet from the street."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 140-21",
			"title": "Lampposts.",
			"content": [
				{
					"text": "No accessory structures are permitted in the\nfront yard; except lampposts may be constructed in accordance with\nthe following restrictions:"
				},
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Location limited to front yard, no farther than 10\nfeet from the front wall of the building."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Maximum height, including pedestal, not to exceed\n6 feet."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Building permit and Architectural Review Board approval\nrequired."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 140-22",
			"title": "Accessory structures and encroachments permitted.",
			"content": [
				{
					"text": "Accessory buildings or structures and encroachments,\nconforming to the provision of this article, are permitted."
				}
			]
		},
		{
			"paragraph": "§ 140-23",
			"title": "Accessory buildings.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Accessory buildings, except as otherwise provided\nin this article, shall not be over 15 feet in height at their highest\npoint. The yard area occupied by an accessory building shall be included\nin computing the maximum percentage of the lot area which may be utilized\nfor building."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Accessory buildings shall be a distance at least 10\nfeet more from the street line than the rear wall of the main building\nand not less than 5 feet from any lot side line or 2 feet from any\nlot rear line."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "No accessory building, with the exception of fences\nor retaining walls, shall be erected within 20 feet of a building\nused for residence purposes on an adjoining lot."
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "Unless otherwise provided in this article, accessory buildings and/or structures on corner lots 100 feet or less in depth shall be located as far as possible from the front property lines while conforming to the provisions of Subsections A and B."
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "On a corner lot a private detached garage accessory to a dwelling on the same lot may be erected in the rear yard, provided the depth of a lot is sufficient to permit compliance with the provisions of Subsection A to D, inclusive, and provided the setback of such garage complies with the front yard requirements."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 140-24",
			"title": "Accessory structures.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "No fence shall be created, constructed or altered without first obtaining a building permit as provided in Article III of Chapter 43, Building Construction. Fences shall not exceed 4 feet in height. Fences shall be of an open-type construction, allowing a passage of both light and air through the fence, and shall be constructed of wrought iron, polyvinyl chloride (PVC) or wood. The style of fence shall be approved by the Architectural Review Board prior to installation. In addition to any landscaping that will be required by the Architectural Review Board, as a minimum requirement, evergreen shrubs at least 3 feet in height as measured from grade level at installation shall be planted at each fence post. Open-type construction shall mean construction in which the materials used are present in not more than 60% of the surface area of the fence, and the obstructed areas and the unobstructed areas are uniformly distributed throughout the area of the fence. Fences constructed of any other material or in any other manner shall require the approval of the Board of Appeals. Fences may be constructed to enclose the rear yard or any portion thereof, but in no event shall any fence extend forward of the rear wall of the dwelling. No fences shall be permitted in front yards or side yards unless approved by the Board of Appeals.[Amended 1-10-2005 by L.L. No. 2-2005]"
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "A retaining wall shall have a maximum height of 4\nfeet with a setback ratio of 1:1. Retaining walls shall not extend\nmore than 6 inches above the surface of the ground which they support."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Stationary outdoor fireplaces shall be erected in\nrear yards only and shall be at least 10 feet distance from the side\nand rear yard property lines and shall not exceed 5 feet in height."
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "Pergolas shall not exceed 10 feet in height."
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "No accessory structure or building shall be constructed\nor erected upon the premises for the purpose of containing air-conditioning\nequipment, ventilating fans and appurtenances thereto; such air conditioning,\nventilating fans and appurtenant equipment shall be contained within\nthe confines of the main building."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Upon application the limiting provisions of this section\nmay be waived when a central air-conditioning unit of 5 tons or less\nis installed in the side or rear yard and when such unit is installed\nin compliance with the side and rear yard sections of this article\nand when such installation has a certified sound level rating at the\nadjoining property line not exceeding 25-35 decibels."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "When a central air-conditioning system is installed,\na certificate of installation certifying that it has been installed\nby the builder in accordance with the manufacturer's instructions\nshall be issued to the owner and a copy of same shall be filed with\nthe Village Clerk."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "F. ",
							"content": [
								{
									"text": "A single garden shed or tool shed is permitted, with\na permit from the Building Inspector, subject to the provisions of\nthis section and other applicable provisions of this Code. The shed\nmay be located in the rear yard, provided that (1) it has a gabled\nroof with a minimum pitch of 1 in 3, that (2) it does not exceed 9\nfeet in height from grade to the top of gable ridge, (3) floor area\nof shed may not occupy more than 3.20% of the rear yard area, but\nin no event shall it be more than 80 square feet, (4) it is set back\nno less than 3 feet or more than 5 feet from the side or rear lot\nline, (5) it shall be a distance of at least 10 feet more from the\nstreet line than the rear wall of the main building, (6) side and\nrear lot lines at sheds shall have evergreens planted to a minimum\nheight of 4 feet at time of planting as a buffer zone. Nonconforming\nsheds that are modified, rebuilt or replaced must conform with this\nchapter."
								}
							]
						},
						{
							"number": "G. ",
							"content": [
								{
									"text": "Other accessory structures not mentioned herein shall be located in accordance with the requirements for accessory buildings as provided in § 140-23A through E, inclusive. [Amended 8-7-2006 by L.L. No. 5-2006]"
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 140-25",
			"title": "Permitted encroachments.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Encroachments into required yards are permitted in\nthe Village as provided in this article only."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Cornice and eaves projection not more than 24 inches;\ngutters projecting not more than 8 inches; chimneys not projecting\nmore than 18 inches; bay windows not more than 6 feet in width and\nprojection not more than 24 inches into any front yard; bay windows\nnot projecting more than 24 inches into any side or rear yard; belt\ncourses and sills projecting no more than 6 inches."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "One-story open porches and terraces projecting not\nmore than 5 feet into a minimum front yard."
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "One-story enclosed vestibule not greater than 8 feet\nin width and 5 feet in depth extending into a minimum front yard,\nprovided that said vestibule shall conform in architecture and material\nto the main building and after the erection thereof there shall remain\na front yard with a depth not less than the least depth of a front\nyard existing in the same block."
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "No encroachment which is permitted to extend into\nany yard if unroofed or unenclosed shall thereafter be enclosed permanently\nin whole or in part."
								}
							]
						},
						{
							"number": "F. ",
							"content": [
								{
									"text": "No permitted encroachment shall in any case extend\nor project closer than 13 feet to any lot line."
								}
							]
						},
						{
							"number": "G. ",
							"content": [
								{
									"text": "Steps extending into a minimum yard shall not be considered\nan encroachment into such yard, provided that such steps do not exceed\nin height the first floor level of the building and provided further\nthat such steps are necessary to provide access to a walk, porch,\nterrace or vestibule."
								}
							]
						},
						{
							"number": "H. ",
							"content": [
								{
									"text": "In any case where the Board of Appeals has diminished\nrequired yard by variance, none of the foregoing encroachments shall\nbe permitted in such diminished yard."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 140-26",
			"title": "Swimming pools.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Swimming pools may be installed only as an accessory\nstructure to a residence for the private use of the owner or occupant\nof such residence and their families and guests."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "No swimming pool shall be installed or maintained\nas authorized in the preceding section except on the following conditions:[Amended 2-4-1991 by L.L. No. 1-1991]"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Such pool shall be installed in the rear yard of the\npremises and shall not exceed a height of 18 inches above ground level."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Swimming pools shall be located not less than 30 feet\ndistant from the side and rear lot lines, and not less than 20 feet\nfrom any building or structure other than the dwelling located on\nthe plot."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "All pools shall be fenced in accordance with the New York State Uniform Fire Prevention and Building Code. Such fencing shall not be less than 4 feet nor more than 5 feet in height, and may be erected so as to completely enclose the pool itself or the entire rear property as specified in this chapter, Article III, § 140-24A. The location and style of fence shall be approved prior to installation by the Architectural Review Board. Mature shrubbery and/or plants shall be planted around the exterior of the fencing to screen the fencing.[Amended 2-10-2003 by L.L. No. 1-2003]"
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "Such pool area shall not occupy more than 40% of the\nopen area of the rear yard after compliance with all setback restrictions."
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "If the water for such pool is supplied from a private\nwell, there shall be no cross-connection with the public water supply\nsystem."
												}
											]
										},
										{
											"number": "(6) ",
											"content": [
												{
													"text": "If the water for such pool is supplied from the public\nwater supply system, the inlet shall be above the overflow level of\nthe pool."
												}
											]
										},
										{
											"number": "(7) ",
											"content": [
												{
													"text": "Such pool shall be chemically treated in a manner\nsufficient to maintain the bacterial standards established by the\nprovisions of the New York State Sanitary Code or other agencies having\njurisdiction relating to public swimming pools."
												}
											]
										},
										{
											"number": "(8) ",
											"content": [
												{
													"text": "No permission shall be granted for the installation\nof any swimming pool unless the plans therefore meet the approval\nof the Building Inspector's construction requirements nor until the\nowner of the premises has filed with the Building Inspector a certificate\napproved by a professional engineer licensed by the State of New York\nstating that the drainage of such pool is adequate and will not interfere\nwith the public water supply system, with existing sanitary facilities\nor with the public highways."
												}
											]
										},
										{
											"number": "(9) ",
											"content": [
												{
													"text": "No loud speaker device which can be heard beyond the\nproperty lines of the premises in which any swimming pool has been\ninstalled may be operated in connection with such pool, nor may any\nlighting be installed in connection therewith which shall throw any\nrays beyond such property lines."
												}
											]
										},
										{
											"number": "(10) ",
											"content": [
												{
													"text": "In determining any application for permission to erect a fence other than as required in Subsection B(3) hereof, the Board of Appeals shall consider whether the proposed fence will interfere with or impair the use of the light or air enjoyed by the abutting properties, the character of the abutting properties, the necessity of such a fence to protect the property to be enclosed thereby or the abutting properties, the existence, height, and nature of other fences in the vicinity."
												}
											]
										},
										{
											"number": "(11) ",
											"content": [
												{
													"text": "Outdoor water pools shall for the purposes of\nthis chapter be construed to mean any swimming pool, tank, depression\nor excavation in any material, dike or berm constructed, erected,\nexcavated or maintained which will cause the retaining of water to\na greater depth than 18 inches and having a larger plane surface area\nof water greater than 100 square feet, except such as shall hereinafter\nbe excluded. The word \"pool\" shall be construed to mean outdoor water\npool."
												}
											]
										},
										{
											"number": "(12) ",
											"content": [
												{
													"text": "Should the owner abandon the pool he shall arrange\nto remove the depression and return the surface of the ground to its\noriginal grade and approximately in the same condition as before the\npool was constructed, and he shall further notify the Building Inspector\nof the abandonment so that an inspection of the site may be made and\nthe records of the permit be marked accordingly."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Portable swimming pools of a size capable of retaining water to a greater depth than 18 inches and having a larger plane surface area of water greater than 100 square feet shall not be required to comply with the provisions of Subsection B, providing the following conditions are complied with in all respects:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "The pool shall be so located on the premises as to\nbe visible from the dwelling."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "The pool shall be located in the rear yard of the\npremises and as far removed from all property lines as is practicable."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "The pool shall be equipped with a cover approved by\nthe Building Inspector and shall be of sufficient strength to protect\nagainst accidental entry into the pool. The pool shall be covered\nat all times when containing water and not in use."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "When the pool contains water and is not in use, it\nshall be equipped with an electrical device, approved by the Building\nInspector to sound an alarm on entry."
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "The water in the pool shall be drained whenever the\nresidence it serves is left unattended for a period in excess of 24\nhours."
												}
											]
										},
										{
											"number": "(6) ",
											"content": [
												{
													"text": "Provision shall be made on the premises for drainage\nof water from the pool."
												}
											]
										},
										{
											"number": "(7) ",
											"content": [
												{
													"text": "The pool shall be treated in such manner as to maintain\nthe bacterial standards satisfactory to the Nassau County Department\nof Health, or other agencies having a jurisdiction."
												}
											]
										}
									]
								}
							]
						}
					]
				}
			]
		}
	]
}