{
	"url": "http://ecode360.com/8080531",
	"paras": [
		{
			"paragraph": "§ 140-3",
			"title": "Permitted uses.",
			"content": [
				{
					"text": "No building or structure shall be erected, used\nor maintained nor shall any building, structure or premises be altered\nor remodeled nor any lot used for other than 1 or more of the following\nuses:"
				},
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "A single-family detached dwelling with private garage,\nthe dimensions of which garage shall be at least 10 feet wide and\n20 feet deep.[Amended 10-5-1987; 4-28-2011 by L.L. No. 1-2011]"
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "A nonprofit institution of learning approved by the\nState Board of Regents and supported by public funds."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "A Village park for recreational use."
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "A Village Hall or other buildings necessary in connection\nwith the administration of the affairs of the Village."
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "A church or other buildings used exclusively for religious\npurposes. A parish house."
								}
							]
						},
						{
							"number": "F. ",
							"content": [
								{
									"text": "Professional office, provided that the office is located\nin the dwelling in which the professional person resides and provided\nthere is no display of advertising, except for doctors and dentists\nwho may have a small professional name plate which may be illuminated\nby an electric lamp not exceeding 15 watts of power contained within\nthe sign."
								}
							]
						},
						{
							"number": "G. ",
							"content": [
								{
									"text": "Private garage detached or attached or within the\nmain building."
								}
							]
						},
						{
							"number": "H. ",
							"content": [
								{
									"text": "No signs except as mentioned in Subsection F shall be permitted, except the following:[Amended 12-4-1989 by L.L. No. 2-1989]"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Small sign, which may be illuminated, not exceeding\n1/2 square foot to identify name or number of a resident."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "One sign only for sale or rental of real estate on\nproperty on which same is located, said sign not to exceed 3 square\nfeet and to contain only the words \"for sale\" or \"for rent\" and a\ntelephone number, and, if not attached to the building, the same shall\nconform with the minimum front and side yard setbacks herein stated\nin this chapter."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Notices or advertisements required by law, or any\nlegal proceedings, or signs put up for public notices."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "Signs for the directions, regulation or information\nfor the safety of the public, in each case when authorized in writing\nby the Village Clerk.[Amended 10-7-1996 by L.L. No. 1-1996]"
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "I. ",
							"content": [
								{
									"text": "Other accessory buildings or structures conforming to the provisions of Article III."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 140-4",
			"title": "Height.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "In the case of a single-family dwelling no building\nshall exceed 2 1/2 stories, with a maximum height of 30 feet."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Buildings other than a single-family dwelling shall\nnot exceed 35 feet in height, except a church spire or belfry."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Sky exposure plane/height setback ratio limitation.[Added 5-5-2014 by L.L. No. 2-2014]"
								},
								{
									"content": [
										{
											"number": "(a) ",
											"content": [
												{
													"text": "No\nportion of any principal building on a residential lot shall invade\nthe sky exposure plane, based upon the distance between the side of\nthe building to be measured and the nearest side property line, and\nwhich shall be a ratio of two feet vertical to one foot horizontal.\nThis regulation applies to all side yards and to all sides of buildings\nfacing any side property line."
												}
											]
										},
										{
											"number": "(b) ",
											"content": [
												{
													"text": "For\npurposes of this section, all distances shall be measured along the\nshortest horizontal line between the nearest side lot line and a vertical\nplane running through the point being measured, which plane is parallel\nto such side lot line."
												}
											]
										}
									]
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 140-5",
			"title": "Plot area.",
			"content": [
				{
					"text": "No dwelling or other building shall be constructed\non a lot containing an area of less than 1/4 acre (10,890 square feet)\nand having a frontage of not less than 90 feet. The area shall be\ncomputed on the basis of a reasonable flat lot. Berms more than 3\nfeet in height shall be excluded from the computations. Slopes of\nberm shall measure not less than 2 on the horizontal and 1 on the\nvertical."
				}
			]
		},
		{
			"paragraph": "§ 140-6",
			"title": "Building area.",
			"content": [
				{
					"text": "The building area shall not exceed 25% of the\nlot area."
				}
			]
		},
		{
			"paragraph": "§ 140-7",
			"title": "Floor area.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "No dwelling shall be erected unless it has a habitable\nfirst floor area in a 1-story building of at least 1,300 square feet."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "The floor area ratio of the lot shall not exceed 0.40."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 140-8",
			"title": "Front yard.",
			"content": [
				{
					"text": "On an interior lot there shall be a front yard,\nthe depth of which shall be not less than 35 feet from the front property\nline. Where a front yard setback has been established, the front yard\ndepth shall conform to the established front yards of adjacent residential\nbuildings but shall not be less than 25 feet from the street line."
				}
			]
		},
		{
			"paragraph": "§ 140-9",
			"title": "Corner lot.",
			"content": [
				{
					"text": "On a corner lot a dwelling shall have a front yard on each street conforming with the provisions of § 140-8."
				}
			]
		},
		{
			"paragraph": "§ 140-10",
			"title": "Front of building.",
			"content": [
				{
					"text": "The principal entrance of any building shall\nface the street which the property adjoins through the wall or side\nof such building nearest to such adjoining street."
				}
			]
		},
		{
			"paragraph": "§ 140-11",
			"title": "Side yards.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "On an interior lot there shall be 2 side yards, 1\non each side of the main building, the aggregate width of which shall\nbe not less than 40 feet, and either side yard shall be not less than\n15 feet wide. Buildings over 30 feet in height shall have a side yard\non each side of the building of not less than 20 feet."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "On a corner lot there shall be only 1 side yard of not less than 15 feet. Said yard shall be on the side adjoining the interior lot opposite the front yard having the greater street frontage. The remaining yard shall be considered the rear yard and shall conform to the provision of § 140-12."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 140-12",
			"title": "Rear yard.",
			"content": [
				{
					"text": "There shall be a rear yard the depth of which\nshall be not less than 30 feet. No building to be used for dwelling\npurposes shall be erected in back of or to the rear of a building\non the same lot. No building situated in back of or to the rear of\na building on the same lot at the effective date of this chapter shall\nbe altered and used for dwelling purposes."
				}
			]
		},
		{
			"paragraph": "§ 140-13",
			"title": "Planning Board.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Establishment and powers. A Planning Board is hereby\nestablished with all of the powers and duties set forth in New York\nState Village Law."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Appointment and membership. Members of the Planning Board shall be appointed by the Mayor with the approval of the Board of Trustees as provided in Chapter 1, General Provisions, Article IV, Boards, of this Code."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 140-14",
			"title": "Subdivision and merger.",
			"content": [
				{
					"text": "No parcel of land shall be subdivided to create\n1 or more new lots, nor shall the lot lines of existing lots be altered\nunless approved by the Planning Board in conformity with this chapter\nand in accordance with New York State Village Law, and such other\nrules and regulations established by resolution of the Board of Trustees."
				}
			]
		},
		{
			"paragraph": "§ 140-15",
			"title": "Change in plans or construction.",
			"content": [
				{
					"text": "Nothing herein contained shall require any change\nin the plans or construction of a building under construction, provided\nthat at the effective date of this chapter the construction shall\nhave proceeded to the completion of the foundation, and provided,\nfurther, that the work thereon shall be diligently prosecuted to completion\nwithin 1 year from the effective date of this chapter."
				}
			]
		},
		{
			"paragraph": "§ 140-16",
			"title": "Extensions to existing buildings.",
			"content": [
				{
					"text": "In the case of a building erected prior to the\neffective date of this chapter, and having existing side yards less\nthan permitted in this chapter, extensions to the rear of the main\nbuilding shall be permitted as follows:"
				},
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "If the minimum existing side yard is less than 10\nfeet, extension to the rear of the main building must maintain a minimum\nside yard of not less than 10 feet."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "The aggregate width of side yards at the extension\nshall be not less than 40 feet."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "The extension of the building to the rear may be extended\nto the minimum rear yard requirement, provided the building, including\nthe extension, does not exceed the limitations of lot coverage and\nfloor area ratio requirements."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 140-17",
			"title": "Cellars.",
			"content": [
				{
					"text": "A cellar shall not be used or occupied for other\nthan utility and recreation purposes."
				}
			]
		},
		{
			"paragraph": "§ 140-18",
			"title": "Basement.",
			"content": [
				{
					"text": "A basement may be used as habitable space."
				}
			]
		},
		{
			"paragraph": "§ 140-19",
			"title": "Impervious surface.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "The impervious\nsurface of any lot shall not exceed 45% of the lot area."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "The impervious\nsurface of any front yard shall not exceed 30% of the lot area of\nsuch front yard."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 140-20",
			"title": "Driveway widths.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Single-car garage. A driveway from the street to a\nsingle-car garage may have a maximum width of 20 feet.[Amended 7-1-2013 by L.L. No. 1-2013]"
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Two-car garage. A driveway from the street to a 2-car\ngarage may have a maximum width of 20 feet, except that it may fan\nout to a width of 22 feet at a distance 3 feet from the street."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 140-21",
			"title": "Lampposts.",
			"content": [
				{
					"text": "No accessory structures are permitted in the\nfront yard; except lampposts may be constructed in accordance with\nthe following restrictions:"
				},
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Location limited to front yard, no farther than 10\nfeet from the front wall of the building."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Maximum height, including pedestal, not to exceed\n6 feet."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Building permit and Architectural Review Board approval\nrequired."
								}
							]
						}
					]
				}
			]
		}
	]
}