{
	"url": "http://ecode360.com/15765657",
	"paras": [
		{
			"paragraph": "§ 211-14",
			"title": "General provisions.",
			"content": [
				{
					"text": "The general regulations affecting the bulk and arrangement of buildings and structures, the density of residential development and of materials and equipment occupying land in connection with nonbuilding uses thereof for each of the districts established by Article III are hereby established and set forth in this article."
				}
			]
		},
		{
			"paragraph": "§ 211-15",
			"title": "Table of Bulk Regulations.",
			"content": [
				{
					"text": "The accompanying table entitled \"Table of Bulk Regulations, § 211-15,\" shall be deemed a part of this section and is referred to herein as \"Bulk Table.\"[1]"
				},
				{
					"content": [
						{
							"number": "4. ",
							"content": [
								{
									"text": "Minimum Lot area (square feet): 7,500"
								}
							]
						},
						{
							"number": "5. ",
							"content": [
								{
									"text": "Minimum Lot Width(feet): 75"
								}
							]
						},
						{
							"number": "7. ",
							"content": [
								{
									"text": "Minimum Lot Depth(feet): 100"
								}
							]
						},
						{
							"number": "8. ",
							"content": [
								{
									"text": "Minimum Front Yard(feet): 30"
								}
							]
						},
						{
							"number": "9. ",
							"content": [
								{
									"text": "Minimum Side Yard (feet) 1 Yard/Total Both Yards: 10/20"
								}
							]
						},
						{
							"number": "10. ",
							"content": [
								{
									"text": "Minimum Rear Yard (feet): 50"
								}
							]
						},
						{
							"number": "11. ",
							"content": [
								{
									"text": "Maximum Building Height (stories/feet): 2.5/35"
								}
							]
						},
						{
							"number": "12. ",
							"content": [
								{
									"text": "Maximum Lot Coverage (percent): 30"
								}
							]
						}
					]
				},
				{
					"footnote": "[1]\nEditor's Note: The Table of Bulk Regulations is included\nat the end of this chapter.\n"
				}
			]
		},
		{
			"paragraph": "§ 211-16",
			"title": "Rules for use of Bulk Table.\n[1]",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "The Bulk Table is divided into columns, each column headed by a number\nfor reference. Double-weight horizontal lines divide the regulations\nfor one district from those of another. The Bulk Table is further\ndivided by single-weight horizontal lines into groups, each group\nbeing designated by a letter symbol and having different bulk regulations.\nBulk Table, Column 3, refers in abbreviated form to the uses listed\nin detail in the Use Table, Columns 2 and 3."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "In the Bulk Table, the words \"same as\" followed by a group symbol\nshall be construed to include all of the matter in the same columns\nfor the group thus referred to. Where the words \"same as\" are followed\nby a series of group symbols, the use group and their respective bulk\nregulations shall be construed as applying to equivalent uses in the\ndistrict wherein referred."
								}
							]
						}
					]
				},
				{
					"footnote": "[1]\nEditor's Note: The Table of Bulk Regulations is included\nat the end of this chapter.\n"
				}
			]
		},
		{
			"paragraph": "§ 211-17",
			"title": "Permitted variations from required bulk regulations.",
			"content": [
				{
					"text": "The minimum lot, yard and height requirements of Article V shall prevail in all cases, except as follows:"
				},
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Front yard exception. When an unimproved lot is situated between\ntwo improved lots, each having a principal building within 20 feet\nof the side lot line of the unimproved lot, the front yard may be\nreduced to a depth equal to that of the greater front yard of the\ntwo adjoining lots; provided, however, that it may not be reduced\nto below 10 feet in residential districts."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Projections into yards. Projections into required yards shall be\npermitted as follows, except that no such projection shall be located\ncloser than three feet to any side or rear lot line or 10 feet to\nany front lot line:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Bay windows, carports, fireplaces, fire escapes, chimneys, uncovered\nstairs and landings and balconies and cornices, canopies, eaves or\nother architectural features not required for structural support may\nproject into the required side, front or rear yard not more than a\ntotal of three feet."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Porches may project into the required rear yard up to 10 feet."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Patios may be located in the required side and rear yards not closer\nthan three feet to any adjacent property line and may project into\nfront yards up to 10 feet."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "Accessory off-street parking spaces, except that in residential districts\nno off-street parking spaces are permitted in any required front yard."
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "Signs as provided in § 211-10, except freestanding signs."
												}
											]
										}
									]
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 211-17.1",
			"title": "Standard for lot count.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Standards for lot count. For all major subdivision applications,\nthe maximum number of lots or dwelling units (N) which the Planning\nBoard may approve for land to be subdivided shall be the whole number\n(all fractions excluded) which results from the following calculation:"
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Procedures for steep slope delineations. The procedure to be utilized\nin quantifying the areas of steep slope for the purpose of determining\nthe number of lots or units shall be as follows:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Scale of map shall be either one inch equals 50 feet or one\ninch equals 100 feet with a two-foot contour interval."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "All areas of steep slopes shall be shown on the Lot Count Map.\nAreas of steep slopes used in lot count calculations and inclusions\nof 20% or less, too small to be excluded, shall be clearly differentiated\nfrom steeply sloping land which has not been included. Determination\nfor inclusion in lot count calculations shall be made by applying\nthe guidelines below."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Calculations pursuant to the formula contained in Subsection A shall be included on the Lot Count Map."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "Sources of all topographic and other survey data shall be identified\non the Lot Count Map."
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "The Lot Count Map, including all steep slope quantifications\nand calculations, shall be sealed by either a licensed professional\nengineer, licensed surveyor, licensed landscape architect or registered\narchitect."
												}
											]
										},
										{
											"number": "(6) ",
											"content": [
												{
													"text": "The original Mylar(s) or other dimensionally stable transparency\nand a minimum of two copies of the original Lot Count Map shall be\nsubmitted to the Planning Board."
												}
											]
										},
										{
											"number": "(7) ",
											"content": [
												{
													"text": "Steep slopes shall be determined by measuring at right angles\nto contour lines. Whenever the distance between two adjacent contour\nlines is less than 10 feet, such area shall be shaded as steep slope\non the worksheet maps. Limits of steeply sloping land shall be shown\nas a curvilinear line smoothly transitioning between points. Allowances\nshall be made for the continuation of steeply sloping land at the\ntop and bottom of such slopes. See Figure 1 below."
												}
											]
										},
										{
											"number": "(8) ",
											"content": [
												{
													"text": "On the Lot Count Map and in the lot count calculations, an area\nof less than 25% slope located within an area which generally is a\nsteep slope area shall be included as a part of such steep slope area,\nunless it is large enough to contain a fifty-foot-diameter circle\nas shown in Figure 2."
												}
											]
										},
										{
											"number": "(9) ",
											"content": [
												{
													"text": "On the Lot Count Map and in the lot count calculations, the\nminimum area to be considered a steep slope area shall be large enough\nto contain a fifty-foot-diameter circle as shown in Figure 3. When\napplying this guideline, steep slope areas continuing offside or into\nwetlands shall be considered."
												}
											]
										},
										{
											"number": "(10) ",
											"content": [
												{
													"text": "Topographic mapping."
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "All topographic mapping used for lot count calculations shall\nbe in the National Geodetic Vertical Datum (NGVD) of 1929. At least\nthree recently established or recently recovered bench marks shall\nbe properly plotted on the same, together with their complete descriptions\nand elevations. These bench marks shall be readily accessible and\nlocated either on the subject parcel or in nearby public rights-of-way.\nThey shall be geographically distributed so as to make their use generally\nconvenient."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "The boundary (property line) of the subject parcel shall be\nclearly marked on the topographic map(s) and complete metes and bounds\ninformation provided, together with a printout or list of coordinates\nto permit random mathematical scale checks. These scale checks will\nbe used to prorate areas by the appropriate squared scale factor."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "Photogrammetry used for this purpose shall be compiled to national\nmap accuracy standards from current aerial photography. All areas\nof dense foliage shall be clearly identified, and contours in these\nareas shall be verified by direct field work; otherwise, these areas\nshall be considered steep slope areas."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(11) ",
											"content": [
												{
													"text": "As determined by the Planning Board, the recreation area requirement\nshall be satisfied by either:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "A reduction of N in the calculations in this section by 10%\nand a designation of at least one acre of land for every 20 dwelling\nunits for active recreation;"
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "Payment of an in-lieu-of-recreation-area fee at a rate per dwelling\nunit as required in the Village of Buchanan Code; or"
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "A combination of a reduction of N in the calculations in this\nsection and the designation and development of active recreation facilities\nthat would be commensurate with alternatives in the subsections above."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(12) ",
											"content": [
												{
													"text": "Calculations."
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "For purposes of the calculations in this section, if a parcel\nfalls in more than one zoning district, zoning district lines shall\nbe treated as hypothetical lot lines, and separate calculations shall\nbe made for each portion of the parcel so divided by zoning district\nlines."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "For purposes of the calculations in this section, areas falling\nunder more than one category to be subtracted from the gross parcel\narea shall be subtracted only once."
																}
															]
														}
													]
												}
											]
										}
									]
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 211-18",
			"title": "Unique lots and building locations.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Vehicular access for through lots and corner lots. The Planning Board\nshall decide which street shall be considered as the street from which\nvehicular access is derived and shall designate the front yard."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Front yard designation of through lots and corner lots. The Planning\nBoard shall designate which yard abutting a street shall be considered\nthe front yard for purpose of locating accessory structures and uses."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Clear sight triangle for corner lots. Across each corner lot, a clear\nsight triangle shall be provided outside the street right-of-way,\nwithin the area formed by the nearest edges of the street pavement\nand a straight line between two points, each 75 feet back from the\ntheoretical intersection of the nearest edges of the pavement. A clear\nline of sight shall be maintained in either direction across such\ntriangular area between an observer's eye 3.5 feet above the\npavement surface at its nearest edge and an object 4.25 feet above\nthe nearest edge of pavement on the intersecting road. In the case\nof streets which intersect at other than right angles, the Planning\nBoard may require that the dimensions of the clear sight triangle\nbe modified to provide adequate sight distance."
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "Lots without public water or sewer facilities. No building permit\nshall be issued for any use on a lot which is not served by both the\npublic water and public sewer systems."
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "One building or structure per lot. Every building or structure hereafter\nerected shall be located on a lot, and there shall not be more than\none building or structure on a lot unless specifically permitted elsewhere\nin this chapter."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 211-19",
			"title": "Accessory structures and uses.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Accessory structures. All accessory structures shall conform to the minimum yard regulations established in Article V, except as permitted below:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Unattached structures accessory to residential buildings. Structures\naccessory to residential buildings which are not attached to a principal\nstructure shall not be higher than 15 feet or 1 1/2 stories and\nmay be erected within the required rear yard of a principal structure,\nprovided that they conform to the following:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "Distance from side lot line: not less than three feet from the side lot line, except in the case of corner lots, where the side yard, as specified in § 211-18, shall be maintained."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "Distance from rear lot line: not less than four feet from the\nrear lot line."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "Distance from principal structure: not less than 10 feet from\na principal structure."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Unattached structures accessory to nonresidential buildings. Such\naccessory structures shall comply with front and side yard requirements\nfor the principal structure, shall have a minimum rear yard of at\nleast 10 feet and shall not exceed two stories or 25 feet in height."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Fences and walls. Unless specifically noted, the provisions of this\nchapter shall not apply to fences, terraces or walls less than six\nfeet in height above the average natural grade nor to terraces, steps,\nunroofed porches or other similar features not over three feet above\nthe level of the natural grade."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Home occupations. A single home occupation per lot is permitted as\nan accessory use to a residential building subject to special use\npermit approval of the Board of Appeals. The home occupation must\nconform to the following regulations:[Amended 4-6-1981 by L.L. No. 2-1981; 11-20-1989 by L.L. No.\n13-1989]"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "The home occupation shall be carried on wholly indoors within a dwelling\nunit."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Not more than 300 square feet and in no case more than 20% of the\nfloor area of the dwelling unit may be used."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "There shall be no exterior storage of materials or equipment."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "The home occupation must be operated only by a person residing in\nthe dwelling unit."
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "There shall be no use of show windows, displays or advertising visible\noutside the premises to attract customers or clients other than one\nhome occupation announcement sign, not more than two square feet in\nsize."
												}
											]
										},
										{
											"number": "(6) ",
											"content": [
												{
													"text": "No external alterations, additions or changes to the structure shall\nbe permitted in order to accommodate or facilitate a home occupation."
												}
											]
										},
										{
											"number": "(7) ",
											"content": [
												{
													"text": "The Building Inspector shall be permitted free access to the dwelling\nduring normal business hours."
												}
											]
										},
										{
											"number": "(8) ",
											"content": [
												{
													"text": "The special use permit shall be valid for a period of one year and\nmay be renewed annually upon a showing that all the conditions of\nthe original permit are still satisfied."
												}
											]
										},
										{
											"number": "(9) ",
											"content": [
												{
													"text": "The following uses are the only uses eligible as an accessory home\noccupation: writer, seamstress, typist, crafts, word processing, tutor\nand such other similar uses that the Board of Appeals deems compatible\nwith a residential district."
												}
											]
										},
										{
											"number": "(10) ",
											"content": [
												{
													"text": "Among those uses not to be interpreted to be a home occupation\nare the following: clinics, hospitals, laboratories, group-care facilities,\ngroup homes, shelters and veterinarians."
												}
											]
										},
										{
											"number": "(11) ",
											"content": [
												{
													"text": "No offensive odor, noise, vibration, smoke, dust, heat, light,\nglare or similar condition shall be produced by a home occupation."
												}
											]
										},
										{
											"number": "(12) ",
											"content": [
												{
													"text": "Parking requirements for home occupation uses must be complied\nwith."
												}
											]
										},
										{
											"number": "(13) ",
											"content": [
												{
													"text": "A home occupation shall not be permitted on a lot where the\ndwelling also contains an accessory apartment as an accessory use."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Home gardening, nurseries and greenhouses. Home gardening and accessory\nstructures used for nurseries or as greenhouses are permitted in residential\nareas, provided that they are used by the residents thereof for noncommercial\npurposes and provided, further, that they shall not include the outdoor\nstorage of equipment and supplies."
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "Residential swimming pools.[Amended 6-18-1990 by L.L. No. 5-1990]"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "A residential swimming pool is permitted within a building, provided that the building complies with the area and dimensional requirements of this chapter and with the structural requirements of Chapter 67, Building Construction."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "A residential swimming pool is permitted outside of a building, provided\nthat:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "The edge of the pool (measured at the waterline) and any deck,\npatio, walkway, filter and other equipment shall not be located closer\nthan 10 feet to any side or rear property line nor located within\nany front yard."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "The pool, with any deck, patio, walkway, filter and other equipment,\nshall not occupy more than 8% of the lot area."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "Enclosures."
																},
																{
																	"content": [
																		{
																			"number": "[1] ",
																			"content": [
																				{
																					"text": "The pool shall be provided with an enclosure which shall comply\nwith the following:"
																				},
																				{
																					"content": [
																						{
																							"number": "[a] ",
																							"content": [
																								{
																									"text": "The enclosure shall be at least four feet in height\nand have a maximum vertical clearance to grade of two inches."
																								}
																							]
																						},
																						{
																							"number": "[b] ",
																							"content": [
																								{
																									"text": "Where a picket-type fence is provided, horizontal\nopenings between pickets shall not exceed 3 1/2 inches."
																								}
																							]
																						},
																						{
																							"number": "[c] ",
																							"content": [
																								{
																									"text": "Where a chain link fence is provided, the openings\nbetween links shall not exceed 2 3/8 inches."
																								}
																							]
																						},
																						{
																							"number": "[d] ",
																							"content": [
																								{
																									"text": "The enclosure shall be constructed so as not to\nprovide footholds."
																								}
																							]
																						},
																						{
																							"number": "[e] ",
																							"content": [
																								{
																									"text": "Pickets and chain link twists shall extend above\nthe upper horizontal bar."
																								}
																							]
																						},
																						{
																							"number": "[f] ",
																							"content": [
																								{
																									"text": "The enclosure shall have railings and posts within\nthe enclosure, which shall be capable of resisting a minimum lateral\nload of 150 pounds applied midway between posts and at the top of\nthe posts respectively. Enclosure, fence material or fabric shall\nbe capable of withstanding a concentrated lateral load of 50 pounds\napplied anywhere between supports on an area 12 inches square, without\nfailure or permanent deformation. Gates provided in the enclosure\nshall be self-closing and self-latching, with the latch handle located\nwithin the enclosure and at least 40 inches above grade."
																								}
																							]
																						}
																					]
																				}
																			]
																		},
																		{
																			"number": "[2] ",
																			"content": [
																				{
																					"text": "A wall of a dwelling is permitted to serve as part of the enclosure required in Subsection D(2)(c)[1] under the following conditions:"
																				},
																				{
																					"content": [
																						{
																							"number": "[a] ",
																							"content": [
																								{
																									"text": "Windows in the wall shall have a latching device\nat least 40 inches above the floor."
																								}
																							]
																						},
																						{
																							"number": "[b] ",
																							"content": [
																								{
																									"text": "Any swinging door in the wall shall be self-closing\nand self-latching."
																								}
																							]
																						},
																						{
																							"number": "[c] ",
																							"content": [
																								{
																									"text": "Any sliding door in the wall shall have a self-latching\ndevice."
																								}
																							]
																						}
																					]
																				}
																			]
																		},
																		{
																			"number": "[3] ",
																			"content": [
																				{
																					"text": "The pool shall not be required to be enclosed in accordance with Subsection D(2)(c)[1] and [2] if the pool decking or pool top is separated from adjoining grade by at least 46 inches, provided that the access ladder or steps can be blocked in an approved manner when the pool is not intended for use."
																				}
																			]
																		}
																	]
																}
															]
														}
													]
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "Private garages and parking spaces."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Any garage or parking space in a residential district, when used\nfor boat or vehicle storage, shall be occupied only by boats or vehicles\nowned and operated by the residents of the dwellings on the same lot,\nexcept that one private garage may be occupied by the boat or vehicle\nof a nonresident owner."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "No commercial vehicles having a capacity of more than two tons or\nhaving three or more axles shall be stored, parked or garaged in a\nresidential district, and the parking, storing or garaging of vans,\ntrailers, semitrailers or similar vehicles designed to be propelled\nby a separate means of locomotion, or vehicles designed to be used\nfor moving said vans, trailers or semitrailers, and of all self-propelled\nmachinery designed for commercial use shall be prohibited in residential\ndistricts."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Development of parking and loading spaces. All off-street parking\nand loading areas shall conform to the following:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "Off-street parking and loading lots may be developed on any required side, front or rear yard subject to § 211-17B. Off-street parking garages shall conform to the minimum yard requirements for accessory or principal buildings of the district in which they are located."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "They shall be surfaced with a durable bituminous or concrete\npaving material."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "They shall be properly graded and drained to dispose of all\nsurface water."
																}
															]
														},
														{
															"number": "(d) ",
															"content": [
																{
																	"text": "They shall be arranged and marked for the orderly and safe movement,\nloading, parking and storage of vehicles."
																}
															]
														},
														{
															"number": "(e) ",
															"content": [
																{
																	"text": "They shall be adequately illuminated if designed for use by\nmore than three cars after dusk."
																}
															]
														},
														{
															"number": "(f) ",
															"content": [
																{
																	"text": "Exit and entrance driveways or access points for other than\nresidences shall be at least 20 feet wide and shall not exceed 32\nfeet in width and, wherever practical, shall not occupy the full width\nof the streets, alleys or other rights-of-way from which they derive\ntheir access, but in all cases shall be limited to well-defined points\nand shall be so designed as to provide maximum safety for other adjoining\nor nearby uses."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "Storage of vehicles. No dead storage of vehicles shall be allowed\nin any front or side yards."
												}
											]
										}
									]
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 211-20",
			"title": "Signs.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Purpose. The purpose of this section is to promote and protect the public health, safety and welfare by regulating outdoor signs of all types, in furtherance of the purposes of this chapter as set forth in § 211-3. It is intended to protect property values, create a more attractive economic and business climate, enhance and protect the physical appearance of the community, preserve the scenic and natural beauty and provide a more enjoyable and pleasing community. It is further intended hereby to reduce sign or advertising distractions and obstructions that may contribute to traffic accidents, reduce hazards that may be caused by signs overhanging or projecting over public rights-of-way, provide more visual open space and maintain and improve the community's appearance and attractiveness. This section is intended to promote attractive signs which clearly present the visual message in a manner that is compatible with its surroundings. The appearance, character and quality of a community are affected by the location, size, construction and graphic design of its signs. Therefore, such signs should convey their messages clearly and simply to enhance their surroundings."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Sign permit application."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "No person shall erect, alter or relocate any sign allowed by permit in a commercial or industrial district as listed in Subsection D, Sign Table,[1] without first obtaining a permit from the Building Inspector\nunless approval is given through site development plan or special\npermit review. Subsequent to this initial application or site development\nplan or special permit approval, no permit shall be required for a\nsign to be repainted or repaired or to have its message changed, provided\nthat its location, size, materials and method of construction, illumination\nand colors are the same as those for which the initial application\nwas made or site development plan or special permit approval was given."
												},
												{
													"footnote": "[1]\nEditor's Note: The Sign Schedule is included at the end\nof this chapter.\n"
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Application for a permit shall be made, in writing, to the Building\nInspector on forms provided by the Village and shall contain the following\ninformation. Depending on the exact nature of the sign, the Building\nInspector may modify the following informational requirements to require\nadditional information or to eliminate certain information. The application\nshall include:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "The name, address and telephone number of the applicant and\nthe owner of the property."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "The street address and Tax Map parcel number of the building,\nstructure or land upon which the sign now exists or is to be erected."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "A full description of the placement and appearance of the proposes\nsign, including the following:"
																},
																{
																	"content": [
																		{
																			"number": "[1] ",
																			"content": [
																				{
																					"text": "The elevation and plan drawings of the proposed sign."
																				}
																			]
																		},
																		{
																			"number": "[2] ",
																			"content": [
																				{
																					"text": "The location on the premises; specifically, its position in\nrelation to adjacent buildings, structures and property lines."
																				}
																			]
																		},
																		{
																			"number": "[3] ",
																			"content": [
																				{
																					"text": "The method of illumination, if any, and the position of lighting\nor other extraneous devices and a copy of the electrical permit related\nto the electrical connections."
																				}
																			]
																		},
																		{
																			"number": "[4] ",
																			"content": [
																				{
																					"text": "The graphic design, including symbols, letters, materials and\ncolors."
																				}
																			]
																		},
																		{
																			"number": "[5] ",
																			"content": [
																				{
																					"text": "The visual message, text, copy or content of the sign."
																				}
																			]
																		},
																		{
																			"number": "[6] ",
																			"content": [
																				{
																					"text": "Construction plans sufficient to indicate compliance with Chapter 67, Building Construction, and Chapter 79, Electrical Standards."
																				}
																			]
																		}
																	]
																}
															]
														},
														{
															"number": "(d) ",
															"content": [
																{
																	"text": "A description of the placement and appearance of all existing\nsigns on the premises, including elevation and plan drawings of the\nsigns, location on the premises, method of illumination, graphic design\nand content of the sign."
																}
															]
														},
														{
															"number": "(e) ",
															"content": [
																{
																	"text": "Written consent or a copy of the contract made with the owner\nof the property upon which the sign is to be erected if the applicant\nis not the owner."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Upon the filing of a completed application for a sign permit and\nthe payment of a fee in accordance with the fee schedule of the Village\nof Buchanan, the Building Inspector shall examine the plans, specifications\nand other data submitted and the premises on which the sign is to\nbe erected or now exists. If the proposed sign is in compliance with\nall the requirements of this chapter, the Building Inspector shall\nthen, within 15 days, issue a permit for the erection of the proposed\nsign or for an existing sign. The issuance of a permit shall not exclude\nthe applicant from conforming to the other laws and ordinances of\nthe Village."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "If the erection of the sign authorized under any such permit has\nnot commenced within six months from the date of the issuance, the\npermit shall become null and void, but may be renewed within 30 days\nprior to the expiration, for good cause shown, for an additional six\nmonths, upon payment of 1/2 of the original fee."
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "A current and valid sign permit shall be freely assignable to a successor\nas owner of the property or holder of a business license for the same\nproperty, provided that the subsequent owner of the property or holder\nof the business license makes no changes."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "General regulations."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "No sign shall impair or cause confusion of vehicular or pedestrian\ntraffic in its design, color or placement."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "In addition to the setback requirements of this section, signs shall be located in compliance with § 211-18C, Clear sight triangle for corner lots, except that a freestanding sign may be permitted in the clear sight triangle, provided that the bottom of the sign is at least seven feet above normal grade below the sign, that the sign is supported by no more than two stanchions adequately spaced to maintain a clear line of sight and that each stanchion is no wider than six inches."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "No direct light or significant glare from an illuminated sign, other\nthan one composed of exposed bulbs or neon, shall be cast beyond the\nproperty lines of the lot on which the sign is located."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "Illumination shall be appropriate to the character of the sign and\nsurroundings."
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "Signs shall be designed to be compatible with the surroundings and\nappropriate to the architectural character of the buildings on which\nthey are placed. Sign panels and graphics shall relate with and not\ncover architectural features and shall be in proportion to them."
												}
											]
										},
										{
											"number": "(6) ",
											"content": [
												{
													"text": "Groups of related signs shall express uniformity and create a sense\nof harmonious appearance."
												}
											]
										},
										{
											"number": "(7) ",
											"content": [
												{
													"text": "Signs shall be appropriate to the types of activities they represent."
												}
											]
										},
										{
											"number": "(8) ",
											"content": [
												{
													"text": "Temporary signs may be displayed for 14 days prior to and during\nthe event or occurrence but shall be removed two days after the close\nof the event or occurrence."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "Sign Table. The accompanying table entitled \"Village of Buchanan\nSign Schedule\"[2] shall be deemed part of this section and is referred to\nherein as \"Sign Table.\""
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Allowed signs per lot. Those signs listed under the column \"Allowed Signs Per Lot\" in the Sign Table, none of which shall be animated, changeable copy or illuminated, except where otherwise noted, shall be allowed as regulated therein without the need for obtaining a permit as specified in Subsection B."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Signs allowed by permit per lot. Those signs listed under the column \"Signs Allowed By Permit Per Lot\" in the Sign Table shall be allowed as regulated therein only after a permit as specified in Subsection B has been obtained."
												}
											]
										}
									]
								},
								{
									"footnote": "[2]\nEditor's Note: The Sign Schedule is included at the end\nof this chapter.\n"
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "Prohibited signs. All signs not expressly allowed either with or\nwithout a permit under this section are prohibited. Such signs include\nbut are not limited to:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Signs with commercial messages which do not concern a lawful activity\nor are misleading."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Signs within a public right-of-way and signs attached to utility\npoles, other than public signs erected by a governmental body to post\nlegal notices, identify public property, convey public information\nand regulate pedestrian or vehicular traffic; bus stop signs erected\nby a public transit company; and informational signs of a public utility."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Signs placed upon or above the roof of any building."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "Beacons, pennants and strings of lights which are not permanently\nmounted to a rigid background, other than holiday lights and decorations\nhaving no commercial message and being displayed between November\n15 and January 15."
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "Inflatable signs and tethered balloons."
												}
											]
										},
										{
											"number": "(6) ",
											"content": [
												{
													"text": "Animated signs."
												}
											]
										},
										{
											"number": "(7) ",
											"content": [
												{
													"text": "General advertising (billboard or posterboard) signs which direct\nattention to a business, commodity, service, event or other activity\nwhich is sold, offered or conducted elsewhere than on the premises\nupon which such sign is located.[Amended 7-8-1996 by L.L. No. 1-1996]"
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "F. ",
							"content": [
								{
									"text": "Construction standards."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "All freestanding signs shall be designed and constructed to withstand\na wind pressure of not less than 30 pounds per square foot of surface\narea."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "All changeable copy signs, the bottoms of which are located below\n10 feet above normal grade below the sign, shall be enclosed or otherwise\nprotected from vandalism."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "All signs, including wall and projecting signs, shall be securely\nanchored."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "All projecting, freestanding or wall signs shall employ acceptable\nsafety material."
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "All signs shall be painted and/or fabricated in accordance with standards\nacceptable to the Building Inspector."
												}
											]
										},
										{
											"number": "(6) ",
											"content": [
												{
													"text": "All internally illuminated signs shall be constructed in conformance\nwith the Standards for Electric Signs (U.L. 48) of Underwriters'\nLaboratories, Inc., and bear the seal of Underwriters' Laboratories,\nInc. If such sign does not bear the Underwriters' Laboratories,\nInc., label, the sign shall be inspected and certified by the New\nYork Board of Fire Underwriters."
												}
											]
										},
										{
											"number": "(7) ",
											"content": [
												{
													"text": "All transformers, wires and similar items for illuminated signs shall\nbe concealed. All wiring to freestanding signs shall be underground."
												}
											]
										},
										{
											"number": "(8) ",
											"content": [
												{
													"text": "All signs, sign finishes, supports and electric work shall be kept\nclean, neatly painted and free from all hazards, such as but not limited\nto faulty wiring and loose supports, braces, guys and anchors."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "G. ",
							"content": [
								{
									"text": "Nonconforming signs.[Added 7-8-1996 by L.L. No. 1-1996]"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Any sign which cannot be classified from the sign categories specifically\npermitted or exempted by this section shall be removed within one\nyear of the effective date of this section."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "All other signs which do not meet the provisions or standards of\nthis section shall be either conformed or removed within three years\nof the effective date of this section (the \"amortization period\").\nUpon the submission of an application within 30 days of the expiration\nof such amortization period and credible evidence by the owner of\nany such sign establishing that recoupment of the initial investment\ncannot be accomplished within the amortization period, the Village\nBoard of Trustees may, after consideration of the submitted evidence\nand purposes of this section, grant an extension of the amortization\nperiod."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "The transfer of ownership or use of any nonconforming or prohibited\nsign during the amortization period noted above will immediately terminate\nthe amortization period and shall result in the immediate removal\nof the nonconforming or prohibited sign."
												}
											]
										}
									]
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 211-21",
			"title": "Yard screening.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Required yard screening. Yard screening shall be provided within\n15 feet of the boundary or property line of any manufacturing or commercial\nuse of off-street parking lot which abuts a residential use and on\nany special use where such screening is required by the Board of Appeals.\nSuch screening shall consist of a four-foot-high to six-foot-high\nvisual screen or obstruction of suitable scrubs, fences, walls or\nhedges."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Other yard screening. Walls, shrubs and hedges under six feet tall\nmay be located in any yard or court and shall be maintained in good\ncondition."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Fences."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "A drawing of the proposed fence must be submitted to the Building\nDepartment showing the exact location the fence will be located on\nthe property and a building permit must be obtained. Fences are to\nbe limited to four feet in height across front yards and six feet\nin height on side and rear yards. Fences may be located anywhere on\na property; however, the Village requires front yard fences to be\nset back six feet from the curb to allow for snow removal. The Village\nwill not be responsible for damage to fences caused by snow plowing\nand snow removal."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "In regard to fences, the height of the fence shall be measured from\nthe finished grade to the top of the fence. In the case of a fence\nlocated on the top of a wall or berm, the height of the fence shall\ninclude the height of the wall or berm. Fences located more than 10\nfeet away from the wall will not be required to include the height\nof the wall when calculating fence height."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "All fences installed before the adoption of this section shall be exempt from the requirements of Subsection C."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "One decorative entrance gate or archway, not exceeding eight feet\nin height and eight feet in width, may be installed to allow entry\nto and from a yard in any side or rear yard."
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "At all street intersections in all districts, no obstructions to\nmotorist vision exceeding three feet in height above street pavement\nlevel shall be erected or maintained on any lot within the triangle\nformed by the street lines of such lot and a line drawn between points\nalong such street line 30 feet distant from their point of intersection.\nAll corner lots are deemed to have two front yards and are therefore\nsubject to the four-foot height restriction."
								}
							]
						},
						{
							"number": "F. ",
							"content": [
								{
									"text": "Walls. Walls may be located anywhere on a property. Walls less than\nthree feet in height do not require a building permit. Walls over\nthree feet in height require a building permit and a drawing of where\nthe wall will be located on the property. Walls over four feet in\nheight require a building permit and a drawing by a licensed engineer\ndetailing the design of the wall and its location on the property."
								}
							]
						},
						{
							"number": "G. ",
							"content": [
								{
									"text": "Any preexisting fence or wall installed before the adoption of this\nsection, which is damaged or destroyed to an extent equal to not more\nthan 50% of the total wall or fence, may be restored within one year\nof the date of the damage; provided, however, that it shall not be\naltered or enlarged unless said alteration or enlargement complies\nwith the current requirements of this chapter.[1]"
								},
								{
									"footnote": "[1]\nEditor's Note: Original § 54-20 of the 1971\nCode, entitled \"Standards for auto service stations and garages,\"\nwhich immediately followed this subsection, was repealed 9-5-1989\nby L.L. No. 6-1989.\n"
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 211-22",
			"title": "Accessory apartments in single-family detached residences.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Legislative intent. A special permit may be granted by the Planning\nBoard to permit accessory apartments. It is the specific purpose and\nintent of this provision to provide the opportunity for the development\nof small, rental dwelling units designed, in particular, to meet the\nspecial housing needs of single persons and couples of low and moderate\nincome, both young and old, and of relatives of families presently\nliving in the Village of Buchanan. Furthermore, it is the purpose\nand intent of this section to allow the more efficient use of the\nVillage's existing stock of dwellings, to provide economic support\nfor present resident families of limited income, to protect and preserve\nproperty values and to maintain the single-family character of the\nresidential districts of the Village of Buchanan without the overutilization\nof the land."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "To help achieve these goals and promote the objectives of the Village Development Plan, the issuance of a special permit and the granting of site development plan approval by the Planning Board shall be subject to the following requirements, and the Planning Board shall make the following as findings in addition to the general standards and requirements applicable to site development plans set forth in Article VII and special permits as set forth in Article X of this chapter."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "More restrictive provisions to prevail. In the R-7.5, R-10, R-15,\nR-20 and R-40 Residential Districts and in the C-1 and C-2 Commercial\nDistricts, the property and structures shall comply with all applicable\nrequirements for the zoning district in which the property is located,\nexcept that the regulations of this section shall apply when they\nare more restrictive."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Occupancy."
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "The owner of the single-family lot upon which the accessory\napartment is located shall occupy the principal or accessory dwelling\nunit on the premises as his primary residence."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "No more than one accessory apartment shall be permitted on any\nlot."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "An accessory apartment shall be subordinate in area to the principal\ndwelling and shall be limited to occupancy by a maximum of two persons."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Use."
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "An accessory apartment shall not be permitted on a lot where\nthe dwelling also contains either boarding or a home occupation as\nan accessory use."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "The principal use of the premises must be a single-family detached\nresidence."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "No accessory apartment is permitted in an accessory building\nor structure."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "Maintenance and continued compliance. An accessory apartment shall be permitted only where all structures on the premises are in a reasonable state of repair and modernization and where all structures and any new construction undertaken for the accessory apartment shall be in compliance with Chapter 67, Building Construction, and the New York State Uniform Fire Prevention and Building Code as well as all other applicable regulations. The Building Inspector shall inspect the premises and shall report on the condition of structures on the premises to the Planning Board. No permit shall be granted until all outstanding violations are corrected. All conditions of the special permit must be complied with and shall be subject to inspection by the Building Inspector."
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "Parking."
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "Off-street parking shall be provided in accordance with the standards and requirements of §§ 211-10 and 211-19. The location of such parking and driveways shall be reviewed by the Planning Board to ensure compatibility with the use of the lot and adjacent properties."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "The foregoing conditions shall not be varied by any board in\nthe Village of Buchanan in conjunction with an application for a special\npermit under this section."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(6) ",
											"content": [
												{
													"text": "Other conditions."
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "In making its determination on the special permit, the Planning\nBoard shall also give consideration to the character of the existing\nand future uses in the immediate vicinity of the proposed accessory\napartment, including the exterior appearance of buildings as single-family\ndwellings, the number of other accessory apartments existing in the\nneighborhood in relation to single-family dwellings and the amount\nof traffic and parking conditions in the neighborhood. The principal\nbuilding must continue to appear to be a single-family residence."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "Artificial illumination shall be installed at the entrance to\nany dwelling unit if such entrance is not directly from a public street."
																}
															]
														}
													]
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "After the Planning Board has determined that the applicant has complied with the above requirements, the issuance of a special permit and the granting of site development plan approval, if necessary, by the Planning Board shall be further subject to the following requirements; however, the Planning Board shall have the power to modify the requirements, provided that said Board finds that such following modifications are consistent with the legislative intent of this section as set forth in Subsection A above and the purposes of this chapter as set forth in § 211-3:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Age of structure and length of occupancy. The building in which the\naccessory apartment is constructed shall be at least 10 years old,\nand the owner applicant shall have occupied the dwelling for at least\nthree years prior to the initial application for the special permit\nfor an accessory apartment."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Occupancy."
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "No more than one bedroom shall be permitted in any accessory\napartment."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "The minimum gross floor area for an accessory apartment within\na principal building shall be 300 square feet but not larger than\n600 square feet, and in no case shall it exceed 33% of gross floor\narea of the building in which it is located."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Location of parking. No more than two off-street parking spaces shall\nbe permitted in front of the principal building."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "Other provisions."
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "A second entrance on the front facade of the principal dwelling\nbuilding shall not be permitted."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "Outside stairways and fire escapes for the accessory apartment\nshall be at the rear of the building."
																}
															]
														}
													]
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "In addition to the above requirements, the special permit for an\naccessory apartment shall be subject to the following conditions and\nprocedures:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Required submissions."
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "In addition to the information required in §§ 211-27 and 211-42A of this chapter, the owner-applicant shall present to the Planning Board a floor plan of each habitable floor of the building, with all interior dimensions, including windows and doors, and with an assignment of spaces to the proposed dwelling units, including types of rooms. All plans shall be prepared in sufficient detail and by a person of adequate qualifications to enable the Planning Board to understand and decide upon the acceptability of the proposal."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "The special permit shall be issued to the owners of the property.\nShould there be a change in ownership or a change in the residence\nof the owner, the special permit and the certificate of occupancy\nfor the accessory apartment shall become null and void. Thereafter,\nshould the new owner decide to live in the structure and desire to\ncontinue the use of the accessory apartment, within 90 days of the\nchange of ownership he shall apply to the Planning Board for a special\npermit. Should the new owner decide not to live in the structure or\ndesire not to continue the use of the accessory apartment, the tenant\nshall have 90 days to relocate, the owner shall remove the kitchen\nof the accessory apartment within 60 days after the tenant leaves,\nand the premises shall revert to a single-dwelling unit."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Term of permit."
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "The initial permit shall be valid for a period of one year, at which time the applicant must appear before the Planning Board and request a renewal of such permit. Subsequent thereto, the special permit shall be valid for a period not to exceed three years, the exact term to be determined by the Planning Board upon its issuance of a renewal special permit. At the end of such period, the owner-applicant shall request the Building Inspector to renew the permit or the owner shall notify the Building Inspector of his intent to discontinue the permit in accordance with the applicable time periods established in Subsection D(1). The Building Inspector shall renew the permit if all conditions of the original permit are still satisfied; otherwise, the Building Inspector shall not renew the permit, and the time periods established in Subsection D(1) for discontinuing the accessory apartment shall apply."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "The owner-applicant shall be required to file on the subject\nproperty a declaration of covenants at the Westchester County Clerk's\noffice prior to the issuance of a special permit for an accessory\napartment. This declaration shall be in favor of the Village of Buchanan\nand state that:"
																},
																{
																	"content": [
																		{
																			"number": "[1] ",
																			"content": [
																				{
																					"text": "The special permit for an accessory apartment or any renewal\nof said special permit shall terminate upon the death of the undersigned\nor the survivor of the undersigned or upon the transfer of title to\nsaid premises or upon the undersigned no longer occupying the premises\nas his principal residence."
																				}
																			]
																		},
																		{
																			"number": "[2] ",
																			"content": [
																				{
																					"text": "The new owner of the premises shall have to apply to the Planning\nBoard for a special permit to continue the accessory apartment."
																				}
																			]
																		},
																		{
																			"number": "[3] ",
																			"content": [
																				{
																					"text": "The Building Inspector shall have the right to inspect the premises\nupon reasonable notice to the owner.[1]"
																				},
																				{
																					"footnote": "[1]\nEditor's Note: Original §§ 54-22 and 54-23\nof the 1971 Code, entitled \"Commercial and industrial planned development\ngroups\" and \"Residential planned development groups,\" respectively,\nwhich immediately followed this subsection, were repealed 9-5-1989\nby L.L. No. 6-1989.\n"
																				}
																			]
																		}
																	]
																}
															]
														}
													]
												}
											]
										}
									]
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 211-23",
			"title": "Performance standards; nuisances.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "All nonresidential uses shall be subject to performance standards\nas follows:[Amended 8-20-1990 by L.L. No. 12-1990]"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Prior to construction and operation. Any application for a building\npermit for a use which shall be subject to performance standards shall\nbe accompanied by a sworn statement by the owner of the subject property\nthat said use will be operated in accordance with the performance\nstandards set forth herein."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Continued compliance. Continued compliance with performance standards\nis required, and the enforcement of continued compliance with these\nperformance standards shall be enforced by the Code Enforcement Officer."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Regulation of nuisance elements."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Definition of elements. No land or building in any district, used\nor occupied for any purposes, shall be operated in such manner as\nto create any dangerous, injurious, noxious or otherwise objectionable\nfire, explosive or other hazard; noise or vibration, smoke, dust,\ndirt or other form of air pollution; electrical or other disturbance;\nglare; or other substance, condition or element in such amount as\nto adversely affect the surrounding area or premises (referred to\nherein as \"dangerous or objectionable elements\"), provided that any\nuse permitted by this chapter may be undertaken and maintained if\nit conforms to the regulations of this subsection limiting dangerous\nand objectionable elements at the specified point or points of the\ndetermination of their existence."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Location where determinations are to be made for enforcement of performance\nstandards. The determination of the existence of any dangerous and\nobjectionable elements shall be made at:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "The point or points where such elements shall be most apparent\nfor fire and explosion hazards, for radioactivity and electrical disturbances,\nfor smoke and other forms of air pollution."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "The property lines of the use creating such elements for noise,\nfor vibration, for glare and for odors."
																}
															]
														}
													]
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Standards to be enforced."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Fire and explosion hazards. All activities involving, and all storage\nof, flammable and explosive materials shall be provided with adequate\nsafety devices against the hazard of fire and explosion and adequate\nfire-fighting and fire-suppression equipment and devices standard\nin this industry. Burning of waste materials in open fires is prohibited.\nThe relevant provisions of state and local laws and regulations shall\nalso apply."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Radioactivity or electrical disturbance. No activities shall be permitted\nwhich emit dangerous radioactivity or electrical disturbance adversely\naffecting the operation of any equipment other than that of the creator\nof such disturbance. All applicable federal regulations shall be complied\nwith."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Noise."
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "At the points of measurement specified, the maximum sound-pressure\nlevel radiated in each standard octave band by any use or facility,\nother than transportation facilities or temporary construction work,\nshall not exceed the values for octave bands lying within the several\nfrequency limits given in Table I after applying the corrections shown\nin Table II. The sound-pressure level, measured with a sound-level\nmeter and associated octave band analyzer conforming to standards\nprescribed by the American Standards Association, Inc., New York,\nNew York. (American Standard Sound Level Meters for Measurement of\nNoise and Other Sounds, 224.3—944, American Standards Association,\nInc., New York, New York, and American Standard Specification for\nan Octave-Band Filter Set for the Analysis of Noise and Other Sounds,\n224.30—1953, or latest approved revision thereof, American Standards\nAssociation, Inc., New York, New York, shall be used.)"
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "If the noise is not smooth and continuous and is not radiated\nbetween the hours of 10:00 p.m. and 7:00 a.m., one or more of the\ncorrections in Table II shall be applied to the octave band levels\ngiven in Table I."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "Vibration. No vibration shall be permitted which is detectable without\ninstruments at the property lines."
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "Glare. No direct or sky-reflected glare, whether from floodlights\nor from high-temperature processes, such as combustion or welding,\nor otherwise, shall be permitted. This restriction shall not apply\nto signs otherwise permitted by the provisions of this chapter."
												}
											]
										},
										{
											"number": "(6) ",
											"content": [
												{
													"text": "Smoke. No emission shall be permitted from any chimney, or otherwise,\nof visible gray smoke of a shade equal to or darker than No. 2 on\nthe Powers Micro Ringelmann Chart, published by McGraw-Hill Publishing\nCompany, Inc., and copyrighted 1954 (being a direct facsimile reduction\nof a standard Ringelmann Chart as issued by the United States Bureau\nof Mines), except that visible gray smoke of a shade equal to No.\n3 on said chart may be emitted for four minutes in any 30 minutes.\nAll applicable federal, state or county regulations shall apply."
												}
											]
										},
										{
											"number": "(7) ",
											"content": [
												{
													"text": "Odors. No emission shall be permitted of odorous gases or other odorous\nmatter in such quantities as to be readily detectable at the property\nline of the zone lot from which they are emitted without instruments."
												}
											]
										},
										{
											"number": "(8) ",
											"content": [
												{
													"text": "Other forms of air pollution. No emission of fly ash, dust, fumes,\nvapors, gases and other forms of air pollution shall be permitted\nwhich can cause any damage to health, to animals, to vegetation or\nto other forms of property or which can cause any excessive soiling.\nAll applicable federal, state and county regulations shall apply."
												}
											]
										}
									]
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 211-24",
			"title": "Mobile homes and mobile home parks.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Mobile homes. Mobile homes shall be permitted only in mobile home\nparks and shall conform to the following requirements:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Code requirements. Mobile home units shall meet the requirements\nof American Standards Association Code Provision A-119.1, American\nStandards for Installation in Mobile Homes of Electrical Heating and\nPlumbing Systems or Mobile Home Manufacturers Association Mobile Home\nStandards for Plumbing, Heating and Electrical Systems or any state-administered\ncode ensuring equal or better standards and shall have a visible official\ncertification of compliance with such code or codes."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Mobile home stands. The mobile home shall be placed upon a stand\nconsisting of appropriate material, properly placed, graded and compacted\nso as to be durable and adequate for the maximum load anticipated\nduring all seasons."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Anchors. Anchors and tie-downs shall be placed at least at each corner\nof the structure, and each shall be able to sustain a minimum tensile\nstrength of 2,800 pounds. Anchors shall be such as cast-in-place concrete\n\"dead men,\" eyelets embedded in concrete, screw augers, arrowhead\nanchors or similar devices."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "Skirting. Each mobile home shall be skirted around the bottom portion\nwith approved metal, fire-retardant treated wood or other durable\nmaterial, properly ventilated, within 60 days from the date of placement\nof the unit."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Mobile home parks. The following regulations and minimum requirements\nshall apply:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Minimum size. Each mobile home park shall have a minimum area of\nfive acres containing clearly defined and marked mobile home lots\nand stands, streets, service buildings and recreation areas."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Location and access. No mobile home park shall be located except\nwith direct access to a state or county highway and with appropriate\nfrontage thereon to permit proper design of access facilities."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Site conditions. The mobile home park site shall in all respects\nbe suitable for residential use. It shall not be subject to hazards,\ninsects, rodents, objectionable smoke, noxious odors, unusual noise,\nsoil subsidence or the probability of flooding or erosion. The soil,\ngroundwater level, drainage, rock formations and topography shall\nnot create hazards to property or to the health and safety of occupants."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "Landscaping and screening."
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "Landscaping and screening will be required to the extent needed\nto provide for:"
																},
																{
																	"content": [
																		{
																			"number": "[1] ",
																			"content": [
																				{
																					"text": "The screening of objectionable views."
																				}
																			]
																		},
																		{
																			"number": "[2] ",
																			"content": [
																				{
																					"text": "Adequate shading."
																				}
																			]
																		},
																		{
																			"number": "[3] ",
																			"content": [
																				{
																					"text": "A suitable setting for the mobile homes and other facilities."
																				}
																			]
																		}
																	]
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "Screening, where required, will be a solid fence six feet high,\nmaintained in good condition and free of all advertising."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "Planted screenings in lieu of such fence shall consist of dense\nplantings of evergreens not less than six feet in height."
																}
															]
														},
														{
															"number": "(d) ",
															"content": [
																{
																	"text": "Screening may be required, where appropriate, for objectionable\nviews such as laundry drying yards, refuse collection stations, accessory\nuses and adjacent properties."
																}
															]
														},
														{
															"number": "(e) ",
															"content": [
																{
																	"text": "Landscaping will be required in appropriate size, quantity and\ncharacter to provide an attractive setting for the mobile homes and\naccessory facilities, to provide adequate privacy and a pleasant setting,\nto minimize glare and to afford shade."
																}
															]
														},
														{
															"number": "(f) ",
															"content": [
																{
																	"text": "Existing natural vegetation should be preserved to the maximum\nextent possible where such is suitable for preservation."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "Size of lots, yards and setbacks. One mobile home may be permitted\non a lot which shall meet the following minimum requirements:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "Minimum lot area: 10,000 square feet.[Amended 8-1-2017 by L.L.\nNo. 3-2017]"
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "Minimum lot width: 100 feet.[Amended 8-1-2017 by L.L.\nNo. 3-2017]"
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "Minimum side yard: 10 feet."
																}
															]
														},
														{
															"number": "(d) ",
															"content": [
																{
																	"text": "Front yard depth from internal street: 20 feet."
																}
															]
														},
														{
															"number": "(e) ",
															"content": [
																{
																	"text": "Yard depth from public streets: 50 feet; and 30 feet from any\nother mobile home park boundary."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(6) ",
											"content": [
												{
													"text": "Recreation areas and open spaces. Not less than 10% of the total\nmobile home park area shall be devoted to recreational facilities,\ngenerally provided in a central location or, in larger courts, decentralized.\nRecreation areas shall include space for community buildings and community\nuse facilities, such as guest parking, adult recreation and child\nplay areas and swimming pools."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Mobile home stands spacing. Mobile home stands shall be so located\nso as to be separated from each other and from other buildings and\nstructures by at least 25 feet, provided that mobile homes placed\nend-to-end may have a clearance of 20 feet."
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "Walkways. Walkways not less than 30 inches wide shall be provided\nfrom the mobile home space to the off-street parking space and from\nmobile home park streets to service buildings."
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "Patio pads. All mobile home stands shall be provided with a patio\npad constructed of concrete, to be a minimum of eight feet by 20 feet\nand four inches in depth. Patio pads shall be located so as to provide\nsafe and easy access to and from the mobile home."
								}
							]
						},
						{
							"number": "F. ",
							"content": [
								{
									"text": "Awnings. Awnings may be provided of any size, provided that they\nare not placed closer than 10 feet to an adjacent mobile home lot."
								}
							]
						},
						{
							"number": "G. ",
							"content": [
								{
									"text": "Additional structure on mobile home stand. No nonintegral structural\naddition or other accessory building or structure in excess of 10\nfeet by 10 feet, or a total of 100 square feet, shall be permitted\non any mobile home lot."
								}
							]
						},
						{
							"number": "H. ",
							"content": [
								{
									"text": "Streets."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Streets shall be provided on the site where necessary to furnish\nprincipal trafficways for convenient access to the mobile home stands\nand other important facilities on the property. Streets shall be privately\nowned and maintained."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "All streets shall be provided with a smooth, hard and dense surface\nin accordance with Village specifications, which streets shall be\ndurable and well-drained under normal use and weather conditions.\nStreet surfaces shall be maintained free of holes and other hazards."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Street surface drainage and overland surface drainage adjacent to\nstreets shall be conveyed to stormwater drain systems or natural drainage\nsystems as approved by the Village consulting engineer."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "Access streets. The entrance streets connecting the mobile home park\nstreets with a public street shall have a minimum pavement width of\n32 feet and a minimum right-of-way width of 50 feet."
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "Internal streets. The width of all rights-of-way must be a minimum\nof 50 feet, 24 feet of which must be pavement."
												}
											]
										},
										{
											"number": "(6) ",
											"content": [
												{
													"text": "Culs-de-sac shall be provided in lieu of closed-end streets and shall\nhave a turnaround with an outside pavement diameter of at least 100\nfeet."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "I. ",
							"content": [
								{
									"text": "Water supply. Public water supply connection shall be used exclusively\nunless local authorities deem otherwise, and water mains and hydrants\nshall be installed in accordance with Village specifications."
								}
							]
						},
						{
							"number": "J. ",
							"content": [
								{
									"text": "Sewerage. Public sewer system connections shall be provided in all\nmobile home parks for the conveying, disposing and treatment of sewage\nfrom mobile homes, service buildings and other facilities."
								}
							]
						},
						{
							"number": "K. ",
							"content": [
								{
									"text": "Garbage and refuse. Each mobile home space shall be provided with\nat least two twenty-gallon metal or plastic garbage cans with tight-fitting\ncovers. The cans shall be kept in a sanitary condition at all times.\nIt shall be the responsibility of the court owner to ensure that garbage\nand rubbish shall be collected and properly disposed of outside of\nthe mobile home park. Exterior property areas shall be maintained\nfree from organic and inorganic material that might become a health,\naccident or fire hazard."
								}
							]
						},
						{
							"number": "L. ",
							"content": [
								{
									"text": "Fuel supply and storage."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Liquefied petroleum gas storage containers having a capacity exceeding\n125 gallons shall be stored in accordance with National Fire Prevention\nAct standards."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Supports and standards for fuel storage tanks are to be of a noncombustible\nmaterial."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "All fuel oil tanks shall be placed at the rear of the mobile home\nand located not less than five feet from any exit."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "M. ",
							"content": [
								{
									"text": "Electrical service."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Every mobile home park shall contain an electrical wiring system\nconsisting of wiring fixtures, equipment and appurtenances in accordance\nwith the National Electrical Code."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Each mobile home stand shall be supplied with not less than one-hundred-ampere\nservice."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Adequate lights shall be provided to illuminate streets, driveways\nand walkways for the safe movement of vehicles and pedestrians at\nnight. A minimum lighting level of 0.3 footcandle shall be provided."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "All electrical distribution lines shall be placed underground."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "N. ",
							"content": [
								{
									"text": "Telephone service. When telephone service is provided to mobile home\nspaces, the distribution service shall be placed underground."
								}
							]
						},
						{
							"number": "O. ",
							"content": [
								{
									"text": "Fire protection and control."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Every mobile home park shall be equipped at all times with fire-extinguishing\nequipment, in good working order, of such type, size and number so\nlocated within the park as to satisfy applicable regulations of the\nfire district within which the mobile home park is located."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "No open fires shall be permitted at any place within the mobile home\npark, with the exception of outdoor grills used for the preparation\nof food."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Water mains and hydrants shall be required and installed in accordance\nwith Village specifications."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "P. ",
							"content": [
								{
									"text": "Management and duties of licensees."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "All park owners shall keep a register of the year, make, serial number\nand size of all mobile homes in the park. Said register is to be maintained\nin the office of the park. The names and addresses of the mobile home\nowners shall also be on file on the park premises."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "The person or person operating a mobile home park shall provide adequate\nsupervision to maintain the park and its facilities and equipment\nin good repair and in sanitary condition at all times."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "Q. ",
							"content": [
								{
									"text": "Posting of license and temporary permit. The certificate of occupancy\nshall be conspicuously posted in the office of or on the premises\nof the mobile home park at all times.[1]"
								},
								{
									"footnote": "[1]\nEditor's Note: Original § 54-25.1 of the 1971\nCode, entitled \"One-family dwelling on a lot of 5,000 square feet\nin a R-7.5 District,\" which immediately followed this section and\nwas added 6-18-1984 by L.L. No. 2-1984 and amended 2-3-1986 by L.L.\nNo. 1-1986, was repealed 10-6-1986 by L.L. No. 4-1986.\n"
								}
							]
						}
					]
				}
			]
		}
	]
}