{
	"url": "http://ecode360.com/12729101",
	"paras": [
		{
			"paragraph": "§ 275",
			"title": "Schedule of Dimensional Regulations",
			"content": [
				{
					"text": "The following regulations shall apply in an R-B District :"
				},
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "PRINCIPAL USES Minimum Requirements:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Lot area (square feet): 21,780"
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Lot width (feet): 125"
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Lot depth (feet): 175"
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "Front yard (feet): 40"
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "Side yard: one (feet): 15"
												}
											]
										},
										{
											"number": "(6) ",
											"content": [
												{
													"text": "Side yard: both (feet): 40"
												}
											]
										},
										{
											"number": "(7) ",
											"content": [
												{
													"text": "Rear yard (feet): 30"
												}
											]
										},
										{
											"number": "(8) ",
											"content": [
												{
													"text": "Lot frontage (feet) 115"
												}
											]
										},
										{
											"number": "(9) ",
											"content": [
												{
													"text": "Habitable floor area (square feet): 1,400"
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "PRINCIPAL USES Maximum Requirements:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Height (stories/feet): 2.5/32 "
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Lot coverage (%): 30"
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "ACCESSORY USES Minimum Requirements:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Rear yard setback (feet): 5"
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Side yard setback (feet): 10"
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Distance from principal building (feet): 20"
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "ACCESSORY USES Maximum Requirements:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Height (feet): 20"
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Coverage of rear yard (%): 20"
												}
											]
										}
									]
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 275-10",
			"title": "Tables.\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t[1]",
			"content": [
				{
					"text": "The accompanying List of Use Regulations by District (Table 1) and Schedule of Dimensional Regulations (Table 2) list and define the permitted use of land, buildings and structures and set forth the minimum and maximum dimensional requirements to be met in connection with such uses. In the List of Use Regulations by District each district is listed, and it is indicated what uses are permitted and in what manner they are permitted for that district. In addition to those uses listed specifically in § 275-11 (prohibited uses), any use not specifically listed as being permitted shall be deemed to be prohibited. No more than one permitted principal use shall be permitted on a lot in any of the residence districts."
				},
				{
					"footnote": "[1]\nEditor's Note: Tables 1 and 2 are included\nat the end of this chapter.\n"
				}
			]
		},
		{
			"paragraph": "§ 275-11",
			"title": "Prohibited uses.",
			"content": [
				{
					"text": "All uses which are not expressly permitted in\nthis chapter are hereby prohibited."
				}
			]
		},
		{
			"paragraph": "§ 275-12",
			"title": "Maximum floor area ratio.",
			"content": [
				{
					"text": "The maximum permitted aggregate floor ratio\narea for all principal and accessory buildings on a lot in all residential\ndistricts shall be as follows (see also Table 3 for an illustrative\nexample):[1]"
				},
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Lots of 8,000 square feet or less shall have a maximum\nfloor area ratio of 0.350."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Lots between 8,001 square feet and 20,000 square feet\nshall have a maximum floor area ratio of 0.350 for the first 8,000\nsquare feet of lot area and 0.10 for each square foot in excess thereof."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Lots between 20,001 square feet and 40,000 square\nfeet shall have a maximum floor area ratio of 0.20 minus 0.0025 or\nproportion thereof for every 1,000 square feet of lot area or proportion\nthereof in excess of 20,000 square feet."
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "Lots between 40,001 square feet and 80,000 square\nfeet shall have a maximum floor area ratio of 0.15 minus 0.00125 or\na proportion thereof for every 1,000 square feet of lot area or proportion\nthereof in excess of 40,000 square feet."
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "Lots between 80,001 square feet and 120,000 square\nfeet shall have a maximum floor area ratio of 0.10 minus 0.0005 or\na proportion thereof for every 1,000 square feet of lot area or proportion\nthereof in excess of 80,000 square feet."
								}
							]
						},
						{
							"number": "F. ",
							"content": [
								{
									"text": "Lots in excess of 120,000 square feet shall have a\nmaximum floor area ratio of .08 for the first 120,000 square feet\nof lot area and 0.04 for each square foot in excess thereof."
								}
							]
						}
					]
				},
				{
					"footnote": "[1]\nEditor's Note: Table 3 is included at the\nend of this chapter.\n"
				}
			]
		},
		{
			"paragraph": "§ 275-13",
			"title": "Height/setback ratio.",
			"content": [
				{
					"text": "In all residential districts, the maximum height\nof a building at all required side and rear yard setback lines shall\nnot exceed 22 feet above grade as defined herein. Thereafter, the\nheight of such buildings may be increased by two feet for each one\nfoot of additional setback from the side or rear lot line. However,\nin no event shall the height of the building or structure exceed the\nmaximum height permitted, as specified in Table 2."
				},
				{
					"paragraph": "§ 275-14",
					"title": "Purpose.",
					"content": [
						{
							"text": "The use and dimensional regulations contained in this article are supplemental and additional to the use and dimensional regulations provided for in Article IV of this chapter. Where the standards or regulations provided for herein (in Article V) conflict with those of other requirements of this chapter, the standards of this article shall apply. The approving agency may, when reasonable, waive compliance or modify the supplemental requirements as provided for in this article (Article VI in connection with an approval, an approval with modification or disapproval of a development application except that any waiver or modification of a dimensional requirement as provided for in this article (Article V) shall be subject to the grant of an area variance by the Zoning Board of Appeals as provided for in § 275-45 of this chapter. The waiver or modification of nondimensional supplemental requirements of this article by the approving agency shall be granted only:"
						},
						{
							"content": [
								{
									"number": "A. ",
									"content": [
										{
											"text": "Upon a showing by the applicant that compliance with\nsuch requirements would result in an unnecessary hardship, or that\nthe benefits to the neighborhood or Village of Roslyn Harbor of granting\nsuch a waiver outweigh the detriments thereof; and"
										}
									]
								},
								{
									"number": "B. ",
									"content": [
										{
											"text": "When such requirements are found not to be requisite\nin the interest of the public health, safety and general welfare or\nare found to be inappropriate to the particular use for which approval\nis being sought."
										}
									]
								}
							]
						}
					]
				},
				{
					"paragraph": "§ 275-15",
					"title": "Supplementary regulations for all uses and districts.",
					"content": [
						{
							"content": [
								{
									"number": "A. ",
									"content": [
										{
											"text": "Lot for every building or structure. Every building\nor structure hereafter erected shall be located on a lot. There shall\nbe no more than one principal building or structure and its accessory\nbuildings or structures on one lot, for single-family detached dwellings."
										}
									]
								},
								{
									"number": "B. ",
									"content": [
										{
											"text": "Yard for every building or structure. No yard or other\nopen space provided about any building or structure for the purpose\nof complying with the provisions of this chapter shall be included\nas any part of the yard or open space for any other building or structure.\nNo yard or any other open space on one lot shall be considered as\na yard or open space for a building on any other lot."
										}
									]
								},
								{
									"number": "C. ",
									"content": [
										{
											"text": "Required street frontage. Every lot shall be required\nto front on a public or private street. On a cul-de-sac turnaround\nor a radial street the Planning Board may reduce the minimum required\nlot frontage, but by no more than 40% in all cases."
										}
									]
								},
								{
									"number": "D. ",
									"content": [
										{
											"text": "Conformity required for apportionments and subdivisions.\nWhere a lot is formed hereafter from part of a lot already occupied\nby a building or structure, such separation shall be effected in such\nmanner as not to impair conformity with any of the requirements of\nthis chapter with respect to the existing building or structure and\nall yards and other required spaces in connection therewith, and no\npermit shall be issued for the erection of a building or structure\non the new lot thus created unless it complies with all the provisions\nof this chapter."
										}
									]
								},
								{
									"number": "E. ",
									"content": [
										{
											"text": "Irregularly shaped lots. Where a question exists as\nto the proper application of any of the requirements of this chapter\nto a particular lot because of its peculiar or irregular shape, the\nBuilding Inspector shall determine how the requirements of this chapter\napply."
										}
									]
								},
								{
									"number": "F. ",
									"content": [
										{
											"text": "New buildings or structures on lots smaller than the\nminimum required area or dimension. Where the required area or dimensions\nof lots are changed by an amendment to this chapter, any lot legally\nin existence on that date and made nonconforming by such amendment\nmay be built upon, provided that:"
										},
										{
											"content": [
												{
													"number": "(1) ",
													"content": [
														{
															"text": "The lot met the zoning requirements at the time it\nreceived subdivision approval;"
														}
													]
												},
												{
													"number": "(2) ",
													"content": [
														{
															"text": "All yard setbacks and other building-related requirements\nwhich were in effect at the time the building permit was granted are\ncomplied with; and"
														}
													]
												},
												{
													"number": "(3) ",
													"content": [
														{
															"text": "The ownership of such lot was not the same as any\nother lot or lots contiguous thereto as of the date of adoption of\nthis chapter. If the opposite is the case, such other lot or lots,\nor so much thereof as may be necessary, shall be combined with the\nfirst-named lot to make one or more conforming lots, whereupon a permit\nmay be issued, but only for conforming lots when so combined."
														}
													]
												}
											]
										}
									]
								},
								{
									"number": "G. ",
									"content": [
										{
											"text": "Use of yards. No accessory use, building or structure shall be permitted within any minimum required yard except as may be specifically permitted in this Article V (Supplementary Use and Dimensional Regulations) and Article VI (Special Use Permits) of this chapter."
										}
									]
								},
								{
									"number": "H. ",
									"content": [
										{
											"text": "No reduction of required yards. No lot shall be so\nreduced in area as to make any yard smaller than the minimum required\nunder this chapter."
										}
									]
								},
								{
									"number": "I. ",
									"content": [
										{
											"text": "Front yards or corner lots. On corner lots, the yard\nin front of the structure which has been so designated on the plot\nplan by the owner shall be required to meet the minimum front yard\nrequirements for the district in which the lot is so located."
										}
									]
								},
								{
									"number": "J. ",
									"content": [
										{
											"text": "Front yards on through lots. On a through lot, the\nowner shall designate which street frontage is the front, to which\na front yard setback shall apply. A rear yard setback shall be required\non the other street frontage, provided that it is approved by the\nPlanning Board and determined by the Board not to be inconsistent\nwith or detrimental to the neighborhood or street upon which such\nlot is located."
										}
									]
								},
								{
									"number": "K. ",
									"content": [
										{
											"text": "Front yards on widened streets. Wherever a portion\nof a front yard is being taken for the widening or improvement of\nany street right-of-way, the buildings or structures on such a lot\nshall be required to measure the yard setbacks from the taking line\nrather than the existing right-of-way line."
										}
									]
								},
								{
									"number": "L. ",
									"content": [
										{
											"text": "Structural projections permitted into required front\nyards. In all districts where a front yard is required, the space\nin such front yard shall be open and unobstructed, except for:"
										},
										{
											"content": [
												{
													"number": "(1) ",
													"content": [
														{
															"text": "An unroofed extension or deck projecting not more\nthan five feet into the minimum front yard."
														}
													]
												},
												{
													"number": "(2) ",
													"content": [
														{
															"text": "Cornices or eaves on the principal building projecting\nnot more than 18 inches."
														}
													]
												},
												{
													"number": "(3) ",
													"content": [
														{
															"text": "Fences and walls as provided for in § 275-18C."
														}
													]
												},
												{
													"number": "(4) ",
													"content": [
														{
															"text": "Open stairs."
														}
													]
												},
												{
													"number": "(5) ",
													"content": [
														{
															"text": "Permitted residential signs in accordance with § 275-18I."
														}
													]
												}
											]
										}
									]
								},
								{
									"number": "M. ",
									"content": [
										{
											"text": "Structural projections permitted into required side\nor rear yards. In all districts, the space in a required side or rear\nyard shall be open and unobstructed, except for:"
										},
										{
											"content": [
												{
													"number": "(1) ",
													"content": [
														{
															"text": "Ordinary projections of windowsills, belt courses\nand other ornamental features projecting not more than four inches."
														}
													]
												},
												{
													"number": "(2) ",
													"content": [
														{
															"text": "Chimneys projecting not more than 2 1/2 feet."
														}
													]
												},
												{
													"number": "(3) ",
													"content": [
														{
															"text": "Cornices or eaves projecting not more than three feet\nin a rear yard and two feet in a side yard."
														}
													]
												},
												{
													"number": "(4) ",
													"content": [
														{
															"text": "Bay windows projecting not more than two feet."
														}
													]
												},
												{
													"number": "(5) ",
													"content": [
														{
															"text": "Walls and fences as provided for in § 275-18C."
														}
													]
												},
												{
													"number": "(6) ",
													"content": [
														{
															"text": "Unroofed decks less than three feet above finished grade as provided for in § 275-18A."
														}
													]
												},
												{
													"number": "(7) ",
													"content": [
														{
															"text": "Open stairs."
														}
													]
												},
												{
													"number": "(8) ",
													"content": [
														{
															"text": "Other accessory uses, buildings and structures as specifically permitted by §§ 275-17 and 275-18."
														}
													]
												}
											]
										}
									]
								},
								{
									"number": "N. ",
									"content": [
										{
											"text": "Drainage improvements. Roof water drainage shall be\ncollected in dry wells via gutters and leaders to dry wells placed\nat a minimum of 10 feet from a building or structure. On driveways\nwith a slope in excess of 5%, a designed trench drain shall be provided\nat the lowest elevation and connected to appropriately designed and\nsized dry wells to prevent stormwater runoff from flowing onto Village\nroads."
										}
									]
								}
							]
						}
					]
				},
				{
					"paragraph": "§ 275-16",
					"title": "Supplementary regulations for uses in residential districts.",
					"content": [
						{
							"content": [
								{
									"number": "A. ",
									"content": [
										{
											"text": "Private recreational clubs and outdoor recreational\nuses.[1]"
										},
										{
											"content": [
												{
													"number": "(1) ",
													"content": [
														{
															"text": "All interior areas designed for potentially noisy\nactivities shall be sufficiently sound-insulated or separated from\nadjacent residential structures so as to avoid any noise nuisance."
														}
													]
												},
												{
													"number": "(2) ",
													"content": [
														{
															"text": "The appearance of any structure shall not be out of\ncharacter or scale with the neighborhood within which it is to be\nlocated."
														}
													]
												},
												{
													"number": "(3) ",
													"content": [
														{
															"text": "A ten-foot-high all-season evergreen planted screen\nor other suitable buffering shall be required for a depth of 10 feet,\nwhere the club is adjacent to a residential use or district. No fence\nshall be used in place of the screening."
														}
													]
												},
												{
													"number": "(4) ",
													"content": [
														{
															"text": "No intensive outdoor activity shall be permitted other\nthan off-street parking and similar service uses. If outdoor service\nfacilities are provided they shall be located no closer than 100 feet\nto a residential zone or the property line of an adjacent residential\nuse."
														}
													]
												},
												{
													"number": "(5) ",
													"content": [
														{
															"text": "No outdoor music or public address system shall be\nprovided."
														}
													]
												},
												{
													"number": "(6) ",
													"content": [
														{
															"text": "A private kitchen accessory to the principal use shall\nbe permitted, provided that such food or drink is served in the dining\narea. If food or drink is served on the grounds of the club, such\nservice shall be limited to the hours of 8:00 a.m. to 10:00 p.m.,\nexcept that on Friday and Saturday nights and those preceding public\nholidays such time shall be 11:00 p.m."
														}
													]
												},
												{
													"number": "(7) ",
													"content": [
														{
															"text": "All swimming pools shall provide a suitable club or\nbathhouse building. The club or bathhouse shall be set back not less\nthan 50 feet from all property lines."
														}
													]
												},
												{
													"number": "(8) ",
													"content": [
														{
															"text": "An outdoor swimming pool shall be located not less\nthan 100 feet from the side or rear of the clubhouse or bathhouse\nand not less than 100 feet from the front property line and not less\nthan 50 feet from the side and rear property lines."
														}
													]
												},
												{
													"number": "(9) ",
													"content": [
														{
															"text": "Parking spaces shall be provided in an area or areas\nlocated not less than 100 feet from the front property line and 50\nfeet from all other property lines. Such parking areas shall be screened\nand buffered from adjacent properties and public or private streets."
														}
													]
												},
												{
													"number": "(10) ",
													"content": [
														{
															"text": "The pump of a filtration or pumping system of\na private club pool shall be located not less than 100 feet from any\nside or rear property line."
														}
													]
												},
												{
													"number": "(11) ",
													"content": [
														{
															"text": "To provide safety and privacy, an outdoor swimming\npool or other outdoor recreational facility shall be surrounded entirely\nby a suitably strong tight fence; however, one side or sides of the\nclub or bathhouse may serve as a part of the enclosure. The fence\nshall be from six feet to eight feet high and shall be nonclimbable.\nAll supporting structures shall be on the inside of the fence, and\nthe top of such support shall be at least one inch lower than the\ntop of the fence. Any opening or openings in the fence to afford entry\nto the pool shall be equipped with a substantial gate similar to the\nfence and shall extend from not less than two inches above the ground\nto the height of the fence. The gate shall be of a self-closing type,\nopening outwardly only and be equipped with a lock and key or chain\nand padlock and shall be kept locked, except when the pool is in use."
														}
													]
												},
												{
													"number": "(12) ",
													"content": [
														{
															"text": "All outdoor lighting fixtures shall be shielded\nso as to prevent any direct beam from falling upon any adjoining property.\nDownlights only shall be permitted. No support pole or lamp thereon\nshall exceed a height of 12 feet. No mercury, sodium or arc lamps\nshall be permitted."
														}
													]
												},
												{
													"number": "(13) ",
													"content": [
														{
															"text": "Overhead wires shall not be carried across the\nswimming pool and wading pool proper, decks and lounging areas."
														}
													]
												},
												{
													"number": "(14) ",
													"content": [
														{
															"text": "Underwater lighting shall be designed, installed,\nand grounded so as not to create a hazard to bathers."
														}
													]
												}
											]
										},
										{
											"footnote": "[1]\nEditor's Note: See also Ch. 221, § 221-8, Private recreational clubs.\n"
										}
									]
								}
							]
						}
					]
				},
				{
					"paragraph": "§ 275-17",
					"title": "Supplementary requirements for all accessory uses in residential districts.",
					"content": [
						{
							"text": "In addition to the specific requirements for certain accessory residential uses and structures provided for in § 275-18, all accessory residential uses and structures shall be required to meet the following provisions:"
						},
						{
							"content": [
								{
									"number": "A. ",
									"content": [
										{
											"text": "No accessory residential use or structure may be established\non a lot prior to the establishment of the principal building or structure,\nexcept temporary structures associated with the construction of the\nprincipal building or structure."
										}
									]
								},
								{
									"number": "B. ",
									"content": [
										{
											"text": "The following accessory uses and structures are specifically\nprohibited:"
										},
										{
											"content": [
												{
													"number": "(1) ",
													"content": [
														{
															"text": "Outdoor storage, except temporary construction equipment"
														}
													]
												},
												{
													"number": "(2) ",
													"content": [
														{
															"text": "The parking and storing of commercial vehicles during\nthe period of time from sunset to sunrise, except that such a vehicle\nmay be parked for such periods of time as required for the continued\nperformance of any service on or delivery to premises contained in\nsaid residential districts. Where such parking of a commercial vehicle\nis occasioned by continuing construction or other work for which a\nbuilding permit is required, such parking shall only be permitted\nif and to the extent authorized in the building permit."
														}
													]
												},
												{
													"number": "(3) ",
													"content": [
														{
															"text": "Temporary or portable signs."
														}
													]
												}
											]
										}
									]
								},
								{
									"number": "C. ",
									"content": [
										{
											"text": "Unless otherwise specifically provided for in § 275-18, all accessory buildings and structures shall adhere to the requirements set forth below. Where the requirements in this subsection conflict the standards of § 275-18, the standards of § 275-18 shall apply."
										},
										{
											"content": [
												{
													"number": "(1) ",
													"content": [
														{
															"text": "No accessory residential uses or structures shall be permitted in the front yard, except for fences and walls as provided for in § 275-18C and signs in accordance with § 275-18I."
														}
													]
												},
												{
													"number": "(2) ",
													"content": [
														{
															"text": "More than one accessory residential use or structure\nshall be permitted on a single lot provided that the total area covered\nby such buildings and structures does not cover more than 20% of the\nrear yard."
														}
													]
												}
											]
										}
									]
								}
							]
						}
					]
				},
				{
					"paragraph": "§ 275-18",
					"title": "Supplementary requirements for certain uses in residential districts.",
					"content": [
						{
							"content": [
								{
									"number": "A. ",
									"content": [
										{
											"text": "Decks."
										},
										{
											"content": [
												{
													"number": "(1) ",
													"content": [
														{
															"text": "A deck shall have no enclosure other than the sides\nof the principal building to which it is attached; provided, however,\nthat a deck may have a railing of open construction not over four\nfeet in height, with at least 1/2 of the area thereof open."
														}
													]
												},
												{
													"number": "(2) ",
													"content": [
														{
															"text": "A deck which is more than three feet in height above\nthe average finished grade of the building to which it is attached\nshall meet the minimum setback requirements for principal buildings.\nAll other decks shall be no closer than three feet to a side property\nline nor closer than five feet to a rear property line."
														}
													]
												},
												{
													"number": "(3) ",
													"content": [
														{
															"text": "A deck shall not be located in the front yard, except in accordance with § 275-15L, and may not cover more than 20% of one side or rear yard."
														}
													]
												}
											]
										}
									]
								},
								{
									"number": "B. ",
									"content": [
										{
											"text": "Doghouses or structures accommodating pets. See Chapter 92.[Amended 6-9-2016 by L.L.\nNo. 2-2016]"
										}
									]
								},
								{
									"number": "C. ",
									"content": [
										{
											"text": "Fences and walls."
										},
										{
											"content": [
												{
													"number": "(1) ",
													"content": [
														{
															"text": "All fences or walls and their appurtenances shall be located inside\nall lot line. No boundary fence or wall shall exceed a height of six\nfeet, except for fences and walls along property lines bordering Bryant\nAvenue, Glen Cove Avenue, Glenwood Road and Scudders Lane, which shall\nnot exceed eight feet in height.[Amended 5-12-2016 by L.L. No. 1-2016]"
														}
													]
												},
												{
													"number": "(2) ",
													"content": [
														{
															"text": "Electrically charged fences, barbed wire fences and\nother fences constructed of sharp materials shall not be permitted."
														}
													]
												},
												{
													"number": "(3) ",
													"content": [
														{
															"text": "No solid fence or wall shall be erected along any property line bordering\nany street except for the following streets: Bryant Avenue, Glen Cove\nAvenue, Glenwood Road and Scudders Lane, which may be solid and up\nto eight feet in height.[Amended 7-14-2008 by L.L. No. 2-2008]"
														}
													]
												},
												{
													"number": "(4) ",
													"content": [
														{
															"text": "No wall, fence, or other structure shall be erected\nor altered and no hedge, tree, shrub or other growth shall be planted\nor maintained on any lot which may obscure the view on a street or\nat the intersection of streets endangering lives or property of the\nusers thereof."
														}
													]
												},
												{
													"number": "(5) ",
													"content": [
														{
															"text": "All fences shall exhibit the finished, unbroken or\nnonpost side toward the adjoining property. No supports, posts or\nbracing shall be placed on the side of the fence facing adjoining\nproperty."
														}
													]
												},
												{
													"number": "(6) ",
													"content": [
														{
															"text": "For all fences and walls existing on June 1, 2016, the provisions\nof this section only apply if the existing fence or wall is being\nreplaced in excess of 50% of its length.[Added 5-12-2016 by L.L.\nNo. 1-2016]"
														}
													]
												}
											]
										}
									]
								},
								{
									"number": "D. ",
									"content": [
										{
											"text": "Garage and yard sales. Garage and yard sales shall\nbe permitted not more than once in any one calendar year per residential\nproperty and shall be limited to items not specifically purchased\nfor resale. Said sales may only involve property from the occupant\nof the specific property."
										}
									]
								},
								{
									"number": "E. ",
									"content": [
										{
											"text": "Guest cottages."
										},
										{
											"content": [
												{
													"number": "(1) ",
													"content": [
														{
															"text": "Guest cottages, consisting of a residential unit no\nlarger than 500 square feet or 10% of the gross floor area of the\nprincipal dwelling, whichever is smaller, and comprising no more than\none room other than a bathroom shall be permitted for occupancy only\nby nonpaying guests of residents of the principal residence on the\nlot."
														}
													]
												},
												{
													"number": "(2) ",
													"content": [
														{
															"text": "Such cottages shall adhere to all other requirements\nfor accessory structures in the district."
														}
													]
												},
												{
													"number": "(3) ",
													"content": [
														{
															"text": "Such a cottage shall have a residential appearance\nand shall have pitched roof and facade materials which match those\nof the principal residence."
														}
													]
												}
											]
										}
									]
								},
								{
									"number": "F. ",
									"content": [
										{
											"text": "Piers, docks and boathouses."
										},
										{
											"content": [
												{
													"number": "(1) ",
													"content": [
														{
															"text": "Boathouses and covered moorages shall not exceed a\nheight of 10 feet above high tide, nor shall the aggregate floor area\nof such structures exceed 500 square feet of the rear yard."
														}
													]
												},
												{
													"number": "(2) ",
													"content": [
														{
															"text": "The maximum length that a pier may extend into the\nwater shall not exceed 50 feet beyond the high tide line, and a pier\nshall not exceed six feet in width."
														}
													]
												},
												{
													"number": "(3) ",
													"content": [
														{
															"text": "A pier shall be attached to the shore between the\nminimum side yard setback lines projected into the water body."
														}
													]
												}
											]
										}
									]
								},
								{
									"number": "G. ",
									"content": [
										{
											"text": "Private garages and private open air parking areas."
										},
										{
											"content": [
												{
													"number": "(1) ",
													"content": [
														{
															"text": "When a private garage is constructed within the main\nwalls of the principal building to which it is accessory, or on the\nsame lot and wholly below the level of the first floor of such principal\nbuilding, the floor areas of such private garage shall be excluded\nin the computations of the gross floor area of such principal building,\nits floor area ratio and its lot coverage but shall adhere to the\nsetback and height restrictions for principal buildings on the lot."
														}
													]
												},
												{
													"number": "(2) ",
													"content": [
														{
															"text": "When a private garage is constructed outside the main\nwalls of the principal building to which it is accessory and in whole\nor in part above the level of the first floor of such principal building,\nthe floor area of such private garage shall be included in the computation\nof the gross floor area of such principal building, its floor area\nratio and its lot coverage and shall adhere to the setback and height\nrequirements as provided for herein."
														}
													]
												},
												{
													"number": "(3) ",
													"content": [
														{
															"text": "No wall or partition wall of any private garage may\nproject into or be erected upon the area of the minimum required front\nyard or minimum required side yard.[Amended 11-9-2009 by L.L. No. 2-2009]"
														}
													]
												},
												{
													"number": "(4) ",
													"content": [
														{
															"text": "No wall or partition wall of any private garage or\nopen air parking space may project into or be erected upon the area\nof the minimum required front yard or minimum required side yard."
														}
													]
												},
												{
													"number": "(5) ",
													"content": [
														{
															"text": "Private garages or private open air parking of motor\nvehicles shall be prohibited on vacant lots or lots where the principal\nbuilding has not been completed."
														}
													]
												},
												{
													"number": "(6) ",
													"content": [
														{
															"text": "Only private garages and/or private open air parking\nspace may be used to satisfy the parking requirements for all single-family\nresidential uses in the Village of Roslyn Harbor."
														}
													]
												},
												{
													"number": "(7) ",
													"content": [
														{
															"text": "At least two off-street parking spaces shall be provided\nfor each dwelling unit, of which at least one shall be provided in\nan enclosed garage.[Amended 11-9-2009 by L.L. No. 2-2009]"
														}
													]
												},
												{
													"number": "(8) ",
													"content": [
														{
															"text": "At least two off-street parking spaces shall be provided\nfor each dwelling unit, of which at least one shall be provided in\nan enclosed garage. No more than one parking space shall be provided\nin the driveway. No parking space shall be permitted in the front\nyard."
														}
													]
												},
												{
													"number": "(9) ",
													"content": [
														{
															"text": "No open air parking space, driveway, or other paved\nsurface may be used for the storage, servicing or dismantling of motor\nvehicles, nor for the storage or overnight parking of boats, boat\ntrailers, recreational vehicles, unregistered vehicles or vehicles\nthat are commercial registered or registered for livery.[Amended 11-9-2009 by L.L. No. 2-2009]"
														}
													]
												},
												{
													"number": "(10) ",
													"content": [
														{
															"text": "Parking areas and driveways are to be adequately\nscreened and appropriately located and sized for the property. The\ntype, location and extent of screening and the location and size of\nthe driveway and parking areas shall be approved by the Building Inspector\nor the Planning Board, if subject to site plan approval.[Amended 11-9-2009 by L.L. No. 2-2009]"
														},
														{
															"content": [
																{
																	"number": "(a) ",
																	"content": [
																		{
																			"text": "The location and size of the driveway and parking area, along with\nthe screening to be required by the Building Inspector or Planning\nBoard, shall be:"
																		},
																		{
																			"content": [
																				{
																					"number": "[1] ",
																					"content": [
																						{
																							"text": "To the degree and extent required to minimize the overall impacts\n(including visual appearance) of the parking area and driveway on\nneighboring properties and passing motorists;"
																						}
																					]
																				},
																				{
																					"number": "[2] ",
																					"content": [
																						{
																							"text": "Compatible with neighboring properties and the Village; and"
																						}
																					]
																				},
																				{
																					"number": "[3] ",
																					"content": [
																						{
																							"text": "Not be overly restrictive to preclude the reasonable use of the owner's\nproperty."
																						}
																					]
																				}
																			]
																		}
																	]
																},
																{
																	"number": "(b) ",
																	"content": [
																		{
																			"text": "Screening that is required shall thereafter be maintained by the\nowner. If the plantings die or become diseased to an extent that adversely\nimpacts the plants' screening qualities, the dead and diseased plants\nshall be promptly replaced with equivalent plant material."
																		}
																	]
																}
															]
														}
													]
												}
											]
										}
									]
								},
								{
									"number": "H. ",
									"content": [
										{
											"text": "Radio and TV antennas."
										},
										{
											"content": [
												{
													"number": "(1) ",
													"content": [
														{
															"text": "Radio and TV antennas may be attached to principal\nbuildings as architectural projections and may project into the required\nside or rear yard a maximum of two feet."
														}
													]
												},
												{
													"number": "(2) ",
													"content": [
														{
															"text": "Freestanding antennas shall require their own foundation\nand shall meet all required rear and side yard setback and height\nstandards for principal buildings."
														}
													]
												}
											]
										}
									]
								},
								{
									"number": "I. ",
									"content": [
										{
											"text": "Residential signs. The following signs shall be permitted:[Amended by 12-7-2000 by L.L. No. 3-2000]"
										},
										{
											"content": [
												{
													"number": "(1) ",
													"content": [
														{
															"text": "Nonilluminated trespass and traffic signs, provided\nthat no such sign shall exceed nine square feet in area."
														}
													]
												},
												{
													"number": "(2) ",
													"content": [
														{
															"text": "A nonilluminated informational or directional sign\nor historic marker erected by a public agency and any similar sign\nlocated within a public park or playground and erected and maintained\ntherein by the public agency having jurisdiction over such park or\nplayground, provided that no such sign shall exceed nine square feet\nin area."
														}
													]
												},
												{
													"number": "(3) ",
													"content": [
														{
															"text": "Directional, directory or announcement signs erected\nand maintained by the Village in connection with a public or semipublic\nbuilding or attraction and municipal signs necessary to the public\nwelfare of the Village, after approval by the Board of Trustees."
														}
													]
												},
												{
													"number": "(4) ",
													"content": [
														{
															"text": "Noncommercial signs, provided that:"
														},
														{
															"content": [
																{
																	"number": "(a) ",
																	"content": [
																		{
																			"text": "No such sign shall exceed four square feet in\narea."
																		}
																	]
																},
																{
																	"number": "(b) ",
																	"content": [
																		{
																			"text": "The sign shall be set back a minimum of 20 feet\nfrom the nearest road."
																		}
																	]
																},
																{
																	"number": "(c) ",
																	"content": [
																		{
																			"text": "No sign may be erected on a public street or\nright-of-way or on private property near the intersection of any street\nso as to obstruct or impair free and clear vision of motorists or\nof any sign displayed by a public entity for traffic instructions\nor directions or other public information."
																		}
																	]
																}
															]
														}
													]
												},
												{
													"number": "(5) ",
													"content": [
														{
															"text": "A temporary nonilluminated real estate sign or signboard\nused in connection with the sale, lease or rental of the land or property\non which the sign is displayed, provided that:"
														},
														{
															"content": [
																{
																	"number": "(a) ",
																	"content": [
																		{
																			"text": "No such sign or signboard shall exceed two square\nfeet in area;"
																		}
																	]
																},
																{
																	"number": "(b) ",
																	"content": [
																		{
																			"text": "Total height shall not exceed five feet from\nthe grade to the highest point of the sign or sign board structure;"
																		}
																	]
																},
																{
																	"number": "(c) ",
																	"content": [
																		{
																			"text": "No lot shall have more than one real estate\nsign;"
																		}
																	]
																},
																{
																	"number": "(d) ",
																	"content": [
																		{
																			"text": "The sign may not contain the name of the realtor\nor broker or otherwise use wording which directs attention to a business,\ncommodity or service conducted on or off the land or property on which\nthe sign is displayed;"
																		}
																	]
																},
																{
																	"number": "(e) ",
																	"content": [
																		{
																			"text": "The sign shall be on a white background;"
																		}
																	]
																},
																{
																	"number": "(f) ",
																	"content": [
																		{
																			"text": "The sign shall be set back a minimum of 20 feet\nfrom the nearest road;"
																		}
																	]
																},
																{
																	"number": "(g) ",
																	"content": [
																		{
																			"text": "No sign shall be erected on a public street\nor right-of-way or on private property near the intersection of any\nstreet so as to obstruct or impair free and clear vision of motorists\nor of any sign displayed by a public entity for traffic instructions\nor directions or other public information;"
																		}
																	]
																},
																{
																	"number": "(h) ",
																	"content": [
																		{
																			"text": "No balloons, garlands, ribbons, or similar items\nshall be attached or affixed to any sign or signboard; and"
																		}
																	]
																},
																{
																	"number": "(i) ",
																	"content": [
																		{
																			"text": "No sign or any part thereof may be in motion\nby any means, including fluttering or rotating."
																		}
																	]
																}
															]
														}
													]
												},
												{
													"number": "(6) ",
													"content": [
														{
															"text": "Nonconforming residential signs existing as of the\neffective date of this chapter may remain for 90 days, at which time\nany sign on property or land shall be brought into full conformance\nwith this chapter."
														}
													]
												},
												{
													"number": "(7) ",
													"content": [
														{
															"text": "The following regulations shall apply to signs hereafter erected, altered or repaired in all residential districts, the fee for which shall be in accordance with that established in Article XIII of this chapter. No permit shall be required for any of the following residential signs which may be displayed in any district:"
														},
														{
															"content": [
																{
																	"number": "(a) ",
																	"content": [
																		{
																			"text": "A nonilluminated nameplate for a home professional\noffice not exceeding two square feet in area bearing only the name\nof the occupant or professional person residing on the land or property\non which the sign is displayed and indicating such person's profession."
																		}
																	]
																},
																{
																	"number": "(b) ",
																	"content": [
																		{
																			"text": "A nonilluminated informational or directional\nsign or historic marker erected by a public agency and any similar\nsign located within a public park or playground."
																		}
																	]
																},
																{
																	"number": "(c) ",
																	"content": [
																		{
																			"text": "Directional, directory or announcement signs\nerected and maintained by the Village in connection with a public\nor semipublic building or attraction and municipal signs necessary\nto the public welfare of the Village."
																		}
																	]
																},
																{
																	"number": "(d) ",
																	"content": [
																		{
																			"text": "Permitted noncommercial signs not exceeding\nfour square feet in area."
																		}
																	]
																}
															]
														}
													]
												}
											]
										}
									]
								},
								{
									"number": "J. ",
									"content": [
										{
											"text": "Storage of recreational vehicles, campers, boats and\nmotor vehicle trailers"
										},
										{
											"content": [
												{
													"number": "(1) ",
													"content": [
														{
															"text": "Only one recreational vehicle, camper, boat, boat\ntrailer or motor vehicle trailer shall be stored on an improved lot\nand shall be owned by the owner or occupant of the dwelling or the\nlot. An enclosed garage of sufficient size to accommodate such a vehicle\nshall be provided. The recreational vehicle, camper, boat, boat trailer\nor motor vehicle trailer shall be stored in the enclosed garage at\nall times."
														}
													]
												},
												{
													"number": "(2) ",
													"content": [
														{
															"text": "Such a vehicle shall be stored with the wheels attached\nthereto or shall not be used for permanent or transient habitation\nwhen so stored."
														}
													]
												}
											]
										}
									]
								},
								{
									"number": "K. ",
									"content": [
										{
											"text": "Storage sheds and greenhouses."
										},
										{
											"content": [
												{
													"number": "(1) ",
													"content": [
														{
															"text": "The maximum size of a greenhouse shall be 100 square\nfeet for each 10,000 square feet of lot area, or a proportion thereof,\nbut in all cases may be at least 100 square feet in size."
														}
													]
												},
												{
													"number": "(2) ",
													"content": [
														{
															"text": "No more than one storage shed or greenhouse shall\nbe permitted."
														}
													]
												},
												{
													"number": "(3) ",
													"content": [
														{
															"text": "No storage shed or greenhouse shall exceed a height\nof eight feet nor be located any closer to a property line than five\nfeet."
														}
													]
												},
												{
													"number": "(4) ",
													"content": [
														{
															"text": "Applicants are encouraged to match the color and roofing\nmaterial of storage sheds with that of the principal building on the\nlot."
														}
													]
												},
												{
													"number": "(5) ",
													"content": [
														{
															"text": "Any storage shed or greenhouse which is attached to\na principal building or structure shall be considered part of the\nprincipal building or structure for the purpose of measuring minimum\nrequired setbacks."
														}
													]
												},
												{
													"number": "(6) ",
													"content": [
														{
															"text": "Such structure shall not be used for the conduct of\nany business located on or off the subject property nor storage for\nany commercial enterprise or business on or off the subject property."
														}
													]
												}
											]
										}
									]
								},
								{
									"number": "L. ",
									"content": [
										{
											"text": "Swimming pools and bathhouses. Such structure shall\nnot be used for the conduct of any business located on or off the\nsubject property nor storage for any commercial enterprise or business\non or off the subject property.[Amended 6-9-2016 by L.L.\nNo. 4-2016]"
										},
										{
											"content": [
												{
													"number": "(1) ",
													"content": [
														{
															"text": "A private swimming pool may be located in the rear\nyard, or side yard, except that a pool shall not be located in the\nminimum required side yard as measured from the inside wall surface\nof in-ground pools and from the exterior edge of a deck for aboveground\nand partially aboveground pools."
														}
													]
												},
												{
													"number": "(2) ",
													"content": [
														{
															"text": "Adjacent to every front, side, and rear lot line contiguous\nto the yard areas containing the pool, there shall be a protective\nsolid screen for a height of not less than four feet, so as to provide\nan effective visual screen along such property lines. The requirement\nof a visual screen shall be satisfied by the installation of either\na solid fence or a planting strip not less than four feet wide and\nlaid out with suitable plant material which will attain and be maintained\nat a height of not less than four feet."
														}
													]
												},
												{
													"number": "(3) ",
													"content": [
														{
															"text": "Outdoor pools shall be constructed in compliance with\nthe regulations of the Nassau County Health Department and other applicable\nrules and regulations. For in-ground or partial in-ground pools, the\nportion of the premises upon which a swimming pool is located shall\nbe entirely enclosed with an approved, quality, chain link wire, wooden\nor other fence of not less than four feet in height. For aboveground\npools without decks, a ladder of the hinged type shall be provided\nwith locking devices such that, when the pool is not in use, the ladder\nwill be locked in the \"up\" position. For aboveground pools having\ndecks, a gate and fence at least three feet high above the level of\nthe deck shall be installed. Aboveground pools shall not be required\nto have any additional fencing."
														}
													]
												},
												{
													"number": "(4) ",
													"content": [
														{
															"text": "Every gate or other opening in the fence enclosing\nany swimming pool shall be kept securely closed and locked at all\ntimes when such pool is not in use. All gates shall be equipped with\na spring or such similar device to automatically close the gate after\nuse. The gate shall be equipped with a latch which will automatically\nengage when the gate closes. The latch release shall be located at\nleast four feet above adjacent ground level."
														}
													]
												},
												{
													"number": "(5) ",
													"content": [
														{
															"text": "Notwithstanding the provision of Subsection L(1) above, no portion of a swimming pool shall be less than 20 feet from any property line."
														}
													]
												},
												{
													"number": "(6) ",
													"content": [
														{
															"text": "All swimming pools shall be provided an acceptable\nmeans of draining water. Proper disposal of backwash and all pool\nwater shall be required to drain to an acceptable wastewater disposal\nsystem as approved by the Building Inspector."
														}
													]
												},
												{
													"number": "(7) ",
													"content": [
														{
															"text": "No loudspeaking or amplifying device shall be permitted\nthat will project sound beyond the boundary of the property or lot\nwhere any pool is located."
														}
													]
												},
												{
													"number": "(8) ",
													"content": [
														{
															"text": "No lighting or spotlighting shall be permitted that\nwill project light rays beyond the bounds of the property or lot."
														}
													]
												},
												{
													"number": "(9) ",
													"content": [
														{
															"text": "A bathhouse or cabana, swimming pool mechanical and electrical systems\nand pool accessories, including slides and diving boards serving a\nswimming pool, shall be permitted, provided they meet the setback\nand other dimensional requirements for accessory uses and structures\nin the district in which they are located."
														}
													]
												},
												{
													"number": "(10) ",
													"content": [
														{
															"text": "No outdoor swimming pool shall be enclosed by\nplastic, canvas or other similar material or temporary structure in\nany fashion. For purposes of this section, a swimming pool cover no\ngreater than two feet above the surface of the water shall not be\ndeemed to be an enclosure or temporary structure."
														}
													]
												}
											]
										}
									]
								},
								{
									"number": "M. ",
									"content": [
										{
											"text": "On-site living quarters for employees of private recreational clubs. A building or structure or portion thereof customarily incidental and subordinate to the buildings or structures of a private recreational club may be used as living quarters for the purpose of providing housing for employees of the club provided that such housing facilities comply with the provisions of this chapter, including Article VI.[Added 3-21-2007 by L.L. No. 3-2007]"
										}
									]
								},
								{
									"number": "N. ",
									"content": [
										{
											"text": "Accessory electrical generator equipment.[Added 5-14-2012 by L.L. No. 2-2012]"
										},
										{
											"content": [
												{
													"number": "(1) ",
													"content": [
														{
															"text": "For the purposes of this section, accessory electrical generator\nequipment shall include an electric generator unit that is designed\nto be used for providing temporary electrical service to a dwelling\nand its component elements."
														}
													]
												},
												{
													"number": "(2) ",
													"content": [
														{
															"text": "Accessory electrical generator equipment may be installed and maintained\nin any residential district of the Village, provided it is:"
														},
														{
															"content": [
																{
																	"number": "(a) ",
																	"content": [
																		{
																			"text": "Not located in the front yard."
																		}
																	]
																},
																{
																	"number": "(b) ",
																	"content": [
																		{
																			"text": "Complies with the minimum side and rear setback requirements\nfor a dwelling, except the Building Inspector may allow a lesser setback\nbased upon practical difficulty presented by the site and provided\nit does not further adversely impact neighboring properties. Under\nno circumstances shall accessory electrical generator equipment have\na setback less than the required side and rear yard for an accessory\nstructure."
																		}
																	]
																},
																{
																	"number": "(c) ",
																	"content": [
																		{
																			"text": "Equipped with and thereafter maintained with an adequate sound\nattenuation enclosure and/or panels to have it be in compliance with\noperational noise levels as shall be established by resolution of\nthe Board of Trustees."
																		}
																	]
																},
																{
																	"number": "(d) ",
																	"content": [
																		{
																			"text": "Screened to the extent reasonable and practicable as required\nby the Building Inspector, to reduce and minimize the adverse impacts\nof operational noise and visibility of the unit from surrounding properties.\nThe required screening shall thereafter be maintained by the homeowner."
																		}
																	]
																}
															]
														}
													]
												},
												{
													"number": "(3) ",
													"content": [
														{
															"text": "If accessory electrical generator equipment requires periodic testing,\nit shall be scheduled during the weekday, between the hours of 10:00\na.m. and 3:00 p.m."
														}
													]
												},
												{
													"number": "(4) ",
													"content": [
														{
															"text": "If requested by the Building Inspector, the property owner shall\nsubmit to the Village an inspection report, prepared by an independent\ncertified sound testing firm, certifying that the accessory electrical\ngenerator equipment is in current compliance with Village noise regulations\nand levels."
														}
													]
												}
											]
										}
									]
								}
							]
						}
					]
				},
				{
					"paragraph": "§ 275-19",
					"title": "Supplementary requirements for all accessory uses in business districts.",
					"content": [
						{
							"text": "In addition to the specific requirements for certain accessory business uses and structures provided for in § 275-20, all accessory business uses and structures shall be required to meet the following provisions:"
						},
						{
							"content": [
								{
									"number": "A. ",
									"content": [
										{
											"text": "No accessory business use or structure may be established\non a lot prior to the establishment of the principal building or structure,\nexcept temporary structures associated with the construction of the\nprincipal building or structure."
										}
									]
								},
								{
									"number": "B. ",
									"content": [
										{
											"text": "No accessory business uses or structures shall be permitted in the front yard, except for fences and walls as provided for in § 275-20A and signs in accordance with § 275-20C."
										}
									]
								},
								{
									"number": "C. ",
									"content": [
										{
											"text": "More than one accessory business use or structure\nshall be permitted on a single lot, provided that the total area covered\nby such buildings and structures does not cover more than 60% of the\nrear yard or more than 60% of each side yard, or a total of 50% of\nthe rear and side yards when added together."
										}
									]
								},
								{
									"number": "D. ",
									"content": [
										{
											"text": "Where adjacent to a residential use or district, the\ngross floor area of all accessory buildings on a lot may not exceed\n30% of the total floor area of all buildings on the lot."
										}
									]
								},
								{
									"number": "E. ",
									"content": [
										{
											"text": "No accessory nonresidential use or structure shall\nexceed one story or 15 feet in height, whichever is the lesser, and\nin no event shall it exceed the height of the principal building on\nthe lot."
										}
									]
								},
								{
									"number": "F. ",
									"content": [
										{
											"text": "Any use which is prohibited in accordance with § 275-11 shall be prohibited as an accessory use as well as a principal use."
										}
									]
								},
								{
									"number": "G. ",
									"content": [
										{
											"text": "All business establishments or uses shall be provided\nwith adequate utilities, including sewage disposal systems, approved\nby the Nassau County Department of Health."
										}
									]
								},
								{
									"number": "H. ",
									"content": [
										{
											"text": "All buildings, structures, roads, works, and parking\nareas shall conform to all applicable laws, regulations and local\nlaws relating to their construction, operation and maintenance."
										}
									]
								},
								{
									"number": "I. ",
									"content": [
										{
											"text": "No use shall be permitted, either principal or accessory,\nwhich creates or may create smoke, odors, corrosive or toxic fumes\nor gas, obnoxious dust, vapor or wastes or offensive noises or vibrations\nwhich may be detrimental to the health, safety or general welfare\nof the Village."
										}
									]
								}
							]
						}
					]
				},
				{
					"paragraph": "§ 275-20",
					"title": "Supplementary requirements for certain accessory uses in business districts.",
					"content": [
						{
							"content": [
								{
									"number": "A. ",
									"content": [
										{
											"text": "Fences and walls. Fences and walls in nonresidential districts shall be subject to the same supplemental requirements provided in § 275-18C for accessory residential uses and structures."
										}
									]
								},
								{
									"number": "B. ",
									"content": [
										{
											"text": "Semipublic open air parking area."
										},
										{
											"content": [
												{
													"number": "(1) ",
													"content": [
														{
															"text": "Semipublic open air parking areas shall be provided\nin conjunction with those uses which are required to provide off-street\nparking spaces for customers, employees, visitors and other members\nof the public for business uses."
														}
													]
												},
												{
													"number": "(2) ",
													"content": [
														{
															"text": "Semipublic open air parking shall be provided on the\nsame lot as the principal use or building."
														}
													]
												},
												{
													"number": "(3) ",
													"content": [
														{
															"text": "All semipublic open air parking areas shall be set\nback a minimum of 25 feet from an existing residential use or zone\nand at least five feet from any other property line and five feet\nfrom any building on the same lot."
														}
													]
												},
												{
													"number": "(4) ",
													"content": [
														{
															"text": "The following amounts of off-street parking shall\nbe provided for business uses:"
														}
													]
												},
												{
													"number": "(5) ",
													"content": [
														{
															"text": "All spaces shall be at least nine feet wide by 18\nfeet in length served by a driveway or parking aisle of at least 24\nfeet in width."
														}
													]
												},
												{
													"number": "(6) ",
													"content": [
														{
															"text": "Such parking areas shall be adequately screened by\nmeans of fences, walls, beams or vegetative planting, or a combination\nof the above, from neighboring properties."
														}
													]
												}
											]
										}
									]
								},
								{
									"number": "C. ",
									"content": [
										{
											"text": "Business signs. Signs shall be permitted in all business\ndistricts subject to the regulations below:"
										},
										{
											"content": [
												{
													"number": "(1) ",
													"content": [
														{
															"text": "Business signs for identification of a business building\nor use shall be limited to one wall or eave sign and one detached\nor ground sign on each public street frontage of the building."
														},
														{
															"content": [
																{
																	"number": "(a) ",
																	"content": [
																		{
																			"text": "A wall identification sign shall be attached\nto or incorporated in the building wall. Such sign shall have:"
																		},
																		{
																			"content": [
																				{
																					"number": "[1] ",
																					"content": [
																						{
																							"text": "A maximum area of 1/2 square foot for each horizontal\nfoot of building wall on which it is mounted."
																						}
																					]
																				},
																				{
																					"number": "[2] ",
																					"content": [
																						{
																							"text": "A maximum width of 20% of the building wall's\nhorizontal measurement, except that, where such horizontal measurement\nis 20 feet or less, the maximum width may be 30% of such measurement."
																						}
																					]
																				},
																				{
																					"number": "[3] ",
																					"content": [
																						{
																							"text": "A maximum height of 12 feet."
																						}
																					]
																				},
																				{
																					"number": "[4] ",
																					"content": [
																						{
																							"text": "A maximum projection of 12 inches from the face\nof the building wall to which the sign is attached to any part of\nsuch sign."
																						}
																					]
																				}
																			]
																		}
																	]
																},
																{
																	"number": "(b) ",
																	"content": [
																		{
																			"text": "An eave identification sign shall be attached\nto the eave of a pitched roof. Such sign shall have:"
																		},
																		{
																			"content": [
																				{
																					"number": "[1] ",
																					"content": [
																						{
																							"text": "A maximum area of 1/2 square foot for each horizontal\nfoot of building wall above which it is mounted."
																						}
																					]
																				},
																				{
																					"number": "[2] ",
																					"content": [
																						{
																							"text": "A maximum width of 20% of the building wall's\nhorizontal measurement, except that, where such horizontal measurement\nis 20 feet or less, the maximum width may be 30% of such measurement."
																						}
																					]
																				},
																				{
																					"number": "[3] ",
																					"content": [
																						{
																							"text": "A maximum height of 12 feet but in no case exceeding\na height determined by averaging the heights of the eave end and ridge\nof the roof slope on which such sign is mounted."
																						}
																					]
																				}
																			]
																		}
																	]
																},
																{
																	"number": "(c) ",
																	"content": [
																		{
																			"text": "A detached or ground identification sign shall\nnot exceed 20 square feet in area. Such sign shall have:"
																		},
																		{
																			"content": [
																				{
																					"number": "[1] ",
																					"content": [
																						{
																							"text": "A maximum unbroken length of five feet."
																						}
																					]
																				},
																				{
																					"number": "[2] ",
																					"content": [
																						{
																							"text": "A maximum height measured from the ground level\nof four feet."
																						}
																					]
																				},
																				{
																					"number": "[3] ",
																					"content": [
																						{
																							"text": "A setback of at least 20 feet from any property\nline."
																						}
																					]
																				}
																			]
																		}
																	]
																},
																{
																	"number": "(d) ",
																	"content": [
																		{
																			"text": "Identification signs may be double-faced."
																		}
																	]
																},
																{
																	"number": "(e) ",
																	"content": [
																		{
																			"text": "Identification signs may be interior lighted\nwith nonglaring lights or may be illuminated by shielded floodlights;\nprovided, however, that intermittent or flashing lights shall not\nbe used on or in any sign. Moving or animated signs shall not be permitted."
																		}
																	]
																},
																{
																	"number": "(f) ",
																	"content": [
																		{
																			"text": "All signs, except as hereinafter specifically\nexcluded, shall be the subject of a sign permit issued prior to erection.\nAll signs required to have permits shall at all times prominently\nand permanently display the permit number on the face of the sign.\nFailure to display the permit number shall constitute cause for revocation\nof the sign permit by the Building Inspector in addition to any other\npenalties or remedies prescribed in this chapter."
																		}
																	]
																},
																{
																	"number": "(g) ",
																	"content": [
																		{
																			"text": "Temporary signs, or signs directing automobile\ndrivers to off-street parking areas, having an area of two square\nfeet or less shall not be required to have a sign permit."
																		}
																	]
																},
																{
																	"number": "(h) ",
																	"content": [
																		{
																			"text": "Neither temporary or permanent signs resting\non or attached to vehicles nor portable, folding or movable signs\nshall be used in such a way as to circumvent the provisions of this\nchapter."
																		}
																	]
																}
															]
														}
													]
												}
											]
										}
									]
								},
								{
									"number": "D. ",
									"content": [
										{
											"text": "Refuse collection, storage and recycling."
										},
										{
											"content": [
												{
													"number": "(1) ",
													"content": [
														{
															"text": "An enclosed area shall be provided for the temporary\noutdoor storage of trash or recycling materials and other refuse.\nTrash receptacles shall be covered. The enclosed area shall be on\na durable, paved surface and designed and screened by landscaping\nor an attractive, solid architectural fence, so that the trash and\nrefuse will not be seen by the general public or from adjoining properties."
														}
													]
												},
												{
													"number": "(2) ",
													"content": [
														{
															"text": "For each application for commercial or industrial\ndevelopment utilizing 1,000 or more square feet of land, the applicant\nshall provide the approving agency with estimates of the amount of\nrecyclable materials to be generated each week. A storage area of\nsufficient size to accommodate up to one week of accumulation of designated\nrecyclable materials shall be provided."
														}
													]
												},
												{
													"number": "(3) ",
													"content": [
														{
															"text": "For commercial uses which have more than one principal\nuse on the lot, more than one building on a lot or more than one tenant\nwithin a building or lot, the approving agency may require the applicant\nto designate a centralized storage area for recyclable materials."
														}
													]
												},
												{
													"number": "(4) ",
													"content": [
														{
															"text": "Any commercial use generating wastes that are attractive\nto rodents or insects, or which may be borne by wind or rain, shall\nprovide completely sealable containers for waste storage and collection."
														}
													]
												}
											]
										}
									]
								}
							]
						}
					]
				}
			]
		}
	]
}