{
	"url": "http://ecode360.com/12729400",
	"paras": [
		{
			"paragraph": "§ 275-10",
			"title": "Tables.\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t[1]",
			"content": [
				{
					"text": "The accompanying List of Use Regulations by District (Table 1) and Schedule of Dimensional Regulations (Table 2) list and define the permitted use of land, buildings and structures and set forth the minimum and maximum dimensional requirements to be met in connection with such uses. In the List of Use Regulations by District each district is listed, and it is indicated what uses are permitted and in what manner they are permitted for that district. In addition to those uses listed specifically in § 275-11 (prohibited uses), any use not specifically listed as being permitted shall be deemed to be prohibited. No more than one permitted principal use shall be permitted on a lot in any of the residence districts."
				},
				{
					"footnote": "[1]\nEditor's Note: Tables 1 and 2 are included\nat the end of this chapter.\n"
				}
			]
		},
		{
			"paragraph": "§ 275-11",
			"title": "Prohibited uses.",
			"content": [
				{
					"text": "All uses which are not expressly permitted in\nthis chapter are hereby prohibited."
				}
			]
		},
		{
			"paragraph": "§ 275-12",
			"title": "Maximum floor area ratio.",
			"content": [
				{
					"text": "The maximum permitted aggregate floor ratio\narea for all principal and accessory buildings on a lot in all residential\ndistricts shall be as follows (see also Table 3 for an illustrative\nexample):[1]"
				},
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Lots of 8,000 square feet or less shall have a maximum\nfloor area ratio of 0.350."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Lots between 8,001 square feet and 20,000 square feet\nshall have a maximum floor area ratio of 0.350 for the first 8,000\nsquare feet of lot area and 0.10 for each square foot in excess thereof."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Lots between 20,001 square feet and 40,000 square\nfeet shall have a maximum floor area ratio of 0.20 minus 0.0025 or\nproportion thereof for every 1,000 square feet of lot area or proportion\nthereof in excess of 20,000 square feet."
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "Lots between 40,001 square feet and 80,000 square\nfeet shall have a maximum floor area ratio of 0.15 minus 0.00125 or\na proportion thereof for every 1,000 square feet of lot area or proportion\nthereof in excess of 40,000 square feet."
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "Lots between 80,001 square feet and 120,000 square\nfeet shall have a maximum floor area ratio of 0.10 minus 0.0005 or\na proportion thereof for every 1,000 square feet of lot area or proportion\nthereof in excess of 80,000 square feet."
								}
							]
						},
						{
							"number": "F. ",
							"content": [
								{
									"text": "Lots in excess of 120,000 square feet shall have a\nmaximum floor area ratio of .08 for the first 120,000 square feet\nof lot area and 0.04 for each square foot in excess thereof."
								}
							]
						}
					]
				},
				{
					"footnote": "[1]\nEditor's Note: Table 3 is included at the\nend of this chapter.\n"
				}
			]
		},
		{
			"paragraph": "§ 275-13",
			"title": "Height/setback ratio.",
			"content": [
				{
					"text": "In all residential districts, the maximum height\nof a building at all required side and rear yard setback lines shall\nnot exceed 22 feet above grade as defined herein. Thereafter, the\nheight of such buildings may be increased by two feet for each one\nfoot of additional setback from the side or rear lot line. However,\nin no event shall the height of the building or structure exceed the\nmaximum height permitted, as specified in Table 2."
				}
			]
		}
	]
}