{
	"url": "http://ecode360.com/14447497",
	"paras": [
		{
			"paragraph": "§ 600-70",
			"title": "Permitted uses.",
			"content": [
				{
					"text": "In a Residence B District, no building or premises\nshall be used and no building shall be erected or altered for other\nthan one or more of the following specified uses:"
				},
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Any use permitted in a Residence AA District."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "A private garage for the storage of not more than\nthree motor vehicles, one of which may be a commercial vehicle having\na capacity not exceeding 1/2 ton.[1]"
								},
								{
									"footnote": "[1]\nEditor's Note: Former Subsection B, which\nallowed two family detached houses, as amended 5-24-1965, was repealed\n3-11-1991 by L.L. No. 3-1991\n"
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Office/residential use for properties fronting on Conklin Street, Fulton Street and West Street, provided the owner satisfies the conditions set forth in Article XIII, Office-Residence District.[Added 2-5-2007 by L.L. No. 2-2007]"
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 600-71",
			"title": "Building area.",
			"content": [
				{
					"text": "The building area shall not exceed 35% of the\nlot area."
				}
			]
		},
		{
			"paragraph": "§ 600-72",
			"title": "Front yard.",
			"content": [
				{
					"text": "There shall be a required front yard which shall\nbe not less than 25 feet in depth."
				}
			]
		},
		{
			"paragraph": "§ 600-73",
			"title": "Side yards.",
			"content": [
				{
					"text": "There shall be two side yards, one on each side\nof the main building. Each side yard shall not be less than six feet\nwide."
				}
			]
		},
		{
			"paragraph": "§ 600-74",
			"title": "Rear yard.",
			"content": [
				{
					"text": "There shall be a required rear yard which shall\nhave a minimum depth of 25 feet."
				}
			]
		},
		{
			"paragraph": "§ 600-75",
			"title": "Lot area.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "No principal building or accessory building shall\nbe erected upon a lot that has a street frontage and minimum lot width\nat the front and rear wall of the principal building of less than\n60 feet and a lot area of less than 6,000 square feet."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "The lot area and frontage requirements set forth herein\nshall not apply to any lot having an area and/or frontage of less\nthan that prescribed herein, provided that such a lot has an area\nof at least 5,000 square feet and was under different ownership from\nthat of any adjoining land on June 5, 2006, and provided further that\nsuch lot and any adjoining land did not come under common ownership\nsince that date."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "If any lot on which a building has been erected shall be subdivided into two or more lots in such manner that the resulting lot on which such building remains shall not comply with Subsection A hereof, the right of the owner thereof to maintain such buildings of such lot shall immediately cease, and he or she shall remove the same on the order of the Building Superintendent."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 600-76",
			"title": "Building height.",
			"content": [
				{
					"text": "No building shall be greater than 2 1/2\nstories nor more than 35 feet in height."
				}
			]
		}
	]
}