{
	"url": "http://ecode360.com/14447521",
	"paras": [
		{
			"paragraph": "§ 600-84",
			"title": "Permitted uses.",
			"content": [
				{
					"text": "In a Residence BB District, no building or premises\nshall be used and no building shall be erected or altered for other\nthan one or more of the following specified uses:"
				},
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Any use permitted in a Residence B District."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Multifamily dwellings, when approved by the Board\nof Trustees of the Village of Farmingdale as a special use permit\nafter a public hearing.[Amended 4-22-1963]"
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Nursing home or convalescent home, provided that the\nsite has a minimum of 1/2 acre and a minimum frontage of 100 feet\nat the building line and a minimum of 100 feet at the rear building\nline.[Added 3-25-1991 by L.L. No. 5-1991]"
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 600-85",
			"title": "Building area.",
			"content": [
				{
					"text": "The building area shall not exceed 35% of the\nlot area."
				}
			]
		},
		{
			"paragraph": "§ 600-86",
			"title": "Front yard.",
			"content": [
				{
					"text": "There shall be a required front yard which shall\nbe not less than 25 feet in depth, except that where a multifamily\ndwelling is erected or an existing building is converted to a multifamily\ndwelling, the required front yard shall not be less than 35 feet in\ndepth."
				}
			]
		},
		{
			"paragraph": "§ 600-87",
			"title": "Side yards.",
			"content": [
				{
					"text": "There shall be two side yards, one on each side\nof the main building. Each side yard shall not be less than six feet\nwide, except that where a multifamily dwelling is erected or an existing\nbuilding is converted to a multiple dwelling, each side yard shall\nnot be less than 30 feet."
				}
			]
		},
		{
			"paragraph": "§ 600-88",
			"title": "Rear yard.",
			"content": [
				{
					"text": "There shall be a required rear yard which shall\nhave a minimum depth of 35 feet."
				}
			]
		},
		{
			"paragraph": "§ 600-89",
			"title": "Lot area.",
			"content": [
				{
					"text": "No building shall be erected upon a lot that has a street frontage and minimum lot width at the front and rear wall of the principal building of less than 50 feet and a lot area of less than 5,000 square feet, except that where a multifamily dwelling is to be erected or an existing building is to be converted to a multifamily dwelling, the provisions of Article IV of this chapter shall apply."
				}
			]
		},
		{
			"paragraph": "§ 600-90",
			"title": "Building height.",
			"content": [
				{
					"text": "No building shall be greater than 2 1/2 stories or 35 feet in height, except that no multifamily dwelling hereafter erected or any building hereafter converted to a multifamily dwelling shall be higher than that which is permitted pursuant to the provisions of Article IV of this chapter."
				}
			]
		}
	]
}