{
	"url": "http://ecode360.com/14447455",
	"paras": [
		{
			"paragraph": "§ 600-42",
			"title": "Permitted uses.",
			"content": [
				{
					"text": "In a Residence AA District, no building or premises\nshall be used, and no building shall be erected or altered for other\nthan one or more of the following specified uses:"
				},
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "One-family dwelling, including the office, studio\nor occupational room of a professional person when located in the\nsame dwelling in which such professional person resides, provided\nthat there is no display of goods or advertising other than a sign\nnot larger than one square foot, which shall be set back at least\n10 feet from the street line and which shall bear only the name and\noccupation of the practitioner.[1]"
								},
								{
									"footnote": "[1]\nEditor's Note: Amended at time of adoption of Code (see Ch. 1, General Provisions, Art. I).\n"
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Churches, libraries and public and private schools."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Playgrounds, parks and accessory buildings."
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "Agriculture, gardens, nurseries and greenhouses, provided\nthat they are not used primarily for the growing of vegetables, plants\nor flowers for sale, and provided that there is no display of products\nand no advertising. Any greenhouse heating plant shall be at least\n20 feet distant from the side and rear lines of the lot."
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "Buildings, structures and premises necessary for the\nuse and occupancy by the Village of Farmingdale for administration\npurposes, water supply, sewage pumping stations and fire and police\nstations."
								}
							]
						},
						{
							"number": "F. ",
							"content": [
								{
									"text": "Accessory uses customarily incidental to the above\nuses. The term \"accessory use,\" however, shall not include a business\nor any building or use not located on the same lot with the building\nto which it is accessory. The term \"accessory use\" shall include a\nprivate garage for the storage of not more than three motor vehicles,\nnone of which shall be a commercial truck."
								}
							]
						},
						{
							"number": "G. ",
							"content": [
								{
									"text": "Real estate signs advertising the real estate on which\nsaid sign is placed for sale or for rent, not exceeding in the aggregate\neight square feet in area; temporary signs in undeveloped sections,\nreferring to the land on which the sign is erected, only when approved\nby the Board of Zoning Appeals, provided that no permit for any such\ntemporary sign shall be granted for more than one year. In granting\na permit for the erection of such temporary sign, the Board of Zoning\nAppeals shall fix the location and size thereof and shall limit the\npurpose for which such temporary sign shall be erected."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 600-43",
			"title": "Building area.",
			"content": [
				{
					"text": "The building area shall not exceed 25% of the\nlot area."
				}
			]
		},
		{
			"paragraph": "§ 600-44",
			"title": "Front yard.",
			"content": [
				{
					"text": "There shall be a required front yard which shall\nbe not less than 30 feet in depth."
				}
			]
		},
		{
			"paragraph": "§ 600-45",
			"title": "Side yards.",
			"content": [
				{
					"text": "There shall be two side yards, one on each side\nof the main building. Each side yard shall be not less than 10 feet\nwide."
				}
			]
		},
		{
			"paragraph": "§ 600-46",
			"title": "Rear yard.",
			"content": [
				{
					"text": "There shall be a required rear yard which shall\nhave a minimum depth of 30 feet."
				}
			]
		},
		{
			"paragraph": "§ 600-47",
			"title": "Lot area.",
			"content": [
				{
					"text": "No principal building and accessory buildings\nshall be erected upon a lot that has a street frontage and minimum\nlot width at the front and rear wall of the principal building of\nless than 75 feet and a lot area of less than 7,500 square feet."
				}
			]
		},
		{
			"paragraph": "§ 600-48",
			"title": "Building height.",
			"content": [
				{
					"text": "No building shall be greater than 2 1/2\nstories nor more than 35 feet in height."
				}
			]
		}
	]
}