{
	"url": "http://ecode360.com/11099835",
	"paras": [
		{
			"paragraph": "§ 176-20",
			"title": "Applicability of provisions.",
			"content": [
				{
					"text": "In a Residence B District the following regulations\nshall apply."
				}
			]
		},
		{
			"paragraph": "§ 176-21",
			"title": "Permitted uses.",
			"content": [
				{
					"text": "No building may be erected, altered or used\nand no lot or premises may be used except for the following purposes:"
				},
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Detached single-family dwelling, except the construction\nof a detached single-family dwelling for the purpose of sale shall\nnot be permitted unless authorized by the Board of Appeals."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Public primary and secondary schools."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Churches for public worship and other strictly religious uses, in accordance with the discipline, rules and usages of the religious corporation which will own, support and maintain such church and of the ecclesiastical governing body, if any, to which such corporation is subject, and primary and secondary schools, organized and conducted other than for profit, chartered by the Regents of the University of the State of New York or approved by and under the supervision of the New York State Department of Education, and such other nonresidential uses as may not be excluded pursuant to state and federal laws, and accessory uses on the same lot, provided that any such use and accessory use have been approved by the Board of Appeals after public notice and hearing and after taking into consideration the public health, safety and general welfare and in accordance with the provisions of Article VIII, §§ 176-71C through F, 176-72 and 176-73 hereof and subject to appropriate conditions and safeguards prescribed by said Board."
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "Municipal uses as follows: Village of Sands Point\nmunicipal uses and purposes except incinerator and sewage disposal\nplants."
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "Public utility lines and poles necessary for the service\nof the area."
								}
							]
						},
						{
							"number": "F. ",
							"content": [
								{
									"text": "Agriculture and greenhouses. It is not intended that\nthe use of the property for agriculture and greenhouses shall be commercial\nin nature but shall only be permitted if and when the agricultural\npursuit and the use of the greenhouse are in connection with the general\nuse of the property as a residence. It is not intended to permit commercial\nagriculture, greenhouses or nurseries in a Residence B District."
								}
							]
						},
						{
							"number": "G. ",
							"content": [
								{
									"text": "Name, trespass and traffic signs, provided that no\nsuch sign shall exceed two square feet in area.[Amended 8-21-1989 by L.L. No. 3-1989]"
								}
							]
						},
						{
							"number": "H. ",
							"content": [
								{
									"text": "A club use on premises comprising not less than 50 acres, provided that in a specific case, after public notice and hearing, the Board of Appeals authorizes a permit therefor in accordance with the provisions of §§ 176-71 through 176-73.[Amended 11-22-1994 by L.L. No. 8-1994]"
								}
							]
						},
						{
							"number": "I. ",
							"content": [
								{
									"text": "Signs or signboards used in connection with the sale,\nlease or rental of property, provided that no such sign or signboard\nshall exceed two feet in height by two feet in length or four square\nfeet in area, with a space of three feet between the bottom of the\nsign and the ground and so placed as to conform to the front and side\nyard restrictions, that the number of any such sign or signboards\nshall not exceed the number of streets abutting on such parcel, that\nonly one such sign or signboard shall be located adjacent to any abutting\nstreet and that all such signs or signboards shall be located on the\nsame parcel as the property thus advertised. Signboards as above for\nreal estate subdivisions, not exceeding eight feet high by 10 feet\nlong or 80 square feet in area, shall be permitted only when authorized\nby the Board of Trustees."
								}
							]
						},
						{
							"number": "J. ",
							"content": [
								{
									"text": "Accessory uses on the same lot with and customarily incidental to any of the above permitted uses, except the uses provided in Subsection C of this section, including a private garage for not more than five cars or a stable for not more than one horse for each 43,560 square feet (one acre). Guesthouses and buildings equipped and designed to be used for habitable purposes are not regarded and permitted as an accessory use. It is the purpose of this section to confine the use of all lots and premises for habitable purposes to the dwelling referred to in Subsection A of this section. Except as above permitted, accessory uses shall not include any use customarily carried on as a business or industry, including the construction of a dwelling for sale, or any display visible from the street.[Amended 8-21-1989 by L.L. No. 3-1989]"
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 176-22",
			"title": "Building height.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "No dwelling shall exceed three stories and an attic nor shall it exceed a height, as defined in Article I, § 176-2, of the Village Code, of 35 feet on a lot of less than three acres and 40 feet on a lot which is permanently restricted to contain at least three acres. (See Table 1, Appendix A.[1])[Amended 2-23-2016 by L.L. No. 1-2016]"
								},
								{
									"footnote": "[1]\nEditor's Note: Appendix A is included as an attachment to this chapter.\n"
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "No accessory building shall exceed one story and an attic, nor shall it exceed a height, as defined in Article I, of 15 feet."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "No other building shall exceed 40 feet in height, as defined in Article I, nor shall it exceed three stories and an attic."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 176-23",
			"title": "(Reserved)\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t[1]",
			"content": [
				{
					"footnote": "[1]\nEditor's Note: Former § 176-23, Fences, was amended, was repealed 11-21-2000 by L.L. No. 4-2000. See Ch. 83, Fences.\n"
				}
			]
		},
		{
			"paragraph": "§ 176-24",
			"title": "Lot area.",
			"content": [
				{
					"text": "No building shall hereafter be erected, altered\nor moved to accommodate or make provision for more than one family\nfor each 43,560 square feet (one acre) of the area of the lot."
				}
			]
		},
		{
			"paragraph": "§ 176-25",
			"title": "Building area.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "The building area shall not exceed 12% of the lot area for the first acre or any part thereof, 8% for the second acre or any part thereof and 6% of any lot area in excess thereof, but in no case shall the ratio of habitable floor area to lot area exceed a ratio of 0.12 for the first acre or any part thereof, 0.06 for the second acre or any part thereof and 0.04 for any lot area in excess thereof. (See Table 1, Appendix A.[1])"
								},
								{
									"footnote": "[1]\nEditor's Note: Appendix A is included as an attachment to this chapter.\n"
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "The combined coverage of all structures on any lot shall not exceed 20% of the lot area. (See Table 1, Appendix A.)"
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 176-26",
			"title": "Usable floor area.",
			"content": [
				{
					"text": "All dwellings hereafter erected or altered in\na Residence B District shall provide for each family not less than\n2,000 square feet of usable floor area, all of which shall be completed\nprior to occupancy."
				}
			]
		},
		{
			"paragraph": "§ 176-27",
			"title": "Yards.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Yards required. Each lot shall have front, side and rear yards of not less than the following, nor shall any point on a building be permitted to exceed the height/setback ratio (sky exposure plane) as set forth below and as illustrated in Figure 3 of Appendix A. (See also Example 1, Table 2 and Figure 2 of Appendix A.[1])"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Front yard: 60 feet, but in no case shall any point\non a building, including any point on its roof, be permitted to exceed\nan elevation which is more than one foot higher than grade for each\nthree feet of setback."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Each side yard: 40 feet, but in no case shall any\npoint on a building, including any point on its roof, be permitted\nto exceed an elevation which is more than one foot higher than grade\nfor each two feet of setback."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Rear yard: 50 feet, but in no case shall any point\non a building, including any point on its roof, be permitted to exceed\nan elevation which is more than one foot higher than grade for each\n21/2 feet of setback."
												}
											]
										}
									]
								},
								{
									"footnote": "[1]\nEditor's Note: Appendix A is included as an attachment to this chapter.\n"
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "For the purposes of this section, \"grade\" shall be the existing undisturbed grade or the proposed final grade, whichever is more restrictive, established at a point immediately adjacent to the perimeter wall of the building, which point is located on a vertical plane perpendicular to the lot line and extending through the entire building. (See Figure 2 of Appendix A.[2])"
								},
								{
									"footnote": "[2]\nEditor's Note: Appendix A is located at the end of this chapter.\n"
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Chimneys, spires and similar projections as permitted by the definition of \"height\" in Article I shall be excluded from this section."
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "A building erected on a corner lot shall be required\nto comply with the front yard requirement only from the street which\nprovides its access, but in no case shall the setback from any other\nstreet line be less than 60 feet."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 176-28",
			"title": "Street frontage.",
			"content": [
				{
					"text": "Each lot shall have a minimum width of 150 feet\non the front street line and shall have a minimum width of 140 feet\nwithin 25 feet of the front street line. On a corner lot, the width\nof the lot on a street line shall be the same for each street frontage."
				}
			]
		},
		{
			"paragraph": "§ 176-29",
			"title": "Structures for animals; storage of manure.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "No structure in which horses, cows, sheep or other\nfarm animals or poultry are kept or animal run or kennel shall be\ncloser than 50 feet to any adjoining property line, nor shall animals\nbe harbored within 50 feet of the property line.[Amended 8-21-1989 by L.L. No. 3-1989]"
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "No storage of manure shall be permitted except as\nfollows: Manure may be stored in a pit or structure completely enclosed\nand screened against flies. No such pit or structure shall be closer\nthan 100 feet to any property line, nor closer than 25 feet to a dwelling\non the same lot, nor closer than 150 feet to a dwelling on another\nlot."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 176-30",
			"title": "Stationary outdoor fireplaces.",
			"content": [
				{
					"text": "Stationary outdoor fireplaces may project into\nthe rear yard or side yard, but shall be at least 20 feet distant\nfrom side and rear property lines and shall not exceed eight feet\nin height."
				}
			]
		},
		{
			"paragraph": "§ 176-31",
			"title": "Outdoor pools.",
			"content": [
				{
					"text": "No outdoor pools shall be constructed except\nin compliance with the regulations of the Nassau County Health Department\nwhich may be now or hereafter in effect."
				}
			]
		},
		{
			"paragraph": "§ 176-32",
			"title": "Accessory buildings.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Accessory buildings or structures shall be located\nonly in the rear yard. Accessory buildings or structures shall not\noccupy more than 15% of the area of the rear yard. The yard area occupied\nby the accessory buildings or structures shall be included in computing\nthe maximum percent of the lot area which may be utilized for building.[Amended 12-19-1995 by L.L. No. 7-1995]"
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Unless otherwise provided in this article, no structures\nhereafter erected shall be located nearer the street line than the\nrear line of the main dwelling, and on a corner lot no such structures\nshall be located in any yard abutting any street. This subsection\nshall not apply to driveways, paved walks, water pumps and wells,\nwalls and fences not in excess of six feet six inches in height, gates\nand gateposts.[Amended 8-21-1989 by L.L. No. 3-1989; 12-19-1995 by L.L. No.\n7-1995]"
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Structures shall be not less than 25 feet distant\nfrom the main buildings, not less than 15 feet distant from the rear\nlot line and not less than 20 feet distant from any side line, with\nthe exceptions of boundary line fences and walls not exceeding six\nfeet six inches in height, which may be located on the lot line or\nwithin four feet thereof. Notwithstanding any provisions of this chapter\nto the contrary, no distance shall be required between a swimming\npool and a main dwelling.[Amended 8-21-1989 by L.L. No. 3-1989]"
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "Every part of an accessory building shall be at least\n80 feet distance from every street line."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 176-33",
			"title": "Driveways and parking areas.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Each lot used for single-family dwelling purposes shall have only\none driveway, accessed by a single curb cut. Such driveway shall have\na maximum width of not more than 15 feet at the street line."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "All parking areas, including, but not limited to, all parking courts\nand driveways where vehicles are parked or stored, whether paved or\nunpaved (collectively, \"parking areas\"), must be screened from the\nstreet and from any adjoining property by a living screen of evergreen\ntrees and/or shrubs. All screening is required to be at least 30 inches\nin height and must be comprised of vegetation having sufficient density\nto mitigate any potential visual impact that a parking area could\nhave on the street and/or on any adjoining property. All parking area\nscreening or changes to the screening must be approved by the Building\nCommissioner or the Commissioner's designee. In situations where\nthe topography of the premises and/or the distance between the parking\narea and the street or an adjacent property or other relevant circumstances\nserve to mitigate visual impact, the Building Commissioner or the\nCommissioner's designee, in his or her sole discretion, may waive\nor modify the screening requirements set forth herein."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "All applications to the Building Department that relate to the construction\nor alteration of a driveway and/or parking area must be submitted\nwith a landscape plan prepared by a licensed professional."
								}
							]
						}
					]
				}
			]
		}
	]
}