{
	"url": "http://ecode360.com/11099983",
	"paras": [
		{
			"paragraph": "§ 176-33.1",
			"title": "Legislative intent and findings.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "The Village of Sands Point has a long-standing comprehensive\nland use and planning program, which has been primarily implemented\nthrough the Village Zoning Ordinance. The Village of Sands Point has\na low-density, rural character and is located in an isolated position\non the northern tip of a peninsula. It is only approximately 4.2 square\nmiles (2,688 acres) in area. Land in the Village formerly used for\nagriculture and estates is rapidly being subdivided for residential\ndevelopment on minimum one-acre and two-acre lots. The proposed zoning\namendments will help maintain the rural estate character of the Village\nby increasing the minimum lot area on certain undeveloped parcels\nfrom the current zoning to five acres and preserve the water supply\nfor the Village."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "The Village Board of Trustees has determined to preserve\nthe Village's open character, protect the water supply, limit water\ndemand, reduce potential traffic generation and preserve open space\nin the Village. The Board of Trustees hereby finds that the proposed\nzoning amendments set forth hereinbelow help implement these goals."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "With regard to the water supply, the Board notes that\nthe Village has been severely limited by pumpage caps imposed by the\nNew York State Department of Environmental Conservation so that such\na restricted water supply may not be adequate to serve future development\nof the Village under existing land use regulations. Moreover, the\nVillage borders Hydrogeologic Zone I, an area in which the state requires\nstrict regulation of development and groundwater recharge. The Board\nfinds that the proposed zoning amendments will help protect groundwater\nresources."
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "The Board further finds that more open space will\nbe preserved under the proposed zoning through larger (five-acre)\nminimum lot sizes. Existing vegetation and environmental and aesthetic\nresources can be preserved through the use of more flexible subdivision\ndesign standards."
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "Finally, the Board notes that regional planning agencies,\nincluding the Tri-State Regional Planning Commission, the Long Island\nRegional Planning Board and the Nassau County Planning Commission,\nhave all concurred in their plans that the Sands Point area should\nbe maintained as a low-density open space and residential area. Also,\nthe Town of North Hempstead recently amended its zoning regulations\nto create a five-acre zone. The goals and policies of regional plans\nwill be implemented through the proposed rezoning."
								}
							]
						},
						{
							"number": "F. ",
							"content": [
								{
									"text": "Thus, the Board of Trustees, having studied the environmental,\nplanning and zoning characteristics of the Village and having considered\nthe comments of the public and with the Board's own knowledge of the\nVillage, has determined that it is in the best interests of the Village\nas a whole, in an effort to conserve the Village's natural resources,\nparticularly its water supply and clean air, to create a third residential\ndistrict consisting of the lands described below,[1] which district shall permit no more than one family, that\nis, one single-family residence, for each five acres of lot area."
								},
								{
									"footnote": "[1]\nEditor's Note: See § 176-5F.\n"
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 176-33.2",
			"title": "Applicability of provisions.",
			"content": [
				{
					"text": "In a Residence C District the following regulations\nshall apply."
				}
			]
		},
		{
			"paragraph": "§ 176-33.3",
			"title": "Permitted uses.",
			"content": [
				{
					"text": "No building may be erected, altered or used\nand no lot or premises may be used except for one or more of the following\npurposes:"
				},
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Detached single-family dwelling, except the construction\nof a detached single-family dwelling for the purpose of sale shall\nnot be permitted unless authorized by the Board of Appeals."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Public primary and secondary schools."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Churches for public worship and other strictly religious uses, in accordance with the discipline, rules and usages of the religious corporation which will own, support and maintain such church and of the ecclesiastical governing body, if any, to which such corporation is subject, and primary and secondary schools, organized and conducted other than for profit, chartered by the Regents of the University of the State of New York or approved by and under the supervision of the New York State Department of Education, and such other nonresidential uses as may not be excluded pursuant to state and federal laws, and accessory uses on the same lot, provided that any such use and accessory use have been approved by the Board of Appeals after public notice and hearing and after taking into consideration the public health, safety and general welfare and in accordance with the provisions of Article VIII, §§ 176-71C through F, 176-72 and 176-73, hereof and subject to appropriate conditions and safeguards prescribed by said Board."
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "Municipal uses as follows: Village of Sands Point\nmunicipal uses and purposes, except incinerator and sewage disposal\nplants."
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "Public utility lines and poles necessary for the service\nof the area."
								}
							]
						},
						{
							"number": "F. ",
							"content": [
								{
									"text": "Agriculture and greenhouses. It is not intended that\nthe use of the property for agriculture and greenhouses shall be commercial\nin nature but shall only be permitted if and when the agricultural\npursuit and the use of the greenhouse are in connection with the general\nuse of the property as a residence. It is not intended to permit commercial\nagriculture, greenhouses or nurseries in a Residence A District."
								}
							]
						},
						{
							"number": "G. ",
							"content": [
								{
									"text": "Name, trespass and traffic signs, provided that no\nsuch sign shall exceed two square feet in area."
								}
							]
						},
						{
							"number": "H. ",
							"content": [
								{
									"text": "A club use on premises comprising not less than 50 acres, provided that in a specific case, after public notice and hearing, the Board of Appeals authorizes a permit therefor in accordance with the provisions of §§ 176-71 through 176-73.[Amended 11-22-1994 by L.L. No. 8-1994]"
								}
							]
						},
						{
							"number": "I. ",
							"content": [
								{
									"text": "Signs or signboards used in connection with the sale,\nlease or rental of property, provided that no such sign or signboard\nshall exceed two feet in height by two feet in length or four square\nfeet in area, with a space of three feet between the bottom of the\nsign and the ground and so placed as to conform to the front and side\nyard restrictions, that the number of any such sign or signboards\nshall not exceed the number of streets abutting on such parcel, that\nonly one such sign or signboard shall be located adjacent to any abutting\nstreet and that all such signs or signboards shall be located on the\nsame parcel as the property thus advertised. Signboards as above for\nreal estate subdivisions, not exceeding eight feet high by 10 feet\nlong or 80 square feet in area, shall be permitted only when authorized\nby the Board of Trustees."
								}
							]
						},
						{
							"number": "J. ",
							"content": [
								{
									"text": "Accessory uses on the same lot with and customarily incidental to any of the above-permitted uses, except the uses provided in Subsection C of this section, including a private garage for not more than five cars or a stable for not more than one horse for each 43,560 square feet (one acre). Guesthouses and buildings equipped and designed to be used for habitable purposes are not regarded and permitted as an accessory use. It is the purpose of this subsection to confine the use of all lots and premises for habitable purposes to the dwelling referred to in Subsection A of this section. Except as above permitted, accessory uses shall not include any use customarily carried on as a business or industry, including the construction of a dwelling for sale, or any display visible from the street."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 176-33.4",
			"title": "Building height.",
			"content": [
				{
					"text": "Restrictions on building height shall be the same as those set forth in Village Code § 176-8."
				}
			]
		},
		{
			"paragraph": "§ 176-33.5",
			"title": "(Reserved)\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t[1]",
			"content": [
				{
					"footnote": "[1]\nEditor's Note: Former § 176-33.5, Fences, was repealed 11-21-2000 by L.L. No. 4-2000. See now Ch. 83, Fences.\n"
				}
			]
		},
		{
			"paragraph": "§ 176-33.6",
			"title": "Lot area.",
			"content": [
				{
					"text": "No building shall hereafter be erected, altered\nor moved to accommodate or make provision for more than one family\nfor each 217,800 square feet (five acres) of the area of the lot."
				}
			]
		},
		{
			"paragraph": "§ 176-33.7",
			"title": "Building area.",
			"content": [
				{
					"text": "Restrictions on building area shall be the same as those set forth in Village Code § 176-11."
				}
			]
		},
		{
			"paragraph": "§ 176-33.8",
			"title": "Usable floor area.",
			"content": [
				{
					"text": "Restrictions on usable floor area shall be the same as those set forth in Village Code § 176-12."
				}
			]
		},
		{
			"paragraph": "§ 176-33.9",
			"title": "Yards.",
			"content": [
				{
					"text": "Minimum yard setbacks shall be the same as these set forth in Village Code § 176-13."
				}
			]
		},
		{
			"paragraph": "§ 176-33.10",
			"title": "Street frontage.",
			"content": [
				{
					"text": "No lot shall have a street frontage of less\nthan 175 feet and shall have a minimum width of 175 feet within 25\nfeet of the front street line. On a corner lot, the width of the lot\non a street line shall be the same for each street frontage."
				}
			]
		},
		{
			"paragraph": "§ 176-33.11",
			"title": "Structures for animals; storage of manure.",
			"content": [
				{
					"text": "Restrictions on structures for animals and the storage of manure shall be the same as those set forth in Village Code § 176-15."
				}
			]
		},
		{
			"paragraph": "§ 176-33.12",
			"title": "Stationary outdoor fireplaces.",
			"content": [
				{
					"text": "Restrictions on stationary outdoor fireplaces shall be the same as those set forth in Village Code § 176-16."
				}
			]
		},
		{
			"paragraph": "§ 176-33.13",
			"title": "Outdoor pools.",
			"content": [
				{
					"text": "No outdoor pools shall be constructed except\nin compliance with the regulations of the State of New York, the Nassau\nCounty Health Department, the Village of Sands Point and any other\ngovernment agency having jurisdiction which may now or hereafter be\nin effect."
				}
			]
		},
		{
			"paragraph": "§ 176-33.14",
			"title": "Accessory structures.",
			"content": [
				{
					"text": "Restrictions on accessory structures shall be the same as those set forth in Village Code § 176-18."
				}
			]
		},
		{
			"paragraph": "§ 176-33.15",
			"title": "Driveways and parking areas.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Each lot used for single-family dwelling purposes shall have only\none driveway, accessed by a single curb cut. Such driveway shall have\na maximum width of not more than 15 feet at the street line."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "All parking areas, including, but not limited to, all parking courts\nand driveways where vehicles are parked or stored, whether paved or\nunpaved (collectively, \"parking areas\"), must be screened from the\nstreet and from any adjoining property by a living screen of evergreen\ntrees and/or shrubs. All screening is required to be at least 30 inches\nin height and must be comprised of vegetation having sufficient density\nto mitigate any potential visual impact that a parking area could\nhave on the street and/or on any adjoining property. All parking area\nscreening or changes to the screening must be approved by the Building\nCommissioner or the Commissioner's designee. In situations where\nthe topography of the premises and/or the distance between the parking\narea and the street or an adjacent property or other relevant circumstances\nserve to mitigate visual impact, the Building Commissioner or the\nCommissioner's designee, in his or her sole discretion, may waive\nor modify the screening requirements set forth herein."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "All applications to the Building Department that relate to the construction\nor alteration of a driveway and/or parking area must be submitted\nwith a landscape plan prepared by a licensed professional."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 176-33.16",
			"title": "Supplementary regulations.",
			"content": [
				{
					"text": "Article V of Chapter 176 of the Village Code, entitled \"Supplementary Regulations,\" shall apply in the Residence C District."
				}
			]
		}
	]
}