{
	"url": "http://ecode360.com/5188802",
	"paras": [
		{
			"paragraph": "§ 195a",
			"title": "Schedule Limiting Height and Bulk of Buildings",
			"content": [
				{
					"text": "The following regulations shall apply in the Residence District:"
				},
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Maximum stories/height: 2.5/30"
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Minimum/Maximum depth front yard(feet): 15/25"
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Minimum Side Yards(feet): one side yard of not less than 10 feet, the other side yard to be not less than five feet"
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "Minimum Rear Yards(feet): 25"
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "Lot Area per family(square feet): 4000"
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 195-4",
			"title": "Permitted uses.",
			"content": [
				{
					"text": "In a residence zone, no building or premises\nshall be used and no building shall be erected or altered which is\narranged, intended or designed to be used, except for one or more\nof the following uses:"
				},
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Residential dwellings, including therein the office\nor studio of a licensed physician, dentist, nurse-practitioner, physical\ntherapist, psychologist or chiropractor or a licensed accountant,\narchitect, attorney, engineer or land surveyor or a professional artist,\nmusician or photographer, only when and where such office or studio\nand dwelling are actually owned, used and occupied by such person(s)\nand their families, and the space dedicated to carrying on such professional\nactivity shall occupy not more than 15% of the total livable floor\narea of the dwelling unit, provided that no such professional area\nshall exceed 400 square feet, and such that the number of persons,\nincluding the practitioner and associates, assistants and employees\nengaged in such activities on the premises, shall not exceed one person\nother than those who legally reside in the residential dwelling.[Amended 6-5-1990 by L.L. No. 4-1990; 1-24-2006 by L.L. No. 2-2006; 7-21-2009 by L.L. No.\n3-2009]"
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Churches, public and parochial schools."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Railroad passenger stations."
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "Farming, truck gardens, nurseries and greenhouses,\nprovided that they are not used primarily for the growing of vegetables,\nplants or flowers for sale, and provided that there is no display\nof products and no advertising, and provided that there is no power\nplant, and that any greenhouse heating plant is at least 20 feet distant\nfrom each side lot line and also from the rear lot line. This shall\nnot restrict the erection of further greenhouses by florists or the\ngrantee on additional adjoining property owned by said florists and\nduly recorded in the office of an official clerk of record at the\ntime of the adoption of this chapter."
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "Those accessory uses and structures customarily incidental to and reasonably related to the primary uses and structures permitted under Subsections A through D of this section. However, for purposes of this section, the following uses and/or structures shall not be deemed or construed as complying with this subsection and shall not be permitted as accessory uses and/or structures in the residence zones:[Amended 11-17-1987 by L.L. No. 1-1987] "
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Any trade, business, occupation or profession, except as specified in and limited under Subsection A of this section. For purposes of this subsection, the foregoing prohibition and restriction shall be deemed to include the storage, advertising, display, assembly, manufacture, repair, servicing, sale or resale of any goods, merchandise, materials, machinery, equipment or components used in connection with or produced by any trade, business, occupation or profession, whether or not the same is operated from or upon the premises.[Amended 6-5-1990 by L.L. No. 4-1990]"
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Any building, structure, improvement, use or occupancy\notherwise permissible as an accessory use or structure under the provisions\nof this section, when or where the same shall extend beyond the lot\nboundary lines of the building lot improved or occupied by a lawful\nprimary use or structure to which such accessory use or structure\nis or is proposed to be accessory.[Amended 6-5-1990 by L.L. No. 4-1990[1]]"
												},
												{
													"footnote": "[1]\nEditor's Note: This local law also repealed\nformer Subsection E(3), which prohibited accessory uses or structures\nfrom extending to noncontiguous lots, and provided for the redesignation\nof former Subsection E(4) through (9) as Subsection E(3) through (8).\n"
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Any sign or advertising material, as such terms are defined in Chapter 156, Signage and Advertising of the Village Code, except as, where and when the same shall be specifically authorized and permitted under the provisions of this chapter or said Chapter 156 of the Village Code, subject to the proviso set forth and contained in § 195-57 under Article XVI of this chapter.[Amended 1-21-1997 by L.L. No. 2-1997]"
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "Any fence, as such term is defined in § 195-16 under Article VII of this chapter, except as, where and when specifically authorized and permitted under the provisions of this chapter or Chapter 101, Fences, of the Village Code, subject to the proviso set forth and contained in § 195-57 under article XVI of this chapter.[Amended 1-21-1997 by L.L. No. 2-1997]"
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "Any garage or garages either designed, intended, used or occupied or capable of use or occupancy, by more than three private passenger vehicles, subject to the limitations imposed under Articles VII and X of this chapter."
												}
											]
										},
										{
											"number": "(6) ",
											"content": [
												{
													"text": "The parking, storage or maintenance in or upon any residentially zoned lot of any motor vehicles other than private passenger vehicles and/or motorcycles, except that such passenger vehicles or motorcycles need not be owned by the owner or owners of such premises, and except that the owner or owners of such premises, when actually residing in and occupying such premises, may keep, park, store and maintain on such premises for their own use, not more than one commercially registered van, step-van, pickup truck or light panel truck per premises, so long as the same is actually owned by and registered in the name of at least one of such owners/occupants, so long as such vehicle bears a valid, current vehicle identification plate and inspection sticker and so long as such vehicle does not exceed the gross vehicle weight, number of wheels or axles or dimensional limitations set forth in Subsection E(7) of this section."
												}
											]
										},
										{
											"number": "(7) ",
											"content": [
												{
													"text": "The parking, storage or maintenance of any motor vehicle,\nregardless of its type, style, design, configuration, class, purpose\nor official registration, in or upon any residentially zoned lot or\nlots, which vehicle exceeds a gross vehicle weight of 6,000 pounds\nor which has a total of more than two axles or more than four wheels\nor which exceeds a maximum gross width of seven feet six inches, a\nmaximum gross length of 20 feet or a maximum gross height of seven\nfeet. For purposes of this subsection, all boats, sailboats, trailers,\ncampers, pop-up trailers, pop-up campers and similar devices, whether\nor not self-propelled or designed to be towed, shall constitute and\nbe deemed to be motor vehicles subject to the limitations herein."
												}
											]
										},
										{
											"number": "(8) ",
											"content": [
												{
													"text": "Any swimming pool, wading pool, ornamental pool, hot\ntub or other device, whether temporary or permanent, and designed,\nintended, used or capable of being used, to hold more than 50 gallons\nof water, which exceeds at any point, part or portion thereof a depth\nbelow grade of more than 10 feet or a height above grade of more than\nfour feet six inches."
												}
											]
										}
									]
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 195-5",
			"title": "Signs and fences; applicable requirements and regulations.",
			"content": [
				{
					"text": "For the purposes of this article and unless otherwise provided for elsewhere in this chapter (in which event the provisions of § 195-57, under Article XVI of this chapter, shall be deemed controlling), the governing requirements, restrictions and other regulations applicable to accessory signs and/or fences in the residence zones shall be those currently prescribed under or pursuant to Chapters 101, Fences, and 156, Signage and Advertising, of the Village Code, as the case may be."
				}
			]
		},
		{
			"paragraph": "§ 195-6",
			"title": "Accessways not to be accessory uses.",
			"content": [
				{
					"text": "A driveway or walk used for access to a business\nor industrial use shall in no case be permitted as an accessory use."
				}
			]
		},
		{
			"paragraph": "§ 195-15",
			"title": "Restrictions.",
			"content": [
				{
					"text": "In the residence zones, with the exception of a fence as authorized and permitted in conformity with the provisions of §§ 195-5 and 195-17 of this chapter and/or a sign as authorized and permitted in conformity with the provisions of §§ 195-5 and 195-18 of this chapter, no person shall erect, construct, reconstruct, alter, extend, use or maintain upon any premises any accessory building, structure or improvement which:"
				},
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "In the case of any interior lot fronting upon only\none street, encroaches or will encroach in or upon that half of the\ntotal lot depth parallel to and adjoining the street fronting such\nlot."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "In the case of any interior through lot fronting upon\ntwo or more streets, encroaches or will encroach in or upon that quarter\nof the total lot depth that is parallel to and adjoining each and\nevery street fronting upon such lot."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "In the case of any corner lot fronting upon two or\nmore streets, encroaches or will encroach in or upon that half of\nthe total lot depth that is parallel to and adjoining the narrower\nstreet frontage(s) and/or encroaches or will encroach in or upon that\nquarter of the total lot width that is parallel to and adjoining the\nwider street frontage(s). Where the frontage on each street is equal,\nthe owner may elect which such frontage shall be deemed the narrower\nand which the wider for purposes of this subsection."
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "Encroaches or will encroach in or upon that portion\nof any lot which lies within three feet of any adjoining lot boundary\nline."
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "Encroaches or will encroach in or upon that portion\nof the lot which lies within 10 feet of and is parallel to that part\nof the side lot line of the same premises which is contiguous with\nthat part of the side lot line of a separate, adjoining residential\nlot and which bounds the front yard of such adjoining premises."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 195-16",
			"title": "Definitions.",
			"content": [
				{
					"text": "For purposes of this article, the following\nwords or phrases shall have the meanings ascribed:"
				}
			]
		},
		{
			"paragraph": "§ 195-17",
			"title": "Fences.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "In the residence zones, no fence shall at any time be erected, constructed, reconstructed, altered, extended, used or maintained upon any premises except in strict conformity with all currently applicable provisions of this chapter and Chapter 101, Fences, of the Village Code. With respect to the foregoing requirements, in the event that any conflict or inconsistency shall be found to exist between an applicable provision of this chapter and any corresponding provision of Chapter 101 of the Village Code, then in such event the proviso set forth and contained in § 195-57, under Article XVI of this chapter, shall be deemed controlling."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Notwithstanding the provisions of the preceding subsection, nothing in this section or in Chapter 101 of the Village Code shall be deemed or construed to prevent the continued maintenance and use of an existing legal nonconforming fence up to and including the 31st day of August 2000, after which date every such nonconforming fence shall have been removed, or shall have been so reconstructed, altered, relocated or replaced as to fully conform to the requirements prescribed in the said preceding subsection. For the purposes of this subsection, the term \"legal nonconforming fence\" shall mean and refer only to an existing permanent fence lawfully constructed of its current component materials and in its present dimensions and lawfully erected and installed at its current location prior to April 18, 1989."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 195-18",
			"title": "Signs.",
			"content": [
				{
					"text": "In the residence zones, no sign shall at any time be erected, constructed, reconstructed, altered, extended, used or maintained upon any premises except in strict conformity with all currently applicable provisions of this chapter and Chapter 156, Signage and Advertising, of the Village Code. With respect to the foregoing requirements, in the event that any conflict or inconsistency shall be found to exist between an applicable provision of this chapter and any corresponding provision of Chapter 156 of the Village Code, then in such event the proviso set forth and contained in § 195-57, under Article XVI of this chapter, shall be deemed controlling."
				}
			]
		},
		{
			"paragraph": "§ 195-19",
			"title": "Specifications; conformance to schedule.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "No dwelling or tenement house shall hereafter be erected or altered to accommodate or make provisions for more families than the number indicated in the Schedule Limiting Height and Bulk of Buildings, in § 195-23 herein, for the zone in which such dwelling or tenement house is located, or otherwise than provided under the terms and provisions of this subsection. In a residence zone, no dwelling:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Known as a \"high-ranch-style home,\" as such term is\ndefined herein, shall be constructed on a lot containing less than\n6,000 square feet of land area and having a minimum continuous lot\nwidth throughout the depth of such lot, as measured from side lot\nline to side lot line, of 60 feet, and, any other provision of this\nchapter or any other ordinance or local law to the contrary notwithstanding,\nno such building shall be constructed with a minimum setback and open\nfront yard of less than 25 feet in depth, as measured from the front\nproperty line of the premises to the front of the building line of\nsuch building. The minimum lot area per family for two-or-more-family\nresidential occupancies in any such building shall be 6,000 square\nfeet per family."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Shall be constructed on a lot containing a land area\nless than 4,000 square feet, and having a minimum continuous lot width\nthroughout the depth of such lot, as measured from side lot line to\nside lot line, of 40 feet. Minimum lot depth must be 100 feet. The\nminimum lot area per family for two-or-more-family residential occupancies\nin any structure shall be 4,000 square feet per family.[Amended 11-27-2007 by L.L. No. 5-2007]"
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "In no event shall the length of any lot boundary line, regardless of type or style of dwelling, which is in excess of 100 feet as measured from the intersection of such lot line with the street line of the street fronting such premises on the narrower street to the intersection of such lot line with the rear lot line of the premises, be utilized in computing plot area under this section with reference to the requirements of Subsection A hereinabove."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Every residential building lot, regardless of type\nor style of dwelling proposed to be erected thereon, and regardless\nof the minimum lot area required under this section, shall, upon construction\nof such structure, and prior to the issuance of a certificate of completion\nand a certificate of occupancy therefor, be provided with a paved\ndriveway, for purposes of off-street parking of private passenger\nvehicles, such driveway to be located in the wider of the mandatory\nminimum side yards required under this chapter, and to have a minimum\nusable and finished surface of at least 75 feet in length, as measured\nfrom the front lot line of the premises to the end of such driveway."
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "For purposes of this chapter, a \"high-ranch-style\nhome or dwelling\" is hereby defined to mean and include any dwelling\nstructure constructed with the whole of such structure on a concrete\nor other gradient slab, and having an attached garage.[Amended 4-2-1998]"
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "The limitations imposed herein shall in no event prohibit\nthe erection of a one-family dwelling, other than a high-ranch style,\non any plot in single and separate ownership at the time of the adoption\nof this chapter (i.e., March 3, 1928) and containing at the time of\nsuch adoption an area less than that required for a one-family dwelling\nother than a high-ranch -style home as provided hereinabove."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 195-20",
			"title": "Maximum occupancies.",
			"content": [
				{
					"text": "In addition to the limitations set forth in § 195-19 above and subject to the definition of \"family\" set forth in § 195-21 below, the maximum number of occupants in each dwelling shall be determined as follows:"
				},
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Each person 12 years of age and older shall be counted\nas one person, children more than one year old but less than 12 years\nold shall be deemed to be 1/2 person, and infants up to one year old\nshall not be counted. The floor area shall be based upon the habitable\nfloor area contained within the living unit, exclusive of utility\nand storage rooms, halls, closets, porches and connecting spaces.\nAny area in a habitable room which has a ceiling height of less than\nfive feet shall not be counted or included in the computation of the\nspace."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Every dwelling unit, as that term is defined in Section\n2(n) of the New Hyde Park Housing and Rehabilitation Code, shall have\nat least 120 square feet of habitable floor area for the first occupant,\nplus 70 square feet of habitable floor area for each additional occupant.\nEach dwelling unit shall contain one habitable room with at least\n120 square feet of floor area and a minimum horizontal dimension of\neight feet. Any additional habitable rooms shall have a minimum floor\narea of 70 square feet and a minimum horizontal dimension of seven\nfeet."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "At least 1/2 of the floor space of any habitable room\nmust have an average ceiling height of at least seven feet six inches.\nPortions of floor spaces having ceiling heights less than five feet\nshall not be counted."
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "Habitable floor area hereunder shall not include any\nfloor area in a cellar, as that term is defined in Section 2(f) of\nthe New Hyde Park Housing and Rehabilitation Code. That area in a\nbasement, as that term is defined in Section 2(h) of the New Hyde\nPark Housing and Rehabilitation Code, may not be included in computing\nhabitable floor area unless the finished floor surface therein is\nnot more than four feet below grade; and the ceiling therein is not\nless than four feet above grade; and the floors and walls therein\nare water- and dampproofed in accordance with an approved method,\nif in contact with the earth, with said waterproofing located between\nthe floor therein or between the wall finished therein and the ground."
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "Subject to, and not in limitation of, both the foregoing\nprovisions of this section and all other provisions of this chapter,\nno single-family dwelling shall hereafter be erected or reconstructed\nanywhere in the Village unless it shall contain a total habitable\nfloor area of at least 750 square feet, and no two-family dwelling\nshall hereafter be erected or reconstructed, and no one-family dwelling\nshall hereafter be converted into use as a two-family dwelling, whether\nas of right or pursuant to a variance, unless it shall contain a total\nhabitable floor area of at least 750 square feet for each separate\nfamily.[Added 6-15-1999]"
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 195-21",
			"title": "Definitions.",
			"content": [
				{
					"text": "For the purposes of this chapter, \"family\" shall\nbe defined as follows:"
				},
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "One or more persons, whether or not related to each\nother by blood, marriage or adoption, all living together as a single,\nstable, permanent and bona fide housekeeping unit, so long as such\npersons together occupy and own, lease or rent the whole of a separate\nbuilding or dwelling unit in a family-like living arrangement as the\nfunctional and factual equivalent of a natural family and use all\nrooms and housekeeping facilities in common;"
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Any such number of persons shall not be deemed to\nconstitute a family if any one of such persons may not have lawful\naccess to all parts of the separate building or dwelling unit; or\nif any one or more of such persons lease or rent any separate portion\nof such separate building or dwelling unit from any other person;\nor if residency is temporary or transitional, either as part of an\neducational, medical, rehabilitation or treatment process, or otherwise;"
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "It shall be presumed that a separate building or dwelling\nunit is occupied by more than one family if any two or more of the\nfollowing features may be found to exist by the Superintendent of\nBuildings (or other person designated by the Mayor and Board of Trustees\nto enforce this chapter): more than one mailbox, mail slot or post\noffice address; more than one doorbell or doorway on the same side\nof the separate building or dwelling unit; more than one electric\nmeter; more than one gas meter; more than one connecting line for\ncable television; separate entrances for segregated portions of the\nseparate building or dwelling unit; partitions or locked doors barring\naccess between segregated portions of the separate building or dwelling\nunit including bedrooms; separate written or oral leases or rental\nagreements or the payment of rent for portions of the separate building\nor dwelling unit among its owner or residents; or two or more kitchens,\neach of which contain a range or oven, refrigerator and sink, unless\nit is otherwise proven by evidence presented to the Superintendent\nof Buildings (or other person designated by the Mayor and Board of\nTrustees to enforce this chapter) by the owner or resident of the\nseparate building or dwelling unit that is occupied by one family\n(all as defined in this section). The presumption provided for in\nthis subsection shall be rebuttable. Such presumption shall not preclude\nthe Superintendent of Buildings (or any other person designated by\nthe Mayor and Board of Trustees to enforce this chapter) from making\na determination that the separate building or dwelling unit is not\noccupied by one family, based on other facts whether or not listed\nin this subsection."
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "The Superintendent of Buildings (or any other person\ndesignated by the Mayor and Board of Trustees to enforce this chapter)\nshall make the primary determination as to the application of this\ndefinition of family for the purposes of compliance with any provisions\nof this Zoning Law and any other applicable rule, regulation, code\nor law, based upon an inspection of the premises, any information\nreceived from the residents thereof or any other persons or documentary\nor any other written evidence as to the condition of the premises\nor the relationship and living arrangements of the residents, in consultation\nwith the Village Attorney, and the determination shall be presumed\nto be correct and final, subject to review of or appeal to the Board\nof Zoning Appeals and judicial review as provided by law."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 195-22",
			"title": "(Reserved)\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t[1]",
			"content": [
				{
					"footnote": "[1]\nEditor's Note: Former § 195-22,\nLodging, was repealed 9-25-2007 by L.L. No. 2-2007.\n"
				}
			]
		},
		{
			"paragraph": "§ 195-23",
			"title": "Schedule Limiting Height and Bulk of Buildings.",
			"content": [
				{
					"text": "The Schedule Limiting Height and Bulk of Buildings is specifically incorporated herein to read as follows.[1]"
				},
				{
					"footnote": "[1]\nEditor's Note: Said schedule is included at\nthe end of this chapter.\n"
				}
			]
		},
		{
			"paragraph": "§ 195-23.1",
			"title": "Building coverage and floor area ratios in residential zones.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "In the R Zones (Residential Districts) of the Village,\nthe building coverage on a particular building plot or parcel shall\nin no event exceed 35% of the total lot area of that plot or parcel."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "In the R Zones (Residential Districts) of the Village,\nthe floor area ratio (F.A.R.) requirements applicable to a particular\nbuilding plot or parcel shall be as set forth and prescribed under\nthe following schedule; provided, however, that in no case shall the\nF.A.R. be interpreted and applied so as to require a dwelling to be\nconstructed with less gross floor area than the maximum gross floor\narea permitted on any smaller lot under such schedule:"
								},
								{
									"content": [
										{
											"number": "1. ",
											"content": [
												{
													"text": "Lot Area: Up to 3,999:  FAR: .47   Maximum Gross Floor Area Permitted(square feet): 1880"
												}
											]
										},
										{
											"number": "2. ",
											"content": [
												{
													"text": "Lot Area: 4,000 to 5,999:  FAR: .45   Maximum Gross Floor Area Permitted(square feet): 2700"
												}
											]
										},
										{
											"number": "3. ",
											"content": [
												{
													"text": "Lot Area: 6,000 and above:  FAR: .40   Maximum Gross Floor Area Permitted(square feet): 3200"
												}
											]
										}
									]
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 195-24",
			"title": "General provisions.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "No building or any porch thereof shall be erected and no building or any porch thereof shall be reconstructed or altered so as to project in anywise beyond the average setback line observed by the buildings on the same side of the street, within the block, at the time of the passage of this chapter. Where there are existing buildings at the time of passage of this chapter on only one side of the street within the block, then the setback line on the vacant side shall be the same as the average setback line on the improved side of the street within the block. The foregoing rule shall, however, in no case be applied so as to keep the street wall, walls or porches of buildings further back from the street line than the maximum depth of front yard indicated in the Schedule Limiting Height and Bulk of Buildings for the zone in which such building is located.[1] Where there is no existing building on either side of\nthe street within the block, no new building shall be erected with\nits street wall, walls or porches nearer to the street line than the\nmaximum or minimum depth of front yard shown for each respective zone\nin the schedule."
								},
								{
									"footnote": "[1]\nEditor's Note: See § 195-23.\n"
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Encroachments\ninto front yards are hereby permitted in residential districts as\nprovided in this section, only for one-story porticos and open terraces\nnot to exceed a maximum of eight feet in width, provided that the\nencroachment is no more than five feet.[Amended 7-21-2009 by L.L. No. 6-2009]"
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 195-25",
			"title": "(Reserved)\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t[1]",
			"content": [
				{
					"footnote": "[1]\nEditor's Note: Former § 195-25,\nControlling setback, was repealed 11-27-2007 by L.L. No. 6-2007.\n"
				}
			]
		},
		{
			"paragraph": "§ 195-26",
			"title": "Buildings on corners.",
			"content": [
				{
					"text": "A building erected on a corner lot shall be\nrequired to comply with the front yard requirements on all street\nfrontages. In cases where the two street frontages of a corner lot\nvary in length, the lot shall be deemed to be situated on the street\ncontaining the narrower frontage in computing the average setback\nline. Where the two street frontage of a corner lot are of the same\nlength, the owner may elect which street is to govern the setback\nof his building."
				}
			]
		},
		{
			"paragraph": "§ 195-27",
			"title": "Word usage.",
			"content": [
				{
					"text": "Unless otherwise expressly provided, the terms\n\"rear yards,\" \"front yards,\" \"side yards,\" \"inner court\" or \"outer\ncourt,\" when used in this chapter, shall be deemed to refer only to\na rear yard, front yard, side yard, inner court or outer court required\nby this chapter."
				}
			]
		},
		{
			"paragraph": "§ 195-28",
			"title": "Minimum requirements; conformance.",
			"content": [
				{
					"text": "No lot area shall be so reduced or diminished\nthat the yards, courts or other open spaces shall be smaller than\nprescribed by this chapter. No existing building shall be altered,\nenlarged or rebuilt except in conformity with the regulations herein\nprescribed."
				}
			]
		},
		{
			"paragraph": "§ 195-29",
			"title": "Ventilation.",
			"content": [
				{
					"text": "Except as otherwise provided in this chapter,\nevery room in which persons live, sleep, work or congregate shall\nhave at least one window or ventilating skylight opening directly\neither upon a street or upon a rear yard, front yard, side yard, inner\ncourt or outer court located upon the same lot and conforming to the\nrequirements prescribed by this chapter as to its minimum area and\nleast dimensions. Courts, yards and other open spaces, if provided\nin addition to those required by this chapter, need not be of the\narea and dimensions herein prescribed. No yard, court or other open\nspace provided about any building for the purpose of complying with\nthe provisions of this chapter shall again be used as a yard, court\nor other open space for another building. The provisions of this chapter\nshall not be deemed to apply to courts or shafts for bathrooms, toilet\ncompartments, hallways or stairways."
				}
			]
		},
		{
			"paragraph": "§ 195-30",
			"title": "(Reserved)\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t[1]",
			"content": [
				{
					"footnote": "[1]\nEditor's Note: Former § 195-30,\nRear yard provisions, was repealed 11-27-2007 by L.L. No. 8-2007.\n"
				}
			]
		},
		{
			"paragraph": "§ 195-31",
			"title": "(Reserved)\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t[1]",
			"content": [
				{
					"footnote": "[1]\nEditor's Note: Former § 195-31,\nInterior lots, was repealed 11-27-2007 by L.L. No. 9-2007.\n"
				}
			]
		},
		{
			"paragraph": "§ 195-32",
			"title": "Accessory buildings.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "In the residence zones, accessory buildings and structures\nin excess of 12 inches in height above average surrounding grade,\nother than fences, shall not occupy, in the aggregate, more than 40%\nof the lot area of any rear yard required to be provided under the\nprovisions of this chapter."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "In residence zones, no accessory garage shall be constructed\nbelow grade, nor shall any such accessory garage be constructed or\nerected to a height which exceeds a maximum height of 14 feet as measured\nfrom the surrounding average grade to the uppermost point of the topmost\nlimit of such structure, and no accessory shed or other accessory\nstructure shall be so constructed or erected which exceeds 100 square\nfeet of area by eight feet high measured from the surrounding average\ngrade to the uppermost point or topmost limit thereof.[Amended 11-16-2000 by L.L. No. 8-2000; 7-21-2009 by L.L. No. 4-2009]"
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "In the business and industrial zones, no garage, shed\nor other accessory building or structure, when located within 10 feet\nof any residentially zoned lot or parcel, shall be so erected or constructed\nwhich exceeds a maximum height of 14 feet as measured from the surrounding\naverage grade to the uppermost point or topmost limit of such structure."
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "Where the provisions of this section shall impose\ngreater restrictions than those set forth in the provisions of any\nother section of this chapter or of any law, ordinance, rule or regulation,\nthe provisions of this section shall be deemed superseding and controlling."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 195-33",
			"title": "Courts, yards and shafts.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "The area required in a court or yard at any given\nlevel shall be open from such level to the sky unobstructed, except\nfor the ordinary projections of skylights and parapets above the bottom\nof such court or yard and except for the ordinary projections of windowsills,\nbelt courses, cornices and other ornamental features to the extent\nof not more than four inches."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Courts or shafts used exclusively for lighting and\nventilating bathrooms, toilet compartments, hallways or stairways\nneed not comply with the area regulations of the different zones.\nSuch courts or shafts shall, however, not be less than 15 square feet\nin area nor less than three feet in width."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 195-34",
			"title": "Locations of dwellings.",
			"content": [
				{
					"text": "No dwelling erected after the passage of the\nBuilding Zone Code shall be located or constructed, either in whole\nor in part, in back of or to the rear of buildings on the front of\nthe lot on which they are situated. No dwelling or tenement erected\nprior to the adoption of the Building Zone Code and located or constructed\nin whole or in part in the back of or to the rear of buildings on\nthe front of the lot on which such dwelling or tenement is located\nshall be extended, reerected, reconstructed, altered or otherwise\nmodified or improved, except by variance of the terms of this provision\nby the Board of Zoning Appeals upon a showing of unnecessary hardship\nto the owner of such premises."
				}
			]
		}
	]
}