{
	"url": "http://ecode360.com/14183791",
	"paras": [
	    {
			"paragraph": "ยง 151-11",
			"title": "Residence C District.",
			"content": [
				{
					"text": "In the Residence C District, the following regulations shall\napply:"
				},
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Uses. No building shall be erected, altered or used and no lot or\npremises shall be used except for one of the purposes permitted in\na Residence A District and uses accessory thereto."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Height. No building shall be erected, altered or used any part of\nwhich is higher than permitted in the Residence A District."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Size of lot. No building shall be erected, altered or used on a lot\nhaving an area of less than 8,000 square feet."
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "Street frontage. No building shall be erected, altered or used on\na lot having a street frontage of less than 65 feet."
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "Front yard. The same requirements for a front yard in the Residence\nB District shall apply to front yards in the Residence C District."
								}
							]
						},
						{
							"number": "F. ",
							"content": [
								{
									"text": "Rear yard. The minimum distance between the rear line of the lot\nand rear wall of the principal building at any point shall be not\nless than 25 feet."
								}
							]
						},
						{
							"number": "G. ",
							"content": [
								{
									"text": "Side yards. The same requirements for side yards in the Residence\nA District shall apply to side yards in the Residence C district."
								}
							]
						},
						{
							"number": "H. ",
							"content": [
								{
									"text": "Building area. No principal building or use, together with all accessory\nbuildings or uses, shall occupy in the aggregate more than 35% of\nthe area of the lot."
								}
							]
						},
						{
							"number": "I. ",
							"content": [
								{
									"text": "Corner lots. In the case of a corner lot there shall be two front\nyards and two rear yards; the yards at the street frontages shall\nbe the front yards, and the yards opposite them shall be the rear\nyards. Such yards shall comply with the requirements for front and\nrear yards, respectively.[Amended 5-19-2004 by L.L. No. 4-2004]"
								}
							]
						},
						{
							"number": "J. ",
							"content": [
								{
									"text": "Nonconforming uses. Any use existing in any building or premises at the time of the adoption of Ordinance No. 47 on November 16, 1954, and not conforming to the regulations provided in this ยง 151-17 may be continued, subject to the same conditions and limitations as set forth in ยง 151-22 of this chapter."
								}
							]
						},
						{
							"number": "K. ",
							"content": [
								{
									"text": "Floor area ratio (FAR). In no case shall a dwelling be constructed\nwith an FAR in excess of 0.4.[Added 11-17-1993 by L.L. No. 5-1993]"
								}
							]
						},
						{
							"number": "L. ",
							"content": [
								{
									"text": "Floor\narea. The floor area in a building shall not exceed 8,000 square feet.[Added 2-16-2011 by L.L. No. 2-2011]"
								}
							]
						},
						{
							"number": "M. ",
							"content": [
								{
									"text": "Front\nyard lot coverage. The maximum permitted lot coverage of all paved\nareas in a front yard, including gravel and stone aggregate, shall\nnot be greater than 30% of the front yard. This shall include driveways,\nparking areas, walkways, patios and permitted encroachments.[Added 2-16-2011 by L.L. No. 2-2011]"
								}
							]
						},
						{
							"number": "N. ",
							"content": [
								{
									"text": "Rear yard\nlot coverage. The maximum permitted lot coverage of all paved areas\nin a rear yard, including gravel and stone aggregate, shall not be\ngreater than 25% of the rear yard. This shall include parking areas,\nwalkways, patios, decks, pools and permitted encroachments.[Added 2-16-2011 by L.L. No. 2-2011]"
								}
							]
						},
						{
							"number": "O. ",
							"content": [
								{
									"text": "The height\nof an accessory structure shall not exceed 16 feet.[Added 2-16-2011 by L.L. No. 2-2011]"
								}
							]
						},
						{
							"number": "P. ",
							"content": [
								{
									"text": "For all new construction and substantial improvements that exceed 40% of the existing floor area, the additional regulations in ยง 151-13.2. shall apply.[Added 2-16-2011 by L.L. No. 2-2011]"
								}
							]
						}
					]
				}
			]
		}
	]
}	