{
	"url": "http://ecode360.com/14183791",
	"paras": [
	    {
			"paragraph": "§ 151-11",
			"title": "Residence C District.",
			"content": [
				{
					"text": "In the Residence C District, the following regulations shall\napply:"
				},
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Uses. No building shall be erected, altered or used and no lot or\npremises shall be used except for one of the purposes permitted in\na Residence A District and uses accessory thereto."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Height. No building shall be erected, altered or used any part of\nwhich is higher than permitted in the Residence A District."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Size of lot. No building shall be erected, altered or used on a lot\nhaving an area of less than 8,000 square feet."
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "Street frontage. No building shall be erected, altered or used on\na lot having a street frontage of less than 65 feet."
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "Front yard. The same requirements for a front yard in the Residence\nB District shall apply to front yards in the Residence C District."
								}
							]
						},
						{
							"number": "F. ",
							"content": [
								{
									"text": "Rear yard. The minimum distance between the rear line of the lot\nand rear wall of the principal building at any point shall be not\nless than 25 feet."
								}
							]
						},
						{
							"number": "G. ",
							"content": [
								{
									"text": "Side yards. The same requirements for side yards in the Residence\nA District shall apply to side yards in the Residence C district."
								}
							]
						},
						{
							"number": "H. ",
							"content": [
								{
									"text": "Building area. No principal building or use, together with all accessory\nbuildings or uses, shall occupy in the aggregate more than 35% of\nthe area of the lot."
								}
							]
						},
						{
							"number": "I. ",
							"content": [
								{
									"text": "Corner lots. In the case of a corner lot there shall be two front\nyards and two rear yards; the yards at the street frontages shall\nbe the front yards, and the yards opposite them shall be the rear\nyards. Such yards shall comply with the requirements for front and\nrear yards, respectively.[Amended 5-19-2004 by L.L. No. 4-2004]"
								}
							]
						},
						{
							"number": "J. ",
							"content": [
								{
									"text": "Nonconforming uses. Any use existing in any building or premises at the time of the adoption of Ordinance No. 47 on November 16, 1954, and not conforming to the regulations provided in this § 151-17 may be continued, subject to the same conditions and limitations as set forth in § 151-22 of this chapter."
								}
							]
						},
						{
							"number": "K. ",
							"content": [
								{
									"text": "Floor area ratio (FAR). In no case shall a dwelling be constructed\nwith an FAR in excess of 0.4.[Added 11-17-1993 by L.L. No. 5-1993]"
								}
							]
						},
						{
							"number": "L. ",
							"content": [
								{
									"text": "Floor\narea. The floor area in a building shall not exceed 8,000 square feet.[Added 2-16-2011 by L.L. No. 2-2011]"
								}
							]
						},
						{
							"number": "M. ",
							"content": [
								{
									"text": "Front\nyard lot coverage. The maximum permitted lot coverage of all paved\nareas in a front yard, including gravel and stone aggregate, shall\nnot be greater than 30% of the front yard. This shall include driveways,\nparking areas, walkways, patios and permitted encroachments.[Added 2-16-2011 by L.L. No. 2-2011]"
								}
							]
						},
						{
							"number": "N. ",
							"content": [
								{
									"text": "Rear yard\nlot coverage. The maximum permitted lot coverage of all paved areas\nin a rear yard, including gravel and stone aggregate, shall not be\ngreater than 25% of the rear yard. This shall include parking areas,\nwalkways, patios, decks, pools and permitted encroachments.[Added 2-16-2011 by L.L. No. 2-2011]"
								}
							]
						},
						{
							"number": "O. ",
							"content": [
								{
									"text": "The height\nof an accessory structure shall not exceed 16 feet.[Added 2-16-2011 by L.L. No. 2-2011]"
								}
							]
						},
						{
							"number": "P. ",
							"content": [
								{
									"text": "For all new construction and substantial improvements that exceed 40% of the existing floor area, the additional regulations in § 151-13.2. shall apply.[Added 2-16-2011 by L.L. No. 2-2011]"
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 151-13.2",
			"title": "Additional regulations for new construction and substantial improvements.",
			"content": [
				{
					"text": "The following additional regulations shall apply to new construction\nand substantial improvements constructed after March 1, 2011, in the\nResidence A, Residence B, and Residence C Districts. A substantial\nimprovement shall be defined as improvements that exceed 40% of the\nexisting floor area of the lot as determined by the Building Inspector."
				},
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "First floor elevation."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "The first floor elevation level of a building shall not exceed\nthree feet on lots with a grade having less than a three-percent slope.\nIf a lot has a grade with a slope greater than 3%, the first floor\nelevation is measured by calculating the average front yard along\nthe foundation wall."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "If the distance between the mean street curb level and the mean\ngrade level is greater than three feet, the first floor elevation\ncan not exceed 1.5 feet."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Side yards. Except in the case of a corner lot, two side yards shall\nbe provided as follows:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "For lots having a lot width greater than 140 feet:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "The first story of a building shall have a thirty-two-foot aggregate\nside yard setback and a fifteen-foot minimum side yard setback."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "The second story of a building shall be set back a minimum of\nan additional six feet from the first story wall (\"the required second\nstory setback\") unless:"
																},
																{
																	"content": [
																		{
																			"number": "[1] ",
																			"content": [
																				{
																					"text": "The width of the improvement proposed within the required second\nstory setback is no more than 75% of the building's first story\nwidth directly beneath it; and, either:"
																				}
																			]
																		},
																		{
																			"number": "[2] ",
																			"content": [
																				{
																					"text": "The front and rear facade planes of the proposed improvement\nwithin the required second story setback do not share the same front\nor rear facade planes of the building and there is a break and change\nin plane by at least two feet; or the height of the roof eave of the\nproposed improvement within the required second story setback is less\nthan 50% of the building's second story height."
																				},
																				{
																					"footnote": "[1]\nEditor's Note: Said diagram is included at the end of\nthis chapter.\n"
																				}
																			]
																		}
																	]
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "The side yard setback for buildings that have two-story solid\nplanes are as follows:"
																},
																{
																	"content": [
																		{
																			"number": "[1] ",
																			"content": [
																				{
																					"text": "A building with a two-story solid plane on one side elevation\nshall have a thirty-seven-foot aggregate side yard setback and a twenty-two-foot\nminimum side yard setback for the side elevation with the solid two-story\nplane."
																				}
																			]
																		},
																		{
																			"number": "[2] ",
																			"content": [
																				{
																					"text": "A building with a two-story solid plane on each side elevation\nshall have a forty-four-foot aggregate side yard setback and a twenty-two-foot\nminimum side yard setback for each side."
																				}
																			]
																		}
																	]
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "For lots having a minimum lot width of 100 feet up to a maximum\nof 140 feet:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "The first story of a building shall have a twenty-eight-foot\naggregate side yard setback and a twelve-foot minimum side yard."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "The second story of a building shall be set back a minimum of\nan additional six feet from the first story wall (\"the required second\nstory setback\") unless:"
																},
																{
																	"content": [
																		{
																			"number": "[1] ",
																			"content": [
																				{
																					"text": "The width of the improvement proposed within the required second\nstory setback is no more than 75% of the building's first story\nwidth directly beneath it; and, either:"
																				}
																			]
																		},
																		{
																			"number": "[2] ",
																			"content": [
																				{
																					"text": "The front and rear facade planes of the proposed improvement\nwithin the required second story setback do not share the same front\nor rear facade planes of the building and there is a break and change\nin plane by at least two feet; or the height of the roof eave of the\nproposed improvement within the required second story setback is less\nthan 50% of the building's second story height."
																				},
																				{
																					"footnote": "[2]\nEditor's Note: Said diagram is included at the end of\nthis chapter.\n"
																				}
																			]
																		}
																	]
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "The side yard setback for buildings that have two-story solid\nplanes are as follows:"
																},
																{
																	"content": [
																		{
																			"number": "[1] ",
																			"content": [
																				{
																					"text": "A building with a two-story solid plane on one side elevation\nshall have a thirty-foot aggregate side yard setback and a sixteen-foot\nminimum side yard setback for the side elevation with the solid two-story\nplane."
																				}
																			]
																		},
																		{
																			"number": "[2] ",
																			"content": [
																				{
																					"text": "A building with a two-story solid plane on each side elevation\nshall have a thirty-two-foot aggregate side yard setback and a sixteen-foot\nminimum side yard setback for each side."
																				}
																			]
																		}
																	]
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "For lots having a minimum lot width of 90 feet up to a maximum\nof 99 feet:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "The first story of a building shall have a twenty-six-foot aggregate\nside yard setback and a twelve-foot minimum side yard."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "The second story of a building shall be set back a minimum of\nan additional six feet from the first story wall (\"the required second\nstory setback\") unless:"
																},
																{
																	"content": [
																		{
																			"number": "[1] ",
																			"content": [
																				{
																					"text": "The width of the improvement proposed within the required second\nstory setback is no more than 75% of the building's first story\nwidth directly beneath it; and, either:"
																				}
																			]
																		},
																		{
																			"number": "[2] ",
																			"content": [
																				{
																					"text": "The front and rear facade planes of the proposed improvement\nwithin the required second story setback do not share the same front\nor rear facade planes of the building and there is a break and change\nin plane by at least two feet; or the height of the roof eave of the\nproposed improvement within the required second story setback is less\nthan 50% of the building's second story height."
																				},
																				{
																					"footnote": "[3]\nEditor's Note: Said diagram is included at the end of\nthis chapter.\n"
																				}
																			]
																		}
																	]
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "The side yard setbacks for buildings that have solid two-story\nplanes are as follows:"
																},
																{
																	"content": [
																		{
																			"number": "[1] ",
																			"content": [
																				{
																					"text": "A building with a two-story single plane on one or both side\nelevations shall have a twenty-eight-foot aggregate side yard setback\nand a fourteen-foot minimum side yard setback on each side."
																				}
																			]
																		}
																	]
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "For lots having a minimum lot width of 80 feet up to a maximum\nof 89 feet, a building shall have a twenty-two-foot aggregate side\nyard setback and a ten-foot minimum side yard setback on one side."
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "The width of an irregularly shaped lot shall be determined by\ncalculating the average width of a lot's permissible building\nenvelope. This average width shall be used to determine the applicable\nside yard setback requirements as set forth in this section."
												},
												{
													"footnote": "[4]\nEditor's Note: Said diagram is included at the end of\nthis chapter.\n"
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Facades."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "The horizontal plane of the building's front facade shall\nnot extend more than 60 feet in width without a change or break in\nsaid plane of at least two feet."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "The horizontal plane of the building's side facade shall\nnot extend more than 35 feet without a change or break in said plane\nof at least two feet, and the primary facade cannot constitute more\nthan 75% of the total area of that side wall."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "For both front and side facades, projecting chimneys or permitted\nencroachments shall not be considered a plane break or change."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "Foundation walls shall not be exposed greater than one foot."
												},
												{
													"footnote": "[5]\nEditor's Note: Said diagram is included at the end of\nthis chapter.\n"
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "Maximum encroachments permitted into required yards. No building\nor part of a building shall be erected in, upon or over a required\nyard except for the following permitted encroachments, and only when\nsituated within a side yard that has a minimum width of 12 feet."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Cornices, eaves, gutters: 24 inches;"
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Windowsills, belt courses or other ornamental features: four\ninches;"
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Bay windows not more than 7.5 feet in width, no more than one\nstory high: two feet;"
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "A one-story vestibule, no more than eight feet wide: 3.5 feet\nwide in the front yard;"
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "One-story open porches or terraces that are 60% of the overall\nfront width of the building: 3.5 feet into the front or rear yard;"
												}
											]
										},
										{
											"number": "(6) ",
											"content": [
												{
													"text": "Fireplace chimneys no greater than six feet in width: two feet\ndeep;"
												}
											]
										},
										{
											"number": "(7) ",
											"content": [
												{
													"text": "Stoops, entry steps and platforms with steps no greater than\nsix feet in width and a roof that extends no more than one foot of\nthe exit platform: three feet deep in a side yard and six feet deep\nin a front or rear yard; and"
												}
											]
										},
										{
											"number": "(8) ",
											"content": [
												{
													"text": "Air-conditioning condenser area and equipment having a total\nwidth of seven feet or less: three feet deep."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "Driveways. Driveways are permitted encroachments within a required\nside yard but shall comply with the additional regulations set forth\nin this section."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "For lots with a lot width greater than 99 feet, the following\nregulations shall apply:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "A driveway situated on a lot which is improved with a detached\none- or two-car garage:"
																},
																{
																	"content": [
																		{
																			"number": "[1] ",
																			"content": [
																				{
																					"text": "A three-foot minimum side yard setback shall be required between\nthe driveway and the side property line. Landscaping as approved by\nthe Architectural Review Board shall be required within this setback."
																				}
																			]
																		},
																		{
																			"number": "[2] ",
																			"content": [
																				{
																					"text": "A two-foot minimum separation between the building and the driveway\nshall be required. Landscaping as approved by the Architectural Review\nBoard shall be required within this setback."
																				}
																			]
																		},
																		{
																			"number": "[3] ",
																			"content": [
																				{
																					"text": "The maximum driveway width shall be 12 feet in the front and\nside yard."
																				}
																			]
																		}
																	]
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "A driveway situated on a lot which is improved with a side-entrance\ngarage:"
																},
																{
																	"content": [
																		{
																			"number": "[1] ",
																			"content": [
																				{
																					"text": "A three-foot minimum side yard setback shall be required between\nthe driveway and the side property line. Landscaping as approved by\nthe Architectural Review Board shall be required within this setback."
																				}
																			]
																		},
																		{
																			"number": "[2] ",
																			"content": [
																				{
																					"text": "The driveway shall have a twenty-six-foot clearance area to\nbe used as a turning lane. The location of the clearance area shall\nbe approved by the Building Inspector."
																				}
																			]
																		},
																		{
																			"number": "[3] ",
																			"content": [
																				{
																					"text": "The maximum driveway width shall be 12 feet in the front and\nside yard."
																				}
																			]
																		}
																	]
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "A circular driveway situated on a lot which is improved with\na front-entry garage:"
																},
																{
																	"content": [
																		{
																			"number": "[1] ",
																			"content": [
																				{
																					"text": "A five-foot minimum side yard setback on each side shall be\nrequired between the driveway and the side property line. Landscaping\nas approved by the Architectural Review Board shall be required within\nthis setback."
																				}
																			]
																		},
																		{
																			"number": "[2] ",
																			"content": [
																				{
																					"text": "The building on a lot with a circular driveway shall have a\nforty-foot minimum front yard setback."
																				}
																			]
																		},
																		{
																			"number": "[3] ",
																			"content": [
																				{
																					"text": "Neither curb cut can be separated by less than 40 feet."
																				}
																			]
																		}
																	]
																}
															]
														},
														{
															"number": "(d) ",
															"content": [
																{
																	"text": "A driveway situated on a lot improved with an attached front-facing\ngarage:"
																},
																{
																	"content": [
																		{
																			"number": "[1] ",
																			"content": [
																				{
																					"text": "A three-foot minimum side yard setback shall be required between\nthe driveway and the side property line. Landscaping as approved by\nthe Architectural Review Board shall be required within this setback."
																				}
																			]
																		},
																		{
																			"number": "[2] ",
																			"content": [
																				{
																					"text": "The maximum driveway width shall be 22 feet for a double-car\ngarage."
																				}
																			]
																		},
																		{
																			"number": "[3] ",
																			"content": [
																				{
																					"text": "The maximum driveway width shall be 12 feet for a single-car\ngarage."
																				}
																			]
																		}
																	]
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "For lots with a lot width of 90 to 99 feet, the following regulations\nshall apply:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "A driveway situated on a lot which is improved with a detached\none-car or two-car garage shall comply with the following:"
																},
																{
																	"content": [
																		{
																			"number": "[1] ",
																			"content": [
																				{
																					"text": "A two-foot minimum side yard setback shall be required between\nthe driveway and the side property line. Landscaping as approved by\nthe Architectural Review Board shall be required within this setback."
																				}
																			]
																		},
																		{
																			"number": "[2] ",
																			"content": [
																				{
																					"text": "A two-foot minimum separation between the building and the driveway\nshall be required. Landscaping as approved by the Architectural Review\nBoard shall be required within this setback."
																				}
																			]
																		},
																		{
																			"number": "[3] ",
																			"content": [
																				{
																					"text": "The maximum driveway width shall be 10 feet in the front and\nside yard."
																				}
																			]
																		}
																	]
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "A driveway situated on a lot which is improved with a side-entrance\ngarage:"
																},
																{
																	"content": [
																		{
																			"number": "[1] ",
																			"content": [
																				{
																					"text": "A two-foot minimum side yard setback shall be required between\nthe driveway and the side property line. Landscaping as approved by\nthe Architectural Review Board shall be required within this setback."
																				}
																			]
																		},
																		{
																			"number": "[2] ",
																			"content": [
																				{
																					"text": "The driveway shall have a twenty-six-foot clearance area to\nbe used as a turning lane. The location of the clearance area shall\nbe approved by the building inspector."
																				}
																			]
																		},
																		{
																			"number": "[3] ",
																			"content": [
																				{
																					"text": "The maximum driveway width shall be 10 feet in the front and\nside yard."
																				}
																			]
																		}
																	]
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "A driveway situated on a lot which is improved with an attached\nfront-facing garage:"
																},
																{
																	"content": [
																		{
																			"number": "[1] ",
																			"content": [
																				{
																					"text": "A three-foot minimum side yard setback shall be required between\nthe driveway and side property line. Landscaping as approved by the\nArchitectural Review Board shall be required within this setback."
																				}
																			]
																		},
																		{
																			"number": "[2] ",
																			"content": [
																				{
																					"text": "The maximum driveway width shall be 22 feet for a double-car\ngarage."
																				}
																			]
																		},
																		{
																			"number": "[3] ",
																			"content": [
																				{
																					"text": "The maximum driveway width shall be 12 feet for a single-car\ngarage."
																				}
																			]
																		}
																	]
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "For lots with a lot width of 80 to 89 feet, the following regulations\nshall apply:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "A driveway situated on a lot which is improved with a detached\none-car or two-car garage shall comply with the following:"
																},
																{
																	"content": [
																		{
																			"number": "[1] ",
																			"content": [
																				{
																					"text": "A two-foot minimum side yard setback shall be required between\nthe driveway and the side property line. Landscaping as approved by\nthe Architectural Review Board shall be required within this setback."
																				}
																			]
																		},
																		{
																			"number": "[2] ",
																			"content": [
																				{
																					"text": "The maximum driveway width shall be 10 feet in the front and\nside yard."
																				}
																			]
																		}
																	]
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "A driveway situated on a lot which is improved with a side-entrance\ngarage:"
																},
																{
																	"content": [
																		{
																			"number": "[1] ",
																			"content": [
																				{
																					"text": "A two-foot minimum side yard setback shall be required between\nthe driveway and the side property line. Landscaping as approved by\nthe Architectural Review Board shall be required within this setback."
																				}
																			]
																		},
																		{
																			"number": "[2] ",
																			"content": [
																				{
																					"text": "The driveway shall have a twenty-six-foot clearance area to\nbe used as a turning lane. The location of the clearance area shall\nbe approved by the Building Inspector."
																				}
																			]
																		},
																		{
																			"number": "[3] ",
																			"content": [
																				{
																					"text": "The maximum driveway width shall be 10 feet in the front and\nside yard."
																				}
																			]
																		}
																	]
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "A driveway situated on a lot which is improved with an attached\nfront-facing garage:"
																},
																{
																	"content": [
																		{
																			"number": "[1] ",
																			"content": [
																				{
																					"text": "A three-foot minimum side yard setback shall be required between\nthe driveway and the side property line. Landscaping as approved by\nthe Architectural Review Board shall be required within this setback."
																				}
																			]
																		},
																		{
																			"number": "[2] ",
																			"content": [
																				{
																					"text": "The maximum driveway width shall be 22 feet for a double-car\ngarage."
																				}
																			]
																		},
																		{
																			"number": "[3] ",
																			"content": [
																				{
																					"text": "The maximum driveway width shall be 12 feet for a single-car\ngarage."
																				}
																			]
																		}
																	]
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "The lot width of an irregularly shaped lot shall be the average\nwidth of the front lot line and front line of the building. This average\nwidth shall be used to determine the applicable driveway regulations\nas set forth in this section."
												},
												{
													"footnote": "[6]\nEditor's Note: Said diagram is included at the end of\nthis chapter.\n"
												}
											]
										}
									]
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 151-14",
			"title": "Accessory buildings and uses.",
			"content": [
				{
					"text": "The following additional provisions shall apply to accessory\nbuildings and uses:"
				},
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "The accessory building or use must be located on the same lot as\nthe principal building or use to which it is accessory or on a lot\nimmediately adjoining it. If it is located on a lot immediately adjoining\nthe lot on which the principal building or use is located and the\nlots are severed, the accessory use shall cease."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "The accessory use shall not be carried on by any person other than\nthe occupant of the principal building or, in the case of vacant property,\nthe owner or lessee of the lot."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "The area occupied by accessory buildings shall be included in computing\nthe maximum portion of the lot area which may be built upon in any\ngiven district. The area occupied by accessory buildings shall not\nexceed 8% of the area of the lot."
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "Prior to the issuance of a building permit for the alteration or\nerection of an accessory building on property that abuts a Village\nreserve strip, the Great Neck Water Pollution Control District shall\ndetermine the actual location of the sewer line within the reserve\nstrip. Notwithstanding anything contained in this Code to the contrary,\nin no event shall the accessory building be set back less than six\nfeet from the actual location of the sewer line.[Added 4-22-2004 by L.L. No. 5-2004]"
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 151-15",
			"title": "Professional offices and studios.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Professional offices and studios shall be permitted as an accessory\nuse in legal single-family dwellings in the Village provided the owner\nobtains a special use permit from the Board of Trustees and complies\nwith the following conditions:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "This accessory use is limited to one professional per dwelling, except\nthat two professionals are permitted provided the person is the spouse,\nchild or parent of the owner, and further provided that the professionals\nreside in the dwelling in which such office or studio is located.\nThis accessory use shall be incidental and subordinate to the use\nof such dwelling for residential purposes."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "No display of advertising and no exterior sign shall be permitted except the name of the professional and letters or abbreviations indicating the nature of the profession. The sign shall not exceed eight inches by 24 inches and shall not be illuminated except as set forth in § 151-19."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "On-premises parking shall be provided for all employees and professionals.\nNot more than one assistant or associate licensed practitioner and\nnot more than one nurse or assistant or associate worker may be employed\nin such office."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "A special use permit granted by the Board of Trustees for such accessory\nuse of a dwelling shall apply only to the use described in the permit\nand to the named permittee, and such permit may not be transferred\nand shall expire upon the termination or modification of the permitted\nuse by the permitted user."
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "The professional office or studio shall not be rented to a third\nparty."
												}
											]
										},
										{
											"number": "(6) ",
											"content": [
												{
													"text": "\"Professional office or studio,\" as used herein, shall not be construed\nto include or mean kindergarten, child's nursery, dance school,\nmusic school, art school, or other private school. For the purposes\nof this section, the instructing or teaching of more than three persons\nat any time shall constitute the maintenance of a kindergarten, nursery,\nor other school."
												}
											]
										},
										{
											"number": "(7) ",
											"content": [
												{
													"text": "No such use shall commence without a permit. The owner seeking such\npermit shall file a special use permit application in addition to\nany documents as reasonably may be requested by the Village and shall\npay the required fee. Such use shall not deviate from the approved\npermit prior to an amended permit being submitted and approved by\nthe Village."
												}
											]
										},
										{
											"number": "(8) ",
											"content": [
												{
													"text": "The hours of operation for such professional office or studio shall\nbe stated in the special use permit application and approved by the\nBoard of Trustees."
												}
											]
										},
										{
											"number": "(9) ",
											"content": [
												{
													"text": "There shall be no excessive shipping of materials to and from the\npremises."
												}
											]
										},
										{
											"number": "(10) ",
											"content": [
												{
													"text": "There shall be no overnight accommodations provided or maintained\non the premises related to the professional office or studio use."
												}
											]
										},
										{
											"number": "(11) ",
											"content": [
												{
													"text": "The Board of Trustees may impose reasonable conditions on the use to promote the general standards set forth in § 151-15C below."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Termination of all legal nonconforming uses."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "All professional office or studio uses which preexisted on the effective\ndate of this section may be continued, without conforming to the provisions\nof this section, until September 30, 2014."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "On October 1, 2014, no professional office or studio use shall be\npermitted, notwithstanding the fact that it may have existed prior\nto the effective date of this section, unless the Board of Trustees\nhas granted a special use permit pursuant to the standards and procedures\nset forth in this section."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "General standards. The Board of Trustees shall consider the following\nfactors when reviewing a special use permit application:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "The use does not create a condition which is offensive, annoying\nor harmful to public health, safety and general welfare including,\nbut not limited to, by reason of noise, glare, vibration, odor, dust,\nfumes or undue human or vehicular traffic."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "The use will be in harmony with and promote the general purposes\nand intent of this chapter."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "The plot area is sufficient, appropriate and adequate for the use\nand the reasonably anticipated operation and expansion thereof."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "The proposed use will not prevent the orderly and reasonable use\nof adjacent properties, particularly where they are in a different\ndistrict."
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "The site is particularly suitable for the location of such use in\nthe Village."
												}
											]
										},
										{
											"number": "(6) ",
											"content": [
												{
													"text": "The characteristics of the proposed use are not such that its proposed\nlocation would be unsuitably near to a house of worship, school, theater,\nrecreational area or other place of public assembly."
												}
											]
										},
										{
											"number": "(7) ",
											"content": [
												{
													"text": "In addition to the on-premises parking required pursuant to § 151-15A(6), there are sufficient on-street parking spaces to accommodate the anticipated number of patrons or visitors."
												}
											]
										},
										{
											"number": "(8) ",
											"content": [
												{
													"text": "The layout of the on-premises parking spaces and driveway is convenient\nand conducive to safe operation."
												}
											]
										},
										{
											"number": "(9) ",
											"content": [
												{
													"text": "Adequate buffer yards and screening are provided where necessary\nto protect adjacent properties and land uses."
												}
											]
										},
										{
											"number": "(10) ",
											"content": [
												{
													"text": "Adequate provisions will be made for the collection and disposal\nof stormwater runoff from the site and of sanitary sewage, refuse\nor other waste, whether liquid, solid, gaseous or of other character."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "Exemption. This section shall not apply to an owner who works from\nhome, but does not have any employees or special equipment other than\na home office computer and typical appurtenances such as printer or\nfacsimile machine."
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "All other commercial uses of a single-family dwelling are expressly\nprohibited."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 151-16",
			"title": "Private garages.",
			"content": [
				{
					"text": "A private garage is permitted only as an accessory use and subject\nto the following conditions:"
				},
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "No business, service or industry may be carried on directly or indirectly\nin such garage or in connection therewith."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "No commercial or business vehicle shall be stored or kept temporarily\nor permanently in such garage or elsewhere on the lot."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "When attached to or forming part of the principal building, no part\nof the garage is permitted in a required yard."
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "No private garage shall be permitted within a side yard or within\nthe front yard."
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "In the Residence A District, Residence B District and Residence C District, a detached private garage may be constructed in a rear yard or side yard, provided that no part thereof is nearer than four feet to the nearest property line. In the Residence D District the requirements of § 151-12 shall control.[Amended 9-21-1994 by L.L. No. 3-1994]"
								}
							]
						},
						{
							"number": "F. ",
							"content": [
								{
									"text": "In the case of a corner lot, a garage may not be nearer to the street\nline of the street than the front building line established for that\nstreet."
								}
							]
						},
						{
							"number": "G. ",
							"content": [
								{
									"text": "In the Residence D District, Subdistrict D-1, parking spaces which\nare not required for resident use may be used for the parking of automobiles\nof nonresidents, subject to such regulations and charges as may be\nimposed by the owner of such property."
								}
							]
						},
						{
							"number": "H. ",
							"content": [
								{
									"text": "In the event that there are two or more private garages on a lot, only one detached garage may be set back as provided in § 151-16E; all other garages, either attached or detached, shall comply with the setback requirements for the principal building.[Added 9-21-1994 by L.L. No. 2-1994]"
								}
							]
						},
						{
							"number": "I. ",
							"content": [
								{
									"text": "No portion\nof a front-entrance garage may be located in the cellar or basement\nof a residence.[Added 2-16-2011 by L.L. No. 2-2011]"
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 151-17",
			"title": "Encroachment in required yards.",
			"content": [
				{
					"text": "No building or part of a building shall be erected in, upon\nor over or shall project into a required yard, with the following\nexceptions:"
				},
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Cornices, eaves, gutters not more than 12 inches; or windowsills,\nbelt courses or other ornamental features projecting not more than\nfour inches.[Amended 7-21-1999 by L.L. No. 1-1999; 5-19-2004 by L.L. No. 4-2004]"
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "(Reserved)[1]"
								},
								{
									"footnote": "[1]\nEditor's Note: Former Subsection B, regarding one-story\nuncovered porches, was repealed 5-21-1997 by L.L. No. 3-1997.\n"
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Subsurface structures may be constructed beneath the surface of the\nground of a required rear yard or a required side yard, provided that\nno part of such subsurface structure shall project above the surface\nof the ground in any such yard, and further provided that in cases\nwhere the surface of the ground has been raised above its natural\nstate by fill, grading, terracing or otherwise, no part of such subsurface\nstructure shall be constructed or maintained more than three feet\nabove the level of the ground in its natural state."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 151-18",
			"title": "Height of multiple dwellings and commercial buildings.",
			"content": [
				{
					"text": "The provisions of this chapter relating to the height of multiple\ndwellings and commercial buildings are subject to the following exceptions:"
				},
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "A parapet wall or cornice may extend above such height limit not\nmore than five feet."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Stair bulkheads and air-conditioning units may extend above such\nheight limit not more than 10 feet; provided, however, that such installation\nis enclosed in the same type of brick as used for the building and\nis set back a minimum of 20 feet from any exterior wall of the building."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Ventilating fans may extend above such height limit but in no event\nshall they extend above the parapet wall."
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "Elevators may extend above such height limit not more than 14 feet;\nprovided, however, that such installation is enclosed in the same\ntype of brick as used for the building and is set back a minimum of\n28 feet from any exterior wall of the building."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 151-19",
			"title": "Signs.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Permitted signs."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "No signs shall be erected or maintained except:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "Signs stating the name of the premises or the name of the owner\nor occupant thereof and, in the case of a duly licensed professional\nperson, the letters or symbol designating his profession."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "Signs stating the street and number of the building or premises\nwhere the sign is located."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "Directional or warning signs for the convenience of persons\ndesiring to enter the premises, such as \"Deliveries,\" \"Entrance,\"\n\"Private,\" \"Children\" and the like.[Amended 5-19-2004 by L.L. No. 4-2004]"
																}
															]
														},
														{
															"number": "(d) ",
															"content": [
																{
																	"text": "In a Special Office District, real estate signs advertising\nthe real estate on which the sign is located for sale or for rent.[Amended 5-15-1996 by L.L. No. 2-1996]"
																}
															]
														},
														{
															"number": "(e) ",
															"content": [
																{
																	"text": "During the course of construction of a building, signs giving\nthe names of the builder, architect or artisan engaged on the work."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "All permitted signs may include as incidental thereto a fanciful\ndesign, background or decoration."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "The size of the signs permitted by Subsection A of this section shall be as follows:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Signs permitted under Subsection A(1)(a), (b) and (c) and (2) shall not exceed six inches in height and two feet in length."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Signs permitted under Subsection A(1)(d) and (e) shall not exceed three feet in height and four feet in width."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "The signs permitted by Subsection A shall be located as follows:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Signs permitted under Subsection A(1)(a), (b) and (c) may be erected and maintained within the required front yard, required side yard or required rear yard, provided that the highest point of the sign is not more than five feet above the level of the ground where it is located and the highest point of the post or standard on which it is mounted or to which it is attached is not more than six feet above the level of the ground where it is located."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Signs permitted under Subsection A(1)(d) and (e) are prohibited in a required side yard or required rear yard and in the first 20 feet of the required front yard."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "Signs permitted under Subsection A of this section, other than real estate signs, may be illuminated by artificial means, subject to the following conditions, which must be complied with:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Electric lights, lamps or illuminated tubes shall not be used for\nthe letters, numerals or other symbols of the sign or for its design,\nbackground or decoration. Notwithstanding the foregoing, an internally\nlighted sign with opaque background and translucent letters is permissible."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "No flashing or intermittent lights or means of illumination are permitted."
												}
											]
										}
									]
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 151-20",
			"title": "Swimming pools.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "For the purpose of computing the building area, the required yards\nand the distance from the lines of the lot, the pool apron or platform\nalongside the side or end of a swimming pool, the base for the springboard\nor diving platform and the foundation for the purifying apparatus,\nif any, shall be included."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "No swimming pool or part thereof shall be constructed in the front\nyard."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "All swimming pools shall be constructed in accordance with standard\npractice."
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "Each pool shall be provided with permanently installed facilities\nfor the complete draining thereof. Such facilities shall be entirely\nseparate from the house drains and house sewer. In no case may the\ncontents of the pool be permitted to discharge, directly or indirectly,\ninto a street or public sewer or public drain or catch basin, or in,\nupon or under the land of another person, or in such a way as to adversely\naffect the functioning of the house drains or house sewer of another\nproperty.[Amended 5-19-2004 by L.L. No. 4-2004]"
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "All connections with the public water supply shall be made by a duly\nlicensed plumber in conformity with the Plumbing Code[1] and the rules and regulations of the water supply company\nor water district. Such connections shall be made in such a way as\nto prevent any water from the swimming pool from entering the public\nwater supply system. In times of drought or water shortages, the Board\nof Trustees may direct that the use of the swimming pool be discontinued\nand that all connections with the public water supply system be broken\nuntil further order."
								},
								{
									"footnote": "[1]\nEditor's Note: See Ch. 117, Plumbing and Sewers.\n"
								}
							]
						},
						{
							"number": "F. ",
							"content": [
								{
									"text": "Every swimming pool shall be enclosed by a fence or wall approved\nby the Building Inspector, sufficient to prevent the accidental entry\nor unauthorized use of the pool by a child or children. Such fence\nor wall shall be erected so as to completely enclose either the pool\nitself or the particular yard area in which the pool is situated or\nthe entire property back of the building line."
								}
							]
						},
						{
							"number": "G. ",
							"content": [
								{
									"text": "Such fence or wall shall be not less than four feet and not more\nthan five feet in height above ground level and shall have not more\nthan two openings for ingress or egress. Each of said openings shall\nhave a self-closing gate or door with an automatic latch and a lock\nof such a character that it can be opened from the outside of the\npool enclosure only by means of a key or a combination. Each gate,\ndoor, latch and lock shall at all times be maintained in good working\norder, and each gate or door shall be kept closed and locked at all\ntimes when the pool is not in use by adults, whether it contains water\nor is empty; provided, however, that the Building Inspector may approve\nalternative methods for closing or guarding the openings in said fence\nwhich provide equal or greater protection."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 151-21",
			"title": "Miscellaneous prohibited uses.",
			"content": [
				{
					"text": "The outdoor storage of motor vehicles, boats, boat trailers\nand similar articles of property is prohibited throughout the village."
				}
			]
		}
	]
}	