{
	"url": "http://ecode360.com/14183780",
	"paras": [
	    {
			"paragraph": "ยง 151-10",
			"title": "Residence B District.",
			"content": [
				{
					"text": "In the Residence B District, the following regulations shall\napply:"
				},
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Uses. No building shall be erected, altered or used and no lot or\npremises shall be used except for one of the purposes permitted in\nthe Residence A District and uses accessory thereto."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Height. No building shall be erected, altered or used any part of\nwhich is higher than permitted in the Residence A District."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Size of lot. No building shall be erected, altered or used on a lot\nhaving an area of less than 7,500 square feet."
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "Street frontage; width of lot at street and at rear. No lot shall\nhave a street frontage of less than 100 feet or a street frontage\nthat measures less than 90% nor more than 110% of the rear lot line.[Amended 11-20-1997 by L.L. No. 5-1997]"
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "Front yard. Where two or more buildings exist on the same side of\nthe street as a proposed building and are situated within 200 feet\nof such proposed building or any part thereof, no portion of such\nproposed building shall be erected nearer to the street line than\na line joining the front lines of such existing buildings and running\nas nearly parallel to the street as may be provided that no portion\nof such proposed building shall be erected nearer than 30 feet to\nthe street line of any street and no portion of the front building\nwall need be erected more than 50 feet from such street line. In no\ncase shall any portion of a building be erected nearer than 30 feet\nto the street line of any street.[Amended 12-16-1987 by L.L. No. 9-1987]"
								}
							]
						},
						{
							"number": "F. ",
							"content": [
								{
									"text": "Rear yard. The minimum distance between the rear line of the lot\nand the rear wall of the principal building at any point shall not\nbe less than 15 feet."
								}
							]
						},
						{
							"number": "G. ",
							"content": [
								{
									"text": "Side yards. Except in the case of a corner lot, two side yards shall\nbe provided, each of which shall have the minimum width required for\nthe Residence A District."
								}
							]
						},
						{
							"number": "H. ",
							"content": [
								{
									"text": "Building area. No principal building or use, together with all accessory\nbuildings or uses, shall occupy in the aggregate more than 35% of\nthe area of the lot."
								}
							]
						},
						{
							"number": "I. ",
							"content": [
								{
									"text": "Corner lots. In the case of a corner lot there shall be two front\nyards and two rear yards; the yards at the street frontages shall\nbe the front yards, and the yards opposite them shall be the rear\nyards. Such yards shall comply with the requirements for front and\nrear yards, respectively.[Amended 5-19-2004 by L.L. No. 4-2004]"
								}
							]
						},
						{
							"number": "J. ",
							"content": [
								{
									"text": "Floor area ratio (FAR). In no case shall a dwelling be constructed\nwith an FAR in excess of 0.4.[Added 11-17-1998 by L.L. No. 5-1993]"
								}
							]
						},
						{
							"number": "K. ",
							"content": [
								{
									"text": "Floor\narea. The floor area in a building shall not exceed 8,000 square feet.[Added 2-16-2011 by L.L. No. 2-2011]"
								}
							]
						},
						{
							"number": "L. ",
							"content": [
								{
									"text": "Front\nyard lot coverage. The maximum permitted lot coverage of all paved\nareas in a front yard, including gravel and stone aggregate, shall\nnot be greater than 30% of the front yard. This shall include driveways,\nparking areas, walkways, patios and permitted encroachments.[Added 2-16-2011 by L.L. No. 2-2011]"
								}
							]
						},
						{
							"number": "M. ",
							"content": [
								{
									"text": "Rear yard\nlot coverage. The maximum permitted lot coverage of all paved areas\nin a rear yard, including gravel and stone aggregate, shall not be\ngreater than 25% of the rear yard. This shall include parking areas,\nwalkways, patios, decks, pools and permitted encroachments.[Added 2-16-2011 by L.L. No. 2-2011]"
								}
							]
						},
						{
							"number": "N. ",
							"content": [
								{
									"text": "The height\nof an accessory structure shall not exceed 16 feet.[Added 2-16-2011 by L.L. No. 2-2011]"
								}
							]
						},
						{
							"number": "O. ",
							"content": [
								{
									"text": "For all new construction and substantial improvements that exceed 40% of the existing floor area, the additional regulations in ยง 151-13.2. shall apply.[Added 2-16-2011 by L.L. No. 2-2011]"
								}
							]
						}
					]
				}
			]
		}
	]
}	