{
	"url": "http://ecode360.com/14183803",
	"paras": [
	    {
			"paragraph": "ยง 151-12",
			"title": "Residence D District.",
			"content": [
				{
					"text": "In the Residence D District, the following regulations shall\napply:"
				},
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Establishment. The Residence D District shall consist of the following\narea: Bounded on the west side by Middle Neck Road, on the north and\non the south by the Village line, on the east by the property of the\nKensington School, Nassau Drive and Park Lane (extending northerly\nto the Village line), not including the parks or islands lying within\nPark Lane, constituting Lot Nos. 1 to 65, both inclusive, in Block\nNo. 1, and Lot Nos. 1 to 38, both inclusive, in Block No. 3, all of\nBlock 17 and Lot Nos. 9 to 13, both inclusive, in Block No. 8 and\nthe boundary strips adjacent thereto, shown on a certain map entitled\n\"Amended Map No. 1 of Kensington, Great Neck, Nassau County, L. I.,\nproperty of Rickert-Finlay Realty Company, dated Dec., 1911, surveyed\nby George S. Hubbell, C.E., Flushing, Long Island,\" and filed in the\noffice of the Clerk of the County of Nassau on December 16, 1911,\nas Map No. 30."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Subdistricts. Of said Residence D District, the portion thereof situated\nwithin 100 feet of Middle Neck Road, as widened, is referred to as\n\"Subdistrict D-1,\" and the portion thereof situated more than 100\nfeet from Middle Neck Road, as widened, is referred to as \"Subdistrict\nD-2.\""
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Building Zone Map. The Building Zone Map is deemed amended accordingly."
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "Uses in Subdistrict D-1. In Subdistrict D-1, no building shall be\nerected, altered or used and no lot or premises shall be used except\nfor one or more of the following purposes:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Uses permitted in the Residence A District."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Multiple dwellings."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "The offices of a practitioner of medicine, osteopathy, physiotherapy,\ndentistry, podiatry or psychology, duly licensed under the Education\nLaw of the State of New York."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "Uses in Subdistrict D-2. In Subdistrict D-2, no building shall be\nerected, altered or used and no lot or premises shall be used except\nfor one or more of the following purposes:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Governmental and municipal purposes."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Uses accessory to the uses which may exist in Subdistrict D-1, to the extent and subject to the conditions and limitations specified in Subsection E(3) hereof."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "The conditions and limitations referred to in Subsection E(2) hereof are as follows: Trees, shrubs, vegetable ground cover, ornamental planting, landscaping, walks, steps and walls are permitted in any part of the subdistrict."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "F. ",
							"content": [
								{
									"text": "Height. No building shall be erected, altered or used which is higher\nthan three stories plus basement or higher than 35 feet, whichever\nis less. Such height shall be measured from the elevation of the curb,\nor, if there is no curb, from the elevation of the pavement of the\nstreet, computed, in either case, from the curb or the pavement, as\nthe case may be, of Park Lane nearest to the point of measurement.\nFor the purpose of this section, the terms \"basement\" and \"story\"\nshall have the definitions provided in the Multiple Residence Law."
								}
							]
						},
						{
							"number": "G. ",
							"content": [
								{
									"text": "Building area. In Subdistrict D-1 no principal building or use, together with its accessory buildings, shall occupy in the aggregate more than 60% of the plot at curb level. However, the extension of the basement or cellar area of such building beneath the existing grade of the plot, to be used only for the parking of automobiles, as required by ยง 151-13 of this chapter, shall not be considered as occupancy of the area of the plot for the purposes of this section. Such basement or cellar area, however, shall not invade the front, rear and side yard restrictions above the existing grade of the plot, as hereinafter provided in this Article."
								}
							]
						},
						{
							"number": "H. ",
							"content": [
								{
									"text": "Density. No building shall be erected, altered or used in Subdistrict\nD-1 on a plot having an area of less than 700 square feet for each\nfamily or dwelling unit for which the building is designed, used or\nintended to be used, and in no event on a plot having an area of less\nthan 10,000 square feet. In calculating density, only area actually\nin Subdistrict D-1 shall be included. The area reserved and to be\nused for professional offices in the basement of any multiple dwelling\nerected in said Subdistrict D-1 is to be excluded in making the density\ncomputation."
								}
							]
						},
						{
							"number": "I. ",
							"content": [
								{
									"text": "Front yard. No multiple dwelling shall be hereafter erected, altered\nor used which has a wall nearer than 50 feet to the street line of\nany street within the village, no front yard being required on Middle\nNeck Road. The term \"street\" shall include the entire area of the\npublicly owned property that lies between Middle Neck Road and Kensington\nGate."
								}
							]
						},
						{
							"number": "J. ",
							"content": [
								{
									"text": "Rear yard. Every building hereafter erected, altered or used shall\nhave a rear yard of a minimum depth of 15 feet."
								}
							]
						},
						{
							"number": "K. ",
							"content": [
								{
									"text": "Side yards. Two side yards shall be provided on every building plot,\nthe aggregate width of which shall be at least 35 feet. No side yard\nshall be less than 15 feet in width."
								}
							]
						},
						{
							"number": "L. ",
							"content": [
								{
									"text": "Parking spaces."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "No multiple dwelling shall be constructed, altered or used and no\napplication shall be made for a building permit for the construction\nof a multiple dwelling unless provision is made for garage space of\nsufficient size to accommodate automobiles equal in number to the\nnumber of families for which the multiple dwelling is designed, used\nor intended to be used."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Such garage space shall provide for each of such number of automobiles\na readily accessible parking space not less than nine feet by 20 feet\nin size, free from columns or other obstructions that would interfere\nwith parking, together with necessary access aisles or driveways."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Such garage space must be provided underneath the principal building or buildings in Subdistrict D-1, except as set forth in Subsection G hereof."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "Such garage space must have adequate means of ingress and egress\nto Middle Neck Road or, if permitted, to Embassy Court. Such means\nof ingress and egress shall not be used for pedestrian travel, provision\nfor which shall be made elsewhere. All access roads shall be paved\nin accordance with village specifications and shall be separated,\nby means of dividers or otherwise, from paths and sidewalks used by\npedestrians."
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "No entrance to or exit from a garage shall be permitted on Park Lane,\nBeverly Road or Nassau Drive."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "M. ",
							"content": [
								{
									"text": "Multiple residences. In addition to the provisions of the Building\nCode,[1] the construction, alteration, repair and removal of every\nmultiple dwelling or apartment house in the Village of Kensington\nshall comply with the provisions of the Building Code recommended\nby the National Board of Fire Underwriters of New York (sometimes\nknown as the \"National Code\"), the Multiple Residence Law and the\nState Building Construction Code and Manual as the same now exist\nor may hereafter be amended, whichever is the more restrictive,[2] with the following additional requirements:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "There shall be no means of access from one apartment to the balcony\nof another apartment."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "No exterior clothesline or clothespole or other device for drying\nor airing clothes, laundry, bedding or draperies shall be permitted."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "No water tank or shed or structure for the housing of elevators,\nair conditioners or other machinery shall be exposed."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "No incinerators will be permitted."
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "No septic tanks or cesspools will be permitted for the disposal of\nsanitary and household waste."
												}
											]
										},
										{
											"number": "(6) ",
											"content": [
												{
													"text": "Professional offices are permitted only on the first or ground story\nor basement as defined in the Multiple Residence Law."
												}
											]
										}
									]
								},
								{
									"footnote": "[1]\nEditor's Note: See Ch. 64, Building Construction.\n[2]\nEditor's Note: Currently, see the New York State Uniform\nFire Prevention and Building Code.\n"
								}
							]
						},
						{
							"number": "N. ",
							"content": [
								{
									"text": "Preliminary approvals. No multiple dwelling shall be constructed,\naltered or used and no application for a building permit for the construction\nor alteration of a multiple dwelling shall be issued unless the plans\nand specifications shall have been examined and approved as to type,\ndesign and exterior appearance, and unless the plans and provisions\nfor the parking, storage or garaging of the occupants' automobiles\nshall have been examined and approved as to adequacy, safety and freedom\nfrom fire hazard and as to compliance with this chapter and all other\napplicable ordinances, and unless plans for stormwater and site drainage\nhave been examined and approved as to adequacy by an architect or\nengineer appointed for the purpose by the Board of Trustees."
								}
							]
						},
						{
							"number": "O. ",
							"content": [
								{
									"text": "Fees. In addition to the fees elsewhere required upon the filing\nof an application for a building permit and the issuance of a certificate\nof occupancy, the applicant for a multiple dwelling permit shall pay\nto the village a fee to be determined in each case by the Board of\nTrustees, to pay or reimburse the village for the reasonable charges\nof an architect or engineer who may be employed by the Board of Trustees\nto examine the application for the building permit and the plans and\nspecifications submitted therewith and all amendments thereto and\nto inspect the work during and after the course of construction and\nascertain compliance with the provisions of the building permit and\nthe provisions of all applicable Village ordinances.[Amended 3-21-1990 by L.L. No. 3-1990]"
								}
							]
						},
						{
							"number": "P. ",
							"content": [
								{
									"text": "Floor area ratio (FAR). In no case shall a dwelling be constructed\nwith an FAR in excess of 0.4.[Added 11-17-1993 by L.L. No. 5-1993]"
								}
							]
						}
					]
				}
			]
		}
	]
}	