{
	"url": "https://ecode360.com/attachment/LO2927/LO2927-A.pdf",
	"paras": [
		{
			"paragraph": "ยง 9-105.5",
			"title": "Residence E District",
			"content": [
				{
					"text": "The following regulations shall apply in a Residence E District :"
				},
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Uses. Within any Residence E District as indicated on the Building Zone Map, no building or premises shall be erected or altered, used or maintained, which is intended or designed to be used in whole or in part for other than one or more of the following specified uses"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "A one-family detached house for one dwelling unit only."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "A federal, state, county, municipal or public utility building or structure, if approved by the board of appeals as hereinafter provided."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Municipal recreation building, playground or park."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "College, library, fire station or school."
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "Church or other place of worship, convent, parish house or Sunday school building."
												}
											]
										},
										{
											"number": "(6) ",
											"content": [
												{
													"text": "Accessory uses customarily incident to any use permitted by the provisions of this section."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Height. The limit of height of a building shall be not more than twenty-three (23) feet."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Front yard. There shall be a front yard, the depth of which shall be at least ten (10) feet back of the street line. In case of a corner lot, the front yard shall be required on each street on which the lot abuts. This, however, shall not prohibit the erection and maintenance of an open porch in such front yard, provided that the same be erected not closer to the front line than three (3) feet."
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "Side yard. There shall be a side yard along each side lot line and it shall be at least four (4) feet in width on each side of the building, and extend unobstructed from the front yard to the rear yard."
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "Rear yard. There shall be a rear yard on every lot and it shall be at least four (4) feet deep behind a building."
								}
							]
						},
						{
							"number": "F. ",
							"content": [
								{
									"text": "Building area. The building area shall not exceed fifty-seven (57) per cent of the lot area."
								}
							]
						},
						{
							"number": "G. ",
							"content": [
								{
									"text": "Accessory building. An accessory building for accessory uses permitted herein, including a private garage not over twelve (12) feet high."
								}
							]
						},
						{
							"number": "H. ",
							"content": [
								{
									"text": "Density. No residence shall be erected or altered to make provision for more than one family for each eighteen hundred (1 ,800) square feet of the area of the lot."
								}
							]
						},
						{
							"number": "I. ",
							"content": [
								{
									"text": "Minimum lot size. The minimum lot size shall be thirty (30) by sixty (60) feet."
								}
							]
						},
						{
							"number": "J. ",
							"content": [
								{
									"text": "Existing two-family structure. Notwithstanding any of the provisions set forth in this section, two-family dwelling structures shall be permitted in that portion of this district which is west of the center line of New York Avenue, provided that:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Said structure and use as a two-family dwelling shall have existed prior to November 4, 1970*; and"
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Said structure shall conform to the New York State Building Construction Code applicable to two-family dwellings, and to all ordinances of the City of Long Beach, and, further that a certificate of compliance shall have been obtained within six (6) months after November 4, 1970; and"
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "At least one on-site parking facility shall exist on the premises; and"
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "Separate egress shall be provided for each dwelling unit; and"
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "All setbacks and other yard and height requirements of the Residence E District shall apply."
												}
											]
										},
										{
											"number": "(6) ",
											"content": [
												{
													"text": "Except as herein provided this amendment shall not affect or impair any act done, offense committed or right accruing, accrued or acquired, or liability, penalty, forfeiture or punishment incurred prior to the time of the enactment of this subsection, but the same may be enjoyed, asserted and enforced, prosecuted or inflicted as fully and to the same extent as if such amendment had not been affected."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "K. ",
							"content": [
								{
									"text": "In the event that an existing building or structure prevents the subdivision of the plot of ground on which it stands into two (2) or more legal building plots, neither such existing building or structure, nor any part thereof, may be demolished nor destroyed to accomplish the subdivision of said plot of land into two (2) or more legal building plots."
								}
							]
						},
						{
							"number": "L. ",
							"content": [
								{
									"text": "Nothing contained in this section shall prevent the reconstruction, rebuilding, alteration of, addition to, and/or continued use of any building for which a nonconforming status has been created as a result of the change in height limitation. However, nothing in this section shall be construed to enlarge or expand any nonconforming rights created as a result of the change in height lim itation."
								}
							]
						},
						{
							"number": "M. ",
							"content": [
								{
									"text": "No property within any Residence E District shall be subdivided."
								}
							]
						},
						{
							"number": "N. ",
							"content": [
								{
									"text": "Notwithstanding any of the provisions set forth in this Section and due to the impact of Hurricane Sandy, one and two-family pre-existing dwelling structures shall be permitted provided that:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Said structures shall conform to all FEMA and New York State Building Construction Codes; and"
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "All new construction shall have at least two on-site parking spaces created where technically feasible; and"
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "All plans submitted must be approved by the Department of Buildings and shall be designed to ensure only the intended legal occupancy, i.e. one family use or pre-existing two-family use only."
												}
											]
										}
									]
								}
							]
						}
					]
				}
			]
		}
	]
}