{
	"url": "https://ecode360.com/attachment/LO2927/LO2927-A.pdf",
	"paras": [
		{
			"paragraph": "ยง 9-105.2",
			"title": "Residence C District",
			"content": [
				{
					"text": "The following regulations shall apply in a Residence C District :"
				},
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Uses. Within any Residence C District as indicated on the Building Zone Map, no building or premises shall be erected or altered, used or maintained, which is intended or designed to be used in whole or in part for other than one or more of the following specified uses:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "A one-family detached house for one dwelling unit only."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "A two-family detached house for two (2) dwelling units only."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "A federal, state, county, municipal or public utility building or structure, if approved by the board of appeals as hereinafter provided."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "Municipal recreation building, playground or park."
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "College, library, fire station or school."
												}
											]
										},
										{
											"number": "(6) ",
											"content": [
												{
													"text": "Church or other place of worship, convent, parish house or Sunday school building."
												}
											]
										},
										{
											"number": "(7) ",
											"content": [
												{
													"text": "Accessory uses customarily incident to any use permitted by the provisions of this section."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Height. The limit of height of a building shall be two (2) stories and an attic above a basement or cellar, but not over twenty-five (25) feet."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Front yard. There shall be a front yard, the depth of which shall be at least twenty (20) feet back of street line. In case of a corner lot, a front yard shall be required on each street on which the lot abuts."
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "Side yard. There shall be a side yard along each side lot line, and it shall be at least five (5) feet in width on one side and eight (8) feet in width on the other side of the building, and extend unobstructed from the front yard to the rear yard."
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "Rear yard. There shall be a rear yard on every lot and it shall be at least twenty (20) feet deep behind a building, except that first-story rear projections from the building, not exceeding fifteen (15) feet in height, may extend to within fifteen (15) feet of the rear lot line. Where a lot is more than one hundred (100) feet deep, one-half of the additionaldepth of the lot in excess of one hundred (100) feet shall be added to such rear yard depth, but in no case shall a rear yard in excess of forty (40) feet be required."
								}
							]
						},
						{
							"number": "F. ",
							"content": [
								{
									"text": "Building area. The building area shall not be less than twenty-five (25) per cent of the minimum required lot area, nor shall the building area exceed forty-five (45) per cent of the total lot area."
								}
							]
						},
						{
							"number": "G. ",
							"content": [
								{
									"text": "Accessory building. An accessory building for accessory uses permitted herein, including a private garage not over twelve (12) feet high, may occupy in the aggregate not over forty (40) per cent of the required rear yard area."
								}
							]
						},
						{
							"number": "H. ",
							"content": [
								{
									"text": "Density. No residence shall be erected or altered to make provision for more than two (2) families for each four thousand (4,000) square feet of the area of the lot."
								}
							]
						},
						{
							"number": "I. ",
							"content": [
								{
									"text": "Minimum lot size. The minimum lot size shall be forty (40) by one hundred (100) feet."
								}
							]
						},
						{
							"number": "J. ",
							"content": [
								{
									"text": "In the event that an existing building or structure prevents the subdivision of the plot of ground on which it stands into two (2) or more legal building plots, neither such existing building or structure, nor any part thereof, may be demolished nor destroyed to accomplish the subdivision of said plot of land into two (2) or more legal building plots."
								}
							]
						},
						{
							"number": "K. ",
							"content": [
								{
									"text": "Notwithstanding anything in this section to the contrary, no two-family dwelling shall be erected or occupied in the C District unless a building permit or certificate of occupancy had been issued for such two-family dwelling, or such two-family dwelling was otherwise lawful on January 1, 2000. No building permit shall be issued on or after January 1, 2000 for the construction, creation or erection of a two-family detached dwelling where the land is vacant or contains only a one-family detached dwelling."
								}
							]
						}
					]
				}
			]
		}
	]
}