{
	"url": "https://ecode360.com/attachment/LO2927/LO2927-A.pdf",
	"paras": [
		{
			"paragraph": "ยง 9-105.14",
			"title": "Residence Business A District",
			"content": [
				{
					"text": "The following regulations shall apply in a Residence Business A District :"
				},
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Uses. Within any Residence-Business A District, no building or premises shall be erected or altered, used or maintained, which is intended to be used in whole or in part for other than one or more of the following uses:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "A one-family detached house for one dwelling unit only."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "A two-family detached house for two (2) dwelling units only."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "A multiple dwelling for three (3) or more dwelling units."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "Public park, playground and municipal recreational area when authorized or operated by a municipality, public library or museum."
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "Church or other place of worship, convent, parish house."
												}
											]
										},
										{
											"number": "(6) ",
											"content": [
												{
													"text": "Other accessory uses and buildings including a private garage, not over twelve (12) feet high, used for storage of passenger vehicles provided such uses are incidental to the principal use, but such uses shall not include any activity conducted as a business."
												}
											]
										},
										{
											"number": "(7) ",
											"content": [
												{
													"text": "Retail and commercial services serving the residents of the immediate neighborhood. Such uses as specified below shall not exceed three thousand (3,000) square feet in total floor area. They shall include:Grocery and other food stores; Men's and women's clothing; Books and records;Arts and crafts;Drug stores;Gifts ;Florists;Laundry and dry cleaning pick-up; Barber and beauty shops;Branch post office; Travel agents; Bank branch;Such retail and sales and services shall, whenever possible, be located within a residential building or complex, or a hotel."
												}
											]
										},
										{
											"number": "(8) ",
											"content": [
												{
													"text": "Restaurants."
												}
											]
										},
										{
											"number": "(9) ",
											"content": [
												{
													"text": "Commercial activities serving tourists and visitors shall include thefollowing :Small restaurants, soda fountains, ice cream stores, and the like; Souvenir and gift shops;Arts and crafts."
												}
											]
										},
										{
											"number": "(10) ",
											"content": [
												{
													"text": "Hotels, on a lot containing not less than five hundred (500) square feet of ground area for each guest room or suite in the hotel."
												}
											]
										},
										{
											"number": "(11) ",
											"content": [
												{
													"text": "Bowling alleys, health studios, and similar commercial recreational and fitness activities."
												}
											]
										},
										{
											"number": "(12) ",
											"content": [
												{
													"text": "Mixed use development of a large tract of land with a variety of complementary and integrated uses, such as, but not limited to, residential, hotel, retail, public, or entertainment, in a compact urban form, subject to the approval of the City Council of the City of Long Beach as per the specific standards for mixed use development set forth below."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Height. The height of a building shall not exceed one hundred (100) feet above grade level, provided, however that the height of a one-family detached dwelling or a two-family detached dwelling constructed on or after January 1, 2000 shall not exceed twenty five (25) feet above grade level. No commercial use except a restaurant or a hotel shall be located above the lowest habitable floor of any building. For mixed use developments, the maximum height shall be one hundred and ten (110) feet above grade level."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Lot area. No multiple dwelling shall be erected or altered on a lot having an area of less than forty thousand (40,000) square feet, provided, however, that a one- family detached house for one dwelling unit only may be built upon a lot having an area of four thousand (4,000) square feet, and a two-family detached house for two (2) dwelling units only may be erected or altered on a lot having an area of six thousand (6,000) square feet. Further, no mixed use development shall be erected or altered on a lot having an area less than one hundred and fifty thousand (150,000) square feet."
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "Building area. Total building area for a multiple dwelling shall not exceed twenty (20) per cent of the total lot area, provided, however, that the total building area for a one-family detached house for one dwelling unit shall not be less than twenty-five (25) per cent of said lot area nor exceed forty-five (45) per cent of said total lot area; and, provided, further, that the total building area for a two- family detached house for two (2) dwelling units shall not be less than twenty-five (25) per cent of the total lot area nor exceed thirty-five (35) per cent of said total lot area. Additionally, the total building area for a mixed use development shall not exceed twenty-five percent (25%) of the total lot area, excluding any platform structure with covered parking and other accessory uses and certain principal uses, such as restaurants, retail shops, and catering facilities that strengthen street-level activity, of less than twenty-five (25) feet in height, which shall not be included in the twenty-five percent (25%) coverage."
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "Front yard. There shall be a front yard the depth of which shall be at least ten (10) feet from the street line or where the property fronts on the Ocean Beach Park, the depth of which shall be at least twenty (20) feet from the property line. In case of a corner lot, the front yard shall be required on each street on which the lot abuts. In the event the property line abuts on the Ocean Beach Park and a street, or is a through lot abutting two (2) streets, a front yard shall be required on each. Front yards shall be defined as those yards abutting the Ocean Beach Park, Shore Road, and Broadway. As to mixed use developments located adjacent to Ocean Beach Park, if significant portions of the lot area, as determined by the City Council of the City of Long Beach, are used to provide public areas, adjacent to, and at or above the existing Boardwalk level: the required front yard, where the property fronts Ocean Beach Park, may be reduced to zero (0) feet. For purposes of this provision, public areas shall be defined as parks, plazas, playgrounds, walkways, and other recreational areas and open spaces; significant view-sheds; and other features where the public is directly or indirectly drawn to visit or permitted to congregate within the mixed use development."
								}
							]
						},
						{
							"number": "F. ",
							"content": [
								{
									"text": "Side yards. There shall be a side yard along each side lot line equal to not less than one-half the height of the principal building on the lot nearest to the lot line. In addition, open yards, unobstructed except as specified in this subsection, shall be provided from the front lot line to the rear lot line through not less than seventy (70) per cent of the width of the lot on which the principal buildings are erected. These yards may be between principal buildings and side lot lines, and between principal buildings. No buildings, structures or uses may occupy such yards except the following:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Off-street parking facilities, including structures meeting all other city regulations and extending not more than twelve (12) feet above grade level. However, no off-street parking shall be permitted within fifteen (15) feet of any side lot line."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Swimming pools and other recreation facilities incident to a residential building on the same lot, including cabanas and other related facilities meeting all other city regulations, and extending not more than twelve (12) feet above grade level."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Ornamental landscaping and areas for passive recreation."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "Other uses or structures otherwise complying with all city ordinances and deemed by the building commissioner to be in accordance with the purposes of this section. Notwithstanding any of the provisions of this section, the first fifteen (15) feet immediately adjacent to the property line, running from the front lot line to the rear lot line, shall remain open and unobstructed.As to a one-family detached house for one dwelling unit, or a two-family detached house for two (2) dwelling units, there shall be a side yard along each side lot line, which shall be at least five (5) feet in width on one side and eight (8) feet in width on the other side of the building. All side yards shall extend unobstructed and unencumbered above grade level from the front yard to the rear yard. There shall be no parking of motor vehicles in side yards. As to mixed use developments located adjacent to Ocean Beach Park, if significant portions of the lot area, as determined by the City Council of the City of Long Beach, are used to provide public areas, adjacent to, and at or above the existing Boardwalk level: the required open yards shall be reduced to not less than sixty (60%) percent of the width of the lot on which the principal buildings are erected; there shall only be required a side yard along each side lot line, which shall be at least fifteen (15) feet on each side; and, accessory buildings including parking structures, that meet all other city regulations, may occupy such open yards, provided they extend not more than twenty-five (25) feet above grade level. All side yards shall extend unobstructed and unencumbered above grade level from the front yard to the rear yard."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "G. ",
							"content": [
								{
									"text": "Rear yards. There shall be a rear yard in every lot and it shall be at least twenty (20) feet deep."
								}
							]
						},
						{
							"number": "H. ",
							"content": [
								{
									"text": "Distance between buildings. There shall be a minimum distance between principal buildings on the same lot equal to the average of the heights of the two (2) buildings. The minimum distance between a principal building and any accessory building shall be fifteen (15) feet.No row of one-family or two-family attached buildings shall exceed three (3)buildings and shall not be greater than seventy-five (75) feet in length. There shall be a minimum of twenty (20) feet between one row of attached buildings and another row of attached buildings. As to mixed use development, there shall be a minimum distance between the principal buildings on the same lot equal to one-half ( 1/2) the average of the heights of the two (2) buildings."
								}
							]
						},
						{
							"number": "I. ",
							"content": [
								{
									"text": "Density. No multiple dwelling shall be erected or altered to make provision for more than one dwelling unit per six hundred (600) square feet of lot area. Habitable floor area in each dwelling unit shall be not less than four hundred (400) square feet.No one-family or two-family attached dwellings shall be erected to make provision for more than one family for each one thousand (1,000) square feet of the area of the lot.No one-family dwelling shall be erected to make provision for more than one family for each four thousand (4,000) square feet of the area of the lot nor shall a two- family dwelling be erected to make provision for more than two (2) families for each six thousand (6,000) square feet of the area of the lot."
								}
							]
						},
						{
							"number": "J. ",
							"content": [
								{
									"text": "Recreation areas. No multiple dwelling units shall be erected without providing for a minimum area for recreation and children's play areas at a ratio of fifty (50) square feet for each dwelling unit, provided, however, that off-street parking areas shall not be included in the computation of the areas required to be furnished for recreational purposes."
								}
							]
						},
						{
							"number": "K. ",
							"content": [
								{
									"text": "Off-street parking areas. A paved off-street parking area shall be provided at a ratio of one and one-quarter (1.25) spaces for each studio dwelling unit; one and one-half (1 .5) spaces for each one-bedroom dwelling unit; and two (2) spaces for each dwelling unit of two (2) bedrooms and more. In no case shall the total off- street parking provided comprise less than one and three-quarter (1.75) parking spaces for each dwelling unit. In the case of multiple dwellings containing more than ten (10) units, twenty-five (25) per cent of required off-street parking facilities may be provided off-site, but in no event shall be located more than five hundred (500) feet from the parking generator.Off-street parking for commercial establishments shall be provided in accordance with the off-street parking regulations as set forth in subsection 9-112 of this ordinance."
								}
							]
						}
					]
				}
			]
		}
	]
}