{
	"url": "https://ecode360.com/attachment/LO2927/LO2927-A.pdf",
	"paras": [
		{
			"paragraph": "ยง 9-105.6",
			"title": "Residence EE District",
			"content": [
				{
					"text": "The following regulations shall apply in a Residence EE District :"
				},
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Uses. Within any Residence EE District as indicated on the Building Zone Map, no building or premises shall be erected or altered, used or maintained, which is intended or designed to be used in whole or in part for other than one or more of the following specified uses:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "A one-family detached house for one dwelling unit only."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "A federal, state, county, municipal or public utility building or structure, if approved by the board of appeals as hereinafter provided."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Municipal recreation building, playground or park."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "College, library, fire station or school."
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "Church or other place of worship, convent, parish house or Sunday school building."
												}
											]
										},
										{
											"number": "(6) ",
											"content": [
												{
													"text": "Accessory uses customarily incident to any use permitted by the provisions of this section."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Height. The limit of height of a building shall be two (2) stories and an attic above a basement or cellar, but not over twenty (20) feet."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Front yard. There shall be a front yard, the depth of which shall be at least five (5) feet back of the street line. In case of a corner lot, a front yard shall be required on each street on which the lot abuts."
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "Side yard. There shall be a side yard along each side lot line and it shall be at least twenty (20) feet in width on each side of the building, and extend unobstructed from the front yard to the rear yard."
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "Rear yard. There shall be a rear yard on every lot and it shall be at least four (4) feet deep behind the building."
								}
							]
						},
						{
							"number": "F. ",
							"content": [
								{
									"text": "Building area. The building area shall not be less than thirty (30) per cent of the minimum required lot area, nor shall the building area exceed forty-three (43) per cent of the total lot area."
								}
							]
						},
						{
							"number": "G. ",
							"content": [
								{
									"text": "Accessory building. An accessory building for accessory uses permitted herein, including a private garage not over twelve (12) feet high."
								}
							]
						},
						{
							"number": "H. ",
							"content": [
								{
									"text": "Density. No building shall be erected or altered to make provision for more than one family for each four thousand five hundred-sixty (4,560) square feet of the area of the lot."
								}
							]
						},
						{
							"number": "I. ",
							"content": [
								{
									"text": "Minimum lot size. The minimum lot size shall be eighty (80) by fifty-seven (57) feet."
								}
							]
						},
						{
							"number": "J. ",
							"content": [
								{
									"text": "Existing two-family structure. Notwithstanding any of the provisions set forth in this section, two-family dwelling structures are to be permitted in that portion of this district which lies south of Walnut Street between Roosevelt and Maple Boulevard, provided that"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Said structure and use as a two-family dwelling shall have existed prior to November 4, 1970; and"
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Said structure shall conform to the New York State Building Construction Code applicable to two-family dwellings, and to all ordinances of the City of Long Beach, and, further, that a certificate of compliance shall have been obtained within six (6) months after November 4, 1970; and"
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "At least one on-site parking facility shall be provided on the premises; and"
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "Separate egress shall be provided for each dwelling unit; and"
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "All setbacks and other yard and height requirements of the Residence EE District shall apply."
												}
											]
										},
										{
											"number": "(6) ",
											"content": [
												{
													"text": "Except as herein provided, this amendment shall not affect or impair any act done, offense committed or right accruing, accrued or acquired, or liability, penalty, forfeiture or punishment incurred prior to the time of the enactment of this subsection, but the same may be enjoyed, asserted and enforced, prosecuted or inflicted as fully and to the same extent as if such amendment has not been affected."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "K. ",
							"content": [
								{
									"text": "Where an owner is permitted to subdivide pursuant to this section, the following requirements shall be adhered to:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Side yards. The side yards on each side lot line must be at least five (5) feet in width on one side of the building and at least eight (8) feet in width on the other side of the building and extend unobstructed from the front yard to the rear yard."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Building area. The building area shall not be less than forty (40) per cent of the minimum lot area nor shall the building area exceed fifty-seven (57) per cent of the total lot area."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Density. No building shall be erected or altered to make provision for more than one family for each two thousand two hundred and eighty (2,280) square feet of the area of the lot."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "Lot size. The minimum lot size shall be forty (40) by fifty-seven (57) feet."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "L. ",
							"content": [
								{
									"text": "Nothing contained in this section shall prevent the reconstruction, rebuilding, alteration of, addition to, and/or continued use of any building for which a nonconforming status has been created as a result of the change in the minimum lot size, increase in side-yard requirements or change in height limitation. However, nothing in this section shall be construed to enlarge or expand any nonconforming rights created as a result of the change in the minimum lot size, increase in side-yard requirements or change in height limitation."
								}
							]
						},
						{
							"number": "M. ",
							"content": [
								{
									"text": "Nothing contained in this section shall prevent the construction of a one-family detached house for one dwelling unit only within a Residence EE District on a plot of land at least forty (40) by fifty-seven (57) feet and less than eighty (80) by fifty-seven (57) feet which is vacant and not part of a larger parcel of land at the time of the adoption of this section, provided that such one-family detached house has one side yard at least five (5) feet in width and one side yard at least eight (8) feet in width, unobstructed from the front yard to the rear yard, and does not exceed twenty (20) feet in height."
								}
							]
						}
					]
				}
			]
		}
	]
}