{
	"url": "https://ecode360.com/attachment/LO2927/LO2927-A.pdf",
	"paras": [
		{
			"paragraph": "ยง 9-105.10",
			"title": "Residence H District",
			"content": [
				{
					"text": "The following regulations shall apply in a Residence H District :"
				},
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Uses. Within any Residence H District as indicated on the Building Zone Map, no building or premises shall be erected or altered, used or maintained, which is intended or designed to be used in whole or in part for other than one or more of the following specified uses:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "A one-family detached house for one dwelling unit only."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "A two-family detached house for two (2) dwelling units only."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "A multiple dwelling for three (3) or more dwelling units."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "Public park, playground and municipal recreational area when authorized or operated by a municipality, public library or museum."
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "Church or other place of worship, convent, parish house."
												}
											]
										},
										{
											"number": "(6) ",
											"content": [
												{
													"text": "Other accessory uses and buildings including a private garage, not over fifteen (15) feet high, used for storage of passenger vehicles provided such uses are incidental to the principal use, but such uses shall not include any activity conducted as a business."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Height. The limit of height of a building shall be three (3) stories above a basement or cellar, but not over thirty-five (35) feet above grade level."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Lot area. No multiple dwelling shall be erected or altered on a lot having an area of less than ten thousand (10,000) square feet, provided, however, that a one- family detached house for one dwelling unit only may be built upon a lot having an area of four thousand (4,000) square feet and a two-family detached house for two (2) dwelling units only may be erected or altered on a lot having an area of six thousand (6,000) square feet."
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "Building area. Total building area for a multiple dwelling, including garage space, shall not exceed thirty-five (35) per cent of the total lot area, provided, however, that the total building area for a one-family detached house for one dwelling unit shall not be less than twenty-five (25) per cent of said lot area nor exceed forty- five (45) per cent of said total lot area; and, provided, further, that the total building area for a two-family detached house for two (2) dwelling units shall not be less than twenty-five (25) per cent of the total lot area nor exceed thirty-five (35) per cent of said total lot."
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "Front yard. There shall be a front yard of at least ten (10) feet. In case of a corner lot, a front yard shall be required on each street on which the lot abuts."
								}
							]
						},
						{
							"number": "F. ",
							"content": [
								{
									"text": "Side yard. As to a one-family detached house for one dwelling unit, or a two- family detached house for two (2) dwelling units, there shall be a side yard along each side lot line, which shall be at least five (5) feet in width on one side and eight (8) feet in width on the other side of the building.As to a multiple dwelling, there shall be a side yard along each side lot line and itshall be at least fifteen (15) feet in width.All side yards shall extend unobstructed and unencumbered above grade level from the front yard to the rear yard. There shall be no parking of motor vehicles in front and/or side yards."
								}
							]
						},
						{
							"number": "G. ",
							"content": [
								{
									"text": "Rear yard. There shall be a rear yard on every lot and it shall be at least twenty (20) feet deep behind the building. Where a lot is more than one hundred (100) feet deep, one-half of the additional depth of the lot in excess of one hundred (100) feet shall be added to such rear yard depth, but in no case shall a rear yard depth in excess of thirty (30) feet be required."
								}
							]
						},
						{
							"number": "H. ",
							"content": [
								{
									"text": "Distance between buildings. There shall be a minimum of twenty-five (25) feet between principal buildings erected on the same lot or plot and a distance of at least fifteen (15) feet between the principal building and any accessory building. No row of one-family or two-family attached buildings shall exceed three (3) buildings and shall not be greater than seventy-five (75) feet in length. There shall be a minimum of twenty (20) feet between one row of attached buildings and another row of attached buildings."
								}
							]
						},
						{
							"number": "I. ",
							"content": [
								{
									"text": "Density. No multiple dwelling shall be erected or altered to make provision for more than one family for each one thousand (1,000) square feet of the area of the lot. No multiple dwelling shall contain more than twelve (12) dwelling units nor shall a multiple dwelling hereafter be erected or altered in which the minimum habitable floor area for each dwelling unit is less than four hundred (400) square feet."
								}
							]
						},
						{
							"number": "J. ",
							"content": [
								{
									"text": "Recreation areas. No multiple dwelling units shall be erected without providing for a minimum area for recreation and children's play areas at a ratio of fifty (50) square feet for each dwelling unit, provided, however, that off-street parking areas shall not be included in the computation of the areas required to be furnished for recreational purposes."
								}
							]
						},
						{
							"number": "K. ",
							"content": [
								{
									"text": "Off-street parking areas. A paved off-street parking area shall be provided at a ratio of one and one-quarter (1.25) spaces for each studio dwelling unit; one and one-half (1 .5) spaces for each one-bedroom dwelling unit; and two (2) spaces for each dwelling unit of two (2) bedrooms and more. In no case shall the total off- street parking provided comprise less than one and three-quarter (1.75) parking spaces for each dwelling unit. In the case of a multiple dwelling containing more than ten (10) units, twenty-five (25) per cent of required off-street parking facilities may be provided off-site, but in no event shall be located more than five hundred (500) feet from the parking generator."
								}
							]
						}
					]
				}
			]
		}
	]
}