{
	"url": "https://ecode360.com/attachment/LO2927/LO2927-A.pdf",
	"paras": [
		{
			"paragraph": "ยง 9-105.9",
			"title": "Residence G District",
			"content": [
				{
					"text": "The following regulations shall apply in a Residence G District :"
				},
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Uses. Within any Residence G District as indicated on the Building Zone Map, no building or premises shall be erected or altered, used or maintained, which is intended or designed to be used in whole or in part for other than one or more of the following specified uses:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "A one-family detached house for one dwelling unit only."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "A federal, state, county, municipal or public utility building or structure, if approved by the board of appeals as hereinafter provided."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Municipal recreation building, playground or park."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "College, library, fire station or school."
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "Church or other place of worship, convent, parish house or Sunday school building."
												}
											]
										},
										{
											"number": "(6) ",
											"content": [
												{
													"text": "Accessory uses customarily incident to any use permitted by the provisions of this section."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Height. The limit of height of a building shall be two (2) stories and an attic above a basement or cellar, but not over twenty-five (25) feet."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Front yard. There shall be a front yard of at least ten (10) feet. In case of a corner lot, a front yard shall be required on each street on which the lot abuts."
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "Side yard. There shall be a side yard along each side lot line, and it shall be at least five (5) feet in width on one side and eight (8) feet in width on the other side of the building, and extend unobstructed from the front yard to the rear yard."
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "Rear yard. There shall be a rear yard on every lot and it shall be at least fifteen (15) feet deep behind a building."
								}
							]
						},
						{
							"number": "F. ",
							"content": [
								{
									"text": "Building area. No building or structure erected shall occupy more than fifty-five (55) per cent of the area of the lot."
								}
							]
						},
						{
							"number": "G. ",
							"content": [
								{
									"text": "Accessory building. An accessory building for accessory uses permitted herein, including a private garage not over twelve (12) feet high, may occupy in aggregate not over fifty (50) per cent of the required rear yard area."
								}
							]
						},
						{
							"number": "H. ",
							"content": [
								{
									"text": "Density. No building shall be erected or altered to make provision for more than one family for each five thousand eight hundred (5,800) square feet of the area of the lot."
								}
							]
						},
						{
							"number": "I. ",
							"content": [
								{
									"text": "Minimum lot size. The minimum lot size shall be forty (40) by one hundred forty- five (145) feet. Nothing contained in this section shall prevent the reconstruction, rebuilding,alteration of, addition to, and/or continued use of any building for which a nonconforming status is created as the result of the change in the minimum lot size or increase in side yard requirements. Nothing in this section shall be construed to enlarge or expand any existing nonconforming rights. Construction of one-family, detached houses. Nothing contained in this section shall prevent the construction of a one-family, detached house for one dwelling unit only within a Residence "G" District on a plot of land at least twenty (20) feet by one hundred forty-five (145) feet and less than forty (40) feet by one hundred forty-five (145) feet which is vacant and not part of a larger parcel of land at the time of the adoption of this subsection, provided that such one-family, detached house does not exceed twenty-five (25) feet in height and has side yards of at least three (3) feet in width on either side unobstructed from the front yard to the rear yard."
								}
							]
						},
						{
							"number": "J. ",
							"content": [
								{
									"text": "Existing two-family structure. Notwithstanding any of the provisions set forth in this section, two-family dwelling structures are to be permitted in that portion of this district which lies west of the center line of New York Avenue, provided that:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Said structure and use as a two-family dwelling shall have existed prior to June 8, 1971; and"
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Said structure shall conform to the New York State Building Construction Code applicable to two-family dwellings, and to all ordinances of the City of Long Beach, and, further, that a certificate of compliance shall have been obtained within thirty (30) days after June 8, 1971; and"
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "At least one on-site parking facility shall be provided on the premises; and"
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "Separate egress shall be provided for each dwelling unit; and"
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "All setbacks and other yard and height requirements of the Residence G District shall apply."
												}
											]
										},
										{
											"number": "(6) ",
											"content": [
												{
													"text": "Except as herein provided, this amendment shall not affect or impair any act done, offense committed or right accruing, accrued or acquired, or liability, penalty, forfeiture or punishment incurred prior to the time of the enactment of this subsection, but the same may be enjoyed, asserted, enforced, prosecuted or inflicted as fully and to the same extent as if such amendment had not been affected."
												}
											]
										}
									]
								}
							]
						}
					]
				}
			]
		}
	]
}