{
	"url": "http://www.kpsearch.com/DF/Villageofislandpark-n/03162017ord%2051_1-1.pdf",
	"paras": [
		{
			"paragraph": "§ 4",
			"title": "RESIDENTAL A DISTRICT(Residence District)",
			"content": [
				{
					"text": "The following regulations shall apply:"
				},
				{
					"content": [
						{
							"number": "1. ",
							"content": [
								{
									"text": "In this district, no building or primises shal ! be used and no bu i !ding sha 1 l be e rected or a I tered, wh i ch i s arranged, intended or designed to be used for other than one or more of the following specified uses:"
								},
                                {
                                	"content": [
                                		{
                                			"number": "(a) ",
                                			"content": [
                                				{
                                					"text": "one famiy dwelling. (Amendment enacted May 21, 1969, )"
                                				}
                                			]
                                		},
                                		{
                                			"number": "(b) ",
                                			"content": [
                                				{
                                					"text": "Public school, parochia school or private school recognized by or under the jurisdiction of the State of New York, public library, churches upon issuance of a special permit as provided in Article X, Section 24, (Amendment enacted August 14, 1969. )"
                                				}
                                			]
                                		},
                                		{
                                			"number": "(c) ",
                                			"content": [
                                				{
                                					"text": "Municipal playground or park."
                                				}
                                			]
                                		},
                                		{
                                			"number": "(d) ",
                                			"content": [
                                				{
                                					"text": "Farming, gardening, nursery or greenhouse, provided it is not for commercial purposes."
                                				}
                                			]
                                		},
                                		{
                                			"number": "(e) ",
                                			"content": [
                                				{
                                					"text": "Usual accessory uses which are necessary to the above uses when located in the same building or upon the same lot."
                                				}
                                			]
                                		},
                                		{
                                			"number": "(f) ",
                                			"content": [
                                				{
                                					"text": "Repealed August 18, i966. "
                                				}
                                			]
                                		},
                                		{
                                			"number": "(g) ",
                                			"content": [
                                				{
                                					"text": "Repealed October 10, 1974."
                                				}
                                			]
                                		},
                                		{
                                			"number": "(h) ",
                                			"content": [
                                				{
                                					"text": "Hospitals and nursing homes. No such use, however, shall be established or permitted on a parcel of and less than 3/ acres i n area or with dess than 375 feet frontage, nor shall any part or portion of such use be permitted closer than 20 feet to any adjourning structure. (Amendment enacted June 2, 1966.)"
                                				}
                                			]
                                		}
                                	]
                                }
							]
						},
						{
							"number": "2. ",
							"content": [
								{
									"text": "In this district no building or premises shall be used and no building shall be erected or altered which is arranged, intended or designed to be used for any of the following specified uses:"
								},
								{
                                	"content": [
                                		{
                                			"number": "(a) ",
                                			"content": [
                                				{
                                					"text": "Cemeteries or Crematories."
                                				}
                                			]
                                		},
                                		{
                                			"number": "(b) ",
                                			"content": [
                                				{
                                					"text": "Clinics or dispensaries including but not limited to drug addiction or abuse centers or clinics. (Amended August 1, 1969. )"
                                				}
                                			]
                                		},
                                		{
                                			"number": "(c) ",
                                			"content": [
                                				{
                                					"text": "Clubs, except as such are ordinarily a part of church work."
                                				}
                                			]
                                		},
                                		{
                                			"number": "(d) ",
                                			"content": [
                                				{
                                					"text": "Repealed June 2, 1966."
                                				}
                                			]
                                		},
                                		{
                                			"number": "(e) ",
                                			"content": [
                                				{
                                					"text": "Repealed June 2, 1966."
                                				}
                                			]
                                		},
                                		{
                                			"number": "(f) ",
                                			"content": [
                                				{
                                					"text": "Kindergarten, nursery or private school when carried on as a business or on a commercial basis and when not recognized by or under the jurisdiction of the Department of Education of the State of New York."
                                				}
                                			]
                                		},
                                		{
                                			"number": "(g) ",
                                			"content": [
                                				{
                                					"text": "Mortuary undertaking or embalming par lor or similar plant or an office for such establishment or business."
                                				}
                                			]
                                		},
                                		{
                                			"number": "(h) ",
                                			"content": [
                                				{
                                					"text": "Philanthropic or charítable institutions."
                                				}
                                			]
                                		},
                                		{
                                			"number": "(i) ",
                                			"content": [
                                				{
                                					"text": "Public or private hospitals or other places or buildings where persons suffering from Tental or other diseases of any kind whatsoever are kept or treated except this shall not prohhbit a doctor in his own office, when conducted with in a dwelling from making diagnosis or treating patients ."
                                				}
                                			]
                                		},
                                		{
                                			"number": "(j) ",
                                			"content": [
                                				{
                                					"text": "A home for animals or in which animals are boarded or a hospital or place where animals are boarded, treated, cared for or sold."
                                				}
                                			]
                                		},
                                		{
                                			"number": "(k) ",
                                			"content": [
                                				{
                                					"text": "There is prohibited în Residential A Districts all uses prohibited in the following districts: Residential AA Districts, Residential AAA, Business District, Light Manufacturing or indus trai District:"
                                				}
                                			]
                                		}
                                	]
                                }
							]
						},
						{
							"number": "3. ",
							"content": [
								{
									"text": "No Billboards, signboards, or advert is ing signs sha | f be a lowed upon the building or premises in this district except upon the permit issued by the Board of Trustees, and except that a small sign showing the premises to be for rental or sa le may be used, provided such sign sha it be at least ten (10) feet back from the street line and does not exceed four (4) square feet in size."
								}
							]
						},
						{
							"number": "4. ",
							"content": [
								{
									"text": "No dwelling shall be erected on a lot that has less than sixty (60) feet frontage. In the case of a lot held in single and separate ownership at the effective date of this amendment having a frontage of less than sixty (60) feet, a dwelling may be built thereon when authorized as a special exception by the Board of Appeas. Each dwe l b ing must have ä separate tot area of at least 6,000 square feet in case of a one family dwelling there shall be not less than 900 square feet of living space above the foundation in case of a two family dwelling there sha be not less than 900 square feet of living space for the first dwelling unit and not less than 500 square feet of living space for the second dwelling unit. In the case of a two fami ly dwel i i ng authorized as a special exception on a lot having less than 40 feet frontage, the first dwelling unit may have not less than 750 square feet of living space and the second dwelling unit may have not less than 500 square feet of iiwi ng space. Each such dwell ing authorized as a special exception may have a lot area of not less than 4,000 square feet. A but dings, including accessory buildings shall not cover more than 35 per cent of the area of the iot. (Amendment enacted June 2, 1962.)"
								}
							]
						},
						{
							"number": "5. ",
							"content": [
								{
									"text": "No building shall be raised, altered or erected în this District that exceeds two (2) stories or twenty seven (27) feet in height, except a church, school or library which shall not exceed sixty five (65) feet in he fight. In the case. of a lot held in single and separate ownership at the effective date of this ordinance with less than the required frontage or area the height shall not exceed one (1) story or twenty two (22) feet in height."
								}
							]
						},
						{
							"number": "6. ",
							"content": [
								{
									"text": "No building or part thereof shall be erected oraltered in this district that is nearer the street line upor, which i ti fronts thar the average setback of the two existng buildings adjoining the lot on each side with the same block and the same use district. When all lots on any side of a block are vacant no street wall of a building need be set nearer than twenty five (25) feet to the street line. In no event shall any building or portion of a building be less than fifteen (15) feet from the street line. On corner lots the set-back distance from the street line other than the street upon which the building front shall be not less than fifteen (15) feet. (Amendment enacted December 16, 1976.)"
								}
							]
						},
						{
							"number": "7. ",
							"content": [
								{
									"text": "Two side yards, one on each side of the building, the aggregate widths of which shall be at least sixteen (16) feet are required. Neither side yard shall be less than (6) feet. The following encroachments are permitted: cornices, eaves, gutters or chimneys projecting not more than eighteen (18), inches. (Amendment enacted December 16, 1976.)"
								}
							]
						},
						{
							"number": "8. ",
							"content": [
								{
									"text": "A rear yard equal to a minimum of twenty five (25) percent of the depth of the lot shall be required on each lot. in no case shall the depth of the rear yard be less than fifteen (15) feet. (Amendment enacted Dec. 16, 1978.)"
								}
							]
						},
						{
							"number": "9. ",
							"content": [
								{
									"text": "Accessory buildings may occupy forty percent (40%) of the required area of the rear yard up to an average height of twelve (12) feet. The yard area occupied by such accessory building shall, however, be included in computing the maximum percentage of the lot area which may be built upon, No accessory buildding shall be nearer any front property line than forty-five (45) feet and must be at least two (2) feet from the rear and side property lines. (Amendment enacted December 16, 1976.) Section 10. No accessory buildings, including garages, shall be hereafter altered so that any part thereof shall contain a room or rooms designed for dwelling purposes."
								}
							]
						}
					]
				}
			]
		}
	]
}