{
	"url": "http://ecode360.com/9299478",
	"paras": [
		{
			"paragraph": "§ 70-3.16",
			"title": "Purpose.",
			"content": [
				{
					"text": "A Planned Waterfront Residential Community (PWRC)\nis established to promote and protect the public health, safety, property\nvalues and general welfare of the Town of North Hempstead, and to\ncreate the flexibility which is necessary to achieve environmentally\nsensitive, economically beneficial and socially desirable development\non waterfront properties. The general comprehensive planning goals\nfor this district are to:"
				},
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Promote the most appropriate, desirable, and suitable\nuse of land on sites which are unique due to size and waterfront location,\nand to preserve open space consistent with orderly development of\na site."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Regulate development in such a way as to help preserve\nthe Town of North Hempstead's limited water supply and its surface\nwaters and other aquatic and natural habitat."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Allow for reasonable economic uses of land, consistent\nwith the planning goals for this district."
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "Encourage innovation and flexibility in the design\nand development of waterfront property for residential use, while\nensuring that potential environmental impacts and other adverse impacts\nare minimized."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 70-3.17",
			"title": "Definitions.",
			"content": [
				{
					"text": "The following definitions shall apply in this\narticle:"
				}
			]
		},
		{
			"paragraph": "§ 70-3.18",
			"title": "Application of provisions.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "The provisions of this article shall apply in a Planned\nWaterfront Residential Community."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "A Planned Waterfront Residential Community is permitted\nonly along a waterfront."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Applications for alterations or new construction within\na Planned Waterfront Residential Community shall include a detailed\nwritten description of the proposed work."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 70-3.19",
			"title": "Permitted uses.",
			"content": [
				{
					"text": "A building may be erected, altered or used,\nand a lot or premises may be used, for any of the purposes set forth\nin this article and for no other:"
				},
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "All uses permitted in the R-O-S District."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Single-family dwellings on individual lots."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Multiple-unit development."
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "Clustered development."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 70-3.20",
			"title": "Conditional uses.",
			"content": [
				{
					"text": "A building may be erected, altered or used as an accessory structure or building when authorized by the Board of Zoning and Appeals pursuant to the provisions of Article XXIV, and for no other, subject to the limitations set forth in § 70-3.28."
				}
			]
		},
		{
			"paragraph": "§ 70-3.21",
			"title": "Height.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "No dwelling unit shall exceed two stories, with a\nmaximum building height of 26 feet."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "In no case shall the height of any dwelling unit exceed\nthe maximum height permitted by the Building Codes of the State of\nNew York."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 70-3.22",
			"title": "Minimum lot areas.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "The minimum aggregate lot area for a Planned Waterfront\nResidential Community shall be seven acres."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "The minimum lot area per dwelling unit for single\nfamily dwellings on individual lots, or for clustered developments,\nshall be 8,500 square feet."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "The minimum aggregate lot area per dwelling unit for\nmultiple-unit developments shall be 7,500 square feet."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 70-3.23",
			"title": "Parking requirements.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Parking shall be provided on site at a rate of two parking spaces per dwelling unit, and shall be provided in accordance with the requirements of § 70-103 unless otherwise stated in this section."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "No parking shall be permitted within any required\nyard or setback."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Unpaved parking areas may be permitted, subject to site plan approval in accordance with § 70-219."
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "Landbanked parking as defined in § 70-231 may be permitted, subject to the following restrictions:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Landbanked parking shall be limited to a maximum of\n30% of the required parking."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Landbanked parking shall be identified on a site plan\nand shall be maintained as landscaped area or open green space, or\nshall be preserved in its natural state."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "No structure shall be erected in any designated landbanked\nparking area."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "Landbanked parking shall not be located within any\nrequired yard or setback."
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "Landbanked parking shall be subject to approval by\nthe Board of Zoning and Appeals."
												}
											]
										},
										{
											"number": "(6) ",
											"content": [
												{
													"text": "Development of parking previously permitted as landbanked\nparking may be required as determined by the Board of Zoning and Appeals."
												}
											]
										}
									]
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 70-3.24",
			"title": "Lot coverage.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "The lot coverage of all buildings within a Planned\nWaterfront Residential Community, including any accessory structure\nor building, shall be as follows:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "For single-family dwellings on individual lots, the\nlot coverage shall not exceed 25% of the lot area."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "For multiple-unit developments, the lot coverage shall\nnot exceed 12% of the lot area."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "For clustered developments, the lot coverage shall\nnot exceed 15% of the lot area."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Coverage by paved areas, roads and parking shall be\nlimited to 15% of the lot area."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 70-3.25",
			"title": "Floor area.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "In a multiple-unit development, all dwelling units\nmust comply with the following gross floor area limitations:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "No building for residential occupancy shall be erected\nunless it has a gross floor area of at least 500 square feet."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "The gross floor area of any dwelling unit shall not\nexceed 1,500 square feet."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "In a development of single-family dwellings on individual\nlots, or in a clustered development, all units must comply with the\nfollowing gross floor area limitations:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "No dwelling unit shall be erected unless it has a\ngross floor area of at least 1,200 square feet."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "The gross floor area of a dwelling unit shall not\nexceed 36% of the lot area."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "The gross floor area of a dwelling unit shall not\nexceed 4,000 square feet."
												}
											]
										}
									]
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 70-3.26",
			"title": "Required yards and setbacks.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "For single-family dwellings on individual lots, the required yards and setbacks shall be as defined in Article IV of this chapter pertaining to the Residence A District."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "For multiple-unit developments, there shall be a minimum\ndistance to any property line of 35 feet for any new development."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "For clustered developments, minimum yard and setback\nrequirements shall be established pursuant to site plan approval,\nbut in no case shall it be less than 35 feet unless otherwise approved\nby the Board of Zoning and Appeals."
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "No building or structure shall be built within 25\nfeet of a Special Flood Hazard Area."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 70-3.27",
			"title": "Distances between buildings on same lot.",
			"content": [
				{
					"text": "For all new construction, and for any additions\nor alterations to existing structures in:"
				},
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Multiple-unit developments:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "The minimum distance between side walls of buildings\nor structures shall comply with the requirements of the Building Codes\nof the State of New York, but in no case shall the distance between\nbuildings for new construction be less than five feet."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "The minimum distance from the front of a building\nto any part of another building or structure shall be 20 feet."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Clustered developments:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "The distance between buildings shall be established during and pursuant to site plan review and approval in accordance with § 70-219."
												}
											]
										}
									]
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 70-3.28",
			"title": "Accessory structures and buildings.",
			"content": [
				{
					"text": "Notwithstanding any other provision of Chapter 70 of this Code, no accessory building or structure in a multiple unit development or a clustered development shall be permitted in a required yard or setback."
				}
			]
		},
		{
			"paragraph": "§ 70-3.29",
			"title": "Occupancy.",
			"content": [
				{
					"text": "No dwelling unit shall be occupied unless it\nis insulated, heated, and has potable water and septic connections\nin compliance with § 70-3.30."
				}
			]
		},
		{
			"paragraph": "§ 70-3.30",
			"title": "Sanitary drainage/sewage disposal.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "No dwelling unit shall be constructed, altered, or\nexpanded unless it is connected to a septic system or sanitary sewer\nwith adequate capacity, as approved by the Department of Health and\nthe Building Department."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "For alterations or new construction which increases\nthe preexisting gross floor area of a Planned Waterfront Residential\nCommunity, an analysis of the capacity and utilization of the sewage\ndisposal system shall be included with the application for alteration\nor new construction unless the development is connected to a municipal\nsewer system. Such analysis shall be prepared by a qualified licensed\nprofessional and shall include the number and type of fixtures and\nthe effluent flow per fixture."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "No alteration shall be approved without adequate sewage\ndisposal availability."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 70-3.31",
			"title": "Nonconforming buildings, structures and premises.",
			"content": [
				{
					"text": "The area and dimensions of a building, structure\nor premises existing at the effective date of rezoning pursuant to\nthis chapter which has been legally authorized by a building or other\npermit issued by the Building Department prior thereto, may be maintained\nsubject to site plan approval."
				}
			]
		},
		{
			"paragraph": "§ 70-3.32",
			"title": "Required reviews.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "The Building Commissioner or his/her representative\nshall have the right to inspect all common areas and exterior surfaces\nwithin a Planned Waterfront Residential Community for conformance\nwith all applicable codes, ordinances and regulations."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Any area for which rezoning as a Planned Waterfront Residential Community is sought shall be subject to site plan review and approval in accordance with § 70-219."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Any development or alteration within a Planned Waterfront Residential Community affecting, in an individual instance or cumulatively, more than 10% of the lot area shall be subject to site plan review and approval in accordance with § 70-219."
								}
							]
						}
					]
				}
			]
		}
	]
}