{
	"url": "http://ecode360.com/9299444",
	"paras": [
		{
			"paragraph": "§ 70-3.1",
			"title": "Applicability.",
			"content": [
				{
					"text": "The provisions of this article shall apply in\na Residential Open Space District."
				}
			]
		},
		{
			"paragraph": "§ 70-3.2",
			"title": "Permitted uses.",
			"content": [
				{
					"text": "A building may be erected, altered or used and\na lot or premises may be used for any of the purposes set forth in\nthis article and for no other."
				},
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "One single-family detached dwelling per each 2.5 acres.\nMore than one single-family detached dwelling shall be permitted on\nlots larger than 2.5 acres, provided that if said larger lot is subdivided,\nit would in all respects comply with the provisions of this article."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Professional office of a doctor, dentist, lawyer, teacher, artist, architect, engineer, accountant, ophthalmic dispenser or musician, provided that the office is located in the dwelling in which said professional person resides. The provisions of § 70-231 shall apply to this article, except that a professional office may not occupy more than 15% of the habitable floor space of the first floor of a single-family dwelling. A professional nameplate shall be permitted pursuant to the provisions of § 70-196A."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Church or other building used exclusively for religious\npurposes.[Added 8-26-1986 by L.L. No. 9-1986]"
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "Outdoor pool, as set forth in § 70-102.[Added 4-28-1987 by L.L. No. 10-1987]"
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "Uses carried out by not-for-profit, charitable, eleemosynary,\neducational or governmental entities, or international organizations\nprimarily within enclosed buildings. Uses permitted under this subsection\nshall be limited to conferences, retreats, and other such gatherings\nintended to bring about the improvement of the human condition and\npromote international cooperation.[Added 3-12-2002 by L.L. No. 2-2002]"
								}
							]
						},
						{
							"number": "F. ",
							"content": [
								{
									"text": "A caretaker unit, as defined in § 70-231, located within a building or on a property designated on the National Register of Historic Places, State Register of Historic Places or designated as an individual landmark under Chapter 27 of this Code and having a portion of the building accessible to the public.[Added 9-10-2013 by L.L. No. 4-2013]"
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 70-3.3",
			"title": "Conditional uses.",
			"content": [
				{
					"text": "A building may be erected, altered or used and a lot or premises may be used for any of the purposes set forth in this article authorized by the Board of Zoning and Appeals, pursuant to the provisions of Article XXIV, and for no other:"
				},
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Mother-daughter residence, as defined in § 70-231.[Amended 4-28-1987 by L.L. No. 10-1987; 7-29-2008 by L.L. No. 7-2008; 9-22-2008 by L.L. No.\n9-2008]"
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Tennis courts."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Accessory structures or buildings."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 70-3.4",
			"title": "Height.",
			"content": [
				{
					"text": "No new building construction shall exceed 2 1/2\nstories, with a maximum height of 30 feet."
				}
			]
		},
		{
			"paragraph": "§ 70-3.5",
			"title": "Minimum plot area.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "No dwelling or other building shall be constructed\non a lot containing an area of less than 108,900 square feet (2.5\nacres), with a minimum width of 150 feet at the required front setback\nline and a minimum width of 60 feet from and on the street line to\nthe front setback line."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "A minimum of 380 acres is required for any uses authorized in § 70-3.2E.[Added 3-12-2002 by L.L. No. 2-2002]"
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 70-3.6",
			"title": "Lot coverage.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "The lot coverage, including tennis courts, swimming\npools and any other accessory buildings or structures, shall not exceed\n15% of the lot area."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "For any uses authorized in § 70-3.2E, the lot coverage of all buildings and paved areas shall not exceed 6%."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 70-3.7",
			"title": "Floor area.",
			"content": [
				{
					"text": "No dwelling shall be erected unless it has a\nhabitable floor area on the first floor of at least 2,000 square feet."
				}
			]
		},
		{
			"paragraph": "§ 70-3.8",
			"title": "Front yard.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "There shall be a front yard, the depth of which shall\nnot be less than 75 feet from the front property line."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "On a corner lot, a front yard shall be required on\neach street, each with a depth not less than 75 feet."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 70-3.9",
			"title": "Side yards.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "On an interior lot, a single-family dwelling shall\nhave two side yards, one on each side of the main building, each with\na width not less than 60 feet."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "On a corner lot, a single-family dwelling shall have only one side yard. Said yard shall be on the side adjoining the interior lot opposite the front yard having the greater street frontage. Said side yard shall have a minimum width of 60 feet. The two yards fronting on the streets shall be considered front yards as provided under § 70-3.8A and B. The remaining yard shall be considered the rear yard and shall conform to the provisions of § 70-3.10."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 70-3.10",
			"title": "Rear yard.",
			"content": [
				{
					"text": "There shall be a rear yard, the depth of which\nshall not be less than 50 feet from all buildings, tennis courts,\nswimming pools or other accessory buildings or structures."
				}
			]
		},
		{
			"paragraph": "§ 70-3.11",
			"title": "Depth of lot.",
			"content": [
				{
					"text": "No lot shall have a depth of less than 250 feet.\nOn a corner plot the depth shall be measured from the front yard with\nthe narrower width."
				}
			]
		},
		{
			"paragraph": "§ 70-3.12",
			"title": "Accessory structures and buildings.",
			"content": [
				{
					"text": "Notwithstanding any other provision of Chapter 70 of this Code, no accessory building and/or structure shall be permitted in a front or side yard; every accessory building shall be not less than 50 feet distant from the rear lot line and 75 feet distant from the side lot lines."
				}
			]
		},
		{
			"paragraph": "§ 70-3.13",
			"title": "Utilities.",
			"content": [
				{
					"text": "Overhead or aboveground installations of utility\nlines, wires and cables, including electric, gas, telephone, cable\ntelevision and water servicing any lot shall be prohibited."
				}
			]
		},
		{
			"paragraph": "§ 70-3.14",
			"title": "Parking requirements.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Parking shall be required in accordance with the requirements set forth in § 70-103."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "For any uses authorized in § 70-3.2E, a designated parking area to accommodate a minimum of 50 parking spaces must be provided on site for each building primarily containing meeting and conference rooms.[Added 3-12-2002 by L.L. No. 2-2002]"
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 70-3.15",
			"title": "Buffers.\n                                                                                          [1]",
			"content": [
				{
					"text": "For any uses authorized in § 70-3.2E, a perimeter buffer of at least 100 feet shall be maintained on all sides. No new structures may be erected within required buffers."
				},
				{
					"footnote": "[1]\nEditor's Note: Former § 70-3.15,\nFloor area ratio (FAR), added 2-19-1991 by L.L. No. 5-1991, as amended\n9-22-1992 by L.L. No. 7-1992, was repealed 12-14-1999 by L.L. No.\n14-1999.\n"
				}
			]
		}
	]
}