{
	"url": "http://ecode360.com/9299879",
	"paras": [
		{
			"paragraph": "§ 70-65",
			"title": "Application of provisions.",
			"content": [
				{
					"text": "The provisions of this article shall apply in\na Multiple Residence District."
				}
			]
		},
		{
			"paragraph": "§ 70-66",
			"title": "Permitted uses.",
			"content": [
				{
					"text": "A building may be erected, altered or used and\na lot or premises may be used for any of the purposes set forth in\nthis article and for no other:"
				},
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "All permitted uses set forth in Article VII applicable to R-D Districts."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Multiple dwelling conforming to the provisions of\nthe Multiple Dwelling Law, as amended from time to time, and to the\nprovisions of this article."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Clubhouse, fraternity house or lodge."
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "All buildings and uses permitted in this article with the exception of those provided in § 70-54B and C of Article VII, shall conform to the provisions of Article VI applicable to R-C Districts."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 70-67",
			"title": "Conditional uses.",
			"content": [
				{
					"text": "A building may be erected, altered or used and a lot or premises may be used for any of the purposes set forth in this article when authorized by the Board of Zoning and Appeals pursuant to the provisions of Article XXIV and for no other:"
				},
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "All conditional uses set forth in Article III applicable to R-AA Districts, Article IV applicable to R-A Districts and Article VI applicable to R-C Districts."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "All buildings and uses, as permitted in this article shall conform to the provisions of Article VI applicable to R-C Districts."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Senior citizen facilities, including the following.\nA single building may contain any combination of the senior citizen\nfacilities listed below."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Senior independent-living facilities."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Senior congregate-living facilities."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Senior assisted-living facilities."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "Senior day-care facilities."
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "Senior day-care facilities shall provide means\nfor the drop off and pickup of clients in a manner which does not\ninterfere with the orderly flow of traffic."
																}
															]
														}
													]
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "Accessory uses. Senior citizen facilities and nursing\nhomes may contain or provide uses necessary to and customarily incidental\nto such facilities where such uses are limited to use by residents,\ntheir guests and employees, as follows:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "In independent-living, congregate-living and assisted-living\nfacilities:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "Community/meeting rooms."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "Workshops/arts and crafts rooms."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "Library."
																}
															]
														},
														{
															"number": "(d) ",
															"content": [
																{
																	"text": "Convenience retail, barber and beauty shops;\nsnack bar and gift shop."
																}
															]
														},
														{
															"number": "(e) ",
															"content": [
																{
																	"text": "Outdoor passive and active recreation space."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "In congregate-living and assisted-living facilities:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "Dining rooms."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "In assisted-living facilities and nursing homes:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "Medical offices, limited to use by residents,\nwith no exterior signs or access."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "Physical therapy rooms, limited to use residents,\nwith no exterior signs or access."
																}
															]
														}
													]
												}
											]
										}
									]
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 70-68",
			"title": "Height.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "No multiple dwelling shall exceed three stories, with\na maximum height of 45 feet."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "In the case of a building other than one used for\ndwelling purposes, no building or part thereof shall exceed three\nstories, with a maximum height of 45 feet, except a church spire or\nbelfry."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "In the case of a building containing senior citizen\nfacilities, no building or part thereof shall exceed three stories\nwith a maximum height of 45 feet."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 70-69",
			"title": "Plot area or density of population for senior citizen facilities.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "No multiple dwelling shall contain more than 24 apartments\nto house 24 families on a site of less than one acre."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "The minimum lot area for multiple dwellings shall\nbe 1,500 square feet per family."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Where a multiple dwelling, senior citizen facility or nursing home is erected on a lot abutting a residence district of higher classification, a minimum side and/or rear yard of 25 feet abutting said district will be required, which shall be landscaped and maintained in accordance with § 70-203G and H."
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "Buildings containing the following senior citizen\nfacilities and nursing homes shall be constructed on lots containing\nthe following area dimensions:"
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "For buildings containing more than one senior citizen\nfacility, a composite total of 32 units per acre shall be permitted,\nwith each use assessed at the following rate:"
								}
							]
						},
						{
							"number": "F. ",
							"content": [
								{
									"text": "A 25% density bonus shall be available for senior\nindependent-living facilities where such units are made available\nas affordable senior citizen facilities."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 70-69.1",
			"title": "Buffer area.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "A ten-foot landscaped buffer shall be required along\nside and rear lot lines of any new primary structure, except where\nthe new structure is erected on a lot abutting a residence district\nof higher classification, in which case a minimum buffer of 25 feet\nis required abutting said district.[Amended 4-12-2011 by L.L. No. 7-2011]"
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Within twenty-five-foot required buffers, the planting\nstrip shall provide for two rows of coniferous material six feet tall\non seven-foot centers. Within ten-foot required buffers a single row\nof six-foot tall coniferous material shall be provided."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "The required buffers shall be maintained in accordance with § 70-203G and H."
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "Landbanked parking may be located within a required buffer in accordance with the limitations set forth in § 70-70B."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 70-70",
			"title": "Parking requirements.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "The provisions of § 70-103 shall apply to the Multiple Residence District."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Landbanked parking as defined in § 70-231 may be permitted within the required buffer for senior independent-, congregate- and assisted-living facilities, subject to the following restrictions:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Landbanked parking shall be limited to 40% of the\nrequired parking."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Landbanked parking shall be indicated as such on the\nsite plan and shall be maintained as landscaped or open green space."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "No structure shall be erected in any designated landbanked\narea."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "Landbanked parking shall be located a minimum of 15\nfeet from any property line abutting a residence district."
												}
											]
										}
									]
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 70-71",
			"title": "Lot coverage.",
			"content": [
				{
					"text": "The lot coverage shall not exceed 35% of the\nlot area, with a minimum distance between front and rear walls of\n50 feet and 20 feet between building end walls."
				}
			]
		},
		{
			"paragraph": "§ 70-72",
			"title": "Recreational area.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "For other than senior citizen facilities, a minimum\narea shall be provided for outdoor recreation with a ratio of 100\nsquare feet for each dwelling unit."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "A minimum of 80 square feet per dwelling unit of indoor\ncommon amenity space other than dining space shall be provided for\nsenior citizen facilities. A minimum of 50 square feet of common outdoor\nactive and passive recreation and open space shall be provided per\ndwelling unit for senior citizen facilities."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 70-73",
			"title": "Basement apartments.",
			"content": [
				{
					"text": "No basement apartments shall be permitted in\nany multiple dwelling or senior citizen facility other than one such\napartment for the use of the superintendent, custodian or other person\nin charge of the maintenance of such dwelling."
				}
			]
		},
		{
			"paragraph": "§ 70-74",
			"title": "Floor area.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Multiple dwellings shall provide habitable floor area\nof not less than 600 square feet per family (per dwelling unit), except\nin the case of efficiency (no-bedroom) apartments in government-subsidized\ndevelopments where the floor area of said efficiency apartment shall\nbe not less than 400 square feet."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Senior citizen facilities."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Buildings containing the following senior citizen\nfacilities shall have the following minimum and maximum gross habitable\nfloor areas per unit:"
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "In buildings containing more than one facility, maximum\npermitted floor area shall be calculated based on the sum of the separate\nfloor areas for each type of facility."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "In senior independent-, congregate- and assisted-living\nfacilities, a minimum of 40% of the dwelling units shall be one-bedroom\nunits. No dwelling unit shall contain more than two bedrooms."
												}
											]
										}
									]
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 70-75",
			"title": "Front yard.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Unless the main building on the lot is controlled by § 70-75C, there shall be a front yard, the depth of which shall not be less than 25 feet."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "On a corner lot, a front yard shall be required on each street and, unless the building is controlled by § 70-75C, the front yard on the narrower street frontage shall be not less than 25 feet in depth, and the other front yard shall be not less than 20 feet in depth: and if the street frontages are equal, a minimum front yard of 25 feet in depth shall be required on each street front."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "No front yard shall be required for properties located\nwithin the New Cassel Urban Renewal Overlay District.[Amended 4-12-2011 by L.L. No. 7-2011; 7-10-2012 by L.L. No.\n11-2012; 3-31-2015 by L.L. No. 3-2015]"
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 70-76",
			"title": "Side yards.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "On an interior lot, a multiple dwelling, senior citizen\nfacility or nursing home shall have two side yards, one on each side\nof the main building, each of which shall be not less than 20 feet\nin width from the front line to the rear lot line."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Where multiple dwellings, senior citizen facility\nor nursing homes are grouped on the same lot or plot, the unobstructed\nopen spaces between the exterior walls of such buildings shall be\nnot less than 30 feet."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "On a corner lot, a multiple dwelling, senior citizen facility or nursing home shall have only one side yard. Said yard shall be on the side adjoining the interior lot opposite the front yard having the greater street frontage. Said side yard shall have a minimum width of 20 feet. The two yards fronting on streets shall be considered front yards as provided under § 70-75B. The remaining yard shall be considered the rear yard and shall conform to the provisions of § 70-77."
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "Where a garage door(s) faces a side property line,\na setback of 25 feet shall be provided between the side property line\nand the closest point of the garage structure.[Added 1-3-2006 by L.L. No. 1-2006]"
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "An areaway may extend into the required side yard,\nprovided that, for any areaway projecting closer than four feet to\na side property line, the entire areaway must be protected by a horizontal\ngrating constructed in conformance with the requirements of the Building\nCode.[Added 1-3-2006 by L.L. No. 1-2006]"
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 70-77",
			"title": "Rear yard.",
			"content": [
				{
					"text": "In the case of a multiple dwelling, senior citizen\nfacility or nursing home, there shall be a rear yard the depth of\nwhich shall be not less than 20 feet."
				}
			]
		},
		{
			"paragraph": "§ 70-77.1",
			"title": "Design features in senior citizen facilities.",
			"content": [
				{
					"text": "All senior citizen facilities shall be designed\nto meet the special needs of senior citizens and at a minimum shall\ncontain the following:"
				},
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "A call button monitoring or equivalent system within\neach dwelling unit for emergency calls to on- or off-site emergency\npersonnel."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Exterior access, at a minimum of two locations, without\nsteps."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Grab bars in all tub and shower stalls."
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "Corridor length and design to facilitate wayfinding."
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "Elevators required for access to all units above the\nfirst story."
								}
							]
						},
						{
							"number": "F. ",
							"content": [
								{
									"text": "Non-skid floors."
								}
							]
						},
						{
							"number": "G. ",
							"content": [
								{
									"text": "Handle-type spigots and doorknobs."
								}
							]
						},
						{
							"number": "H. ",
							"content": [
								{
									"text": "In all rooms, doors of sufficient width to accommodate\nwheelchairs."
								}
							]
						},
						{
							"number": "I. ",
							"content": [
								{
									"text": "Separation of vehicular circulation drive from pedestrian\nwalks."
								}
							]
						},
						{
							"number": "J. ",
							"content": [
								{
									"text": "Changes in grade on walk systems to be accomplished\nby ramps."
								}
							]
						},
						{
							"number": "K. ",
							"content": [
								{
									"text": "Passenger drop-off for occupants and visitors near\nentrance and elevator halls of buildings."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 70-78",
			"title": "Sewage disposal.",
			"content": [
				{
					"text": "No multiple dwelling, senior citizen facility\nor nursing home shall be permitted unless provided with municipal\nsewerage or unless an independent sewage disposal plan, approved by\nthe Nassau County Department of Health and/or Town of North Hempstead\nBuilding Department, is constructed for the sanitary disposal of the\nsewage of such buildings."
				}
			]
		},
		{
			"paragraph": "§ 70-99",
			"title": "Application of provisions.\n                                                                                          [1]",
			"content": [
				{
					"text": "Accessory buildings or structures, temporary\nuses and encroachments, conforming to the provisions of this article,\nare permitted in any residential district."
				},
				{
					"footnote": "[1]\nEditor's Note: Former § 70-99, Accessory buildings, was redesignated as § 70-100.1 10-8-1996 by L.L. No. 25-1996.\n"
				}
			]
		},
		{
			"paragraph": "§ 70-100",
			"title": "(Reserved).\n                                                                                          [1]",
			"content": [
				{
					"footnote": "[1]\nEditor's Note: Former § 70-100, Accessory structures, was redesignated as § 70-100.2 10-8-1996 by L.L. No. 25-1996.\n"
				}
			]
		},
		{
			"paragraph": "§ 70-100.1",
			"title": "Accessory buildings.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Accessory buildings and/or structures, except as otherwise provided\nin this article, shall be located in the rear yard, not be over 15\nfeet in height at their highest point and shall not occupy more than\n40% of the area of the rear yard. The yard area occupied by an accessory\nbuilding or structure shall be included in computing the maximum coverage."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Unless otherwise provided in this article, accessory buildings and/or\nstructures located in the rear yard shall be not less than three feet\ndistant from the rear and side lot lines."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Unless otherwise provided in this article, accessory buildings and/or structures on corner lots 100 feet or less in depth shall be located as far as possible from the front property lines and shall conform to the provisions of § 70-100.1A and B."
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "No accessory building or structure, with the exception of fences\nwhich are four feet in height or retaining walls, shall be erected\nwithin 25 feet of a building used for residence purposes on an adjoining\nlot in Residence AAA or AA Districts, within 20 feet in Residence\nA or B Districts or within 15 feet in all other residence districts."
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "No accessory building or structure shall be erected in a rear yard, the area of which is not sufficient to permit compliance with the requirements of § 70-100.1A to D, inclusive."
								}
							]
						},
						{
							"number": "F. ",
							"content": [
								{
									"text": "A private detached garage accessory to a dwelling on the same lot or plot may be erected in a side yard and may be extended into the rear yard a distance of 1/2 the length of the garage, provided that the width of the lot is sufficient to permit compliance with the side yard requirements in the particular district and § 70-100.1D and § 700-100.1K."
								}
							]
						},
						{
							"number": "G. ",
							"content": [
								{
									"text": "On a corner lot, a private detached garage accessory to a dwelling on the same lot or plot may be erected in the rear yard, provided that the depth of the lot is sufficient to permit compliance with the provisions of § 70-100.1A to D, and provided that the setback of such garage complies with the front yard requirements in the particular district."
								}
							]
						},
						{
							"number": "H. ",
							"content": [
								{
									"text": "On a corner lot, a private detached garage may be erected in the\nfront yard; provided, however, that the yard between said garage and\nthe street property line complies with minimum front yard requirements\nas established for the main building, and provided further that there\nis compliance with the side yard and rear yard requirements of this\nsection and requirements as to distance from the main building on\nan adjoining lot as required by this section, and provided further\nthat said garage shall not be erected in front of or extended beyond\nthe front of the main building."
								}
							]
						},
						{
							"number": "I. ",
							"content": [
								{
									"text": "A private garage may be erected within or as a part of the main building\nor may be attached to the main building by means of a permanent roof,\nand said garage shall not be considered an accessory building. Unless\na private garage is so connected to the main building it shall be\nconsidered an accessory building and shall conform to the requirements\nfor accessory buildings."
								}
							]
						},
						{
							"number": "J. ",
							"content": [
								{
									"text": "No permit shall be issued for the construction of an accessory building\nupon any vacant lot unless such permit includes the construction of\nthe principal building on said lot, and the owner or applicant shall\nnot begin construction of the accessory building until the construction\nof the principal building has proceeded to the first-floor beams."
								}
							]
						},
						{
							"number": "K. ",
							"content": [
								{
									"text": "Where the entrance to a detached garage faces a side property line,\na minimum setback of 25 feet shall be provided between the side property\nline and the closest point of the garage structure."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 70-100.2",
			"title": "Accessory structures.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Fencing within residence districts shall:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Not, if in existence under a Town permit on May 7, 1996, be\naffected by the following provisions of this subsection, except that\nif repairs to more than 50% of such a fence are required, the repaired\nfence shall comply with this subsection."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Not be located, at any point, in the area between a public or\nprivate street and the nearest effective building line. For the purposes\nof this subsection only:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "The term \"building line\" shall mean a straight line continuing\nthe line established by an exterior wall of a residential structure\nto the point where it intersects a property line;"
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "The term \"effective building line\":"
																},
																{
																	"content": [
																		{
																			"number": "[1] ",
																			"content": [
																				{
																					"text": "In the case of a lot having frontage on only one street, shall\nnot include that portion of a building line which lies between the\nresidential structure and the street."
																				}
																			]
																		},
																		{
																			"number": "[2] ",
																			"content": [
																				{
																					"text": "In the case of a lot having frontage on two or more intersecting\nstreets shall include all of the building line."
																				}
																			]
																		}
																	]
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "The term \"exterior wall\" does not include the side of an entranceway\nor a porch;"
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Be constructed with the dressed side facing the street or adjacent\nproperty."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "Not exceed four feet in height, except that:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "A six-foot fence shall be permitted:"
																},
																{
																	"content": [
																		{
																			"number": "[1] ",
																			"content": [
																				{
																					"text": "Where a residential district immediately abuts a business or\nindustrial district."
																				}
																			]
																		},
																		{
																			"number": "[2] ",
																			"content": [
																				{
																					"text": "Where a residential property immediately abuts a road maintained\nby the State of New York or by Nassau County and the main entrance\nof the dwelling on said residential property does not face the said\nroad."
																				}
																			]
																		},
																		{
																			"number": "[3] ",
																			"content": [
																				{
																					"text": "Where a residential property immediately abuts property dedicated\nas parkland by the State of New York, by the County of Nassau, by\nthe Town of North Hempstead, by one of the Town of North Hempstead's\npark districts or by an incorporated village, or where a residential\nproperty abuts a Nassau County recharge basin."
																				}
																			]
																		},
																		{
																			"number": "[4] ",
																			"content": [
																				{
																					"text": "In connection with a swimming pool when required by § 70-102C."
																				}
																			]
																		},
																		{
																			"number": "[5] ",
																			"content": [
																				{
																					"text": "Along the rear property line."
																				}
																			]
																		}
																	]
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "A five-foot fence shall be permitted along the side property\nlines but in no case shall it extend forward of the front building\nline."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "These provisions shall not apply to hedges, privets, trees or other shrubbery which are not limited in height, except as provided in § 70-203C."
																}
															]
														}
													]
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Dangerous fencing."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "In no case shall barbed wire, spikes, chipped glass, electricity or similar materials or devices be used in conjunction with or as part of any fence. No fence shall be permitted which is expressly designed with the intent to injure or malign anyone who attempts to climb such a fence. The exceptions to this rule are certain types of fences listed in § 70-100.2B(2)."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Barbed wire or electric fences."
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "A fence which is seven feet high with a barbed wire, razor wire\nor spiked top or an electric shock fence which would not be detrimental\nto the health, safety or welfare of any person coming into contact\nwith it may be permitted in the industrial districts, upon issuance\nof a conditional use permit by the Board of Zoning and Appeals:"
																},
																{
																	"content": [
																		{
																			"number": "[1] ",
																			"content": [
																				{
																					"text": "Where it can be demonstrated that the fence is needed to prevent\nentry to an area which could be hazardous to the health, safety or\nwelfare of a person or persons."
																				}
																			]
																		},
																		{
																			"number": "[2] ",
																			"content": [
																				{
																					"text": "Where, in the Board's opinion, other reasons are presented\nwhich, in the general community interests or interests of national\nsafety, justify the need for such a fence."
																				}
																			]
																		}
																	]
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "Where such fences are permitted, the fact that they are either\nbarbed or electrified shall be clearly indicated on the fences at\nintervals of not more than 25 feet."
																}
															]
														}
													]
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "(Reserved)"
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "Stationary outdoor fireplaces shall be at least 10 feet distant from\nside and rear property lines and shall not exceed five feet in height."
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "Pools shall not exceed two feet in depth, except when in compliance with the provisions of § 70-102C(2)(b), and no such pools shall be constructed, except in compliance with the regulations of the Nassau County Department of Health and unless provided with a drain or outlet to permit the same to be emptied."
								}
							]
						},
						{
							"number": "F. ",
							"content": [
								{
									"text": "Pergolas shall not exceed 10 feet in height."
								}
							]
						},
						{
							"number": "G. ",
							"content": [
								{
									"text": "Portable sheds shall not exceed 100 square feet and shall be located\nonly in the rear yard not less than three feet from any property line."
								}
							]
						},
						{
							"number": "H. ",
							"content": [
								{
									"text": "No accessory structure or building shall be erected upon the premises for the purpose of containing air-conditioning equipment, ventilating fans and appurtenances thereto; such air-conditioning equipment, ventilating fans and appurtenant equipment shall be contained within the confines of the main building or upon the roof thereof. In the alternative, a central air-conditioning unit of five tons or less may be installed in the rear or side yard when the outer face of the unit is not less than three feet from the side and rear property lines but in no case shall such unit be located more than three feet from the subject dwelling. A central air-conditioning unit may be located in a front yard provided it complies with § 70-101H. Central air-conditioning units located less than five feet from a property lot line or located in the front yard must be screened from view from adjoining properties and the street by evergreen plantings or fencing in compliance with § 70-100.2."
								}
							]
						},
						{
							"number": "I. ",
							"content": [
								{
									"text": "Other accessory structures not mentioned herein shall be located in accordance with the requirements for accessory buildings as provided in § 70-100.1A to G."
								}
							]
						},
						{
							"number": "J. ",
							"content": [
								{
									"text": "Parabolic satellite dish antennas with a diameter greater than three\nfeet, designed to receive or transmit signals from space satellites,\nshall be deemed accessory structures for the purposes of this section.\nProvisions of § 70-100.IC, D and E shall apply to the installation\nof use of dish antennas. In addition, the following provisions shall\nfurther limit and regulate the installation and use of dish antennas:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Dish antennas shall only be permitted in rear yards; there shall\nbe no more than one dish antenna per plot."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Subject to the provisions of § 70-100.1A, a dish antenna shall not occupy more than 20% of the rear yard in which it is situated; no part of the dish antenna shall be located any closer than 10 feet to the side or rear lot line or any closer to said line than the distance which is equal to the height of the antenna plus six feet, whichever is greater."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "No part of the dish antenna, except for footings, foundations\nor buried wire, shall be located below ground level; the natural grade\nof the ground shall not be raised for the purpose of installing a\ndish antenna."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "Dish antennas shall be screened from adjoining lots and roadways\nby a completely planted visual barrier consisting of evergreen plantings,\nthe height of which, after planting, is at least equal to the height\nof the dish antennas."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "K. ",
							"content": [
								{
									"text": "Generators and aboveground fuel tanks shall be permitted only in\nthe side and rear yard so long as the outer face of the generator\nor fuel tank is not less than five feet from the side and rear property\nlines but in no case shall such generator or fuel tank be located\nmore than five feet from the subject dwelling."
								}
							]
						},
						{
							"number": "L. ",
							"content": [
								{
									"text": "Light piers or decorative piers shall be permitted in the front yard\nof a dwelling, subject to the following:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "A maximum of four light piers or decorative piers are permitted."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "A residential property with a circular driveway may have one\npier installed on each side of both driveway entrances."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Piers shall be a maximum of two feet in any horizontal dimension\nwith a maximum height of three feet."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "M. ",
							"content": [
								{
									"text": "Arbors not exceeding eight feet in height and five feet in any horizontal\ndimension shall be permitted in a side yard within a line of fencing\nor other barrier. No more than one arbor shall be permitted in any\nside yard per line of fencing or other barrier separating yards."
								}
							]
						},
						{
							"number": "N. ",
							"content": [
								{
									"text": "A maximum of one freestanding flagpole, not exceeding 20 feet in\nheight, shall be permitted in the front yard of any residential property.\nA flagpole must be set back from all property boundaries a distance\nwhich is at least equal to the height of the pole. For purposes of\nthis code, a \"flagpole\" shall mean a pole that is professionally manufactured\nfor the purpose of displaying flags. Makeshift structures, or manufactured\npoles that have become structurally unsafe, shall not be considered\na flagpole."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 70-100.3",
			"title": "Permitted temporary use regulations.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Garage sales. Garage sales shall be allowed in residential zoning\ndistricts without a permit, subject to the following conditions:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Not more than four garage sales of up to three consecutive days\neach per calendar year may be conducted per property."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Garage sales shall be held during daylight hours only."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Any signage must comply with Article XXI of this chapter."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "For the purpose of this article, the term(s) used herein are defined\nas follows:"
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 70-101",
			"title": "Permitted encroachments.",
			"content": [
				{
					"text": "Encroachments into required yards are permitted in the residential\ndistricts as provided in this article only."
				},
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Cornices and eaves shall project not more than 18 inches, gutters\nnot more than eight inches and chimneys not more than 18 inches; bay\nwindows shall be not more than eight feet in width and shall project\nnot more than 24 inches into any required yard; belt courses and sills\nshall project not more than six inches."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "One-story open porches and terraces shall project not more than five\nfeet into a required front yard."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "A one-story enclosed vestibule not greater than eight feet in width\nand five feet in depth may extend into a required front yard, provided\nthat said vestibule shall conform in architecture and material to\nthe main building."
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "No encroachment which is permitted to extend into any yard or court\nif unroofed or unenclosed shall thereafter be enclosed in whole or\nin part, either permanently or temporarily."
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "(Reserved)"
								}
							]
						},
						{
							"number": "F. ",
							"content": [
								{
									"text": "In any case, where the Board of Appeals has diminished a required\nyard by variance, none of the foregoing encroachments shall be permitted\nin such diminished yard."
								}
							]
						},
						{
							"number": "G. ",
							"content": [
								{
									"text": "Steps extending into a minimum yard will not be considered an encroachment\ninto such yard, provided that such steps do not exceed in height the\nfirst floor level of the building, and provided further that such\nsteps are necessary to provide access to a walk, porch, terrace or\nvestibule."
								}
							]
						},
						{
							"number": "H. ",
							"content": [
								{
									"text": "A central air-conditioning unit shall not project more than five\nfeet into a required front yard. The average front yard setback shall\nnot be considered when determining the required front yard setback\nfor the purposes of locating air-conditioning units in a front yard."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 70-102",
			"title": "Outdoor pools.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Outdoor pools, as defined in Subsection B of this section, may be installed in any district where permitted only as an accessory structure to a residence for the private families and guests or as accessory to a nursery school or day camp, provided that the approval of the Nassau County Department of Health is first obtained and, further, only in conformity with the provisions of this section."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "\"Outdoor pool\" shall, for the purpose of this chapter,\nbe construed to mean a swimming pool, tank, depression or excavation\nin any material, dike or berm which is constructed, erected, excavated\nor maintained which will cause the retaining of water to a greater\ndepth than 24 inches (hereinafter referred to as a \"pool\") or having\na larger plane surface area of water greater than 100 square feet.[Amended 7-9-1991 by L.L. No. 10-1991]"
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "No swimming pool shall be installed or maintained\nas authorized in the preceding subsections except on the following\nconditions:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Such pool shall be installed in the rear yard of the\npremises."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Anything in this chapter to the contrary notwithstanding,\nthere shall be erected and maintained a six-foot-high solid wood,\nsolid vinyl, vertical wrought iron fence with spacing no more then\nfour inches apart, or similar product, with the finished side facing\nthe adjoining properties and the street or a chain link fence complying\nwith the requirements set forth in the current New York State Uniform\nFire Prevention and Building Code. No pool fencing shall extend forward\nof the rear building lines of the dwelling. Such fence shall only\nbe installed after obtaining the necessary permits.[Amended 7-9-1991 by L.L. No. 10-1991; 4-1-1997 by L.L. No. 8-1997; 5-18-2010 by L.L. No.\n5-2010; 7-10-2012 by L.L. No. 11-2012]"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "The fence enclosing the pool shall comply with\nthe following;"
																},
																{
																	"content": [
																		{
																			"number": "[1] ",
																			"content": [
																				{
																					"text": "The fence shall be at least six feet in height\nand shall have a maximum vertical clearance to grade of two inches."
																				}
																			]
																		},
																		{
																			"number": "[2] ",
																			"content": [
																				{
																					"text": "The fence shall be constructed so as not to\nprovide footholds."
																				}
																			]
																		},
																		{
																			"number": "[3] ",
																			"content": [
																				{
																					"text": "Vertical members shall extend above the upper\nhorizontal bar."
																				}
																			]
																		},
																		{
																			"number": "[4] ",
																			"content": [
																				{
																					"text": "A wall of a dwelling is permitted to serve as\npart of the enclosure, in accordance with the provisions of the current\nNew York State Uniform Fire Prevention and Building Code."
																				}
																			]
																		},
																		{
																			"number": "[5] ",
																			"content": [
																				{
																					"text": "The enclosure is permitted only within the rear\nyard and may include equipment accessory to pool use."
																				}
																			]
																		},
																		{
																			"number": "[6] ",
																			"content": [
																				{
																					"text": "The fence shall fully comply with the New York State Uniform Fire\nPrevention and Building Code with regard to openings and member spacing."
																				}
																			]
																		}
																	]
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "Exemptions."
																},
																{
																	"content": [
																		{
																			"number": "[1] ",
																			"content": [
																				{
																					"text": "Aboveground pools with at least 46 inches between pool decking or pool top and adjoining grade are exempt from the fencing requirements of Subsection C(2)(a)[1] through [5], provided that their access ladders or steps shall be capable of being secured, locked or removed to prevent access."
																				}
																			]
																		},
																		{
																			"number": "[2] ",
																			"content": [
																				{
																					"text": "Aboveground pools, hot tubs and whirlpools having\na height of less than 46 inches or having a plane area less than 100\nsquare feet shall have a protective cover and a latching device."
																				}
																			]
																		}
																	]
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Gates or doors. All gates or doors must be equipped\nwith a self-closing, self-latching device located on the inside of\nthe gate or door. Such gate or door must be securely closed and locked\nat all times when not in actual use."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "Such pool area, combined with all other accessory\nstructures, shall not exceed 40% of the area of the rear yard."
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "Setbacks.[Amended 7-9-1991 by L.L. No. 10-1991; 4-1-1997 by L.L. No. 8-1997]"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "An inground swimming pool and any mechanical\nequipment shall be no closer to the rear and side property lines than\n10 feet or the minimum side yard setback requirements for a residential\nstructure in a residential district, whichever is the more restrictive."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "An aboveground pool and any mechanical equipment, as described in § 70-102C(2)(b), shall be no closer to the rear and side property lines than the minimum side yard setback requirement for the residential district in which the premises is located."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(6) ",
											"content": [
												{
													"text": "If the water for such pool is supplied from a private\nwell, there shall be no cross-connection with the public water supply\nsystem."
												}
											]
										},
										{
											"number": "(7) ",
											"content": [
												{
													"text": "If the water for such pool is supplied from the public\nwater supply system, the inlet shall be above the overflow level of\nthe pool, and that supply shall be equipped with an approved backflow\ndevice."
												}
											]
										},
										{
											"number": "(8) ",
											"content": [
												{
													"text": "Such pool shall be chemically treated in a manner\nsufficient to maintain the bacterial standards established by the\nprovisions of the New York State Sanitary Code relating to public\nswimming pools."
												}
											]
										},
										{
											"number": "(9) ",
											"content": [
												{
													"text": "No permission shall be granted for the installation\nof any swimming pool unless the plans therefor meet the approval of\nthe Town of North Hempstead Building Department construction requirements\nnor until the owner of the premises has filed with the Building Department\na certification approved by a professional engineer licensed by the\nState of New York that the drainage of such pool is adequate and will\nnot interfere with the public water supply system, with existing sanitary\nfacilities, with the public highways or with adjoining properties."
												}
											]
										},
										{
											"number": "(10) ",
											"content": [
												{
													"text": "No loudspeaker device which can be heard beyond\nthe property lines of the premises in which any swimming pool has\nbeen installed may be operated in connection with such pool, nor may\nany lighting be installed in connection therewith which shall throw\nany rays beyond such property lines."
												}
											]
										},
										{
											"number": "(11) ",
											"content": [
												{
													"text": "Should the owner or occupant of the premises\nabandon the pool, he shall arrange to remove the depression and return\nthe surface of the ground to its original grade and approximately\nin the same condition as before the pool was constructed, and he shall\nfurther notify the Building Department of the Town of North Hempstead\nof the abandonment so that an inspection of the site may be made and\nthe records of the permit be marked accordingly."
												}
											]
										},
										{
											"number": "(12) ",
											"content": [
												{
													"text": "The pool shall be equipped with a cover approved\nby the Building Department of the Town and shall be of sufficient\nstrength to protect against accidental entry into the pool. The pool\nshall be covered at all times when containing water and not in use."
												}
											]
										},
										{
											"number": "(13) ",
											"content": [
												{
													"text": "The pool shall be secured with a cover or other means approved by\nthe Building Department of the Town and designed to protect against\nentry into the pool at all times when not containing water and not\nin use.[Added 5-18-2010 by L.L. No. 5-2010]"
												}
											]
										},
										{
											"number": "(14) ",
											"content": [
												{
													"text": "Every residential and commercial swimming pool shall have swimming\npool alarms which comply with the requirements set forth in the current\nNew York State Uniform Fire Prevention and Building Code, subject\nto the exceptions set forth therein.[Added 5-18-2010 by L.L. No. 5-2010; amended 7-10-2012 by L.L. No.\n11-2012]"
												}
											]
										}
									]
								}
							]
						}
					]
				}
			]
		}
	]
}