{
	"url": "http://ecode360.com/9299724",
	"paras": [
		{
			"paragraph": "§ 70-33",
			"title": "Application of provisions.",
			"content": [
				{
					"text": "The provisions of this article shall apply in\na Residence B District."
				}
			]
		},
		{
			"paragraph": "§ 70-34",
			"title": "Permitted uses.",
			"content": [
				{
					"text": "A building may be erected, altered or used and\na lot or premises may be used for any of the purposes set forth in\nthis article and for no other:"
				},
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "All permitted uses set forth in Article II applicable to R-AAA Districts and Article III applicable to R-AA Districts."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 70-35",
			"title": "Conditional uses.",
			"content": [
				{
					"text": "A building may be erected, altered or used and a lot or premises may be used for any of the purposes set forth in this article when authorized by the Board of Zoning and Appeals pursuant to the provisions of Article XXIV and for no other."
				},
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "All conditional uses authorized in Article III applicable to R-AA Districts and Article IV applicable to R-A Districts."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 70-36",
			"title": "Height.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "In the case of a single-family dwelling, no building\nshall exceed 2 1/2 stories, with a maximum height of 30 feet.[Amended 12-14-1999 by L.L. No. 14-1999]"
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "In the case of a building other than a single-family\ndwelling, no building or part thereof shall exceed three stories,\nwith a maximum height of 45 feet, except a church spire or belfry."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 70-37",
			"title": "Plot area.",
			"content": [
				{
					"text": "No dwelling or other building shall be constructed\non a lot containing an area of less than 6,000 square feet."
				}
			]
		},
		{
			"paragraph": "§ 70-37.1",
			"title": "Lot width.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "No dwelling or other building shall be constructed\non a lot unless it has a minimum lot width of 50 feet at the required\nfront setback line. A minimum lot width of 40 feet shall be maintained\nat all points between the property line at the street and the front\nsetback line."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "The minimum lot width shall be the same as the average\nlot width of existing residential lots within 200 feet on each side\nof the lot within the same blockfront(s) and district. For lots within\n200 feet of an intersection, the blockfront(s) shall be assumed to\ncontinue across the intersection, excluding the width of the intersection."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "For corner lots, the minimum lot width shall be calculated\nseparately for each blockfront, and the greater of the two shall prevail."
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "The minimum lot width shall be the greater of A or\nB above, but in no case shall the width of a lot be required to exceed\n100 feet."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 70-38",
			"title": "Lot coverage.",
			"content": [
				{
					"text": "The lot coverage shall not exceed 30% of the\nlot area."
				}
			]
		},
		{
			"paragraph": "§ 70-39",
			"title": "Floor area.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "No dwelling shall be erected unless it has a habitable\nfloor area of at least 1,000 square feet."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "The gross floor area shall not exceed 45% of the lot\narea."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "The gross floor area on a lot shall not exceed 3,400\nsquare feet unless the lot area is greater than 8,500 square feet\nand the minimum side yard is increased to 10 feet."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "For lots greater than 8,500 square feet, development exceeding 3,400 square feet of gross floor area shall comply with the regulations of Article IV, R-A."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "In no case shall the limitations of this section prohibit\na dwelling of less than 2,500 square feet on a lot held in single\nand separate ownership as of December 31, 1999, so long as the building\nconforms to all other restrictions of this chapter."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 70-40",
			"title": "Front yard.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Unless the main building on the lot is controlled by § 70-40C, there shall be a front yard, the depth of which shall be not less than 30 feet from the front property line."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "On a corner lot, a front yard shall be required on each street and, unless the building is controlled by § 70-40C, the front yard on the narrower street frontage shall be not less than 30 feet in depth and the other front yard shall be not less than 25 feet in depth; and if the street frontages are equal, a minimum front yard of 30 feet shall be required on each street front."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "The minimum front yard depth shall be the same as\nthe average front yard depth of the existing primary buildings within\n200 feet on each side of the lot on the same side of the street and\nwithin the same zoning district, or 30 feet, whichever is greater.\nNo front yard shall be required to have a depth greater than 45 feet.\nOn a lot with multiple street fronts, the average front yard setback\nshall only apply to the primary front yard.[Amended 4-28-1987 by L.L. No. 10-1987; 7-10-2012 by L.L. No. 11-2012]"
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 70-41",
			"title": "Side yards.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "On an interior lot, a single-family dwelling shall\nhave two side yards, one on each side of the main building, the aggregate\nwidth of which shall be not less than 30% of the width of the lot,\nbut in no case shall any side yard be less than seven feet in width."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "The foregoing requirements for aggregate side yards\nshall not apply to alterations to existing single-family dwellings,\nprovided that:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "The existing dwelling has either a valid certificate\nof occupancy or a valid certificate of existing use effective as of\nDecember 31, 1999; and"
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "The proposed alteration does not decrease the\nwidth of any existing side yard; and"
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "The alteration does not include demolition of\nmore than 40% of the building's perimeter as it existed on December\n31, 1999; and"
																}
															]
														},
														{
															"number": "(d) ",
															"content": [
																{
																	"text": "The maximum height to the ridge does not exceed\n30 feet; and"
																}
															]
														},
														{
															"number": "(e) ",
															"content": [
																{
																	"text": "After alteration, the lot will have two side\nyards, one on each side of the main building, each side yard having\na width of at least seven feet and both side yards together having\nan aggregate width of not less than 25% of the width of the lot."
																}
															]
														}
													]
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "On a corner lot, a single-family dwelling shall have only one side yard. Said yard shall be on the side adjoining the interior lot opposite the front yard having the greater street frontage. Said side yard shall have a minimum width of seven feet. The two yards fronting on streets shall be considered front yards as provided under § 70-39B. The remaining yard shall be considered the rear yard and shall conform to the provisions of § 70-42."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "On an interior lot, a main building other than a single-family\ndwelling shall have two side yards, each having a minimum of 20 feet\nin width."
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "On a corner lot, a building other than a single-family dwelling shall have only one side yard. Said yard shall be on the side adjoining the interior lot opposite the front yard having the greater street frontage. Said side yard shall have a minimum width of 20 feet. The remaining yard shall be considered the rear yard and shall conform to the provisions of § 70-42."
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "Where a garage door(s) faces a side property line,\na setback of 25 feet shall be provided between the side property line\nand the closest point of the garage structure.[Added 1-3-2006 by L.L. No. 1-2006]"
								}
							]
						},
						{
							"number": "F. ",
							"content": [
								{
									"text": "An areaway may extend into the required side yard,\nprovided that, for any areaway projecting closer than four feet to\na side property line, the entire areaway must be protected by a horizontal\ngrating constructed in conformance with the requirements of the Building\nCode.[Added 1-3-2006 by L.L. No. 1-2006]"
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 70-42",
			"title": "Rear yard.",
			"content": [
				{
					"text": "There shall be a rear yard, the depth of which\nshall be not less than 15 feet for all single-family residence buildings.\nFor all other buildings, the rear yard shall be not less than 20 feet."
				}
			]
		},
		{
			"paragraph": "§ 70-42.1",
			"title": "Parking requirements.",
			"content": [
				{
					"text": "Parking shall be provided in accordance with the requirements set forth in § 70-103."
				}
			]
		},
		{
			"paragraph": "§ 70-42.2",
			"title": "(Reserved).\n                                                                                          [1]",
			"content": [
				{
					"footnote": "[1]\nEditor's Note: Former § 70-42.2,\nFloor area ratio (FAR), added 2-19-1991 by L.L. No. 5-1991, as amended,\nwas repealed 12-14-1999 by L.L. No. 14-1999.\n"
				}
			]
		},
		{
			"paragraph": "§ 70-42.3",
			"title": "Sky exposure planes.",
			"content": [
				{
					"text": "All new construction and alterations shall be\ncontained within the area defined by the required sky exposure planes."
				},
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "There shall be a sky exposure plane projecting inward\nfrom the front and side property lines at a ratio of three feet vertical\nto one foot horizontal."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "At no point may a structure be built higher than three\ntimes the horizontal distance from a lot line."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "The foregoing requirements for sky exposure plane\nshall not apply to alterations to existing single-family dwellings,\nprovided that:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "The existing dwelling has either a valid certificate\nof occupancy or a valid certificate of existing use effective as of\nDecember 31, 1999; and"
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "The alteration does not include demolition of more\nthan 40% of the building's perimeter as it existed on December 31,\n1999; and"
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "The maximum height to the ridge does not exceed 30\nfeet."
												}
											]
										}
									]
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 70-42.4",
			"title": "Minimum slope requirements for attached garages.",
			"content": [
				{
					"text": "For construction of new dwellings or alterations\nto existing structures, the floor elevation of new attached garages\nmay be located no lower than a 4% slope below the adjacent curb elevation."
				}
			]
		},
		{
			"paragraph": "§ 70-42.5",
			"title": "Detached garages, accessory buildings and accessory structures.",
			"content": [
				{
					"text": "Detached garages, accessory buildings and accessory structures must comply with the requirements of § 70-100.1, Accessory buildings, and § 70-100.2, Accessory structures."
				}
			]
		},
		{
			"paragraph": "§ 70-42.6",
			"title": "Front yard paving.",
			"content": [
				{
					"text": "For all new construction, alterations or landscaping\nchanges, a front yard may not be covered more than 45% by any impervious\nmaterial or paving. Water flow from paved areas must be controlled\nto alleviate excessive runoff onto adjacent properties."
				}
			]
		},
		{
			"paragraph": "§ 70-42.7",
			"title": "Eave height.",
			"content": [
				{
					"text": "The maximum height to the uppermost eave shall\nbe 22 feet, as measured from the preexisting average grade at the\nperimeter of the building."
				}
			]
		},
		{
			"paragraph": "§ 70-42.8",
			"title": "Site lighting.",
			"content": [
				{
					"text": "Site lighting must comply with the requirements of § 70-217, Light fixtures."
				}
			]
		}
	]
}