{
	"url": "http://ecode360.com/9299879",
	"paras": [
		{
			"paragraph": "§ 70-65",
			"title": "Application of provisions.",
			"content": [
				{
					"text": "The provisions of this article shall apply in\na Multiple Residence District."
				}
			]
		},
		{
			"paragraph": "§ 70-66",
			"title": "Permitted uses.",
			"content": [
				{
					"text": "A building may be erected, altered or used and\na lot or premises may be used for any of the purposes set forth in\nthis article and for no other:"
				},
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "All permitted uses set forth in Article VII applicable to R-D Districts."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Multiple dwelling conforming to the provisions of\nthe Multiple Dwelling Law, as amended from time to time, and to the\nprovisions of this article."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Clubhouse, fraternity house or lodge."
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "All buildings and uses permitted in this article with the exception of those provided in § 70-54B and C of Article VII, shall conform to the provisions of Article VI applicable to R-C Districts."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 70-67",
			"title": "Conditional uses.",
			"content": [
				{
					"text": "A building may be erected, altered or used and a lot or premises may be used for any of the purposes set forth in this article when authorized by the Board of Zoning and Appeals pursuant to the provisions of Article XXIV and for no other:"
				},
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "All conditional uses set forth in Article III applicable to R-AA Districts, Article IV applicable to R-A Districts and Article VI applicable to R-C Districts."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "All buildings and uses, as permitted in this article shall conform to the provisions of Article VI applicable to R-C Districts."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Senior citizen facilities, including the following.\nA single building may contain any combination of the senior citizen\nfacilities listed below."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Senior independent-living facilities."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Senior congregate-living facilities."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Senior assisted-living facilities."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "Senior day-care facilities."
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "Senior day-care facilities shall provide means\nfor the drop off and pickup of clients in a manner which does not\ninterfere with the orderly flow of traffic."
																}
															]
														}
													]
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "Accessory uses. Senior citizen facilities and nursing\nhomes may contain or provide uses necessary to and customarily incidental\nto such facilities where such uses are limited to use by residents,\ntheir guests and employees, as follows:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "In independent-living, congregate-living and assisted-living\nfacilities:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "Community/meeting rooms."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "Workshops/arts and crafts rooms."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "Library."
																}
															]
														},
														{
															"number": "(d) ",
															"content": [
																{
																	"text": "Convenience retail, barber and beauty shops;\nsnack bar and gift shop."
																}
															]
														},
														{
															"number": "(e) ",
															"content": [
																{
																	"text": "Outdoor passive and active recreation space."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "In congregate-living and assisted-living facilities:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "Dining rooms."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "In assisted-living facilities and nursing homes:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "Medical offices, limited to use by residents,\nwith no exterior signs or access."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "Physical therapy rooms, limited to use residents,\nwith no exterior signs or access."
																}
															]
														}
													]
												}
											]
										}
									]
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 70-68",
			"title": "Height.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "No multiple dwelling shall exceed three stories, with\na maximum height of 45 feet."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "In the case of a building other than one used for\ndwelling purposes, no building or part thereof shall exceed three\nstories, with a maximum height of 45 feet, except a church spire or\nbelfry."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "In the case of a building containing senior citizen\nfacilities, no building or part thereof shall exceed three stories\nwith a maximum height of 45 feet."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 70-69",
			"title": "Plot area or density of population for senior citizen facilities.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "No multiple dwelling shall contain more than 24 apartments\nto house 24 families on a site of less than one acre."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "The minimum lot area for multiple dwellings shall\nbe 1,500 square feet per family."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Where a multiple dwelling, senior citizen facility or nursing home is erected on a lot abutting a residence district of higher classification, a minimum side and/or rear yard of 25 feet abutting said district will be required, which shall be landscaped and maintained in accordance with § 70-203G and H."
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "Buildings containing the following senior citizen\nfacilities and nursing homes shall be constructed on lots containing\nthe following area dimensions:"
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "For buildings containing more than one senior citizen\nfacility, a composite total of 32 units per acre shall be permitted,\nwith each use assessed at the following rate:"
								}
							]
						},
						{
							"number": "F. ",
							"content": [
								{
									"text": "A 25% density bonus shall be available for senior\nindependent-living facilities where such units are made available\nas affordable senior citizen facilities."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 70-69.1",
			"title": "Buffer area.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "A ten-foot landscaped buffer shall be required along\nside and rear lot lines of any new primary structure, except where\nthe new structure is erected on a lot abutting a residence district\nof higher classification, in which case a minimum buffer of 25 feet\nis required abutting said district.[Amended 4-12-2011 by L.L. No. 7-2011]"
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Within twenty-five-foot required buffers, the planting\nstrip shall provide for two rows of coniferous material six feet tall\non seven-foot centers. Within ten-foot required buffers a single row\nof six-foot tall coniferous material shall be provided."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "The required buffers shall be maintained in accordance with § 70-203G and H."
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "Landbanked parking may be located within a required buffer in accordance with the limitations set forth in § 70-70B."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 70-70",
			"title": "Parking requirements.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "The provisions of § 70-103 shall apply to the Multiple Residence District."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Landbanked parking as defined in § 70-231 may be permitted within the required buffer for senior independent-, congregate- and assisted-living facilities, subject to the following restrictions:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Landbanked parking shall be limited to 40% of the\nrequired parking."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Landbanked parking shall be indicated as such on the\nsite plan and shall be maintained as landscaped or open green space."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "No structure shall be erected in any designated landbanked\narea."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "Landbanked parking shall be located a minimum of 15\nfeet from any property line abutting a residence district."
												}
											]
										}
									]
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 70-71",
			"title": "Lot coverage.",
			"content": [
				{
					"text": "The lot coverage shall not exceed 35% of the\nlot area, with a minimum distance between front and rear walls of\n50 feet and 20 feet between building end walls."
				}
			]
		},
		{
			"paragraph": "§ 70-72",
			"title": "Recreational area.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "For other than senior citizen facilities, a minimum\narea shall be provided for outdoor recreation with a ratio of 100\nsquare feet for each dwelling unit."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "A minimum of 80 square feet per dwelling unit of indoor\ncommon amenity space other than dining space shall be provided for\nsenior citizen facilities. A minimum of 50 square feet of common outdoor\nactive and passive recreation and open space shall be provided per\ndwelling unit for senior citizen facilities."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 70-73",
			"title": "Basement apartments.",
			"content": [
				{
					"text": "No basement apartments shall be permitted in\nany multiple dwelling or senior citizen facility other than one such\napartment for the use of the superintendent, custodian or other person\nin charge of the maintenance of such dwelling."
				}
			]
		},
		{
			"paragraph": "§ 70-74",
			"title": "Floor area.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Multiple dwellings shall provide habitable floor area\nof not less than 600 square feet per family (per dwelling unit), except\nin the case of efficiency (no-bedroom) apartments in government-subsidized\ndevelopments where the floor area of said efficiency apartment shall\nbe not less than 400 square feet."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Senior citizen facilities."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Buildings containing the following senior citizen\nfacilities shall have the following minimum and maximum gross habitable\nfloor areas per unit:"
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "In buildings containing more than one facility, maximum\npermitted floor area shall be calculated based on the sum of the separate\nfloor areas for each type of facility."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "In senior independent-, congregate- and assisted-living\nfacilities, a minimum of 40% of the dwelling units shall be one-bedroom\nunits. No dwelling unit shall contain more than two bedrooms."
												}
											]
										}
									]
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 70-75",
			"title": "Front yard.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Unless the main building on the lot is controlled by § 70-75C, there shall be a front yard, the depth of which shall not be less than 25 feet."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "On a corner lot, a front yard shall be required on each street and, unless the building is controlled by § 70-75C, the front yard on the narrower street frontage shall be not less than 25 feet in depth, and the other front yard shall be not less than 20 feet in depth: and if the street frontages are equal, a minimum front yard of 25 feet in depth shall be required on each street front."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "No front yard shall be required for properties located\nwithin the New Cassel Urban Renewal Overlay District.[Amended 4-12-2011 by L.L. No. 7-2011; 7-10-2012 by L.L. No.\n11-2012; 3-31-2015 by L.L. No. 3-2015]"
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 70-76",
			"title": "Side yards.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "On an interior lot, a multiple dwelling, senior citizen\nfacility or nursing home shall have two side yards, one on each side\nof the main building, each of which shall be not less than 20 feet\nin width from the front line to the rear lot line."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Where multiple dwellings, senior citizen facility\nor nursing homes are grouped on the same lot or plot, the unobstructed\nopen spaces between the exterior walls of such buildings shall be\nnot less than 30 feet."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "On a corner lot, a multiple dwelling, senior citizen facility or nursing home shall have only one side yard. Said yard shall be on the side adjoining the interior lot opposite the front yard having the greater street frontage. Said side yard shall have a minimum width of 20 feet. The two yards fronting on streets shall be considered front yards as provided under § 70-75B. The remaining yard shall be considered the rear yard and shall conform to the provisions of § 70-77."
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "Where a garage door(s) faces a side property line,\na setback of 25 feet shall be provided between the side property line\nand the closest point of the garage structure.[Added 1-3-2006 by L.L. No. 1-2006]"
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "An areaway may extend into the required side yard,\nprovided that, for any areaway projecting closer than four feet to\na side property line, the entire areaway must be protected by a horizontal\ngrating constructed in conformance with the requirements of the Building\nCode.[Added 1-3-2006 by L.L. No. 1-2006]"
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 70-77",
			"title": "Rear yard.",
			"content": [
				{
					"text": "In the case of a multiple dwelling, senior citizen\nfacility or nursing home, there shall be a rear yard the depth of\nwhich shall be not less than 20 feet."
				}
			]
		},
		{
			"paragraph": "§ 70-77.1",
			"title": "Design features in senior citizen facilities.",
			"content": [
				{
					"text": "All senior citizen facilities shall be designed\nto meet the special needs of senior citizens and at a minimum shall\ncontain the following:"
				},
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "A call button monitoring or equivalent system within\neach dwelling unit for emergency calls to on- or off-site emergency\npersonnel."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Exterior access, at a minimum of two locations, without\nsteps."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Grab bars in all tub and shower stalls."
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "Corridor length and design to facilitate wayfinding."
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "Elevators required for access to all units above the\nfirst story."
								}
							]
						},
						{
							"number": "F. ",
							"content": [
								{
									"text": "Non-skid floors."
								}
							]
						},
						{
							"number": "G. ",
							"content": [
								{
									"text": "Handle-type spigots and doorknobs."
								}
							]
						},
						{
							"number": "H. ",
							"content": [
								{
									"text": "In all rooms, doors of sufficient width to accommodate\nwheelchairs."
								}
							]
						},
						{
							"number": "I. ",
							"content": [
								{
									"text": "Separation of vehicular circulation drive from pedestrian\nwalks."
								}
							]
						},
						{
							"number": "J. ",
							"content": [
								{
									"text": "Changes in grade on walk systems to be accomplished\nby ramps."
								}
							]
						},
						{
							"number": "K. ",
							"content": [
								{
									"text": "Passenger drop-off for occupants and visitors near\nentrance and elevator halls of buildings."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 70-78",
			"title": "Sewage disposal.",
			"content": [
				{
					"text": "No multiple dwelling, senior citizen facility\nor nursing home shall be permitted unless provided with municipal\nsewerage or unless an independent sewage disposal plan, approved by\nthe Nassau County Department of Health and/or Town of North Hempstead\nBuilding Department, is constructed for the sanitary disposal of the\nsewage of such buildings."
				}
			]
		}
	]
}