{
	"url": "http://ecode360.com/9299778",
	"paras": [
		{
			"paragraph": "§ 70-43",
			"title": "Application of provisions.",
			"content": [
				{
					"text": "The provisions of this article shall apply in\na Residence C District."
				}
			]
		},
		{
			"paragraph": "§ 70-44",
			"title": "Permitted uses.",
			"content": [
				{
					"text": "A building may be erected, altered or used and\na lot or premises may be used for any of the purposes set forth in\nthis article and for no other:"
				},
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "All permitted uses set forth in Article II applicable to R-AAA Districts and Article III applicable to R-AA Districts."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Two-family detached dwelling."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Telephone exchange."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 70-45",
			"title": "Conditional uses.",
			"content": [
				{
					"text": "A building may be erected, altered or used and a lot or premises may be used for any of the purposes set forth in this article when authorized by the Board of Appeals pursuant to the provisions of Article XXIV and for no other:"
				},
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "All conditional uses set forth in Article III applicable to R-AA Districts and Article IV applicable to R-A Districts."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Greenhouse, provided that it is maintained as an accessory\nuse by the owner and not a gainful business."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Philanthropic or eleemosynary uses or institutions\nother than correctional institutions."
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "Nursing home licensed by the Nassau County Department\nof Health."
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "Delicatessen as defined in § 70-231, sandwich shop or bakery conforming to the following:[Added 8-2-2011 by L.L. No. 12-2011]"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "The\nestablishment is situated on a thoroughfare with four or more travel\nlanes; and"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "Vehicular access to the establishment shall only be from the thoroughfare."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "The lot shall be no less than 1.5 acres in area."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "The lot shall have a minimum depth of 300 feet from the thoroughfare\nto the rear property line."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "The\ngross floor area shall be no greater than 4,000 square feet;"
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "There\nshall be no tables or chairs for the on-premises consumption of food;"
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "There\nshall be no drive-through service windows; and"
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "There shall be a landscaped buffer required in conformance with the standards of §§ 70-203G and H."
												}
											]
										}
									]
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 70-46",
			"title": "Height.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "In the case of a single-family or two-family dwelling,\nno building shall exceed 2 1/2 stories with a maximum height\nof 30 feet.[Amended 12-14-1999 by L.L. No. 14-1999]"
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "In the case of a building other than a dwelling, no\nbuilding or part thereof shall exceed three stories, with a maximum\nheight of 45 feet, except a church spire or belfry."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 70-47",
			"title": "Plot area.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "No single-family dwelling shall be constructed on\na lot containing an area of less than 5,000 square feet."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "No two-family dwelling shall be constructed on a lot\ncontaining an area of less than 10,000 square feet."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Other main buildings permitted as set forth in § 70-44 and not used for residence purposes shall require a minimum lot area of 6,000 square feet."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 70-47.1",
			"title": "Lot width.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "No single-family dwelling shall be constructed on\na lot unless it has a minimum lot width of 40 feet at the required\nfront setback line. A minimum lot width of 35 feet shall be maintained\nat all points between the property line at the street and the front\nsetback line."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "No two-family dwelling shall be constructed on a lot\nunless it has a minimum lot width of 80 feet at the required front\nsetback line. A minimum lot width of 50 feet shall be maintained at\nall points between the property line at the street and the front setback\nline."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "No other main building permitted as set forth in § 70-44 and not used for residence purposes shall be constructed on a lot unless it has a minimum lot width of 50 feet."
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "The minimum lot width shall be the same as the average\nlot width of existing lots within 200 feet on each side of the lot\nwithin the same blockfront(s) and district, or the minimums required\nin A, B or C above as applicable, whichever is greater. For lots within\n200 feet of an intersection, the blockfront shall be assumed to continue\nacross the intersection, excluding the width of the intersection."
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "For corner lots, the minimum lot width shall be calculated\nseparately for each blockfront, and the greater of the two shall prevail."
								}
							]
						},
						{
							"number": "F. ",
							"content": [
								{
									"text": "Where a blockfront consists of a mix of single-family\nand two-family dwellings, conforming lots containing two-family dwellings\nshall be counted as two single-family lots to determine the average\nlot width."
								}
							]
						},
						{
							"number": "G. ",
							"content": [
								{
									"text": "No single-family lot shall be required to exceed 80\nfeet in lot width, nor shall any other lot be required to exceed 160\nfeet in lot width."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 70-48",
			"title": "Lot coverage.",
			"content": [
				{
					"text": "The lot coverage shall not exceed 35% of the\nlot area."
				}
			]
		},
		{
			"paragraph": "§ 70-49",
			"title": "Floor area.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "No single-family dwelling shall be erected unless\nit has a habitable floor area of at least 900 square feet. No two-family\ndwelling shall be erected unless it has a habitable floor area of\nat least 900 square feet for each family."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "The gross floor area shall not exceed 50% of the lot\narea."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "The gross floor area on a lot shall not exceed 2,800\nsquare feet unless it has a lot area greater than 6,000 square feet\nand the minimum side yard is increased to seven feet."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "For lots greater than 6,000 square feet, development exceeding 2,800 square feet of gross floor area shall comply with the regulations of Article V, R-B."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "In no case shall the limitations of this section prohibit\na dwelling of less than 2,250 square feet on a lot held in single\nand separate ownership as of December 31, 1999, so long as the building\nconforms to all other restrictions of this chapter."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 70-50",
			"title": "Front yard.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Unless the main building on the lot is controlled by § 70-50C, there shall be a front yard, the depth of which shall be not less than 25 feet from the front property line.[Amended 1-3-2006 by L.L. No. 1-2006]"
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "On a corner lot, a front yard shall be required on each street and, unless the building is controlled by § 70-50C, the front yard on the narrower street frontage shall be not less than 25 feet in depth and the other front yard shall be not less than 20 feet in depth; and if the street frontages are equal, a minimum front yard of 25 feet shall be required on each street front."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "The minimum front yard depth shall be the same as\nthe average front yard depth of the existing primary buildings within\n200 feet on each side of the lot on the same side of the street and\nwithin the same zoning district, or 25 feet, whichever is greater.\nNo front yard shall be required to have a depth greater than 40 feet.\nOn a lot with multiple street fronts, the average front yard setback\nshall only apply to the primary front yard.[Amended 4-28-1987 by L.L. No. 10-1987; 7-10-2012 by L.L. No. 11-2012]"
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 70-51",
			"title": "Side yards.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "On an interior lot, a single-family dwelling shall\nhave two side yards, one on each side of the main building, the aggregate\nwidth of which shall be not less than 25% of the width of the lot,\nbut in no case shall any side yard be less than five feet in width."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "On a corner lot, a single-family dwelling shall have only one side yard. Said yard shall be on the side adjoining the interior lot opposite the front yard having the greater street frontage. Said side yard shall have a minimum width of five feet. The two yards fronting on streets shall be considered front yards as provided in § 70-50B. The remaining yard shall be considered the rear yard and shall conform to the provisions of § 70-52.[Amended 4-28-1987 by L.L. No. 10-1987]"
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "On an interior lot, a main building other than a dwelling\nshall have two side yards, each having a minimum of 15 feet in width.\nIf such building is over 35 feet in height, the width of each side\nyard shall be not less than 20 feet."
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "On a corner lot, a main building other than a dwelling shall have only one side yard. Said yard shall be on the side adjoining the interior lot opposite the front yard having the greater street frontage. Said side yard shall have a minimum width of 15 feet for a building 35 feet or less in height and a minimum width of 20 feet for a building over 35 feet in height. The remaining yard shall be considered the rear yard and shall conform to the provisions of § 70-52."
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "On an interior lot, a two-family dwelling shall have\ntwo side yards, one on each side of the main building, the aggregate\nwidth of which shall be not less than 25% of the width of the lot,\nbut in no event shall any side yard be less than 12 feet."
								}
							]
						},
						{
							"number": "F. ",
							"content": [
								{
									"text": "On a corner lot, a two-family dwelling shall have only one side yard. Said yard shall be on the side adjoining the interior lot opposite the front yard having the greater street frontage. Said side yard shall have a minimum width of 10 feet. The two yards fronting on streets shall be considered front yards as provided under § 70-50B. The remaining yard shall be considered the rear yard and shall conform to the provisions of § 70-52."
								}
							]
						},
						{
							"number": "G. ",
							"content": [
								{
									"text": "Where a garage door(s) faces a side property line,\na setback of 25 feet shall be provided between the side property line\nand the closest point of the garage structure.[Added 1-3-2006 by L.L. No. 1-2006]"
								}
							]
						},
						{
							"number": "H. ",
							"content": [
								{
									"text": "An areaway may extend into the required side yard,\nprovided that, for any areaway projecting closer than four feet to\na side property line, the entire areaway must be protected by a horizontal\ngrating constructed in conformance with the requirements of the Building\nCode.[Added 1-3-2006 by L.L. No. 1-2006]"
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 70-52",
			"title": "Rear yard.",
			"content": [
				{
					"text": "For single-family dwellings there shall be a\nrear yard, the depth of which shall be not less than 15 feet. For\ntwo-family dwellings there shall be a rear yard, the depth of which\nshall be not less than 25 feet. For all other buildings, the depth\nof the rear yard shall be not less than 25 feet."
				}
			]
		},
		{
			"paragraph": "§ 70-52.1",
			"title": "Parking requirements.",
			"content": [
				{
					"text": "Parking shall be provided in accordance with the requirements set forth in § 70-103."
				}
			]
		},
		{
			"paragraph": "§ 70-52.2",
			"title": "(Reserved).\n                                                                                          [1]",
			"content": [
				{
					"footnote": "[1]\nEditor's Note: Former § 70-52.2,\nFloor area ratio (FAR), added 2-19-1991 by L.L. No. 5-1991, as amended,\nwas repealed 12-14-1999 by L.L. No. 14-1999.\n"
				}
			]
		},
		{
			"paragraph": "§ 70-52.3",
			"title": "Sky exposure planes.",
			"content": [
				{
					"text": "All new construction and alterations shall be\ncontained within the area defined by the required sky exposure planes."
				},
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "There shall be a sky exposure plane projecting inward\nfrom the front and side property lines at a ratio of four feet vertical\nto one foot horizontal."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "At no point may a structure be built higher than four\ntimes the horizontal distance from a lot line."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "The foregoing requirements for sky exposure plane\nshall not apply to alterations to existing single-family dwellings,\nprovided that:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "The existing dwelling has either a valid certificate\nof occupancy or a valid certificate of existing use effective as of\nDecember 31, 1999; and"
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "The alteration does not include demolition of more\nthan 40% of the building's perimeter as it existed on December 31,\n1999; and"
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "The maximum height to the ridge does not exceed 30\nfeet."
												}
											]
										}
									]
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 70-52.4",
			"title": "Detached garages, accessory buildings and accessory structures.",
			"content": [
				{
					"text": "Detached garages, accessory buildings and accessory structures must comply with the requirements of § 70-100.1, Accessory buildings, and § 70-100.2, Accessory structures."
				}
			]
		},
		{
			"paragraph": "§ 70-52.5",
			"title": "Front yard paving.",
			"content": [
				{
					"text": "For all new construction, alterations or landscaping\nchanges, a front yard may not be covered more than 55% by any impervious\nmaterial or paving. Water flow from paved areas must be controlled\nto alleviate excessive runoff onto adjacent properties."
				}
			]
		},
		{
			"paragraph": "§ 70-52.6",
			"title": "Eave height.",
			"content": [
				{
					"text": "The maximum height to the uppermost eave shall\nbe 22 feet, as measured from the preexisting average grade at the\nperimeter of the building."
				}
			]
		},
		{
			"paragraph": "§ 70-52.7",
			"title": "Site lighting.",
			"content": [
				{
					"text": "Site lighting must comply with the requirements of § 70-217, Light fixtures."
				}
			]
		},
		{
			"paragraph": "§ 70-52.8",
			"title": "Minimum slope requirements for attached garages.",
			"content": [
				{
					"text": "For construction of new dwellings or alterations\nto existing structures, the floor elevation of new attached garages\nmay be located no lower than a 4% slope below the adjacent curb elevation."
				}
			]
		}
	]
}