{
	"url": "http://ecode360.com/9299839",
	"paras": [
		{
			"paragraph": "§ 70-53",
			"title": "Application of provisions.",
			"content": [
				{
					"text": "The provisions of this article shall apply in\na Residence D District."
				}
			]
		},
		{
			"paragraph": "§ 70-54",
			"title": "Permitted uses.",
			"content": [
				{
					"text": "A building may be erected, altered or used and\na lot or premises may be used for any of the purposes set forth in\nthis article and for no other:"
				},
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "All permitted uses set forth in Article II applicable to R-AAA Districts, Article III applicable to R-AA Districts and Article VI applicable to R-C Districts."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Two-family attached residence buildings conforming\nto the provisions of this article."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Detached group garage conforming to the provisions of § 70-58A and B."
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "Single-family attached townhouse conforming to the\nprovisions of this Article only within an area designated as an urban\nrenewal area under Article 15 of the New York State General Municipal\nLaw or when the lot or premises was previously occupied by a single-family\nattached townhouse constructed under the requirements of this article.[Added 2-24-1981 by L.L. No. 1-1981]"
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "All buildings and uses permitted in this article, with the exception of those provided in § 70-54B, C and D shall conform to the provisions of Article VI applicable to R-C Districts.[Amended 2-24-1981 by L.L. No. 1-1981]"
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 70-55",
			"title": "Conditional uses.",
			"content": [
				{
					"text": "A building may be erected, altered or used and a lot or premises may be used for any of the purposes set forth in this article when authorized by the Board of Zoning and Appeals pursuant to the provisions of Article XXIV and for no other:"
				},
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "All conditional uses set forth in Article III applicable to R-AA Districts, Article IV applicable to R-A Districts and Article VI applicable to R-C Districts."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Clubhouse, fraternity house or lodge."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "All buildings and uses, as permitted in § 70-55A and B shall conform to the provisions of Article VI applicable to R-C Districts."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 70-56",
			"title": "Height.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "No dwelling or residence building shall exceed 2 1/2\nstories with a maximum height of 30 feet.[Amended 12-14-1999 by L.L. No. 14-1999]"
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "In the case of a building other than a dwelling or\nresidence building, no building or part thereof shall exceed three\nstories, with a maximum height of 45 feet, except a church spire or\nbelfry."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 70-57",
			"title": "Plot area or density of population.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "No two-family attached residence building shall contain\nmore than four residence units."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "The minimum lot area per family for two-family attached\nresidence buildings shall be 2,000 square feet per family."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "An attached townhouse building shall contain at least\nthree and not more than eight residence units.[Added 2-24-1981 by L.L. No. 1-1981; 4-23-2013 by L.L. No. 2-2013]"
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "The minimum lot area for attached townhouse buildings\nshall be 2,000 square feet per family. The minimum parcel for townhouse\ndevelopment shall be 6,000 square feet.[Added 2-24-1981 by L.L. No. 1-1981; 4-23-2013 by L.L. No. 2-2013]"
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 70-57.1",
			"title": "Lot width.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "For a\ntwo-family attached residence building, the minimum lot width shall\nbe not less than 80 feet."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "For attached\ntownhouses on individual tax lots, the minimum lot width shall be\n20 feet for each interior unit and 35 feet for each end unit."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 70-58",
			"title": "Garage or parking facilities.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "In the case of a two-family attached residence building or an attached townhouse residence building, there shall be provided on the premises parking or garage facilities as per § 70-103. Such garage facilities shall not include space for more than four cars in one accessory building."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "The provisions of § 70-103 shall apply to the Residence D District."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 70-59",
			"title": "Lot coverage.",
			"content": [
				{
					"text": "The lot coverage shall not exceed 35% of the\nlot area for two-family attached residence buildings or 55% for attached\ntownhouse residence buildings."
				}
			]
		},
		{
			"paragraph": "§ 70-60",
			"title": "Floor area.",
			"content": [
				{
					"text": "Two-family attached residence buildings shall\nprovide habitable floor area of not less than 1,500 square feet for\neach residence unit and not less than 750 square feet per family.\nSingle-family attached townhouse residence buildings shall provide\nhabitable floor area of not less than 1,000 square feet per family."
				}
			]
		},
		{
			"paragraph": "§ 70-61",
			"title": "Front yard.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Unless the main building on the lot is controlled by § 70-54E, there shall be a front yard, the depth of which shall be not less than 25 feet."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "On a corner lot, a front yard shall be required on each street and, unless the building is controlled by § 70-54E, the front yard on the narrower street frontage shall be not less than 25 feet in depth and the other front yard shall be not less than 20 feet in depth; and if the street frontages are equal, a minimum front yard of 25 feet shall be required on each street front."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 70-62",
			"title": "Side yards.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "On an interior lot, a two-family attached residence\nbuilding shall have two side yards, one on each side of the main building,\neach of which shall be not less than 20 feet in width."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Where two-family attached residence buildings are\ngrouped on the same lot or plot, the unobstructed open space between\nthe exterior walls of such buildings shall be not less than 30 feet."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "On a corner lot, a two-family attached residence building shall have only one side yard. Said yard shall be on the side adjoining the interior lot opposite the front yard having the greater street frontage. Said side yard shall have a minimum width of 20 feet. The two yards fronting on streets shall be considered front yards as provided under § 70-61B. The remaining yard shall be considered the rear yard and shall conform to the provisions of § 70-63."
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "Any townhouse unit located at the end of an attached townhouse residence building shall have a side yard not less than 15 feet in width. When said side yard fronts on a street, it shall be considered a front yard and shall conform to § 70-61B. No side yard is required for an interior townhouse unit.[Added 2-24-1981 by L.L. No. 1-1981; amended 4-23-2013 by L.L. No. 2-2013]"
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "Where a garage door(s) faces a side property line,\na setback of 25 feet shall be provided between the side property line\nand the closest point of the garage structure.[Added 1-3-2006 by L.L. No. 1-2006]"
								}
							]
						},
						{
							"number": "F. ",
							"content": [
								{
									"text": "An areaway may extend into the required side yard,\nprovided that, for any areaway projecting closer than four feet to\na side property line, the entire areaway must be protected by a horizontal\ngrating constructed in conformance with the requirements of the Building\nCode.[Added 1-3-2006 by L.L. No. 1-2006]"
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 70-63",
			"title": "Rear yard.",
			"content": [
				{
					"text": "In the case of a two-family attached residence\nbuilding or single-family attached townhouse residence building, there\nshall be a rear yard, the depth of which shall be not less than 20\nfeet."
				}
			]
		},
		{
			"paragraph": "§ 70-63.1",
			"title": "Parking requirements.",
			"content": [
				{
					"text": "Parking shall be provided in accordance with the requirements set forth in § 70-103."
				}
			]
		},
		{
			"paragraph": "§ 70-63.2",
			"title": "Minimum slope requirements for attached garages.",
			"content": [
				{
					"text": "For construction of new dwellings or alterations\nto existing structures, the floor elevation of new attached garages\nmay be located no lower than a 4% slope below the adjacent curb elevation."
				}
			]
		},
		{
			"paragraph": "§ 70-64",
			"title": "Sewage disposal.",
			"content": [
				{
					"text": "No two-family attached residence building nor\nsingle-family attached townhouse residence building shall be permitted\nunless provided with municipal sewerage or unless an independent sewage\ndisposal plant, approved by the Nassau County Department of Health\nand/or Town of North Hempstead Building Department, is constructed\nfor the sanitary disposal of the sewage of such buildings."
				}
			]
		}
	]
}