{
	"url": "http://ecode360.com/15353408",
	"paras": [
		{
			"paragraph": "§ 550",
			"title": "Schedule of Regulations, Schedule I & II",
			"content": [
				{
					"text": "The following regulations shall apply in an R-2 district:"
				},
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Front Yard Setback (feet): 25"
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Side Yard Setback (feet): Minimum of 6 on any one side; a total of 14 for both sides"
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Rear Yard Setback (feet): 20"
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "Maximum Building Height: 2 stories, 32 feet"
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "Minimum Gross Floor Area for Dwellings (square feet): 1 story: 850 / 2 stories: 1,200"
								}
							]
						},
						{
							"number": "F. ",
							"content": [
								{
									"text": "Minimum Lot Area (square feet): 5,000"
								}
							]
						},
						{
							"number": "G. ",
							"content": [
								{
									"text": "Minimum Lot Width (feet): 50"
								}
							]
						},
						{
							"number": "H. ",
							"content": [
								{
									"text": "Maximum Building Coverage of Lot: 40%"
								}
							]
						},
						{
							"number": "I. ",
							"content": [
								{
									"text": "Minimum Depth of Lot (feet): 100"
								}
							]
						}
					]
				}
			]
		},
	    {
			"paragraph": "§ 550-8",
			"title": "R-2 Districts (One-Family Residential).",
			"content": [
				{
					"text": "In R-2 Districts, no building or premises shall be used, and\nno building shall be erected or altered, for other than one or more\nof the following uses: any use permitted in R-1 Districts."
				}
			]
		},
		{
			"paragraph": "§ 550-27",
			"title": "Open storage.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Special use. No property shall be used for the open storage of any\narticle, merchandise, material or machinery, except that, in the M\nDistricts, such use may be permitted as a special use by the Board\nof Trustees after notice and public hearing."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Application required for special use permit for open storage. An\napplication shall be made in writing by the owner or lessee of the\nlot or parcel of land upon which open storage use is applied for,\nand said application shall state the following:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "The name of the owner and/or lessee or other occupant."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "The general statement of the location of the property and of the\nclassification of the use district in which such lot, parcel of land\nor plot is located."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "A survey showing the boundary of such parcel, together with the size\nof the parcel by metes and bounds."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "A suitable drawing of the parcel showing any buildings or structures\non the property or buildings or structures to be erected thereon and\nthe proposed location of open storage."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "No storage container, clothing receptacle, recycling receptacle or\nany similar container or structure shall be placed upon any property\nin any zoning district, except that such containers or structures\nmay be permitted as a special use by the Board of Trustees after notice\nand public hearing.[Added 10-18-2000 by L.L. No. 36-2000]"
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 550-46",
			"title": "Continuation.",
			"content": [
				{
					"text": "Any legal nonconforming use existing at the time of the passage\nof this chapter may be continued."
				}
			]
		},
		{
			"paragraph": "§ 550-47",
			"title": "Change in use.",
			"content": [
				{
					"text": "A legal nonconforming use may not be changed to a different\nnonconforming use."
				}
			]
		},
		{
			"paragraph": "§ 550-48",
			"title": "Abandonment and destruction.",
			"content": [
				{
					"text": "Whenever a legal nonconforming use shall have been abandoned\nfor a term of six months, or whenever a legal nonconforming use is\nsubstantially destroyed, the land, building or structure in which\nsaid legal nonconforming use shall have existed shall not thereafter\nbe used for any nonconforming use. Such six-month period of abandonment\nmay be discontinued only by 30 or more consecutive business days of\noperation. A legal nonconforming use shall be substantially destroyed\nif the cost to repair and replace the structure subject to such nonconforming\nuse exceeds 50% of the current structural replacement value thereof."
				}
			]
		},
		{
			"paragraph": "§ 550-49",
			"title": "Enlargement or extension.",
			"content": [
				{
					"text": "No legal nonconforming use may be enlarged or extended unless\nthe use therein is changed to a conforming use."
				}
			]
		},
		{
			"paragraph": "§ 550-50",
			"title": "Structural alteration.",
			"content": [
				{
					"text": "Subject to the approval and consent of the Board of Trustees,\nany legal nonconforming use may be structurally altered, provided\nthat the cost of such structural alteration shall in no case exceed\n50% of the structural value."
				}
			]
		},
		{
			"paragraph": "§ 550-51",
			"title": "Determination of legal nonconforming uses.",
			"content": [
				{
					"text": "The Zoning Board of Appeals may, after public hearing on the\nwritten verified application of the owner of property claiming a legal\nnonconforming use thereon, confirm such use by determining that such\nuse is, in fact, a legal nonconforming use."
				},
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Evidence to accompany application to determine legal nonconforming\nuse. Every application under this section shall state or be accompanied\nby an affidavit or affidavits stating the evidentiary facts claimed\nto establish such use as a legal nonconforming use and shall be filed\nin duplicate with the Zoning Board of Appeals. The Zoning Board of\nAppeals may, in its discretion, require the production of additional\nevidence and make whatever independent investigation it may deem necessary."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Confirmation or denial of legal nonconforming use. The Zoning Board\nof Appeals, upon the evidence submitted to and obtained by it, shall\nmake and file with the Village Clerk a written determination confirming\nor denying that such use is a legal nonconforming use and stating\nthe facts which it finds to be established by such evidence, the basis\nof such findings and the conclusions it has drawn from such findings."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Issuance or denial of certificate of occupancy."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Upon confirmation by the Zoning Board of Appeals of any legal nonconforming\nuse pursuant to this section, the enforcement officer shall issue\nto the applicant a certificate of occupancy with an endorsement thereon\nspecifying the legal nonconforming use so confirmed, and such certificate\nshall constitute presumptive evidence that such use is a legal nonconforming\nuse in any action or proceeding brought to enforce this chapter."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Every nonconforming use for which a certificate of occupancy has\nnot been issued, as provided in this section, shall presumptively\nbe an illegal nonconforming use for the purpose of any application\nto or proceeding before any officer or board of the Village of Mineola."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "Effect of article. Nothing in this article shall be deemed to make\nlegal or to permit the confirmation of any nonconforming use which\nis not a legal nonconforming use or to invalidate the use of or require\nthe confirmation of the use of any land, building or structure for\nwhich a valid certificate of occupancy has been issued prior to and\nis in effect on the effective date of this article."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 550-28",
			"title": "(Reserved)\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t[1]",
			"content": [
				{
					"footnote": "[1]\nEditor's Note: Former § 550-28, Metal buildings and sheds,\nwas repealed 1-20-2016 by L.L. No. 1-2016.\n"
				}
			]
		},
		{
			"paragraph": "§ 550-29",
			"title": "Security gates.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Definitions. As used in this section, the following terms shall have\nthe meanings indicated:"
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Restrictions."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "No security gate shall be erected or maintained in front of or behind\ndoors, windows or other openings facing or fronting on a public road\nor highway located within a business district."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "All security gates shall be of such a type as will not prevent the\nviewing of the interior of the premises from outside the premises."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "When a security gate is not in use, it shall be removed or stored\nin such a manner so as not to be visible from the exterior of the\npremises."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Permits."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "It shall be unlawful for any person to commence work on the erection\nor alteration of or erect, alter or maintain any security gate until\na permit has been duly issued upon application therefor."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "The Building Department shall require that the application for a\npermit be accompanied by a set of plans indicating the proposed location\nand dimension of said security gate and a description of the type\nof said security gate."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "No permit shall be issued until the Building Department has examined\nand approved, in writing, the proposed security gate as complying\nwith all the provisions of this chapter."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "Permits shall expire three months following the date of issuance\nif no substantial work is commenced and may be renewed upon written\napplication to the Building Department."
												}
											]
										}
									]
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 550-30",
			"title": "Garages.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "A private detached garage accessory to a dwelling on the same lot\nor parcel may be erected in a side yard and rear yard, provided that\nthe width of the lot is sufficient to permit compliance with the side\nyard requirements in the particular district."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "On a corner lot, a private detached garage accessory to a dwelling on the same lot or parcel may be erected in the rear yard, provided the depth of the lot is sufficient to permit compliance with the provisions of § 550-32, and provided the setback of such garage complies with the front yard requirements in the particular district."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 550-31",
			"title": "Pinball machines; video games.",
			"content": [
				{
					"text": "No more than two pinball machines or video games, whether or\nnot incident to a principal use, may be permitted, maintained or operated\nby any place of business within the Village of Mineola."
				}
			]
		},
		{
			"paragraph": "§ 550-32",
			"title": "Accessory structures.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "There shall be a minimum rear yard setback of two feet, a minimum\nside yard setback of two feet and a minimum front yard setback of\n25 feet for all accessory structures."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Accessory buildings or structures, except as otherwise provided in\nthis section, shall not be over 15 feet in height at their highest\npoint and shall not occupy more than 40% of the area of the rear yard."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 550-33",
			"title": "Swimming pools.",
			"content": [
				{
					"text": "Swimming pools shall be permitted accessory structures and shall comply in every respect with the provisions of Chapter 464 of the Village of Mineola Municipal Code."
				}
			]
		},
		{
			"paragraph": "§ 550-34",
			"title": "Unlicensed or inoperative motor vehicles.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Unlicensed or inoperative motor vehicles. No lot or parcel shall\nbe used for the outside storage of an inoperative or unlicensed motor\nvehicle or vehicles except as otherwise permitted in this chapter.\nNo repairs shall be made to such vehicle or vehicles outside of enclosed\nbuildings. Nothing herein shall be construed to prohibit the storage\nof such vehicle or vehicles inside a garage or other building located\non the premises."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Motor vehicle repairs."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "The following uses shall not be permitted in any residential district:\nmotor vehicle repairs of a major nature, including but not limited\nto auto painting, body work or extensive mechanical repairs. Nothing\ncontained herein shall be deemed to prohibit either emergency repairs\nor preventive maintenance of a minor nature, such as but not limited\nto an oil change or tune up; provided, however, that such preventive\nmaintenance is performed upon or directly in front of the premises\nby an individual who is an occupant of said premises and that the\nmotor vehicle upon which this emergency repair and/or preventive maintenance\nis being performed is registered in the name of the occupant of said\npremises."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "The following uses shall not be permitted in all other zoning districts:\nAll motor vehicle repairs are hereby prohibited, except for emergency\nrepairs, on all public streets in all zoning districts, other than\nresidential, throughout the Village of Mineola."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "The following uses shall not be permitted in municipal parking fields:\nAll motor vehicle repairs are hereby prohibited in all municipal parking\nfields.[Amended 5-1-1991 by L.L. No. 4-1991]"
												}
											]
										}
									]
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 550-35",
			"title": "Parking of vehicles, mobile homes and boats.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "No space for the parking of motor vehicles shall be installed or\nmaintained on any lot in the area required or utilized for the front\nyard of such lot in any residential district, except upon that portion\nof the front yard which constitutes a permissible driveway."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "No mobile home, trailer, boat in excess of 18 feet, commercial vehicle,\nbus, ambulette, delivery van, taxi, limousine, recreational vehicle\nor motor home shall be stored or parked outdoors on any residentially\nzoned premises or premises utilized for residential purposes, whether\nas a nonconforming use or by variance granted by the Zoning Board\nof Appeals. No vehicle shall be stored in a garage on residentially\nzoned property which shall result in an increase in fire hazard in\nsuch garage, whether by containing hazardous or flammable substances,\ncombustible materials, power equipment or otherwise. In no event shall\nany boat stored on residential property be stored closer to the street\nline of such property than the front building line of the residential\nstructure situated on such property.[Amended 5-1-1991 by L.L. No. 5-1991; 10-18-2000 by L.L. No.\n37-2000; 12-5-2001 by L.L. No. 8-2001; 2-4-2004 by L.L. No.\n4-2004]"
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "The Board of Trustees may issue a ninety-day permit for a mobile\nhome placed on the lot of premises damaged by a casualty."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 550-36",
			"title": "Dish antennas.",
			"content": [
				{
					"text": "The Board of Trustees hereby determines that, in a community\nsuch as the Village of Mineola, comprised principally of one-family\nhomes, the aesthetic impact of large parabolic or hemispheric discs\nor other similar antennae or devices, measuring several feet in diameter,\ncan be offensive to the residential community and be inconsistent\nwith the character of the neighborhood. If unregulated, such devices\ncan be disruptive to the appearance of the skyline and disrupt the\npleasant nature and character of the community. Also, the interests\nof public safety require that such devices be installed in accordance\nwith well-defined engineering standards, and other safety measures\nsuch as fencing around the base may be necessary. These aesthetic\nand safety concerns do not arise in connection with dipole antennae,\nwhich blend into the skyline. The Board also finds that a regulatory\nscheme such as set forth herein allows a reasonable balancing of the\nneeds of the community and the rights of persons to reasonable access\nto television or radio stations which may be desired and allows such\nantennae to fit into the character of the community."
				},
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "General regulation. No person shall cause, suffer or permit the erection,\nconstruction, installation, relocation and/or maintenance of any parabolic\nor hemispheric disc or satellite receive-only antenna or other similar\nantenna or device, the purpose of which is to receive television,\nradio and/or microwave or other electrical or similar signals from\nsatellites or from ground facilities which transmit such signals,\nexcept as provided herein."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "As-of-right uses."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "In the B-1, B-2, B-3, H and M Zoning Districts, a satellite receive-only\nantenna two meters or less in diameter is permitted."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "In any district other than the B-1, B-2, B-3, H and M Districts,\na satellite receive-only antenna one meter or less in diameter is\npermitted."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Permit required. In all other instances, no erection, construction,\ninstallation and/or maintenance shall be permitted or continued except\nwhen permitted by special exception permit by the Board of Trustees\nafter public hearing. The first permit granted to any applicant under\nthis section shall be conditional and shall be for a period of not\nmore than two years. Any application for renewal of such conditional\npermits shall be acted upon in the same manner as an initial application\nunless a waiver of public hearing should have been granted by the\nBoard of Trustees."
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "Requirements for special exception permits."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "In evaluating whether a special exception permit should be issued,\nthe Board of Trustees shall consider the purposes set forth herein."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "The antenna or other device shall be located only in the rear yard\nof the lot unless the applicant establishes that other placement is\nnecessary to obtain reasonable reception."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "No permit shall be issued if the Board of Trustees finds that either\nthe type of antenna or disc, or the method of its placement, will\nendanger the safety of residents, neighbors or pedestrians or threaten\nproperty on the applicant's lot or adjoining lots."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "Use of any illumination for the disc or antenna is strictly prohibited."
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "All connections shall be made so that wiring and supporting cables\nshall not be visible from the street or sidewalk."
												}
											]
										},
										{
											"number": "(6) ",
											"content": [
												{
													"text": "No more than one parabolic, hemispheric, satellite receive-only,\nor similar antenna shall be erected, constructed, installed or maintained\non a single lot or premises."
												}
											]
										},
										{
											"number": "(7) ",
											"content": [
												{
													"text": "The Board of Trustees shall impose such screening requirements as\nare reasonable to effectuate the purposes set forth herein and that\nwill not substantially limit reception."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "Application for permit. All applications for permits shall be filed\nwith the Board of Trustees of the Incorporated Village of Mineola.\nThe application to the Board of Trustees shall describe the subject\npremises by street address and by section, block and lot number and\nshall describe the present use of the premises. In addition, the application\nshall be accompanied by the following:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "A location survey showing existing structures upon the premises,\ntheir location and distance from the proposed disc or antenna, the\ndimensions of the parabolic disc or antenna, the setbacks of the parabolic\ndisc or antenna from each property line and all properties and structures\nwithin a two-hundred-foot radius of the premises, showing the names\nand street addresses of the record owner of such property."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "A detailed plan showing the material from which the parabolic disc\nor antenna is to be constructed and the proposed color of the parabolic\ndisc or antenna and details illustrating the structural support system."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "A landscape plan illustrating adequate screening of the parabolic\ndisc or antenna, which will be provided to screen the parabolic disc\nor antenna from the roadway and adjoining property owners. Unless\ndemonstrated to be impracticable, all screening required shall be\nby coniferous trees and shall be of sufficient height and density\nto screen 100% of the parabolic disc or antenna from sight at ground\nlevel from the roadway and from properties located within a two-hundred-foot\nradius of the premises during the entire year."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "An application fee as set by resolution of the Board of Trustees.[1]"
												},
												{
													"footnote": "[1]\nEditor's Note: Amended at time of adoption of Code (see Ch. 1, General Provisions, Art. II).\n"
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "F. ",
							"content": [
								{
									"text": "Notice required. Prior to the public hearing held by the Board of\nTrustees, the applicant shall file a certification of notice showing\nthat all property owners within 200 feet of the applicant's property\nwere notified, in writing, by the applicant of his application, by\nregistered mail or certified mail, return receipt requested, at least\n10 days and no more than 21 days before the date scheduled for the\npublic hearing."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 550-37",
			"title": "Electric meters.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "No dwelling located within the R-1 or R-2 Zoning District shall have\nlocated thereon or therein more than one electric meter, unless consent\nthereto shall have been granted by the Board of Trustees. No dwelling\nlocated within the R-3 Zoning District shall have located thereon\nor therein more than two electric meters unless consent thereto shall\nhave been granted by the Board of Trustees."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "All nonconforming electric meters in existence on the effective date\nof this section shall, at the expiration of five years from said date,\nbe removed, and the dwelling shall be in conformity with this section\nof this chapter."
								}
							]
						}
					]
				}
			]
		}
	]
}