{
	"url": "http://ecode360.com/9461818",
	"paras": [
		{
			"paragraph": "§ 99-9",
			"title": "R-A District (multiple dwelling).",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Permitted uses. The following uses are permitted in\nthe R-A District:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "A single-family detached dwelling and accessory structures and uses as provided in Article V of this chapter."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "A two-family detached dwelling and accessory structures and uses as provided in Article V of this chapter."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "A multifamily dwelling and accessory structures and uses as provided in Article V of this chapter."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Special use. A building may be erected, altered or\nused for any purpose set forth in this subsection only when authorized\nby the Board of Trustees as a special use after a public hearing conducted\nby the Board of Trustees and for no other:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Church or other place of worship."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Parish house, rectory or Sunday school."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Public library, fire station, park or playground,\npublic or private school."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "A senior citizen multifamily residence comprised of independent living units or assisted living units or a combination thereof and accessory structures and uses as provided in Article V of this chapter."
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "Center for youth activities."
												}
											]
										}
									]
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 99-13",
			"title": "Fences and buffers.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Permit required. No fence or wall may be erected without\na permit issued by the Building Department."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Residential zones."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "In residential districts, a fence not exceeding five\nfeet in height shall be permitted on the rear lot line. Fencing for\nall other lot lines shall not exceed four feet in height and in no\ncase extend nearer to the street than the front line of the dwelling.\nOn corner lots, no fence shall be allowed in a side yard that abuts\na street. On corner lots, no rear yard fence shall extend nearer the\nstreet than 1/2 of the side yard setback for the property, but in\nno event closer than six feet to the property line. That portion of\na rear lot line fence on a corner lot located within the side yard\nsetback shall not exceed four feet in height. In determining the permissible\nheight of a fence, consideration shall be given to the slope of the\nproperty. On a property that slopes, the fence shall follow the contour\nof the natural grade directly below the fence or the maximum height\nof the fence shall be the average of the measurements from the natural\ngrade directly below the fence taken at various points along the run\nof the fence as deemed necessary by the Building Department. In no\nevent shall the maximum height of any part of the top of the fence\nrail (i.e., the horizontal supporting structure between the fence\nposts) exceed 5 1/2 feet and supporting posts shall extend no more\nthan four inches above the top fence rail. All fences shall be of\nopen construction and the design of all fences shall be approved by\nthe Architectural and Preliminary Site Review Board prior to the issuance\nof a permit. The Review Board may, by resolution, grant advance approval\nof certain fence designs, which approval shall be deemed extended\nto any permit application seeking to erect a fence of such design.[Amended 4-18-2006 by L.L. No. 2-2006]"
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Where a property abuts a nonresidential zone, a fence\nalong such line may be opaque and have a height not to exceed eight\nfeet. The placement and style of such fences shall be reviewed and\napproved by the Architectural Review Board prior to the erection of\nany such fence.[Amended 2-2-2010 by L.L. No. 3-2010]"
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Where a property abuts on a Village border, a fence\nalong such border may be opaque and have a height not to exceed six\nfeet.[Amended 2-2-2010 by L.L. No. 3-2010]"
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "Subject to the provision of Subsection B(5) below, nothing in this chapter shall prevent the erection along or adjacent to the street lines of a corner plot of a fence or fence-type structure intended as a deterrent to shortcutting the corner by pedestrians, provided that:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "No part of the structure shall extend more than\nsix feet from the point of intersection of said street lines."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "The average height of the structure shall not\nexceed 24 inches."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "The maximum height of the structure shall not\nexceed 30 inches."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "In no event shall any fence or buffer be permissible\nwhich fence and/or buffer interferes with sight lines of traffic."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Nonresidential zones."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Where a nonresidential plot abuts a residential zone\nto the rear of the plot, an appropriately landscaped and screened\nbuffer of no less than 10% of the nonresidential plot depth shall\nbe created along such abutting line."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Where a nonresidential plot abuts a residential zone,\nwhich zone is located to the side of the nonresidential plot, an appropriately\nlandscaped and screened buffer of no less than five feet shall be\ncreated on the nonresidential plot along such abutting line."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Fences shall be of opaque (closed) construction and\nshall be six feet in height."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "The following materials shall be prohibited in the\nconstruction or maintenance of fencing: barbed wire, razor wire, electrified\nmaterial and any material intending to cause injury to a person making\ncontact with the same. However, barbed wire may be permitted in the\nB-3 District when approved by the Board of Trustees."
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "No gate, when in an open position, shall obstruct\na public walkway."
												}
											]
										},
										{
											"number": "(6) ",
											"content": [
												{
													"text": "The form, layout and composition of all landscaped\nand screened buffers shall be subject to the approval of the Architectural\nand Preliminary Site Review Board."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "Fence facing. The decorative side of all fences shall\nface away from the lot or parcel enclosed."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 99-14",
			"title": "Dormers and roofs in any R-1 or R-2 District.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "No dwelling or accessory building shall be erected\nhaving as the main roof thereof a flat roof or a roof having a pitch\nof less than six inches to the foot, except as provided for one-story\none-family dwellings."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Any dormers or combination of dormers erected on the\nroof of a building having a pitch of less than six inches to the foot\nmay not occupy more than 45% of the area of the main roof as measured\nby its horizontal projection, and in no case shall the pitch be less\nthan three inches to the foot. No dormer having a pitch of less than\nsix inches to the foot shall be erected on the side of a roof facing\non and parallel to a street."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 99-15",
			"title": "Decks on residential premises.",
			"content": [
				{
					"text": "Second-story decks on residential premises are\nprohibited."
				}
			]
		},
		{
			"paragraph": "§ 99-16",
			"title": "Parking lots and parking spaces.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Uses. In addition to the uses hereinabove permitted\nand provided for in the respective districts established by this chapter,\nthe Board of Trustees may consent to and regulate the establishment\nand maintaining of public or private parking spaces or of a parking\nlot on any lot or parcel of ground in any use district."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Application required. Such use for public or private\nparking of automobiles or other vehicles in a parking lot shall not\nbe authorized or permitted except upon a written application made\nto the Board of Trustees by the owner of the lot or parcel of ground\nupon which such use is applied for, which application shall state:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "The name of the owner, and whether such land is occupied\nby the owner or by a lessee or other occupant of said lot or parcel."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "A general statement of the location of the property\nand of the classification of the district in which \"said lot or parcel\nis located, a description of the lot or parcel by metes and bounds,\na survey and a proposed site plan depicting all parking spaces, aisles,\nturning lanes, curb cuts, locations of ingress and egress, signs,\nlighting, drainage, open spaces, buffers and vegetation."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "A statement of whether the applicant intends to use\nsaid lot or parcel for the purpose of parking automobiles or other\nvehicles, for hire or rental, or whether the applicant intends to\nrestrict the parking privileges on said lot or parcel to a particular\ngroup or classification of persons."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "An area map showing all properties, subdivisions,\nstreets, rights-of-way and other pertinent features within 300 feet\nof the boundaries of the proposed parking site."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Municipal parking fields. In cases of proposed establishment\nof municipal parking fields, the Board of Trustees may proceed upon\nits own motion, but in so proceeding shall comply with the provisions\nof this chapter relating to the filing of a statement of ownership,\ndescription and location of the lot or parcel proposed to be used\nas a municipal parking field, filing plans and specifications for\nadaptation of said parcel for such use, and the holding of a public\nhearing, as herein provided."
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "Dimensions. Each parking space shall be paved in accordance\nwith the Building Code and shall have minimum dimensions of nine feet\nby 20 feet with driveways of sufficient width to afford accessibility\nto each parking space. All parking areas shall have sufficient self-contained\ndrainage, adequate means of ingress and egress, asphalt or concrete\npaving and proper lighting."
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "Applications to be filed with the Village Clerk. All\napplications and statements required to be made hereunder shall be\nfiled in the office of the Village Clerk and shall be open to public\ninspection during the hours when the office of the Village Clerk is\nopen for business."
								}
							]
						},
						{
							"number": "F. ",
							"content": [
								{
									"text": "Public hearing required. A public hearing shall be\nheld upon all applications to establish one or more privately owned\nparking spaces in a privately owned parking area, or a municipal parking\nfield, upon the same notice and subject to the same conditions and\nprovisions contained in the Village Law applicable to amending, supplementing,\nchanging, modifying or repealing zoning regulations, restrictions\nand boundaries."
								}
							]
						},
						{
							"number": "G. ",
							"content": [
								{
									"text": "Issuance of permit and/or revocation of the same.\nUpon the hearing, the Board of Trustees may, in the reasonable exercise\nof its discretion, grant or refuse such application; and if such application\nbe granted, shall issue a permit for the construction, maintenance\nand operation of such parking field, for a period of time it deems\nappropriate. In the event that the construction of such parking field\nshall not have been commenced within six months of the date of issuance\nof the permit or if said construction is not completed within 18 months\nof the date of issuance of the permit, such permit shall become void\nunless an extension of the permit shall have been granted by the Board\nof Trustees. In the further event that such parking field shall not\nhave been constructed and maintained within reasonably substantial\ncompliance with the plans and specifications filed, the Board of Trustees\nmay, upon its own motion and upon notice to the owner of said land\nand the proprietor of said parking field (if such proprietor be not\nthe owner), and after due hearing, revoke such permit. In the event\nof such revocation, the owner of said parking space, and the occupant\nof said parcel of ground (if the occupant be not the owner), shall\nforth with discontinue and all other persons shall forthwith cease\nusing such parcel of ground for the parking of automobiles or other\nvehicles, and any continuation of parking automobiles or other vehicles\non such parcel of ground shall be deemed a violation of this chapter."
								}
							]
						},
						{
							"number": "H. ",
							"content": [
								{
									"text": "Exceptions and prohibitions.[Amended 3-23-2004 by L.L. No. 4-2004]"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "This article shall not apply to the parking of automobiles\nor other vehicles placed or kept inside garages, nor shall a separate\npermit or public hearing be required for the creation of parking spaces\nrequired under a building permit pursuant to the minimum parking requirements\nset forth for each zoning district."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Above-grade multilevel or tiered parking facilities\nare prohibited in all zoning districts of the Village."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Applications for below-grade parking facilities shall be presented to the Board of Trustees in the manner provided under § 99-60 of the Code for special use permits. However, in making its determination, the Board of Trustees shall take into consideration the benefit to the applicant if the application is granted, as weighed against the detriment to the health, safety and welfare of the neighborhood or community by such grant."
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "In making such determination, the Board of Trustees\nshall also consider: whether an undesirable change will be produced\nin the character of the neighborhood or a detriment to nearby properties\nwill be created by granting the permit; whether the benefit sought\nby the applicant can be achieved by some method, feasible for the\napplicant to pursue, other than a grant of the permit; whether the\nrequested permit is for a substantial facility; whether the facility\nwill have an adverse effect or impact on the physical or environmental\nconditions in the neighborhood or district; and whether the applicant's\nalleged difficulty was self-created."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "The Board of Trustees shall, in the granting\nof any such permits, have the authority to impose such reasonable\nconditions and restrictions as are directly related to and incidental\nto the below-grade parking facility. Such conditions shall be consistent\nwith the spirit and intent of this Code and shall be imposed for the\npurpose of minimizing any adverse impact the facility may have on\nthe neighborhood or community. The violation of any condition imposed\nby the Board of Trustees shall be a violation of this chapter and\nshall result in the revocation of the permit."
																}
															]
														}
													]
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "I. ",
							"content": [
								{
									"text": "Public notice of renewal applications not required.\nNothing herein contained shall require the publication of a notice\nof further hearings in cases where applications for renewal of permits\ngranted hereunder shall have fully complied with all the provisions\nhereinabove stated."
								}
							]
						},
						{
							"number": "J. ",
							"content": [
								{
									"text": "Required parking in zoning districts."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Parking requirements for each zoning district shall\nbe as listed in the annexed Schedule of Regulations,[1] and shall otherwise conform to the provisions of this\narticle. Parking spaces for one-family and for two-family dwellings\nshall be provided in the driveway portion of the front, side and rear\nyards, or by garage."
												},
												{
													"footnote": "[1]\nEditor's Note: The Schedule of Regulations\nis included at the end of this chapter.\n"
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "In the event that a residential parcel shall contain\na full driveway extending into the rear yard, parking for said parcel\nshall be upon the driveway."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "In the event that a residential parcel shall contain\na driveway which ends at the front building line, then parking shall\nbe provided upon said driveway and upon any permitted paved area,\npursuant to this subsection, in the front yard setback. No more than\n25% of the front yard square footage of any residential lot, including\ndriveway, may be paved and used for parking. Such paved area shall\nnot extend from a point beginning one foot from the side property\nline more than a distance equal to 25% of the property width. Any\npaved walkway serving the premises shall be counted against the maximum\n25% of the front yard square footage stated above unless said walkway\nis separated from the parking area by a green belt at least two feet\nin width."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "The parking requirements set forth in this article\nmay be provided off the premises on a separate plot where such separate\nplot is in common ownership with the plot on which the use is located\nprovided that:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "The separate plot is within 200 feet of the\nplot on which the use is located; and"
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "The separate plot is in the same zoning district\nas the plot on which the use is located."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "In each instance of a residential cooperative or condominium,\neach unit, whether owned or leased, shall be assigned at least one\nparking space."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "K. ",
							"content": [
								{
									"text": "Residential corner lots. Parking upon a residential\ncorner lot shall be permitted within a driveway located in the side\nyard setback bordering the side street. Such parking shall be in a\npaved area running from the rear accessory setback line of one foot\nof the lot for a maximum distance of 14 feet towards the front lot\nline."
								}
							]
						},
						{
							"number": "L. ",
							"content": [
								{
									"text": "Vehicles other than automobiles. No trailer, boat,\nrecreational vehicle or motor home shall be stored or parked outdoors\non any premises unless a permit is granted therefor by the Board of\nTrustees by resolution. No commercial vehicle shall be stored or parked\nupon any residentially zoned property."
								}
							]
						},
						{
							"number": "M. ",
							"content": [
								{
									"text": "Temporary house trailers. The Superintendent of Buildings\nshall be authorized upon, application, to issue a ninety-day permit\nfor a house trailer placed on the lot of a premises damaged by a casualty."
								}
							]
						},
						{
							"number": "N. ",
							"content": [
								{
									"text": "Special exception for parking on residential lots."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "The Zoning Board of Appeals may authorize a special\nexception to permit one car to park about a dwelling in an open area\nthat is not a driveway, upon the following conditions:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "The Zoning Board shall make a finding that the\ngranting of a permit for additional off-street parking shall meet\nthe legitimate parking needs of the residential owner while preserving\nthe general appearance of the residential neighborhood in which the\nlot is located as well as the public safety, health, convenience and\ngeneral welfare of the Village."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "The applicant must demonstrate unnecessary hardship\nand/or practical difficulty in complying with the provisions of this\nchapter, and the fact that the applicant needs or uses his garage\nfor storage shall not be deemed unnecessary hardship or practical\ndifficulty."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "No vehicle shall be permitted to be parked so\nas to overhang a sidewalk."
																}
															]
														},
														{
															"number": "(d) ",
															"content": [
																{
																	"text": "No vehicle shall be permitted to be parked on\ngrass or dirt."
																}
															]
														},
														{
															"number": "(e) ",
															"content": [
																{
																	"text": "No permit under this section shall be for more\nthan two years."
																}
															]
														},
														{
															"number": "(f) ",
															"content": [
																{
																	"text": "The applicant shall execute and deliver to the\nZoning Board of Appeals a written covenant in a form suitable for\nfiling with the County Clerk that any improvements made to the premises\nas a result of a special exception permit granted pursuant to this\nchapter shall be removed upon the expiration of that special exception\npermit and that the premises shall be converted back to their original\ncondition as if the special exception permit was not granted."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "In applying for a special permit exception under this\nsection the applicant must:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "Complete the written application form required\nby the Zoning Board of Appeals."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "Submit copies of all automobile registrations\nfor all vehicles maintained at the premises."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "Permit the Zoning Board of Appeals to inspect\nthe applicant's exterior premises and the interior of any garage on\nthe applicant's premises."
																}
															]
														},
														{
															"number": "(d) ",
															"content": [
																{
																	"text": "Pay the required fee."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Upon issuance of a special exception permit under\nthis section, the Village Clerk shall issue a sticker for the vehicle\nor vehicles designated by the applicant and by the Zoning Board of\nAppeals as the vehicle or vehicles to be parked in the new parking\narea that is authorized by a special exception permit under this section.\nThe applicant shall place the sticker upon the designated vehicle\nwhich shall be the only vehicle authorized to use that space."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "Renewal of permits. A special exception permit may\nbe renewed by the Zoning Board of Appeals without hearing and without\nfee upon the owner of the premises submitting a duly sworn affidavit\nthat the special circumstances that constituted unnecessary hardship\nor practical difficulty to grant the permit still exist. Copies of\nthe registrations of all vehicles maintained at the premises shall\nbe attached to the affidavit. A permit may be renewed for two periods\nof two years each."
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "In granting a permit under this section, the Zoning\nBoard of Appeals may impose such further conditions as it deems appropriate,\nnecessary or advisable to preserve the intent of this section."
												}
											]
										}
									]
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 99-18",
			"title": "Adult uses (B-3 District).",
			"content": [
				{
					"text": "The following adult uses shall be allowable\nin a B-3 District and in no other district:"
				},
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Purposes and considerations."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "In the execution of this section, it is recognized\nthat there are some uses which are entitled to a certain degree of\nconstitutional protection. Nevertheless, such uses, due to their very\nnature, have serious objectionable characteristics. The objectionable\ncharacteristics of these uses are further heightened by their concentration\nin any one area, thereby having deleterious effects on adjacent areas.\nSpecial regulation of these uses is necessary to ensure that these\nadverse effects will not contribute to the blighting or downgrading\nof the surrounding neighborhoods or land uses."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "It is further declared that the location of these\nuses in regard to areas where our youth may regularly assemble and\nthe general atmosphere encompassing their operation is of great concern\nto the Incorporated Village of Floral Park."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "These special regulations are itemized in this section\nto accomplish the primary purposes of preventing a concentration of\nthese uses in any one area and restricting their accessibility to\nminors."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Definitions. As used in this section, the following\nterms shall have the meanings indicated:"
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "The adult uses as defined in Subsection B above are to be restricted as to location in the following manner in addition to any other requirements of this Code:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Any of the above uses shall not be located within\na two-hundred-foot radius of any area zoned for residential use."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Any of the above uses shall not be located within\na one-fourth-mile radius of another such use."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Any of the above uses shall not be located within\na two-hundred-fifty foot radius of any school, church or other place\nof religious worship, park, playground or playing field."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "The restrictions enumerated in Subsection C above may be waived by the Board of Trustees of the Village if the applicant shows and the Board finds, after public hearing, that the following conditions have been met:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "That the proposed use will not be contrary to the\npublic interest or injurious to nearby properties and that the spirit\nor intent of this chapter will be observed;"
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "That the establishment of an additional use of this\ntype in the area will not be contrary to any program of neighborhood\nconservation or improvement, either residential or nonresidential;\nand"
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "That 51% or more of the property owners within the restricted area as defined in Subsection C of this section have signed a petition stating that they have no objection to the establishment of one of the uses defined above."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "No more than one of the adult uses as defined above\nshall be located on any lot."
								}
							]
						},
						{
							"number": "F. ",
							"content": [
								{
									"text": "By amortization, the right to maintain a legal nonconforming\nadult use shall terminate in accordance with the following schedule:"
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 99-19",
			"title": "Security gates prohibited.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Exterior. No owner or occupant of any property shall\ninstall or maintain or cause to be installed or maintained on any\nbuilding or structure within the Village of Floral Park a security\ngate or door of any make, manufacture, design or material, including\nbut not limited to gates or doors more commonly referred to as \"roll-up\ngates,\" \"roll-up doors,\" \"roll-up grilles,\" \"roll-up shutters,\" \"rolling\ndoors\" or \"folding gates.\""
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Interior. No owner or occupant of any property shall\ninstall or maintained or cause to be installed or maintain in the\ninterior of any building or structure within the Village of Floral\nPark a security gate or security door of any make, manufacture, design\nor material unless such gate or door shall allow the interior of the\nstore to be clearly visible from the front sidewalk. Prior to installation,\nthe Architectural and Preliminary Site Review Board shall approve\nsuch gate or door to ensure that it complies with this section. This\nprovision shall not apply to any security gate or door in a location\nthat is not visible from the sidewalk."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 99-20",
			"title": "Boarding of windows and doors prohibited.",
			"content": [
				{
					"text": "It shall be unlawful for any person, either\nas owner, lessee or occupant of a residential dwelling or commercial\nbuilding, to cover any broken, damaged, defective or missing window\nor door on such dwelling or building with wood boards, sheet metal,\nsheet rock or any other material. Such owner, lessee or occupant shall\nbe required to remove such covering and repair or replace the broken,\ndamaged, defective or missing window or door within 10 days of service\nof a written notice from the Superintendent of Buildings to do so.\nService of such notice may be made by personal service or by certified\nmail, return receipt requested, addressed to the owner, lessee or\noccupant at the subject property."
				}
			]
		},
		{
			"paragraph": "§ 99-21",
			"title": "Yard regulations and encroachments.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Front yard."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Every lot in any residential district shall have a\nfront yard with a depth not less than the average of the depths of\nthe existing front yards on the lots in the same block; provided,\nhowever:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "The front yard on a lot situated between and\ncontiguous to two lots on which there are existing buildings need\nnot have a depth greater than the average of the depths of the front\nyards on such contiguous lots."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "The front yard on a corner lot when there is\nan existing building on the contiguous interior lot fronting the same\nstreet need not have a depth greater than that of the front yard on\nsuch contiguous lots."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "No front yard need have a depth of more than\n20 feet."
																}
															]
														},
														{
															"number": "(d) ",
															"content": [
																{
																	"text": "In all instances, the front yard setback shall\nbe measured from the front wall of the primary structure to the property\nline."
																}
															]
														}
													]
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Side yards. In any residence district, the side yard\non the street side of a corner lot shall have a width of not less\nthan 1/4 of the lot frontage; provided, however, that no such side\nyard need have a width greater than 25 feet."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Rear yards. In any residence district, the rear yard\nshall have a minimum depth of 25 feet. In the case of an uncovered\ndeck, the rear yard shall have a minimum depth of 20 feet."
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "Side lines of lots shall be at right angles to street\nlines and rear lot lines; lot width shall be consistently maintained\nfrom the front lot line to the rear lot line. “Flag lots\" shall\nbe prohibited in any residential district."
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "The following features, and no others, may extend into required yards and courts not to exceed the distances specified and, except for Subsection E(4), (5) and (8), shall not be included in computing the building coverage:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Balconies on multifamily dwellings, not more than\n10 feet in width and completely unroofed and unenclosed: extension\nof six inches."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Belt courses, leaders, sills and similar architectural\nfeatures: extension of six inches."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Canopies, cornices, eaves and similar architectural\nfeatures: extension of 20 inches."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "Cover over front steps only (not over a porch or other\nplace or area), provided that such cover shall conform in architecture\nand in material to the existing building and further provided that\nsaid cover shall not project laterally beyond the maximum extent of\nthe top of the existing front steps and in no event shall extend more\nthan four feet from the face of the building, nor be greater than\nsix feet in width."
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "Vestibule, not over four feet in depth, on the front\nof an existing building in any residence district, provided that there\nremains, after the erection of said vestibule, a front yard having\na depth not less than the least depth of front yard existing in the\nsame block or 20 feet, whichever is greater, and provided that said\nvestibule conforms in architecture and material to said existing building."
												}
											]
										},
										{
											"number": "(6) ",
											"content": [
												{
													"text": "Unroofed and unenclosed steps and stoops, into side\nyard: extension of 60%."
												}
											]
										},
										{
											"number": "(7) ",
											"content": [
												{
													"text": "Unroofed and unenclosed steps and stoops, terraces\ninto the front yard, rear yard, and street side yard: extension of\n25%."
												}
											]
										},
										{
											"number": "(8) ",
											"content": [
												{
													"text": "Bay windows and bow windows: extension of 30 inches\nin the front yard only."
												}
											]
										},
										{
											"number": "(9) ",
											"content": [
												{
													"text": "Masonry fireplace or chimney not more than two feet\ninto the five-foot-minimum side yard. Fireplaces shall not exceed\nfive feet in width."
												}
											]
										},
										{
											"number": "(10) ",
											"content": [
												{
													"text": "Window wells may extend two feet into the required\nside yard, provided that the entire well is protected by a horizontal\ngrating constructed in conformity with the New York State Building\nCode."
												}
											]
										},
										{
											"number": "(11) ",
											"content": [
												{
													"text": "Paving in the front yard of any residence not exceeding\n35% of the area of the front yard and limited to a driveway not exceeding\n12 feet in width and a walkway not exceeding four feet in width separated\nfrom the driveway by at least two feet of green space. The driveway\nalso shall be separated from the property line by at least one foot\nof green space."
												}
											]
										},
										{
											"number": "(12) ",
											"content": [
												{
													"text": "Unless otherwise authorized by the Architectural and\nPreliminary Site Review Board, all new construction of buildings or\nstructures or alterations or additions to existing buildings shall\nrequire that a front or side building wall or a combined new and existing\nfront or side building wall may extend to a horizontal length of not\nmore than 30 feet without a change or break of at least two feet;\nwith an additional required break of at least two feet for every 25\nfeet of additional horizontal feet thereafter. No more than 75% of\na two-story front wall shall be constructed, altered or added in one\nvertical plane; the balance of said wall construction shall follow\na vertical plane which is separated from the former plane by at least\ntwo feet.[Added 7-15-2008 by L.L. No. 2-2008; amended 2-7-2012 by L.L. No. 3-2012]"
												}
											]
										}
									]
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 99-21.1",
			"title": "Street and road regulations.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "All streets and roads shall be constructed in conformity\nwith the advantageous development of the area of the neighborhood\nwhere situated and in such a manner as necessary for fire protection,\nproper movement of traffic, and for construction or extension of needed\nutilities and public services, such as sewer, water and drainage facilities."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "All new streets or roads, as well as the continuation\nof existing streets and roads, shall not be less than 50 feet in width,\nwith sidewalks being set back at least three feet from the street\nor road."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "A cul-de-sac shall not exceed 200 feet in length and\nshall be equipped with a turnaround roadway having a minimum radius\nof 45 feet from the curbline at the closed end."
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "Street and roads shall be adjusted to the contour\nof the land to avoid dangerous gradients. Grades of all streets and\nroads shall not be less than 0.3% nor more than 10%. Gradients shall\nbe used to facilitate surface drainage to proper natural or artificial\noutlets. Such street drainage, including recharge basins, shall be\ninstalled and maintained in a manner and location as approved by the\nVillage Engineer."
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "Sidewalks, curb pavement, street signs, property line\nmonuments and driveway aprons shall be installed in a manner and location\nas approved by the Village Engineer."
								}
							]
						},
						{
							"number": "F. ",
							"content": [
								{
									"text": "No street or road shall be constructed unless the\nowner of the land shall irrevocably offer to dedicate same to the\nVillage. The filing of an application for a subdivision which includes\na street or road shall constitute an irrevocable offer of dedication\nof the street or road by the owner of the land to the Village. The\nVillage may in its absolute discretion, accept or not, at such time\nor times, or at any time in the future, such offer of dedication of\nstreets or roads."
								}
							]
						},
						{
							"number": "G. ",
							"content": [
								{
									"text": "No street or road shall be constructed unless a bond,\nissued by a surety approved by the New York State Superintendent of\nInsurance, for the full amount of the costs of the improvement is\nposted with the Village. Said bond shall remain in full force and\neffect until final inspection and approval of the street or roadway\nby the Village Engineer."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 99-22",
			"title": "Garages.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "In the R-1 and R-2 Districts, a private detached garage\naccessory to a dwelling on the same lot or parcel shall be erected\nin a rear yard."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "In the R-1 and R-2 Districts, on a corner lot, a private\ndetached garage accessory to a dwelling on the same lot or parcel\nshall be erected in the rear yard, provided that the depth of the\nlot is sufficient to permit compliance with the provisions of this\nchapter, and provided that the setback of such garage complies with\nthe front yard requirements in the particular district."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "In any other district where residential use is permitted,\na private detached garage shall be permitted as an accessory use to\na multiple-family dwelling as part of the site plan approval process."
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "In any R-1 or R-2 District, no accessory garage shall\nbe erected to house more than two passenger vehicles."
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "A garage shall not exceed 17 feet in height and shall\nbe located at least 10 feet from the dwelling.[Amended 7-15-2008 by L.L. No. 3-2008]"
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 99-23",
			"title": "Open storage.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Special use. No property shall be used for the open\nstorage of any article, merchandise, material or machinery, except\nthat in the B-3 Districts such use may be permitted as a special use\nby the Board of Trustees after notice and public hearing."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Application required for special use permit for open\nstorage. An application shall be made in writing, by the owner or\nlessee of that lot or parcel of land upon which open storage use is\napplied for, and said application shall state the following:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "The name of the owner and/or lessee or other occupant."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "The general statement of the location of the property\nand of the classification of the use district in which such lot, parcel\nof land or plot is located."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "A survey showing the boundary of such parcel, together\nwith the size of the parcel by metes and bounds."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "A suitable drawing of the parcel showing any buildings\nor structures on the property or buildings or structures to be erected\nthereon and the proposed location of open storage."
												}
											]
										}
									]
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 99-24",
			"title": "Accessory buildings and structures.",
			"content": [
				{
					"text": "Except for outdoor pools, the regulations applying to which are set forth in § 99-25, and garages, the regulations applying to which are set forth in § 99-22, the following regulations shall apply to accessory buildings and structures in any residence district:"
				},
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "A detached accessory building or structure may be\nlocated in and may occupy not more than 30% of the area of any rear\nyard and shall be located a distance of at least:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Eight feet from any dwelling or main building."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "One foot from any lot line, with no cornice overhanging\nsuch building more than six inches."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Forty-five feet from any street line, except that\non a corner lot the distance shall be at least 45 feet from the line\nof the street of narrower frontage and 15 feet from the line of the\nstreet of greater frontage."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "No accessory building or structure shall have a dimension\nin excess of 100 square feet in area nor shall such building or structure\nexceed eight feet in height."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "No accessory building may be used for habitable space."
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "A lattice may be located in the rear yard of a residentially\nzoned lot. The lattice must be one foot from any lot line and may\nhave a maximum height of six feet. For each additional one foot of\nsetback from a lot line the lattice may have a height increase of\nsix inches, up to a maximum of eight feet."
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "No freestanding playyard equipment or apparatus, such\nas a swing set, tree house or similar structure, shall be located\nwithin five feet of any property line, nor shall its platform exceed\neight feet or its highest point, including its roof, exceed 12 feet\nin height above the grade directly below said structure when measured\nto the structure's highest point. All playyard structures shall be\nlocated in the rear yard or, in the case of a corner lot, shall not\nextend past the wall of the primary structure closest to the street.[Added 4-20-2004 by L.L. No. 7-2004]"
								}
							]
						},
						{
							"number": "F. ",
							"content": [
								{
									"text": "No part of any freestanding heating, cooling, pumping,\nfiltering, generating or other type of equipment or device shall be\nlocated in any front or side yard, or within 20 feet of any rear lot\nline, except that freestanding heating and cooling equipment may be\nlocated in the side yard, provided that it is no more than 45 feet\nfrom the rear property line and 10 feet from the side lot line. On\na corner lot, such equipment shall be allowed in a yard that abuts\na street, provided that the main entrance to the premises is not in\nthe same yard and that an adequate landscape buffer, approved by the\nBuilding Department, is installed and maintained. On a corner lot,\nsuch equipment shall not be located in the rear yard nearer the street\nthan 1/2 of the side yard setback for the property, but in no event\ncloser than six feet to the property line. At the time of installation\nof any such equipment, the property owner shall file with the Building\nDepartment proof that the equipment has a certified sound-level rating\nat the adjoining property line not exceeding 50 decibels. In addition,\nany such equipment shall be screened in a manner approved by the Building\nDepartment. [Added 8-8-2006 by L.L. No. 6-2006; amended 7-15-2008 by L.L. No. 1-2008; 9-16-2008 by L.L. No.\n6-2008; 8-21-2012 by L.L. No. 5-2012]"
								}
							]
						},
						{
							"number": "G. ",
							"content": [
								{
									"text": "A permanent, fixed generator or any portable generator connected\nto the gas service of the main structure shall be located on a concrete\npad in the rear yard and be a least 10 feet from the residence or\ngarage and at least 10 feet from any property line. At the time of\ninstallation of such equipment, the property owner shall file with\nthe Building Department a certified sound test report as proof that\nthe installation meets the following sound test levels: 1) at the\nside property line not exceeding 56 decibels; 2) if the rear lot line\nabuts the rear lot line of the neighbor's property, not exceeding\n60 decibels at the rear lot line; and 3) if the rear property line\nabuts the side property line of a neighbor's property in the\ncase of a corner lot, not exceeding 56 decibels at the rear property\nlot line. On corner lots, the generator shall be located as provided\nin Subdivision F, except no such unit shall be allowed to be located\nin the side yard abutting a street. The cycling of generators for\nmaintenance purposes shall only be done on a weekday between 9:00\na.m. and 5:00 p.m. Generators shall only be operational between the\nhours of 8:00 a.m. and 10:00 p.m. The property owner shall apply for\nand obtain from the Building Department all required permits, including\nplumbing, electrical and building (with engineer drawings and sound\nlevel certification).[Added 8-6-2013 by L.L. No. 5-2013]"
								}
							]
						},
						{
							"number": "H. ",
							"content": [
								{
									"text": "Special exception for generators on residential lots.[Added 8-6-2013 by L.L. No. 5-2013]"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "The Zoning Board of Appeals may authorize a special exception to\npermit a generator to be located in an area other than permitted under\nthis section upon the following conditions:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "The Zoning Board shall make a finding that the granting of the\npermit shall meet the legitimate needs of the residential owner while\npreserving the general appearance of the residential neighborhood\nin which the lot is located, as well as the public safety, health,\nconvenience and general welfare of the Village."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "The applicant must demonstrate unnecessary hardship and/or practical\ndifficulty in complying with the provisions of this section."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "In applying for a special permit exception under this section, the\napplicant must complete the written application form required by the\nZoning Board of Appeals."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Renewal of permits. A special exception permit may be renewed by\nthe Zoning Board of Appeals without hearing and without fee upon the\nowner of the premises submitting a duly sworn affidavit that the special\ncircumstances that constituted unnecessary hardship or practical difficulty\nto grant the permit still exist. A permit may be renewed for two periods\nof two years each."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "In granting a permit under this section, the Zoning Board of Appeals\nmay impose such further conditions as it deems appropriate, necessary\nor advisable to preserve the intent of this section."
												}
											]
										}
									]
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 99-25",
			"title": "Swimming pools and prefabricated units.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Application of section. No outdoor swimming pool or\nprefabricated unit shall be constructed, erected or maintained in\nthe Village of Floral Park except in conformity with this chapter,\nthe Municipal Code and all applicable state laws, rules and regulations."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Definitions. As used in this chapter, a swimming pool\nis hereby defined as any structure intended for swimming, bathing\nor wading, either above or below ground, having a depth for retaining\nwater of 20 inches or more and a capacity of 200 gallons or more.\nAs used in this chapter, a prefabricated unit is hereby defined as\na self-contained portable hot tub or spa unit used for recreational\npurposes and having a maximum capacity of 300 gallons."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Permit required. No swimming pool or prefabricated\nunit shall be constructed, erected or maintained unless a permit for\nthe same shall have been issued by the Superintendent of Buildings.\nAn application for such permit shall be on such form as may be furnished\nby the Building Department, and shall be accompanied by complete plans\nand specifications of the pool or prefabricated unit, the plan for\nthe disposal of water, the type and location of fencing and a survey\nor map showing the location thereof with respect to the boundary lines\nof the land of the applicant. Permits may be issued only upon application\nof the owner of the land or his or her agent duly authorized, in writing,\nto make such application. Applications shall be accompanied by a permit\nfee established by resolution of the Board of Trustees."
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "Annual renewal required. No swimming pool or prefabricated\nunit shall be maintained or used after the year of initial installation\nor construction thereof except after obtaining from the Building Department\na permit for such maintenance and use. Such permit shall be obtained\neach year before any use is made of such swimming pool or prefabricated\nunit. A fee for said renewal permit shall be in such amount as the\nBoard of Trustees shall determine by resolution."
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "Materials of construction. No swimming pool or prefabricated\nunit shall be built, constructed or maintained except of materials\nhaving adequate strength to retain the water designed to be contained\ntherein. Each swimming pool or prefabricated unit shall be designed\nin accordance with sound engineering practice."
								}
							]
						},
						{
							"number": "F. ",
							"content": [
								{
									"text": "Water disposal. Water overflowing from the swimming\npool or prefabricated unit and when the swimming pool or prefabricated\nunit is emptied shall be disposed of on the owner's land and shall\nbe prevented from flowing over or into the land of any adjoining property\nowner or over or into any abutting street, or into any storm sewer.\nAll water must be disposed of through the homeowner's sanitary sewer\nsystem."
								}
							]
						},
						{
							"number": "G. ",
							"content": [
								{
									"text": "Fencing. Fencing shall be in compliance with the provisions\nof the New York State Residential Code."
								}
							]
						},
						{
							"number": "H. ",
							"content": [
								{
									"text": "Perimeter required. There shall be a perimeter of\nat least five feet around a swimming pool, which perimeter shall be\nbetween the edge of the swimming pool and the fence erected around\nthe swimming pool."
								}
							]
						},
						{
							"number": "I. ",
							"content": [
								{
									"text": "Lighting. No lighting shall be permitted in, on or\nabout said swimming pool, except such lighting that shall shine into\nor upon said swimming pool and cast no light or reflections onto abutting\nproperties. All electrical work shall be performed by a licensed electrician\nin accordance with the provisions of the National Electrical Code."
								}
							]
						},
						{
							"number": "J. ",
							"content": [
								{
									"text": "Abandonment. Should the owner abandon the swimming\npool, he or she shall arrange to remove the depression and return\nthe surface of the ground to its original grade and approximately\nin the same condition as before the swimming pool was constructed,\nand he or she shall further notify the Superintendent of Buildings\nof the abandonment so that the inspection of the site may be made\nand the records of the permit may be marked accordingly."
								}
							]
						},
						{
							"number": "K. ",
							"content": [
								{
									"text": "Location. Every swimming pool and prefabricated unit\nshall conform to the following requirements as to location:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Not less than a distance of five feet from any rear\nor side line of the lot, but not less than 10 feet from any lot line\nalong an abutting street or along a side or front yard on any contiguous\nlot; provided, however, that each of the foregoing distances shall\nbe increased by one foot for each 100 square feet by which the area\nof the plane surface of water of any pool exceeds (or would exceed\nif the pool were completely filled) 500 square feet."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Not less than a distance of 10 feet from any cesspool\nor any part of a sewage disposal system (other than a sewer main)."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": ""
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "All swimming pools shall have a distance of\nnot less than 10 feet from any main building and not less than five\nfeet from any accessory building."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "All prefabricated units shall have a distance\nof not less than five feet away from any accessory structure."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "In addition, a private outdoor pool shall be located\nonly in a rear yard, and the coverage thereof shall not exceed 30%\nof the area of the rear yard for all accessory buildings and structures\nlocated therein; provided, however, that no such pool shall occupy\nmore than 15% of the area of any rear yard."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "L. ",
							"content": [
								{
									"text": "Enforcement. The Enforcement Office shall be empowered\nto enforce the regulations herein set forth and to compel the removal\nof any swimming pool or prefabricated unit that fails to meet the\nrequirements as to installation or proper maintenance of the swimming\npool or prefabricated unit, water disposal and appurtenances."
								}
							]
						},
						{
							"number": "M. ",
							"content": [
								{
									"text": "Compliance. The owner of any land upon which a swimming\npool or prefabricated unit shall have been constructed prior to the\ndate of adoption of the local law from which this chapter is derived\nshall obtain a permit and comply with the requirements contained herein."
								}
							]
						},
						{
							"number": "N. ",
							"content": [
								{
									"text": "Penalties. Any person violating any provisions of this chapter shall be punished as provided in § 99-63 of this Municipal Code."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 99-26",
			"title": "Unlicensed or inoperative motor vehicles/motor vehicle repairs.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "No lot or parcel shall be used for the outside storage\nof an inoperative or unlicensed motor vehicle or vehicles except as\notherwise permitted in this chapter. No repairs shall be made to such\nvehicle or vehicles outside of enclosed buildings. Nothing herein\nshall be construed to prohibit the storage of such vehicle or vehicles\ninside a garage or other building located on the premises, provided\nthat such vehicle or vehicles are owned by the owner or occupant of\nthe principal residence."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Motor vehicle repairs."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "The following uses shall not be permitted in any residential\ndistrict: motor vehicle repairs of a major nature, including but not\nlimited to auto painting, body work or extensive mechanical repairs.\nNothing contained herein shall be deemed to prohibit either emergency\nrepairs or preventive maintenance of a minor nature, such as but not\nlimited to an oil change or tune-up; provided, however, that such\nemergency repairs and/or preventive maintenance is performed upon\nthe premises by an individual who is an occupant of said premises\nand that the motor vehicle upon which the emergency repairs and/or\npreventive maintenance is being performed is registered in the name\nof the occupant of said premises."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "All motor vehicle repairs are hereby prohibited, except\nfor emergency repairs, on all public streets and in all municipal\nparking fields in all zoning districts other than residential, throughout\nthe Village of Floral Park unless pursuant to a special permit."
												}
											]
										}
									]
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 99-27",
			"title": "Satellite dish antennas.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Purpose. The Board of Trustees hereby determines that,\nin a community such as the Village of Floral Park, comprised principally\nof one-family homes located on one-hundred-foot by forty-foot lots,\nthe aesthetic impact of large parabolic or hemispheric discs or other\nsimilar antennas or devices, measuring several feet in diameter, can\nbe offensive to the residential community and be inconsistent with\nthe character of the neighborhood. If unregulated, such devices can\nbe disruptive to the appearance of the skyline and disrupt the pleasant\nnature and character of the community. Also, the interests of public\nsafety require that such devices be installed in accordance with well-defined\nengineering standards, and other safety measures such as fencing around\nthe base may be necessary. These aesthetic and safety concerns do\nnot arise in connection with dipole antennas, which blend into the\nskyline. The Board also finds that a regulatory scheme such as set\nforth herein allows a reasonable balancing of the needs of the community\nand the rights of persons to reasonable access to television or radio\nstations that they desire and to allow such antennas to fit into the\ncharacter of the community."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Permit required. No person shall cause, suffer or\npermit the erection, construction, installation, relocation and/or\nmaintenance of any parabolic or hemispheric disc or satellite receive-only\nantenna or other similar antenna or device, the purpose of which is\nto receive television, radio and/or microwave or other electrical\nor similar signals from satellites or from ground facilities which\ntransmit such signals, except as provided herein."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "As-of-right uses."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "In any commercial or industrial district, a satellite\nreceive-only antenna two meters or less in diameter is permitted."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "In any district other than a commercial or industrial\ndistrict, a satellite receive-only antenna one meter or less in diameter\nis permitted."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "In all other instances, no erection, construction,\ninstallation and/or maintenance shall be permitted or continued except\nwhen permitted by special use permit by the Board of Zoning Appeals,\nafter public hearing. The first permit granted to any applicant under\nthis section shall be conditional and shall be for a period of not\nmore than two years. Any application for renewal of such conditional\npermits shall be acted upon in the same manner as an initial application."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "Requirements for special use permits."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "In evaluating whether a special use permit should\nbe issued, the Board of Zoning Appeals shall consider the purposes\nset forth in this section."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "The antenna or other device shall be located only\nin the rear yard of the lot, unless the applicant establishes that\nother placement is necessary to obtain reasonable reception."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "No permit shall be issued if the Board of Zoning Appeals\nfinds that either the type of antenna or disc or the method of its\nplacement will endanger the safety of residents, neighbors or pedestrians,\nor threaten property on the applicant's lot or adjoining lots."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "Use of any illumination for the disc or antenna is\nstrictly prohibited."
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "All connections shall be made so that wiring and supporting\ncables shall not be visible from the street or sidewalk."
												}
											]
										},
										{
											"number": "(6) ",
											"content": [
												{
													"text": "No more than one parabolic, hemispheric, satellite\nreceive only or similar antenna shall be erected, constructed, installed\nor maintained on a single lot or premises."
												}
											]
										},
										{
											"number": "(7) ",
											"content": [
												{
													"text": "The Board of Appeals shall impose such screening requirements\nthat are reasonable to effectuate the purposes set forth in this section\nand that will not substantially limit reception."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "Application for permit. All applications for special\nuse permits shall be filed with the Board of Zoning Appeals of the\nIncorporated Village of Floral Park. The application to the Board\nof Zoning Appeals shall describe the subject premises by street address\nand by section, block and lot number and shall describe the present\nuse of the premises. In addition, the application shall be accompanied\nby the following:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "A location survey showing existing structures upon\nthe premises, their location and distance from the proposed disc or\nantenna, the dimensions of the parabolic disc or antenna, the setbacks\nof the parabolic disc or antenna from each property line and all properties\nand structures within a two-hundred-foot radius of the premises, showing\nthe names and street addresses of the record owner of such property."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "A detailed plan showing the material from which the\nparabolic disc or antenna is to be constructed and the proposed color\nof the parabolic disc or antenna and details illustrating the structural\nsupport system."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "A landscape plan illustrating adequate screening of\nthe parabolic disc or antenna which will be provided to screen the\nparabolic disc or antenna from the roadway and adjoining property\nowners. Unless demonstrated to be impracticable, all screening required\nshall be by coniferous trees and shall be of sufficient height and\ndensity to screen 100% of the parabolic disc or antenna from sight\nat ground level from the roadway and from properties located within\na two-hundred-foot radius of the premises during the entire year."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "Application fee as set forth in § 99-62."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "F. ",
							"content": [
								{
									"text": "Notice required. Before any decision on or authorization\nof a special permit, the Board of Zoning Appeals shall hold a public\nhearing after due notice. The applicant shall be required to provide\nnotice of the hearing upon a form approved by the Board of Zoning\nAppeals to all record land owners within a two-hundred-foot radius\nof the property which forms the subject of the application as said\nrecord owners appear on the most current tax rolls of the Nassau County\nAssessor's Office. Such notice shall be sent to the record land owners\nby certified mail, return receipt requested, not less than 15 days\nnor more than 30 days before the public hearing. Evidence of compliance\nwith this section shall be provided by the applicant prior to or at\nthe public hearing. In addition, the Village Clerk shall publish notice\nof the hearing not less than 10 days prior to the hearing date."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 99-28",
			"title": "Electric meters and gas meters.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "No dwelling located within the R-1 Zoning District\nshall have located thereon or therein more than one electric meter\nnor more than one gas meter, unless consent thereto shall have been\ngranted by the Board of Trustees. No dwelling located within the R-2\nZoning District and no nonconforming two-family dwelling shall have\nlocated thereon or therein more than two electric meters nor more\nthan two gas meters, unless consent thereto shall have been granted\nby the Board of Trustees. In the R-A Zoning District, there shall\nnot be more than one electric meter nor more than one gas meter per\ndwelling unit."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "All nonconforming electric meters and gas meters in\nexistence on the effective date of this chapter shall, at the expiration\nof three years from said date, be removed, and the dwelling shall\nbe in conformity with this section of the Zoning Code."
								}
							]
						}
					]
				}
			]
		}
	]
}