{
	"url": "http://ecode360.com/15103487",
	"paras": [
		{
			"paragraph": "§ 322-7",
			"title": "Intent of districts.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Special purpose districts."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "CF District (Community Facility). The regulations set forth in this\nsection or set forth elsewhere in this chapter and applicable to the\nCF District are intended to provide for adequate area for religious,\neducational, recreational, institutional, agricultural, environmental\nand municipal facilities and uses to serve the present and future\nneeds of the community and the region."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Flood hazard districts. The Town Board of the Town of Smithtown finds\nthat the potential and/or actual damages from flooding and erosion\nmay be a problem to the residents of the Town of Smithtown and that\nsuch damages may include the destruction or loss of private and public\nhousing, damage to public facilities, both publicly and privately\nowned, and injury to and loss of human life. In order to minimize\nthe threat of such damages and to achieve the purposes and objectives\nhereinafter set forth, these provisions are adopted."
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "Statement of purpose. It is the purpose of this chapter to promote\nthe public health, safety and general welfare and to minimize public\nand private losses due to flood conditions in specific areas by provisions\ndesigned to:"
																},
																{
																	"content": [
																		{
																			"number": "[1] ",
																			"content": [
																				{
																					"text": "Restrict and prohibit uses which are dangerous to health, safety\nand property due to water or erosion hazards or which result in damaging\nincreases in erosion or in flood heights or velocities."
																				}
																			]
																		},
																		{
																			"number": "[2] ",
																			"content": [
																				{
																					"text": "Require that uses vulnerable to floods, including facilities\nwhich serve such uses, be protected against flood damage at the time\nof initial construction."
																				}
																			]
																		},
																		{
																			"number": "[3] ",
																			"content": [
																				{
																					"text": "Control alteration of natural floodplains, stream channels and\nnatural protective barriers which are involved in the accommodation\nof floodwaters."
																				}
																			]
																		},
																		{
																			"number": "[4] ",
																			"content": [
																				{
																					"text": "Prohibit and control filling, grading, dredging and other development\nwhich may increase erosion or flood damages."
																				}
																			]
																		},
																		{
																			"number": "[5] ",
																			"content": [
																				{
																					"text": "Prevent and regulate the construction of flood barriers which\nwill unnaturally divert floodwaters or which may increase flood hazards\nto other lands."
																				}
																			]
																		},
																		{
																			"number": "[6] ",
																			"content": [
																				{
																					"text": "Qualify for and maintain participation in the National Flood\nInsurance Program."
																				}
																			]
																		}
																	]
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "Objectives. The objectives of these provisions are to:"
																},
																{
																	"content": [
																		{
																			"number": "[1] ",
																			"content": [
																				{
																					"text": "Protect human life and health."
																				}
																			]
																		},
																		{
																			"number": "[2] ",
																			"content": [
																				{
																					"text": "Minimize the expenditure of public money for costly flood-control\nprojects."
																				}
																			]
																		},
																		{
																			"number": "[3] ",
																			"content": [
																				{
																					"text": "Minimize the need for rescue and relief efforts associated with\nflooding and generally undertaken at the expense of the general public."
																				}
																			]
																		},
																		{
																			"number": "[4] ",
																			"content": [
																				{
																					"text": "Minimum prolonged business interruptions."
																				}
																			]
																		},
																		{
																			"number": "[5] ",
																			"content": [
																				{
																					"text": "Minimize damage to public facilities and utilities such as water\nand gas mains, electric, telephone and sewer lines, streets and bridges\nlocated in areas of special flood hazard."
																				}
																			]
																		},
																		{
																			"number": "[6] ",
																			"content": [
																				{
																					"text": "Help maintain a stable tax base by providing for the sound use\nand development of areas of special flood hazard so as to minimize\nfuture flood blight areas."
																				}
																			]
																		},
																		{
																			"number": "[7] ",
																			"content": [
																				{
																					"text": "Provide that developers are notified that property is in an\narea of special flood hazard."
																				}
																			]
																		},
																		{
																			"number": "[8] ",
																			"content": [
																				{
																					"text": "Ensure that those who occupy the areas of special flood hazard\nassume responsibility for their actions."
																				}
																			]
																		}
																	]
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "O District\n(Overlay). The regulations set forth in this section or set forth\nelsewhere in this chapter and applicable to an O District are intended\nto provide adequate flexibility for development and the uses therein\nto better serve the present and future needs of the community and\nthe region. [Added 4-8-2014]"
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Residence districts. (Reserved)"
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Business districts."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "PB District (Professional Business). The regulations set forth in\nthis section or set forth elsewhere in this chapter and applicable\nto the PB District are intended to encourage low-intensity office\ndevelopment of single-family residence character compatibly mixed\nwith one- and two-family residential uses, principally for areas in\nwhich a similar pattern of use has occurred or for areas where an\noffice-residential pattern is appropriate between Central Business\nDistricts and residential neighborhoods."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "OB District (Office Business). The regulations set forth in this\nsection or set forth elsewhere in this chapter and applicable to the\nOB District are intended to encourage office development of high aesthetic\nareas unsuitable for residential development and which, for environmental,\neconomic, fiscal, aesthetic or other reasons to promote the public\nhealth, safety and general welfare, are inappropriate for intensive\ncommercial or industrial uses."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "SCB District (Shopping Center Business). The regulations set forth\nin this section or set forth elsewhere in this chapter and applicable\nto the SCB District are intended to provide for retail shopping centers\ncomposed principally of groups of retail and service establishments\nof integrated architectural and site design, to serve community-wide\nor regional needs."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "NB District (Neighborhood Business). The regulations set forth in\nthis section or set forth elsewhere in this chapter and applicable\nto the NB District are intended to encourage moderate-intensity retail,\noffice and service development and uses which are compatible in scale\nand character with, and are designed principally to serve the needs\nof, the adjoining neighborhoods and are adequately buffered from residential\ndistricts."
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "CB District (Central Business). The regulations set forth in this\nsection or set forth elsewhere in this chapter and applicable to the\nCB District are intended to encourage traditional commercial development\nand uses, especially those which depend on and encourage pedestrian\ntraffic and public transportation, principally for areas where a similar\npattern of use has occurred and which is appropriately buffered from\nresidential neighborhoods."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "Industrial districts."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "WSI District (Wholesale and Service Industry). The regulations set\nforth in this section or set forth elsewhere in this chapter and applicable\nto the WSI District are intended to provide adequate land along appropriate\narterial highways for automotive-related nonretail needs and for uses\nwhich require extensive land for outdoor storage or display and for\nuses that do not generate large traffic volumes."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "LI District (Light Industry). The regulations set forth in this section\nor set forth elsewhere in this chapter and applicable to the LI District\nare intended to provide, in appropriate locations, office, research\nand development, wholesale and light manufacturing on sites of high\naesthetic character, with adequate buffering from adjoining residential\nneighborhoods."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "HI District (Heavy Industry). The regulations set forth in this section\nor set forth elsewhere in this chapter and applicable to the HI District\nare intended to provide appropriate locations for safe and efficient\nheavy industrial activities necessary to serve the needs of the community."
												}
											]
										}
									]
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 322-8",
			"title": "Use regulations.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "No building or structure or part thereof shall be erected or altered\nor used, and no lot or land or part thereof shall be used, except\nfor a purpose specifically permitted by the Table of Use Regulations\nin the district in which said building, structure, lot or land is\nlocated.[Amended 6-24-2010]"
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "In any district, any covenant, restriction, easement or other such limitation or condition placed upon property at the direction of the Town Board, the Town Planning Board, the Town Board of Zoning Appeals or the Town Board of Site Plan Review, or pursuant to Chapter 323, Transfer of Density Flow Rights, of the Town Code, shall become part of the zoning requirements for such property. Any violation of any such covenant, restriction, easement or other such limitation or condition shall constitute a violation of this chapter. Nothing in this section, however, shall vest the Board of Zoning Appeals with the authority to modify or eliminate any such covenant, restriction, easement or other such limitation or condition not imposed by the Board of Zoning Appeals.[Added 9-28-2004[1]; amended 5-7-2013]"
								},
								{
									"footnote": "[1]\nEditor's Note: This ordinance also redesignated former\nSubsection B as C.\n"
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "The Table of Use Regulations is located at the end of this chapter."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 322-9",
			"title": "Dimensional regulations.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "No building or structure or part thereof shall be used, erected,\nstructurally altered, enlarged or rebuilt except in conformity with\ndimensional regulations as indicated in the Table of Dimensional Regulations\nfor the specific district in which it is located.[Amended 6-24-2010]"
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "The Table of Dimensional Regulations is located at the end of this\nchapter."
								},
								{
                                	"content": [
                                		{
                                			"number": "1. ",
                                			"content": [
                                				{
                                					"text": "Minimum lot area (square feet): 7500"
                                				}
                                			]
                                		},
                                		{
                                			"number": "2. ",
                                			"content": [
                                				{
                                					"text": "Minimum lot frontage at setback line (feet): 50"
                                				}
                                			]
                                		},
                                		{
                                			"number": "3. ",
                                			"content": [
                                				{
                                					"text": "Minimum road frontage (feet): 40"
                                				}
                                			]
                                		},
                                		{
                                			"number": "4. ",
                                			"content": [
                                				{
                                					"text": "Minimum front yard depth (feet): 25"
                                				}
                                			]
                                		},
                                		{
                                			"number": "5. ",
                                			"content": [
                                				{
                                					"text": "Minimum rear yard depth (feet): 35"
                                				}
                                			]
                                		},
                                		{
                                			"number": "6. ",
                                			"content": [
                                				{
                                					"text": "Minimum side yard width:"
                                				},
                                				{
                                                	"content": [
                                                		{
                                                			"number": "(A) ",
                                                			"content": [
                                                				{
                                                					"text": "Any 1 side (feet): 8"
                                                				}
                                                			]
                                                		},
                                                		{
                                                			"number": "(B) ",
                                                			"content": [
                                                				{
                                                					"text": "Total of both (feet): 18"
                                                				}
                                                			]
                                                		}
                                                	]
                                                }
                                			]
                                		},
                                		{
                                			"number": "7. ",
                                			"content": [
                                				{
                                					"text": "Maximum height"
                                				},
                                				{
                                                	"content": [
                                                		{
                                                			"number": "(A) ",
                                                			"content": [
                                                				{
                                                					"text": "Feet: 35"
                                                				}
                                                			]
                                                		},
                                                		{
                                                			"number": "(B) ",
                                                			"content": [
                                                				{
                                                					"text": "Stories: 2.5"
                                                				}
                                                			]
                                                		}
                                                	]
                                                }
                                			]
                                		},
                                		{
                                			"number": "8. ",
                                			"content": [
                                				{
                                					"text": "Accessory building or structure: "
                                				},
                                				{
                                                	"content": [
                                                		{
                                                			"number": "(A) ",
                                                			"content": [
                                                				{
                                                					"text": "Maximum occupancy of required rear yard (percent): 20"
                                                				}
                                                			]
                                                		},
                                                		{
                                                			"number": "(B) ",
                                                			"content": [
                                                				{
                                                					"text": "Maximum height (feet/stories): 15/1"
                                                				}
                                                			]
                                                		},
                                                		{
                                                			"number": "(C) ",
                                                			"content": [
                                                				{
                                                					"text": "Minimum distance from any lot line (feet): 4"
                                                				}
                                                			]
                                                		}
                                                	]
                                                }
                                			]
                                		},
                                		{
                                			"number": "9. ",
                                			"content": [
                                				{
                                					"text": "Maximum gross floor area (percent of lot area): 35"
                                				}
                                			]
                                		}
                                	]
                                }
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 322-10",
			"title": "(Reserved)",
			"content": []
		},
		{
			"paragraph": "§ 322-11",
			"title": "Prohibited uses.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "No building, structure, lot or land in any district in the Town of Smithtown shall be used for any of the following uses, except as provided in Article XI:[Amended 3-8-1994]"
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "No building, structure, lot or land in any district within 1/2 mile\nof the Nissequogue River, measured from the bank of the river at any\npoint downstream from Veteran's Memorial Highway or Brooksite\nDrive, shall be used for the following uses:"
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 322-12",
			"title": "Placement of accessory buildings, structures and uses.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Except for underground septic systems, no accessory use shall be\npermitted unless it is on the same plot and in the same class of zoning\ndistrict as an existing permitted or lawfully nonconforming principal\nuse; further, parking spaces must be within 500 feet of the building\nwhich they intended to serve."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Except as provided for in Subsection D below, no accessory structure shall be permitted in the required front yard or side yard, regardless of whether the accessory structure is between the principal building and side property line. (See figure below.)"
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "No outdoor storage, as that term is defined in § 322-3, shall exist except pursuant to an approved site plan."
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "The following accessory structures may be located within the required\nfront or side yard, provided that they comply with all other provisions\nof this chapter: fences, walls, retaining walls, driveways, curbs,\nparking areas, drainage structures, lighting, signs, septic systems,\nunderground fuel tanks, utility cables and pipes, litter baskets,\nfuel pumps and benches."
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "Access driveways to required off-street parking areas and truck-loading\nspaces shall lead to a public street over the same lot or by means\nof a permanent easement across an adjoining lot."
								}
							]
						},
						{
							"number": "F. ",
							"content": [
								{
									"text": "Private garage floor area within principal buildings shall not exceed\n750 square feet.[Amended 2-22-1999]"
								}
							]
						},
						{
							"number": "G. ",
							"content": [
								{
									"text": "(Reserved)[1]"
								},
								{
									"footnote": "[1]\nEditor's Note: Former Subsection G, regarding the location\nof detached accessory buildings, was repealed 9-27-2007.\n"
								}
							]
						},
						{
							"number": "H. ",
							"content": [
								{
									"text": "Swimming pools shall be at least six feet from all dwellings.[Added 3-23-1993;[2] amended 9-27-2007; 10-2-2012]"
								},
								{
									"footnote": "[2]\nEditor's Note: This amendment also redesignated former Subsections H, I, J and K as Subsections I, J, K and L, respectively.\n"
								}
							]
						},
						{
							"number": "I. ",
							"content": [
								{
									"text": "Outdoor storage and display shall not be permitted in any district\nexcept as an accessory use and in accordance with the following requirements:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "The storage of manure or odor- or dust-producing substances shall\nbe in a waterproof container and shall not be permitted within 50\nfeet of any side or rear lot line or within 100 feet of any front\nlot line."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Solid waste shall not remain on the premises for more than one week\nand must be stored in closed waterproof containers; furthermore, the\nlot area used for the storage of refuse shall not exceed 1% of the\ngross floor area of the site."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "For uses other than one- and two-family dwellings, refuse containers\nor compactors must be screened from view from adjoining properties\nand highways.[Amended 11-3-2015]"
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "Charity drop boxes may be placed only on commercial, industrial and\ninstitutional sites, provided that the boxes are set back more than\n10 feet from all property lines and do not encroach on any required\nplanting areas, parking areas, driveways or areas needed for traffic\nsafety."
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "(Reserved)[3]"
												},
												{
													"footnote": "[3]\nEditor's Note: Former Subsection I(5), regarding outdoor storage of large vehicles, was repealed 12-10-1996. See now Subsection N of this section.\n"
												}
											]
										},
										{
											"number": "(6) ",
											"content": [
												{
													"text": "For institutional, business and industrial uses, no outdoor storage or outdoor display shall be permitted except in conformity with an outdoor storage or outdoor display area shown on a site plan approved pursuant to Article XIII."
												}
											]
										},
										{
											"number": "(7) ",
											"content": [
												{
													"text": "Motor vehicle and boat showrooms.[Amended 11-19-1996; 10-7-1997]"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "Unregistered motor vehicles and boats parked, displayed in required\nparking areas.[Amended 10-4-2016]"
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "Outdoor storage and display shall not exceed three times the\ngross floor area."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "Not more than one vehicle per site shall be displayed or stored\nabove the approved grade. Vehicle platforms shall not exceed four\nfeet in height."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(8) ",
											"content": [
												{
													"text": "The parking and/or storage of motor vehicles, trailers, boats and\nsimilar articles shall not be permitted in the required front yard,\nexcept on paved surfaces. For residential uses, except garden apartments\nand townhouse dwellings, not more than 25% of the required front,\nside or rear yards shall be paved surfaces, except that the maximum\npaved surface in the required front yard shall be increased as necessary\nto accommodate a twelve-foot swath for a circular driveway; and the\nmaximum paved surface in one side yard shall be increased as necessary\nto accommodate a driveway not exceeding 10 feet in width for access\nto a detached garage, or increased to 50% for a side-entry garage;\nand paved surfaces shall be set back at least one foot from side and\nrear lot lines.[Amended 9-5-2000; 10-2-2012]"
												}
											]
										},
										{
											"number": "(9) ",
											"content": [
												{
													"text": "For nurseries, the outdoor storage and display of live plants shall\nbe permitted to the extent that such storage and/or display does not\nencroach on any parking or truck-loading areas or driveways needed\nfor traffic safety. The outdoor storage of mulch, supplies, equipment\nand vehicles shall not exceed 25% of the outdoor storage of live plants."
												}
											]
										},
										{
											"number": "(10) ",
											"content": [
												{
													"text": "An owner, tenant or occupant of private property in a residence\ndistrict may store not more than one unregistered motor vehicle on\na residential lot. Unless enclosed in a building, the unregistered\nvehicle must be covered at all times with an automobile cover that\nshall be kept in good repair and/or the unregistered vehicle shall\nbe screened from the view of adjacent properties and the abutting\nstreets through the use of shrubbery and/or fencing in accordance\nwith the Town Code.[Amended 10-7-1997; 10-4-2016]"
												}
											]
										},
										{
											"number": "(11) ",
											"content": [
												{
													"text": "In the WSI District, outdoor storage and display shall not exceed\ntwo times the gross floor area of the site, except for nurseries,\nmotor vehicle showrooms and boat showrooms."
												}
											]
										},
										{
											"number": "(12) ",
											"content": [
												{
													"text": "In the WSI District, outdoor storage and display shall be set\nback at least 25 feet from the front property line and 50 feet from\nany residence district; shall not exceed six feet in height, except\nfor vehicles and plants, provided that they are stored on the ground\nand are not stacked, except as provided for in § 322-121(7);\nand shall not be located in any required buffer area or planting or\nmaneuvering area. In the HI District, outdoor storage shall not be\nlocated in the required front yard.[Amended 10-7-1997; 9-22-2016]"
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "J. ",
							"content": [
								{
									"text": "The harboring or stabling of horses or ponies shall be in compliance\nwith the following requirements:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "The proposed use shall be on not less than 1/2 acre of land."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "There shall not be more than one horse or pony per 1/2 acre of land,\nexcept that on a plot of 3/4 acre two such animals may be permitted.\nOn a plot of one acre, three such animals may be permitted. Additional\nhorses or ponies may be permitted at the rate of one such animal per\nadditional 1/2 acre. The use shall be accessory to the principal residential\nuse of the property or shall be for the purpose of agricultural use.\nAll activities shall be conducted for the use of the resident. No\nboarding or rental of horses or ponies shall be permitted whatsoever."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "All horses or ponies shall be sheltered in barns, stables or other\nroofed structures which shall be constructed and maintained in accordance\nwith the Building Code[4] of the Town of Smithtown and pursuant to all applicable\nprovisions of this chapter."
												},
												{
													"footnote": "[4]\nEditor's Note: See Ch. 112, Building Construction.\n"
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "All horses or ponies shall be harbored in a fenced-in area that does\nnot encroach into any required front or side yard. Furthermore, the\nfence shall be set back at least six feet from any side or rear property\nline. The fence shall be between four and six feet in height and shall\nbe constructed of suitable material. All enclosures shall provide\nfor a gate with a safety latch or lock."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "K. ",
							"content": [
								{
									"text": "In the SCB, CB and NB Districts, game rooms shall be permitted as\nan auxiliary and incidental use for the following uses only: taverns,\nrestaurants, counter service restaurants, discotheques, hotels and\nmotels. Only one game room shall be permitted per site. The floor\narea of the building used as a game room shall not exceed 10% of the\ntotal building area or 250 square feet, whichever is less, and further,\nno sign referring to said game machines or game rooms shall be erected,\naffixed or maintained in such a way as to be visible from the exterior\nof the building."
								}
							]
						},
						{
							"number": "L. ",
							"content": [
								{
									"text": "Drive-in windows.[Amended 5-9-2017]"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "This\nis a prohibited use in the LI District except as an accessory use\nto a bank."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Queuing\nlanes shall be provided of sufficient length to prevent queued cars\nfrom interfering with traffic on any highway or in the parking area."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "All\nqueue lanes shall be at least 50 feet from any residence district."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "Drive-in\nwindows, order boards, and menus shall be at least 75 feet from any\nresidence district and shall not be located on any building elevation\nfacing a residence district."
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "The\ndrive-in/order board speaker system shall not be audible at the property\nlines."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "M. ",
							"content": [
								{
									"text": "The installation of tires, batteries, stereo systems and car phones\npurchased on premises shall be permitted as a customary accessory\nuse to any retail store exceeding 100,000 square feet gross floor\narea in the SCB District, provided that all of the following requirements\nare met:[Added 11-1-1994]"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Outdoor storage or display of tires, batteries, stereo systems and\ncar phones and outdoor installation work shall not be permitted at\nany time."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "The floor area for installation shall be less than 10% of the floor\narea of the retail store to which it is accessory."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "No portion of the area used for installation shall be less than 300\nfeet from any developed residential district."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "If any portion of the area used for installation is less than 500\nfeet from any developed residential district, all garage doors associated\nwith the installation facility shall face away from said residential\ndistrict."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "N. ",
							"content": [
								{
									"text": "Parking and/or storage of commercial vehicles.[Added 12-10-1996]"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "In all districts:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "The use shall be clearly accessory and incidental to a principal\nuse that has site plan approval. All other parking and/or storage\nof commercial vehicles which are not accessory or incidental will\nbe classified as a trucking station."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "The parking and/or storage of large commercial vehicles shall\nnot be permitted, except in conformity with an approved site plan."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "No repair, maintenance or any other service shall be permitted\nexcept at a filling station or repair garage or trucking station."
																}
															]
														},
														{
															"number": "(d) ",
															"content": [
																{
																	"text": "The use shall not be permitted in any required front yard, buffer,\nlandscaping, parking spaces, aisles, sidewalks or planting strips."
																}
															]
														},
														{
															"number": "(e) ",
															"content": [
																{
																	"text": "No large commercial vehicle shall be parked or stored within\n100 feet of a residence district."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "In the CF, PB and OB Districts and residence districts:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "No large commercial vehicle shall be parked or stored overnight."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "Not more than one commercial vehicle shall be parked or stored\novernight."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "No commercial vehicle which would otherwise be permitted to be parked or stored pursuant to Subsection N(2)(b), above, shall be so permitted, if said vehicle shall have a commercial sign affixed or painted thereon.[Added 8-2-2010]"
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "The number of commercial vehicles parked and/or stored on a site\nshall note the following:"
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "O. ",
							"content": [
								{
									"text": "Outdoor dining areas. In Central Business (CB) Districts, the regulations set forth in § 322-82C(25) shall be met.[Added 10-2-2012]"
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 322-13",
			"title": "Fences, walls, and berms.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "No fence, wall, or berm shall exceed six feet in height; except that no fence, wall, or berm in a required front yard shall exceed four feet in height, except as otherwise provided in the Table of Dimensional Regulations located at the end of this chapter, and no fence, wall, or berm in a corner clearance triangle, as described in § 322-16 of this chapter, shall exceed two feet in height.[Amended 10-2-2012]"
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "No retaining wall higher than 30 inches, and no fence, berm or other\nwall higher than four feet, shall be constructed or substantially\nreconstructed except in conformity with a building permit."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "The height of a fence or wall shall be measured vertically from the\nnatural or approved grade to the top of the fence or wall, including\nthe posts and appurtenances, but not including an arbor built into\nany such fence or wall, provided said arbor shall not exceed eight\nfeet in height. For purposes of this section, an arbor shall be defined\nas an ornamental structure forming an archway over an opening or gateway\nwithin a fence or wall. No fence or wall shall be located on a berm.[Added 10-2-2012]"
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "The posts and structural members shall face inward, except for residential\nfences abutting business and industrial land uses."
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "The minimum setback of retaining walls from all property lines shall\nbe the height, of the retaining wall or three feet, whichever is greater.\nFences and walls shall be set back from retaining walls one foot for\nevery foot of height of the retaining wall."
								}
							]
						},
						{
							"number": "F. ",
							"content": [
								{
									"text": "Retaining walls may be constructed of only pressure-treated timber,\nmechanically stabilized segmental block (mortarless), or cast-in-place\nconcrete. Timber walls shall not exceed four feet in height, and shall\nnot be used in tiered retaining wall construction."
								}
							]
						},
						{
							"number": "G. ",
							"content": [
								{
									"text": "The maximum grade of berms shall be one foot vertical for every three\nfeet horizontal. No portion of a berm shall be on public property."
								}
							]
						},
						{
							"number": "H. ",
							"content": [
								{
									"text": "All berms shall consist of only pure Long Island loam and topsoil."
								}
							]
						},
						{
							"number": "I. ",
							"content": [
								{
									"text": "The entire berm shall be stabilized with live groundcover. No tree\nspecies with a maximum typical height greater than 20 feet shall be\nplanted on any berm."
								}
							]
						},
						{
							"number": "J. ",
							"content": [
								{
									"text": "No stormwater runoff shall be diverted by the construction of a berm\nin a manner that creates the need for drainage structures on adjacent\nproperties or causes or worsens flooding on nearby property."
								}
							]
						},
						{
							"number": "K. ",
							"content": [
								{
									"text": "The Board of Site Plan Review may modify these requirements in the\nsite plan approval process as it determines necessary to promote the\npurposes of this chapter."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 322-14",
			"title": "Height.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Nothing herein contained shall restrict the height of a church spire,\ncupola, dome, belfry, clock tower, transmission line tower, flagpole,\nchimney flue, public water supply tank or any firesafety structure\nwhich may be required by the New York State Fire Safety Code.[Amended 9-5-1989; 12-10-1991; 8-31-1999]"
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "No structure erected pursuant to Subsection A above to a height in excess of the height limit for the zone in which it is situated shall:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Have a lot coverage in excess of 10% of the lot area."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Be used for residence or tenancy purposes."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Have any sign, nameplate display or advertising device of any kind\nwhatsoever inscribed upon or attached to such structure."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Notwithstanding the maximum height limits stipulated in §§ 322-8C, 322-9C and 322-10C[1] (Table of Dimensional Regulations), a public or semipublic\nbuilding may be erected to a height not to exceed 50 feet, provided\nthat its front, side and rear yards are increased above the stipulated\nminimum by one additional foot for each foot that such building exceeds\nthe stipulated height limit.[Amended 10-21-1986]"
								},
								{
									"footnote": "[1]\nEditor's Note: See now the Tables of Dimensional Regulations\nlocated at the end of this chapter.\n"
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 322-15",
			"title": "Yards.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "All required yards shall be kept open except for:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Cornices, eaves and gutters projecting not more than 18 inches."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Steps giving access to the first floor."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Bay windows, chimneys and fireplaces not wider than six feet and\nprojecting not more than 24 inches."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "Decks as specifically authorized in § 322-15B."
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "Handicap ramps."
												}
											]
										},
										{
											"number": "(6) ",
											"content": [
												{
													"text": "Porticos, up to six feet wide and up to six feet deep; provided the\nstructure to which it is attached meets all other required setbacks.[Added 10-2-2012]"
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Except for the R-6 District, decks shall observe the following setbacks:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Decks under six inches in height are permitted in any required yard\nbut shall be set back at least three feet from all property lines."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Decks six to 18 inches in height shall be permitted to encroach eight\nfeet into the required front yard, provided that the deck shall meet\nthe side yard requirements for principal buildings."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Decks having a maximum height of six to 36 inches shall comply with\nthe setback requirements for accessory structures."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "Decks over 36 inches in height shall comply with the setback requirements\nfor principal buildings."
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "Decks shall not be used in determining the FAR, but decks greater\nthan six inches in height shall not exceed the actual building coverage."
												}
											]
										},
										{
											"number": "(6) ",
											"content": [
												{
													"text": "Railings, posts and/or walls shall not exceed four feet in height\nabove the decks."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Through lots shall provide for the applicable required front yard\non each street frontage."
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "For garage entrances facing into a side yard area, when attached\nor part of the main building in any residential zone, the minimum\nside yard on that side of the building shall be increased to 35 feet,\nthe other minimum side yard shall be observed and the total for both\nside yards shall be increased pursuant to the above."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 322-16",
			"title": "Corner clearance.",
			"content": [
				{
					"text": "On a corner lot, within the triangular area (see sketch) determined\nas provided in this section, no wall or fence or other structure shall\nbe erected to a height above the curb level in excess of two feet;\nno vehicle, object or any other obstruction of a height in excess\nof two feet shall be parked or placed therein; and no hedge, shrub\nor other growth shall be maintained at a height in excess of two feet,\nexcept that trees whose branches are trimmed away to a height of at\nleast eight feet above the curb level shall be permitted. Such triangular\narea shall be determined by the intersecting street center lines and\na diagonal connecting two points, one on each street center line,\neach of whose points is 75 feet from the intersection of such street\ncenter lines."
				}
			]
		},
		{
			"paragraph": "§ 322-17",
			"title": "Swimming pools.\n                                                                                          [1]",
			"content": [
				{
					"text": "It shall be unlawful to construct, install, enlarge or maintain\nany outdoor swimming pool on any lot or land area except in compliance\nwith the following requirements:"
				},
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "The construction, installation, enlargement or alteration of any\npool shall require a permit issued by the Building Director, and the\nproposed work shall be subject to all applicable provisions of the\nTown of Smithtown Code and the New York State Uniform Fire Prevention\nand Building Code.[Amended 5-8-2007; 5-5-2009]"
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "A complete set of drawings and plans shall be submitted to the Building\nDirector, showing, among other things, the exact location of the pool\nwith respect to the lot or land on which it is to be located and the\napplicable zone district regulation and information pertinent to the\npool itself, the fence construction, the water supply system and all\nappurtenances, as well as detailed plans and vertical elevations.\nAll construction shall be in conformance with such drawings and plans\nas approved by the Building Director.[Amended 5-8-2007]"
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Water disposal. All water either overflowing or emptying from the\npool shall be disposed of on the owner's land, and plans submitted\nshall show provisions made for preventing such water from flowing\nonto the land of any adjoining property owner or into any abutting\nstreet."
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "Fences. All pools shall be completely and continuously surrounded and enclosed by a permanent durable wall, barrier or fence, in accordance with the New York State Uniform Fire Prevention and Building Code requirements. In the event that the swimming pool is the above-ground type and is so constructed that it contains a wall, barrier or fence mounted on top of the pool structure installed in accordance with the New York State Uniform Fire Prevention and Building Code, it must be additionally enclosed with a fence around the property in compliance with § 322-13 herein.[Amended 9-21-1965; 2-1-1972; 5-8-2007; 5-5-2009]"
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "Size and location. All pools which are accessory uses shall comply\nwith the requirements for accessory buildings, except that the lot\narea occupied by such pools shall not be included in computing the\npercentage of the lot area which may be built upon."
								}
							]
						}
					]
				},
				{
					"footnote": "[1]\nEditor's Note: See also Ch. 252, Swimming Pools.\n"
				}
			]
		},
		{
			"paragraph": "§ 322-18",
			"title": "Temporary storage of private mobile homes or house trailers.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "One private mobile home or house trailer may be temporarily stored\non the same lot with a single-family dwelling for a period not to\nexceed three months in any calendar year, provided that:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "The mobile home or house trailer belongs to the occupant of the single-family\ndwelling or his guest."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "The occupant of the single-family dwelling is either the owner of\nthe property or has the written permission of the owner to store such\nunit."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "The mobile home or house trailer is not used for residential purposes."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "Every toilet shall be sealed or locked so that it cannot be used\nduring the storage period."
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "The mobile home or house trailer shall be located on the lot or land\nin conformance with the provisions of this chapter for accessory buildings."
												}
											]
										},
										{
											"number": "(6) ",
											"content": [
												{
													"text": "The mobile home or house trailer and its site shall be maintained\nin a manner compatible with community standards and it shall not constitute\na nuisance or hazard to the health, safety and general welfare of\nthe community in which it is located."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Applications for such temporary storage permits shall be made to\nthe Building Director. They shall be approved prior to the time that\nthe mobile home or house trailer is located on the site.[Amended 5-8-2007]"
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Any permit issued pursuant to this section may be revoked by the\nBuilding Director, in the exercise of his reasonable discretion, if\nafter due investigation he deems that the permit holder has violated\nany of the provisions of this chapter or the conditions on which the\npermit was issued.[Amended 5-8-2007]"
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 322-19",
			"title": "Environmentally sensitive lands.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "In any location on the Building Zone Map where environmentally sensitive\nlands are shown as not included in any zoning district, such lands\nshall be construed to lie with a CF District."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "No environmentally sensitive land shall be used to calculate the\npermitted density, building coverage, floor area or minimum lot area.[Amended 9-12-1989; 4-4-2017]"
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Except as provided for in Subsection F, no environmentally sensitive land shall be altered by excavation, storage, compaction, construction activities, vegetation removal or the placement of fill or other activity.[Amended 4-28-2011]"
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "No structure, including but not limited to buildings, decks, garages,\nsheds, swimming pools, fences, walks and driveways, shall be constructed,\nenlarged, altered or replaced within 100 feet from any wetland, escarpment,\nnatural surface water feature or significant wildlife habitat."
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "No structure shall be constructed, enlarged, altered or replaced\nwithin 10 feet of any slope higher than five feet and having a slope\ngreater than 25% or any A or V Flood Hazard Zone.[Amended 9-8-2015 by L.L.\nNo. 3-2015]"
								}
							]
						},
						{
							"number": "F. ",
							"content": [
								{
									"text": "In areas where the only environmentally sensitive land that will be impacted is land where depth to the seasonal high water table is less than 10 feet, the following actions shall be exempt from Subsection C:[Added 4-28-2011]"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Construction\nof a deck."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Installation\nof a fence."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Construction\nof a shed less than 100 square feet."
												}
											]
										}
									]
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 322-20",
			"title": "Required buffer yards and screening adjoining residential districts.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "In order to assure orderly and compatible relationships between residence\nand nonresidence districts along their common boundaries, the provisions\nof this section are general requirements to be applied as indicated\nin specific districts. They do not take precedence over special requirements\nindicated for particular uses or for special exception uses in the\nother sections of this chapter."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Required setbacks and buffer yards adjoining a residence district:[Amended 11-10-1970; 6-25-1985; 10-21-1986; 2-13-1990]"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "In the PB, OB, SCB, NB, CB and WSI Districts, the minimum required\nside and/or rear yard shall be 50 feet."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "In the LI and HI Districts, the minimum required side and rear yard\nshall be 100 feet, shall be maintained as a densely planted buffer\nzone and shall not be used for parking, storage or accessory structures\nexcept for the buffer fence as required by this chapter."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Required buffer screen adjoining a residence district. In the CB,\nSCB, NB, OB, WSI, LI and HI Districts, a six-foot screen fence (stockade,\nmetal posts) shall be erected at the side and rear property lines\non metal fence posts fixed in concrete footings, in accordance with\nTown specifications. The fence posts shall not face residential property\nand, in addition, a ten-foot-wide protective planting strip shall\nbe established and maintained in accordance with Town specifications\nimmediately inside the fence along the residence district boundary.[Amended 11-29-1966; 11-20-1973; 6-25-1985; 8-31-1999]"
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "Landscaping.[Added 6-25-1985]"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "All areas of any site not used for structures, driveways, parking, truck-loading areas and walkways shall be planted with ground cover, shrubs and trees in conformance with a landscape plan approved by the Board of Site Plan Review in accordance with the provisions of Article XIII."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "In the case of injury or death to any plant material, the plant shall\nbe promptly replaced with a plant of the same species and of the same\nspecifications as shown on the approved site plan."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "(Reserved)[1]"
								},
								{
									"footnote": "[1]\nEditor’s Note: Former Subsection E, regarding in-ground\nirrigation systems, added 6-25-1985, was repealed 11-3-2015.\n"
								}
							]
						},
						{
							"number": "F. ",
							"content": [
								{
									"text": "All roof equipment must be screened from view from the street(s)\nadjoining the property.[Added 6-25-1985][2]"
								},
								{
									"footnote": "[2]\nEditor's Note: Original § 54-10I(7) of the\n1964 Code, added 6-25-1985, which immediately followed this subsection\nand provided for dumpster regulations, was repealed 2-13-1990.\n"
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 322-21",
			"title": "Apartment, business or industrial groups; building layout and spacing between buildings.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "In individual building plans, wings of the same buildings which are\nsubstantially parallel to each other shall be not less than 30 feet\napart."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Principal buildings in a group development shall be not less than\n30 feet apart at their nearest point to each other."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Groups of accessory structures, such as a garage compound, or individual\naccessory structures equivalent in floor area to principal buildings,\nshall be not less than 30 feet from the nearest point on a principal\nbuilding."
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "Minor accessory structures shall meet the requirements of § 322-12A."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 322-22",
			"title": "(Reserved)\n                                                                                          [1]",
			"content": [
				{
					"footnote": "[1]\nEditor’s Note: Former § 322-22, Commercial Center,\nas amended, was repealed 11-3-2015. \n"
				}
			]
		},
		{
			"paragraph": "§ 322-23",
			"title": "Research laboratory and nonnuisance industry.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "A research laboratory or nonnuisance industry shall not be deemed to include any use prohibited in § 322-11, any open storage of waste or scrap materials or any open storage of materials, products or equipment over an area exceeding the area of the principal building."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Permitted open storage areas shall be screened from view from the\nproperty line."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "All materials processing and/or manufacturing of products shall be\ndone indoors."
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "Water used in processing where a pollutant or any additive is accumulated\nin the process water shall not be disposed of on the premises. Pure\nprocess water may be disposed of on the premises by discharging into\nthe sanitary waste disposal system or into a stormwater recharge basin,\nprovided that such facilities have adequate capacity for the additional\nwater."
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "There shall be no more than 50 employees per acre of site area on\nthe site at any one time."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 322-24",
			"title": "Planned industrial park.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "In the WSI, LI and HI Districts, application may be made for a planned industrial park status. (See § 322-3, definition of \"planned industrial park.\") Such application shall be accompanied by the proposed subdivision master plan for the entire site area showing streets, lots, building areas, parking areas and landscaping, among other things required by the Town of Smithtown Subdivision Regulations[1] for a subdivision submission.[Amended 12-24-1968; 10-21-1986]"
								},
								{
									"footnote": "[1]\nEditor's Note: See Ch. 248, Subdivision of Land.\n"
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "The Planning Board, in its consideration of the proposed subdivision\nplans through the statutory public hearing, shall also determine whether\nthe area is suitable for development as a planned industrial park\nwithin the meaning of this chapter, whether the proposed planned industrial\npark is consistent with the use of surrounding property and is designed\nto promote and benefit the welfare of the Town and whether it complies\nwith all the provisions of this chapter for such park."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "The Planning Board, in its consideration of the overall master plan\nfor a planned industrial park, may require larger front, side or rear\nyards around the perimeter of the park than indicated in the Table\nof Dimensional Regulations, § 322-10C.[Amended 5-2-1978; 10-21-1986][2]"
								},
								{
									"footnote": "[2]\nEditor's Note: Original § 54-10N(3.1) of the\n1964 Code, which immediately followed this subsection and dealt with\nminimum distances between buildings, as amended, was repealed 6-25-1985.\nOriginal Subsection N(4) and (5) of the 1964 Code, as amended, was\nrepealed 5-2-1978.\n"
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "In approving a planned industrial park, the Planning Board may require\nchanges in the proposed subdivision plan as it deems necessary and\ndesirable for the proper utilization of the subject property and the\nprotection of property values."
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "The Planning Board shall require the actual construction by the industrial\ndeveloper of streets, drainage facilities, landscaping and other improvements\nin the same manner as for residential subdivisions."
								}
							]
						},
						{
							"number": "F. ",
							"content": [
								{
									"text": "There shall be no loading area located in any front yard area, whether\nan actual or required front yard. Loading areas located in a side\nyard area, if visible from any street, shall be screened with a wall\nand/or plant material.[Added 5-2-1978]"
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 322-25",
			"title": "Drainage.",
			"content": [
				{
					"text": "The drainage of stormwater incident to any residential, commercial,\nindustrial or other development use shall be stored and disposed of\non the subject site in accordance with the specifications of the Town\nEngineer. No site shall be developed in a manner that would cause\nthe discharge of stormwater into a wetland, stream, pond or similar\nsurface water feature, unless the Town Engineer determines that the\nquantity, quality and other characteristics of the discharge after\nconstruction are the same as the characteristics of the discharge\nfrom the site in its natural state.[1]"
				},
				{
					"footnote": "[1]\nEditor's Note: Original § 54-10P of the 1964\nCode, which immediately followed this section and regarded airports,\nas amended, was repealed 10-21-1986.\n"
				}
			]
		},
		{
			"paragraph": "§ 322-26",
			"title": "Outdoor and window lighting.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Any outdoor lighting of any use shall be arranged in such a way that\nno direct glare is cast toward any highway or adjacent property, and\nluminary devices shall be hooded and/or arranged so that the source\nof the illumination is not visible from such highway or residential\nuse.[Amended 4-15-2004]"
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "In business and industrial districts, outdoor lighting other than\nfor a permitted sign shall be limited to the illumination of the building\nfor security purposes and to the lighting of parking areas and accessways\nas necessary for the same movement of pedestrians and vehicular traffic.\nLighting intensity shall be limited to that which is necessary to\nafford the minimum adequate illumination for the purposes set forth\nin this section. The location, intensity and design of all luminary\ndevices shall be subject to approval of the Board of Site Plan Review.[1]"
								},
								{
									"footnote": "[1]\nEditor's Note: Original § 54-10Q of the 1964\nCode, which immediately followed this section and regarded modification\nof zoning provisions, as amended, was repealed 10-21-1986.\n"
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "In all districts, flashing, intermittent, moving or chaser lights\nor lighting of varying intensity shall be prohibited, except for the\nperiod between November 15 and January 15."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 322-27",
			"title": "Schools.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "All schools shall be on sites having not less than five acres and\nnot less than 300 feet of frontage on public streets."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "All principal and accessory buildings shall be set back at least\n100 feet from all property lines. For the expansion or renovation\nof a nonconforming structure, the Board of Site Plan Review may reduce\nthis setback requirement so that it equals the existing setback of\nthe nonconforming structure.[Amended 8-9-1994]"
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "The gross floor area shall not exceed 10% of the total site area."
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "All parking and loading areas shall be set back 50 feet from all\nstreets and 75 feet from residential parcels."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 322-28",
			"title": "Counter-service restaurants.\n                                                                                          [1]",
			"content": [
				{
					"text": "The following requirements shall be met:"
				},
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "This is\na prohibited use in the LI District except when located in a building\nused primarily for office and/or non-nuisance industry and the use\nis less than 20% of the gross floor area."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "No more\nthan two curb cuts shall be permitted. They shall be at least 75 feet\napart and shall be at least 75 feet from any residence district."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Densely\nplanted buffer areas at least 25 feet in depth shall be provided adjacent\nto residence districts."
								}
							]
						}
					]
				},
				{
					"footnote": "[1]\nEditor’s Note: Former § 322-28, Coin-operated\nmachines, added 7-12-1966, as amended, was repealed 11-3-2015.\n"
				}
			]
		},
		{
			"paragraph": "§ 322-29",
			"title": "Local Waterfront Revitalization Program (LWRP).",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "The following actions shall be subject to the LWRP: zone changes, subdivisions, site plans, building permits for new buildings, special exceptions, permits for any actions requiring the following variances; land use, height, signage, parking, density or environmentally sensitive lands, and shall not be approved, authorized, issued or altered until the Town Board determines in writing, pursuant to Chapter 151, Art. II of the Town Code, that the action is consistent with the LWRP policies, standards and conditions.[Amended 12-20-1994]"
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "The land use of all nonresidential districts in the local coastal\narea shall not be expanded, intensified or changed, except to water-dependent\nuses, unless the Town Board determines that no water-dependent use\nis feasible and further finds that such change, expansion or intensification\nof use is consistent with the policies, standards and conditions described\nin § III of the LWRP."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Natural vegetation shall be preserved and street trees and new plant\nmaterials shall be installed for all structures constructed and/or\nenlarged after the effective date of this provision so that at least\n75% of the building that would otherwise be visible from any surface\nwater in the coastal area shall be screened at the time of completion\nof construction."
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "Buildings in the local waterfront area shall conform to the requirements\nspecified in the following table:"
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 322-30",
			"title": "Satellite dish antennas.",
			"content": [
				{
					"text": "The Town Board finds that dish antennas, due to their shape,\nopacity and size, create more of a visual impact on the community\nthan do other types of antennas. The intent of these regulations is\nto permit the reception of satellite transmissions in the Town while\nsimultaneously preventing, avoiding or minimizing the visual contrast\nof such antennas with regard to the elements of line, form, scale\nand color."
				},
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "In all districts:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "All installations shall employ to the extent possible colors and\nfinishes that blend with the surroundings."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Roof-mounted antennas shall not exceed the permitted height of principal\nbuildings and shall be located on the back half of the building."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Ground-mounted installations greater than 10 feet in height shall\nbe screened with evergreen trees located along the antenna's\nnonreception window axes."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "Ground-mounted installations shall comply with all dimensional requirements\nfor accessory buildings."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "In residence districts:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Not more than one dish antenna shall be permitted per site."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Dish antennas shall not exceed 10 feet in diameter."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "In business and industrial districts, ground-mounted antennas exceeding\n10 feet in diameter shall comply with all dimensional requirements\nfor principal buildings.[1]"
								},
								{
									"footnote": "[1]\nEditor's Note: Original § 54-10Z of the 1964\nCode, which immediately followed this subsection and regarded sand\nmining, as amended, was repealed 10-21-1986.\n"
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 322-30.1",
			"title": "Mini storage warehouses.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "The use of the premises shall be limited to the rental of indoor\nspace for dead storage, except that one accessory apartment, for use\nas manager's quarters and leasing office, shall be permitted\nas a customary accessory use. Other uses, and the storage of toxic\nor hazardous materials as defined by the United States Department\nof Housing and Urban Development, shall be prohibited."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "All buildings shall be at least 42 feet apart. No building shall\nexceed 24 feet or two stories in height, nor shall the building exceed\nthe floor area ratio of the district."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "All exterior building materials shall have flat earth-tone finishes\nor other color scheme approved by the Board of Site Plan Review."
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "No storage unit door shall be visible from any residential property\nor any public street. Any wall higher than one story which is visible\noff site shall be enhanced by providing relief, such as pilasters,\ncorbeled cornices or similar ornamentation."
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "Except for one access drive nearly perpendicular to the street, all\npaved areas shall be enclosed by buildings or six-foot-high dense\nevergreen plantings. No fence shall be permitted in the required front\nyard(s)."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 322-30.2",
			"title": "Adult retail shop or adult entertainment.",
			"content": [
				{
					"text": "The following apply to an adult retail shop or adult entertainment:"
				},
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "The building shall be at least 500 feet from any residence district,\npark, playground, school, church or similar place of public assembly."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "The building shall be at least 500 feet from any other adult use."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "The building shall have the same colors, finishes and materials of\nrecently approved site plans in the vicinity as determined by the\nBoard of Site Plan Review."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 322-30.3",
			"title": "Personal wireless service facilities.",
			"content": [
				{
					"text": "All personal wireless service facilities shall be classified as either Tier One, Tier Two or Tier Three type of facility as defined in Chapter 242 of the Town Code and be subject to the following review procedures:"
				},
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "All Tier One facilities shall be required to obtain a site plan exemption pursuant to § 322-89B."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "All Tier Two facilities shall be required to obtain a special exception approval from the Planning Board and to obtain site plan approval pursuant to § 322-89A. In reviewing this petition, the Planning Board shall use the following procedures:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "The Board shall conduct a public hearing following the special exception procedures as outlined in § 322-94, except that the Planning Board and not the Town Board shall render a decision."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "The Planning Board shall evaluate the application using the standards outlined in § 242-5 of Chapter 242 of the Town Code."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "The Board shall not render a decision until it has received a report from the Planning Department which contains an assessment pursuant to § 242-11 of Chapter 242."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "The Board may approve the application as submitted, recommend approval with conditions, or the Board may select an alternative location as described in § 242-8 of Chapter 242."
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "In determining the necessity of a Tier Two personal wireless service facility, the Planning Board may require the services of an independent consultant. Costs associated with this review may be assigned to the applicant pursuant to Chapter 242."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "All Tier Three facilities shall be required to obtain a special exception approval from the Town Board, pursuant to § 322-102.1, and to obtain site plan approval pursuant to § 322-89A."
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "All personal wireless service facilities shall be required to be inspected pursuant to § 242-14 of Chapter 242."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 322-30.4",
			"title": "Variances in subdivisions.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "In addition to the authority to grant and require area variances\nto facilitate cluster development in subdivisions simultaneously with\nfinal plat approval as previously delegated to the Planning Board\nby the Town Board in 1954 pursuant to § 278 of the Town\nLaw, the Planning Board shall have the additional authority to grant\narea variances simultaneously with final plat approval, provided that\nall of the following conditions are met:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "The change does not alter the density required by the zoning\ndistrict."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "The change complies with § 322-19, Environmentally sensitive lands."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "The change would result in the addition of not more than one\nlot to the proposed subdivision, provided it does not alter the density\nof the zoning district."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "When, in the Board's judgement, the change meets one or\nmore of the following objectives:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "There is a public purpose or benefit in changing the requirement\npattern;"
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "The alteration, such as a frontage reduction, is consistent\nwith the surrounding lots;"
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "The change would preserve historically significant structures\nor features of the Town;"
																}
															]
														},
														{
															"number": "(d) ",
															"content": [
																{
																	"text": "The change would preserve, protect, or promote scenic or environmentally\nsensitive lands;"
																}
															]
														},
														{
															"number": "(e) ",
															"content": [
																{
																	"text": "The alteration would better protect the homeowner from undesirable\nland uses;"
																}
															]
														},
														{
															"number": "(f) ",
															"content": [
																{
																	"text": "The change would reduce the amount of regrading or clearing\nof property;"
																}
															]
														},
														{
															"number": "(g) ",
															"content": [
																{
																	"text": "The change would be incidental or minor and not alter the character\nof the neighborhood."
																}
															]
														}
													]
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "In making its determination as to granting any area variance, the\nPlanning Board shall grant the minimum variance that it shall deem\nnecessary and adequate and at the same time preserves and protects\nthe character of the neighborhood and the health, safety and welfare\nof the community. In making such determination, the Planning Board\nshall consider and render a determination in accordance with the following\nstandards and criteria:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Whether an undesirable change will be produced in the character\nof the neighborhood or detriment to nearby properties will be created\nby the granting of the area variance;"
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Whether a benefit sought by an applicant can be achieved by\nsome method, feasible for the applicant to pursue, other than by an\narea variance;"
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Whether the proposed variance is substantial;"
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "Whether the proposed variance will have an adverse effect or\nimpact on the physical or environmental conditions in the neighborhood\nor district; and"
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "Whether the alleged difficulty necessitating the area variance\nwas self-created by an applicant, which consideration shall be relevant\nto the decision of the Planning Board, but shall not necessarily preclude\nthe granting of the area variance."
												}
											]
										}
									]
								}
							]
						}
					]
				}
			]
		}
	]
}