{
	"url": "http://ecode360.com/13442732",
	"paras": [
		{
			"paragraph": "§ 122-7",
			"title": "Area.",
			"content": [
				{
					"text": "No building shall hereafter be erected in any\ndistrict except on a lot which, for each principal dwelling, together\nwith its accessory buildings, has:"
				},
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "An area of at least three acres in a Residence A-1\nDistrict and at least 1/2 acre in a Residence A-2 District. Notwithstanding\nany other provision in this Code, the aforementioned minimum area\nrequirements in each district shall be exclusive of any area within\nthe right-of-way of a public or private street or road. Private easements\nfor ingress and egress over which anyone other than the lot owner\nhas a right to pass or repass by foot and by vehicle shall likewise\nbe excluded from minimum area calculations. Utility easements such\nas for water, gas, electricity, telephone, cable and the like for\nservice to the owner's land and drainage easements are not included\nin the aforementioned exclusion.[Amended 9-20-2001 by L.L. No. 14-2001]"
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "A street line of at least 200 feet in a Residence\nA-1 District and 100 feet in a Residence A-2 District."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "A total building area of not more than 25% of the lot area in a Residence A-1 District and 30% of the lot area in a Residence A-2 District. In the event that an existing building that does not conform to the prescribed setback provisions is destroyed by natural causes, it may be rebuilt in the same location subject to the restrictions described in Article VII, § 122-19F."
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "Any area of a building lot seaward of the mean high-water line of a bay or navigable body of water shall be excluded from the minimum area calculations set forth in § 122-7A, above. The mean high-water line shall be located in the manner set forth in § 122-8C hereof.[Added 12-13-2006 by L.L. No. 1-2006]"
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 122-8",
			"title": "Setback.",
			"content": [
				{
					"text": "No building shall hereafter be erected, altered\nor enlarged in any district except that:"
				},
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "If it is a principal dwelling or a permitted habitable\naccessory building or a Class A nonhabitable accessory building, it\nshall be set back at least 75 feet from every street line and at least\n50 feet from all other lot lines n a Residence A-1 District and 40\nfeet from every street line and at least 25 feet from all other lot\nlines in a Residence A-2 District."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "If it is a Class B nonhabitable accessory building\nor structure, it shall be set back at least 75 feet from every street\nline and at least 25 feet from all other lot lines of this lot in\na Residence A-1 District and 40 feet from every street line and at\nleast 20 feet from every other lot line of this lot in a Residence\nA-2 District. An accessory building not exceeding 120 square feet\nin area may be located not less than 15 feet from any side or rear\nlot line in a Residence A-1 District nor less than 10 feet from any\nside or rear lot line in a Residence A-2 District. A habitable accessory\nbuilding must conform to the setback requirements of a principal dwelling."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Whenever a lot line is contiguous with a navigable\nbody of water, the setback shall be measured from the subject building\nto the mean high-water line or the record property line, whichever\nis closer. The mean high-water line shall be as designated on a survey\nmap prepared by a professional land surveyor licensed to do business\nin the State of New York.[Added 7-20-1999 by L.L. No. 1-1999]"
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 122-9",
			"title": "Height.",
			"content": [
				{
					"text": "No building shall hereafter be erected, altered\nor enlarged in any residence district to a height in excess of 37\nfeet for buildings with sloped or peaked roofs and 25 feet for buildings\nwith flat roofs, except that in the Residence A-2 District 32 feet\nshall be the maximum height for buildings with sloped or peaked roofs."
				}
			]
		},
		{
			"paragraph": "§ 122-10",
			"title": "Floor area.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "The minimum habitable floor area of any principal\ndwelling hereafter erected, constructed, altered, repaired or moved\non a lot shall be as follows:"
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Maximum floor area in A-1 Residence District."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "The\nmaximum floor area of the principal dwelling on a lot shall be 7,500\nsquare feet, excluding an attached garage for up to three cars, but\nthe maximum floor area of the principal dwelling may be increased\nby 1,000 square feet for each of the first two acres of lot area in\nexcess of three acres and 500 square feet for the third acre of lot\narea in excess of three acres up to a maximum aggregate floor area\nof 10,000 square feet."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "The\nmaximum aggregate floor area of habitable accessory buildings shall\nbe 800 square feet. The maximum aggregate floor area per lot of all\nroofed accessory buildings, other than an accessory dwelling, shall\nbe 800 square feet with no single such building exceeding 500 square\nfeet."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "No\naccessory structure or building whatsoever shall be located closer\nto the front line of a lot than the rear line of the principal dwelling\nto which it is accessory."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Maximum floor area lot coverage in A-2 Residence District."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "The\nmaximum floor area of the principal dwelling on a lot shall be 4,000\nsquare feet, excluding an attached garage of up to 250 square feet,\nexcept that for lots less than 1/2, acre (21,780 square feet), the\npermitted floor area for a principal dwelling shall be computed by\nmultiplying the actual square footage of the parcel by the floor area\nratio of 0.184, but no dwelling shall be required to be less than\n2,000 square feet with attached garage up to 250 square feet."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "The\nmaximum aggregate lot coverage of the principal dwelling and all accessory\nstructures and buildings shall not exceed 30% of the lot area."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "No\naccessory structure or building shall be located closer to the front\nline of a lot than the rear line of the principal dwelling to which\nit is accessory."
												}
											]
										}
									]
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 122-11",
			"title": "Permitted uses.",
			"content": [
				{
					"text": "In Residence A-1 Districts and Residence A-2\nDistricts, no building or premises shall be used or maintained for\nany purpose except single-family residential use and those accessory\nuses enumerated below, and no building shall hereafter be erected,\nenlarged or altered if, as so erected or as a result of such an enlargement\nor alteration, such building or any part thereof is enlarged, designed\nor intended to be used for any purpose except said purposes. Such\nuses shall in no event include institutional uses or uses customarily\ncarried on as a business."
				},
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Permitted principal uses. The permitted principal\nuses shall be as follows:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Principal dwellings for single-family use."
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "No lot may contain more than one principal dwelling."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "No lot without a principal dwelling may contain\nan accessory building."
																}
															]
														}
													]
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Permitted accessory uses. The permitted accessory\nuses shall be as follows:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Uses permitted in this Code incidental to or accessory\nto and located on the same lot. Accessory uses shall not include any\nbusiness, trade or institutional use of any type or character."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "The noncommercial practice of horticulture, including\nnoncommercial greenhouses; is permitted, provided that no fertilizer\nis stored within 100 feet of any boundary line unless kept in airtight\nstorage. With respect to such use, all buildings and structures shall\nbe set back at least 75 feet from the street line. Household pets\nsuch as dogs, cats, small caged birds, aquarium fish and the like\nare permitted if domiciled indoors."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "The office or studio of a physician, surgeon, architect,\ndentist, teacher, painter or sculptor, musician, lawyer, accountant,\nengineer or consultant residing in the principal dwelling unit in\nwhich such office or studio is located, provided that there is no\ndisplay or advertising on the premises in connection with such use\nand provided also that such studio or office does not occupy more\nspace than 1/3 of the area of one floor of such principal dwelling,\nand further provided that such use is merely incidental to the use\nof such dwelling unit, and further provided that no more than one\nautomobile carrying not more than two clients may ingress and temporarily\nremain on any lot at any one time in connection with said use, and\nprovided, finally, that no assistants, whether paid or not, may participate\nin such use, except that one assistant may be employed if the nature\nof the profession is such as to require an assistant; provided, however,\nthat such professional use shall not be deemed to include the right\nto engage in wholesale or retail trade."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "In the A-1 Residence District only, detached living\nor sleeping accommodations of bona fide domestic employees and caretakers\nregularly employed in the principal building or on the premises by\nthe occupant of such principal building or on the premises by the\noccupant of such principal building (including chauffeurs), under\nthe following conditions:[Added 6-12-2002 by L.L. No. 3-2002;\namended 9-15-2010 by L.L. No. 2-2010]"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "The habitable floor area shall not exceed 800\nsquare feet."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "Location, size, exterior finish, exterior lighting\nand screening from view by neighboring properties and public or private\nstreets shall be as approved by the Architectural Review Board."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "The owner shall file an unsubordinated declaration\nof covenants and restrictions incorporating any conditions imposed\nby the Architectural Review Board and strictly limiting the use of\nsuch accommodations as set forth above. Said declaration shall provide,\nin the event of default, in addition to all other legal remedies,\nreimbursement to the Village of legal expenses including reasonable\nattorney's fees actually incurred by the Village in connection with\nenforcement of any of the conditions contained in said declaration."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "Guesthouses or buildings designed and equipped to\nbe used for habitable purposes by other than said domestic employees,\ncaretakers, and chauffeurs are not accessory buildings and are, therefore,\nnot permitted unless located on a lot eligible in all respects as\na principal building lot.[Added 6-12-2002 by L.L. No. 3-2002]"
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Uses not permitted. In the event that a use or structure\nnot permitted by this Code or by decision of the Board of Zoning Appeals\nin either the Residence A-1 District or the Residence A-2 District\nis mandated by a final and unappealable judgment of a court of competent\njurisdiction, the Board of Trustees may establish specific area, setback,\nheight, bulk, screening, use and other zoning and building regulations\nand limitations for such use or structure as said Board shall deem\nappropriate in the circumstances."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 122-12",
			"title": "Offensive or dangerous uses.",
			"content": [
				{
					"text": "No building shall be used for any purpose which\nis or may reasonably be expected to be obnoxious or offensive by reason\nof causing or emitting odor, smoke, vapor, gas, dust, garbage, refuse\nmatter, noise or vibrations or that is dangerous or harmful to the\nhealth, peace, comfort, welfare, or safety of the community or tends\nto disturb or annoy residents of the Village or that involves any\nthreat of explosion or fire. All uses of land shall operate in conformance\nwith the limitations set forth in each subsection below."
				},
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Vibration. No vibration shall be produced which is\ntransmitted through the ground and is discernible without the aid\nof instruments at or at any point beyond the lot line, nor shall any\nvibration be produced that exceeds 0.002g peak measured at or beyond\nthe lot line using either seismic or electronic vibration measuring\nequipment."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Noise."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "All mechanically produced noise shall be muffled so\nas not to be objectionable due to intermittence, beat frequency or\nshrillness. In no event shall the sound-pressure level of noise radiated\ncontinuously from a facility at nighttime exceed at the lot line the\nvalues given in Table I (set out hereafter) in any octave band of\nfrequency. The sound-pressure level shall be measured with a sound-level\nmeter and an octave band analyzer that conform to specifications published\nby the American Standards Association."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "No person shall operate a motor vehicle, lawn mower,\nleaf blower, chain saw or other landscaping equipment or any internal-combustion\nengine without a muffler properly maintained to reduce noise to the\nabsolute minimum."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Subject to special exception by resolution of the\nBoard of Trustees for emergency or seasonal clean up, use of a gasoline\nleaf blower, chain saw or other loud or heavy machinery is permitted\nonly between the hours of 8:00 a.m. through 6:00 p.m., Monday through\nFriday, and between the hours of 9:00 a.m. through 6:00 p.m. on Saturday.\nThe use of such equipment is not permitted on Sundays or on national\nholidays. Muffled lawn mowers and lawn tractors are specifically excluded\nfrom coverage under this subsection.[Amended 3-14-2001 by L.L. No. 9-2001]"
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "Maximum permissible sound-pressure levels."
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "Maximum permissible sound-pressure levels at\na lot line for noise radiated for more than two hours from a facility\nbetween the hours of 9:00 p.m. and 7:00 a.m., where the lot line adjoins\nor lies within 25 feet of the boundary of a residence district, shall\nbe as follows:"
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "If the noise is not smooth and continuous and\nis not radiated between the hours of 9:00 p.m. and 7:00 a.m., one\nor more of the corrections in Table II which follows shall be added\nto or subtracted from each of the decibel levels given above in Table\nI."
																}
															]
														}
													]
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Odors."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "There shall not be discharged or permitted to escape\ninto the atmosphere odors which shall be offensive to the public or\nwhich endanger public comfort, repose, health or safety."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "The intensity of offensive odors shall be determined\nat the property line adjacent to the source in the manner described\nin the Air Pollution Abatement Manual, Chapter 5, Table III, Manufacturing\nChemists Association, Washington, D.C., 1951."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "No person, firm or corporation or their agents, servants or employees shall install, operate or maintain on private property in the Village any exterior light, lamp or other illumination except in compliance with the provisions of Chapter 79 of this Code.[Amended 7-9-1997 by L.L. No. 3-1997; 3-14-2001 by L.L. No.\n10-2001]"
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 122-13",
			"title": "Prohibited uses.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Natural assets."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "In order to promote the health, safety and general\nwelfare and to conserve, enhance and protect natural assets of the\ncommunity, to maintain groundwater and to prevent floods as well as\nencroachments on watercourses, drainageways, lakes, ponds, shorefronts\nand tidelands, the following uses shall be prohibited in all districts,\nexcept as otherwise specifically provided herein:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "Clearing.[Amended 7-9-1997 by L.L. No. 3-1997]"
																},
																{
																	"content": [
																		{
																			"number": "[1] ",
																			"content": [
																				{
																					"text": "The clearing of wooded areas, the excavation or grading of earth, substantial cutting or alteration of trees, the significant removal of natural ground cover or soil, the significant addition of soil, fill, stone or any other action which could have an appreciable adverse impact on the drainage, ecology or aesthetics of the surrounding area shall be prohibited unless and until a zoning permit is issued therefor in accordance with Subsection A(2) hereunder, except that incidental pruning or alteration of a mature tree or trees, normal home gardening and horticulture, the cutting and removal of damaged, dangerous or diseased trees and the normal gardening and landscaping activities carried on in conformity with the provisions of this chapter shall not require such permit so long as such removal or cutting of line trees does not affect any tree having a trunk girth of more than 24 inches at a point three feet above grade. Application for a permit shall be made to the Building Inspector and should include the purpose of the proposed action. The application fee for non-tree-related applications, which shall be paid on submission of the application, shall be $1,500, plus the costs of any engineering or other professional consulting services deemed necessary by a reviewing Village board. The application for a tree-related permit shall be $50, plus $25 for each tree in excess of one listed in the application. The removal or cutting of trees in violation of this chapter shall carry a fine of not less than $150 and not more than $500.[Amended 3-14-2001 by L.L. No. 3-2001]"
																				}
																			]
																		},
																		{
																			"number": "[2] ",
																			"content": [
																				{
																					"text": "Substantial alteration shall be deemed any cutting\nor drastic pruning or elevating the habitat of a tree which impairs\nthe life of such tree or destroys its natural symmetry and shall include\nbut not be limited to heavy or unnecessary cutting of top branches\nand major lower limbs."
																				}
																			]
																		}
																	]
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "Changing the existing water level or shoreline, dredging, excavating or removing of soil or mineral deposits from or filling of shorefront, tideland, lakes, ponds, marshes, drainage ditches or other watercourses and the construction of a dam, first dock, pier, levee, breakwater, jetty or other facility for drainage, recreation, shorefront protection or water conservation or the addition, removal in whole or in part or substantial alteration of revetment for new construction or repair shall be prohibited unless specifically approved pursuant to the procedure prescribed in Subsection B below.[Amended 3-14-2001 by L.L. No. 5-2001]"
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "No additional water runoff as the result of\nor during construction or landscaping activities shall be permitted\ninto neighboring property, Village roads or the waters surrounding\nthe Village. It shall be the responsibility of the landowner to construct\ncontainment systems sufficient to avoid such runoff. Such surface\nor subsurface runoff shall include but not be limited to water from\nany rain leader or basement sump pump.[Amended 7-9-1997 by L.L. No. 3-1997]"
																}
															]
														},
														{
															"number": "(d) ",
															"content": [
																{
																	"text": "The erection of a dwelling or other building or any portion thereof shall be prohibited below an elevation of 12 feet above mean sea level. Nassau County datum as shown on the topographic map dated October 1957 and prepared for the Nassau County Department of Public Works, except a private bathhouse accessory to a dwelling or a nondwelling accessory structure to a nonprofit club, park or reservation, and which bathhouse or nondwelling shall be subject to approval pursuant to Subsection A(2) hereunder."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "In the case of uses or work enumerated in Subsection A(1)(b) and (c), the Building Inspector shall refer the application to an engineer designated by the Village for review and report on the engineering aspects of the proposal, which reports shall be made within 30 days after receipt of the application. The Building Inspector shall then present the application and plans, together with his and the engineer's report, to the Village Building Committee for consideration. Said Committee may request the Planning Board to review and report upon such plans. After due consideration, the Building Committee may disapprove or approve the plans and application and may authorize the issuance of a zoning permit therefor, subject to such conditions as said Board may impose."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "In the case of work enumerated in Subsection A(1)(b) hereinabove, no permit shall be issued unless the Engineer or Building Inspector designated by the Village has examined the plans and application therefor and said official has certified, in writing, to the Building Committee that:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "The proposed work conforms to such Village engineering\nstandards as have been approved by the Village Trustees as well as\napplicable law and ordinances;"
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "The proposed grading of land conforms to a grading\nplan duly approved by the Planning Board in connection with a subdivision\nplat;"
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "The proposed work does not constitute any development\nof a subdivision (as defined in rules and regulations for filing plats\nfor approval[1]) previously disapproved or pending before the Planning\nBoard; and"
												},
												{
													"footnote": "[1]\nEditor's Note: See Ch. 100, Subdivision of Land.\n"
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "Said work will not create undue hazard or environmental\nimpact on the land in question, on adjacent roads, public or private,\nor property or the tidelands and waters surrounding Centre Island\ndue to flooding, drainage, soil erosion, silting, additional runoff\nor other conditions resulting from disturbance of existing topography,\nground cover or other natural features or structures."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Whenever the engineer designated by the Village or the Building Inspector determines that the work enumerated under Subsection A(1)(a), (b) and (c) above will affect an area in excess of 1/4 acre or in excess of the immediate site of a proposed building to which such work is incidental or that such work may affect adjacent property, the Building Committee shall refer the plans and application to the Planning Board for review and report in such cases. The Planning Board shall consider, among other things, the relation and conformity of the proposed work to § 7-708 of the Village Law of the State of New York and its effect upon adjacent property. Said Board shall also consider whether such work will tend to secure safety from fire, flood, erosion and other dangers; promote health, safety and general welfare; lower the water table; and endanger the conservation enhancement and protection of natural assets. In the case of an unfavorable report by the Planning Board, the Building Committee shall not issue a permit."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 122-14",
			"title": "Signs.",
			"content": [
				{
					"text": "No signs shall be hereafter erected or maintained\non any building or premises in any residence district except as specifically\npermitted herein."
				},
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Residence A Districts. In any residence district,\nsigns may be erected for the following purposes and for no other.\nAny signs erected and maintained shall be subject to all the conditions\nand provisions set forth in this article-Permitted signs shall be\nas follows:[Amended 3-14-2001 by L.L. No. 11-2001]"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "One residential nameplate not exceeding 1 1/2\nfeet in any dimension. In the event of a private road, there may be\none joint nameplate not exceeding 2 1/2 feet in any dimension."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Not more than three \"No Trespassing\" signs in a Residence\nA-1 District and not more than two in a Residence A-2 District, and\nsuch signs shall not exceed more than 1/2 feet in any dimension, with\nalike letters on a black or green background. In the event of a private\nroad, there may be one \"No Trespassing\" sign not exceeding 2 1/2\nfeet in size in any dimension."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Permit and fees."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "It shall be unlawful to erect, alter, maintain, reconstruct\nor relocate a sign, other than a residential nameplate or \"No Trespassing\"\nsign, until a permit has been issued therefor by the Building Committee.\nA written application therefor shall be filed with the Building Committee\nby the owner or lessee of the building or premises on which such sign\nis to be erected or maintained or by the duly authorized agent of\nsuch owner or lessee. Such application shall be accompanied by the\nwritten consent of the owner or lessee of the property on which such\nsign is to be erected or maintained and shall contain an accurate\ndescription of the location or proposed location of such sign, the\nname and address of the applicant and the name and address of the\nperson by whom such sign is to be erected, altered, maintained, reconstructed\nor relocated and such other information as the Building Committee\nmay require to show compliance with the provisions of this chapter."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "A fee shall be paid to the Village by the applicant\nfor a permit at the time of submitting his application for a permit.[1]"
												},
												{
													"footnote": "[1]\nEditor's Note: For current fee provisions, see Ch. 57, Fees.\n"
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Construction and maintenance of signs. All signs shall\nbe properly secured, supported and braced as to make them safe and\nshall be kept in perfect structural condition and clean and well painted."
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "Revocation and expiration of permit."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "When it shall appear to the Building Inspector/Village\nEngineer or the Building Committee that any sign is being maintained\nin an unsafe or insecure manner or in violation of any of the terms\nof this article, he or they shall so notify the person to whom the\npermit has been issued, in writing, at the address stated on the application,\nand it shall be the duty of such person who has been notified to make\nsuch repairs or to comply with the necessary provisions of this chapter\nwithin the time stated in the notice. If such repairs are not so made\nor if such compliance is not so affected, the Building Inspector/Village\nEngineer may cause such sign to be removed and shall charge the expense\nthereof to the person so notified."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Any permit issued hereunder shall be deemed to expire\nupon any change in ownership of the premises on which it is or will\nbe erected. Upon expiration and notice thereof by the Building Inspector\nto the applicant, it shall be the duty of the person so notified to\nremove such sign and, if not so removed, the Building Inspector/Village\nEngineer may cause such sign to be removed and shall charge the expense\nthereof to the person so notified."
												}
											]
										}
									]
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 122-15",
			"title": "Fences, piers, posts, sculptures, gates.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "No fence, wall, pier, post, gate or structure in the\nnature of a fence or wall or connected in any way with a fence or\na wall shall be hereafter erected on any premises which shall exceed\nsix feet in height, except entrance piers and gates not exceeding\neight feet in height shall be permitted. A sculpture or decorative\nshape may be added to the top of a conforming entrance post or pier\nif such addition does not result in any overall height exceeding 10\nfeet. All measurements shall be made from preexisting undisturbed\ngrade."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Fences shall be constructed with the finished side\nfacing adjoining property or public or private roads. No supports,\nposts or bracing shall be placed on the same side of the fence that\nfaces adjoining property or a private or public road."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Front line or street line fencing; obstruction of\nview."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Fencing for the front line or street line of the property\nshall be limited to fences having a minimum of 75% free area when\nprojected as a front elevation (see-through-type fencing). Chainlink\ntype, chicken-wire, hardware-wire and similar fences are not permitted\nunless such fences are constructed as barriers in connection with\npermitted fences, are heavily screened and camouflaged by substantial\nevergreen plantings and do not exceed the lower of four feet or the\nheight of the accompanying fences. Solid fences along the front or\nstreet line are permitted as long as they do not exceed four feet\nin height. Barbed-wire fencing is not permitted."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "No wall, fence or other structure shall be erected\nand no hedge, tree, shrub or other growth shall be maintained in such\nlocation as, in the opinion of the Police Department, would cause\ndanger to traffic by obstructing the view."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "All front line or street line fencing shall be screened\nby plantings as prescribed by the Architectural Review Board."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "Fencing of swimming pools shall comply with the New\nYork State Uniform Fire Prevention and Building Code."
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "Fences shall be kept in good repair or must be removed,\nreplaced or repaired after 30 days' notice from the Village Building\nInspector. A new permit will be required for a replacement or substantial\nrepair."
								}
							]
						},
						{
							"number": "F. ",
							"content": [
								{
									"text": "Wire fencing for tennis courts is permitted up to\n10 feet in height, subject to screen planting requirements as prescribed\nby the Architectural Review Board."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 122-16",
			"title": "Automobiles, trailers, mobile homes and dumpsters.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "The Village Board of Trustees hereby finds that the storage of mobile\nhomes, recreational vehicles, unregistered vehicles and trailers of\nany kind, except boat trailers, adversely affects the environment\nand community by creating a visual or environmental detriment. These\nvisual and environmental detriments impair the beneficial use of real\nproperty in such areas, impair the stability and value of both the\nimproved and unimproved real property in such areas, and produce a\ndegeneration of the property and aesthetic character of such area\nand impair the proper relationship between the taxable value of real\nproperty in the community and the cost of municipal services provided\ntherefor. These detriments, singly and in combinations, result in\na deterioration of conditions affecting the health, safety, morals\nand general welfare of the inhabitants of the community."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "No automobile trailer, travel trailer, or mobile home designed to\nbe used for human habitation, unregistered motor vehicle, or commercial\ntruck, crane, excavator, bulldozer, or similar construction equipment,\nor trailers of any kind, except boat trailers, or dumpsters shall\nbe used, stored or parked in any residence district for more than\n14 days total during any calendar year unless stored or parked within\na fully enclosed private garage building or unless screen planting\nis provided sufficient to occlude the view of the item from all points\noff the premises, and the item's location meets all setback and\nother provisions of the Village Code. Construction site trailers are\nnot permitted in any manner, unless used in connection with a bona\nfide construction project, and their use shall be specifically approved\nby the Architectural Review Board. All dumpsters shall be covered\nso as to prevent any refuse from overflowing the container."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "No trailer or mobile home may be used for overnight habitation."
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "No automobile or vehicle that is nonoperable, unregistered or stored\noutside with a cover may be parked or stored for a period exceeding\n14 days total during any calendar year unless it is kept inside a\nprivate garage or enclosure or set back from private or public view."
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "No portable storage container may be stored or parked in any residence\ndistrict for more than a total of 30 days during any calendar year\nunless stored or parked at a location where the container is concealed\nat all times from neighboring property."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 122-17",
			"title": "Boats.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Except on property legally permitted for club purposes,\nno boat exceeding 16 feet in length may be stored or parked outside\nin any residence district for more than nine months in any one calendar\nyear."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Any boat {regardless of size) stored or parked outside\nfor more than 30 days in the Residence A-1 District must be substantially\nscreened from public or neighboring view by means of evergreen plantings\nof sufficient density and maturity to substantially screen the boat\nfrom view. Any boat in the Residence A-2 District shall be set back\nfrom the street line a minimum of 20 feet."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "No more than one boat of any length may be stored\non each residential parcel unless kept inside a private garage or\nenclosure screened or set back from private or public view."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 122-17.1",
			"title": "Basketball backboards.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "A permanent or nonpermanent backboard/hoop must meet the minimum setback and permitting requirements set forth in § 122-8, except that:[Amended 12-10-2001 by LL. No. 17-2001]"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "A nonpermanent backboard/hoop in the Residence\nA-2 District shall be set back at least 20 feet from every property\nline (or the edge of pavement in the case of a road or street); and"
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "A nonpermanent backboard/hoop shall not require\na permit if in the judgment of the Building Inspector the assembly\nis so insubstantial as not to require a permit."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Hours of use are restricted to between the hours of\n9:00 a.m. to 7:00 p.m. unless the basketball backboard is 125 feet\naway from the nearest adjoining property line."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 122-18",
			"title": "Berms.",
			"content": [
				{
					"text": "For the purposes of this chapter, a \"berm\" is\na quantity of clean dirt, stone, fill or other material or combination\nof material that is located less than 20 feet from a property line."
				},
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Unless a building permit has been issued, no berm\nin excess of two feet above natural grade shall be constructed in\nthe Village within 20 feet of any property line."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "The berm shall be landscaped on all sides with living\nground cover and it shall be maintained in a neat and clean manner\non all sides by the property owner."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "The toe of the slope of all berms shall be located\nat least 10 feet from the property line."
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "The slope of all permitted berms should not exceed\nan angle of repose of 30°, and the width of berms shall be at\nleast four feet at the top."
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "In no case shall the height of any berm exceed four\nfeet above existing natural grade."
								}
							]
						},
						{
							"number": "F. ",
							"content": [
								{
									"text": "No fence may be erected atop a berm."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 122-18.1",
			"title": "Curb cuts.",
			"content": [
				{
					"text": "There shall be no more than one curb cut from\nany lot without specific permission from the Board of Trustees."
				}
			]
		},
		{
			"paragraph": "§ 122-18.2",
			"title": "Filming or videotaping.",
			"content": [
				{
					"text": "There shall be no commercial or production level\nfilm or video activity within the Village except upon special application\nto the Board of Trustees. The Board of Trustees shall establish by\nresolution rules regulating the hours of work, notice to adjoining\nowners, permitted noise levels and application fees. Only those activities\ndemonstrated to be brief, nondisruptive to the peace and quiet of\nthe Village and safe shall be permitted."
				}
			]
		},
		{
			"paragraph": "§ 122-19",
			"title": "Continuation of existing nonconforming uses.",
			"content": [
				{
					"text": "Any building or use existing on the effective date of this chapter and permitted by the Building Zone Code in effect immediately prior to that date, although not conforming with the other provisions of this chapter, may be continued, subject to compliance with the provisions of § 122-20 of this chapter and subject to the following conditions:"
				},
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "No such building which is nonconforming with respect to height, area or lot location or setback from any lot line shall be enlarged or altered in such manner as to increase any nonconformity, subject to the provisions of § 122-20 of this chapter."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "No such building which is nonconforming with respect\nto use shall be enlarged or altered structurally except as may be\nallowed by law or this chapter."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "No such nonconforming use shall be enlarged or extended\nnor shall it be changed to another nonconforming use."
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "No such nonconforming building or use, if changed\nto a building or use which conforms to the provisions of this chapter,\nshall thereafter be changed to a nonconforming use or building."
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "No such nonconforming use, other than tennis courts\nand swimming pools, if discontinued 12 consecutive months within a\nten-year period, shall be resumed."
								}
							]
						},
						{
							"number": "F. ",
							"content": [
								{
									"text": "No such nonconforming building, if 50% or more of\nthe assessed value of the structure is destroyed due to any cause,\nshall be restored in nonconforming form or location. However, if such\nnonconforming building is destroyed accidentally, it may, if so permitted\nby the Board of Zoning Appeals, be restored in substantially the same\nform and location, without substantial enlargement. However, tennis\ncourts and swimming pools are exempt from this subsection."
								}
							]
						},
						{
							"number": "G. ",
							"content": [
								{
									"text": "If less than 50% of a nonconforming building is destroyed\nby natural causes, it may be restored only if a building permit is\nobtained and neither the restored portion of the building nor the\nnonconformity is included. However, tennis courts and swimming pools\nare exempt from this subsection."
								}
							]
						},
						{
							"number": "H. ",
							"content": [
								{
									"text": "The restoration referred to in Subsections F and G hereof must be commenced within one year and completed within two years of the destruction and, if not, the continuation of the nonconformity of the affected portion only shall cease."
								}
							]
						},
						{
							"number": "I. ",
							"content": [
								{
									"text": "If 25% or more of a nonconforming fence is destroyed,\nit must be rebuilt under the provisions of this chapter. This does\nnot apply to ordinary repairs.[Amended 1-12-2000 by L.L. No. 3-2000]"
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 122-20",
			"title": "Nonconforming use of buildings.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "In the case of a lot on which there stands, on the effective date of this chapter, a dwelling or other principal building which conforms to the Building Zone Code in effect immediately prior to that date, which lot shall not at any time on or after the effective date hereof have been reduced in area or in any dimension, the fact that the area of such lot is less than that prescribed in Article IV of this chapter or that the width of the front lot line of said lot is less than that prescribed in Article IV of this chapter shall not prevent the erection, enlargement, alteration or maintenance on such lot of a building or buildings which, as so erected, enlarged or altered, do not increase any existing nonconformity with respect to setback or height and which comply with all the other provisions of this chapter."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "An unimproved lot held in single and separate ownership\nprior to the effective date of this chapter and continuously thereafter\nwhich does not comply with the lot area and front line requirements\nof this chapter shall be exempt from the lot area and front line requirements\nof this chapter but shall comply with the area and front requirements,\nif any, of the Building Zone Law in effect at the time such lot was\nfirst held in single and separate ownership."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Building permit applications made prior to March 12,\n1997, as modified and not denied prior to May 28, 1997, shall be granted,\nprovided that the buildings for which building permits were so applied\nfor conform to the restrictions of this chapter which were in force\non March 12, 1997, and all other provisions of law.[Added 7-9-1997 by L.L No. 3-1997]"
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 122-21",
			"title": "Reducing area of improved lots.",
			"content": [
				{
					"text": "No building shall be used or maintained on a\nlot which is hereafter reduced, other than by natural causes, in area\nor length of the front lot line in violation of the following provisions:"
				},
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "No improved lot shall be reduced in area or in any dimension unless the lot so reduced has at least the area prescribed by Article IV of this chapter and has the unoccupied spaces required by the other provisions of this chapter."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "No improved lot shall be reduced in length of the front lot line unless the lot as so reduced has at least the length of the front lot line prescribed in Article IV of this chapter."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "No improved lot shall be reduced in area or in any\ndimension unless the setback of each then-existing building from any\nnew boundary line shall be at least the setback which would be required\nby the other provisions of this chapter for a building of the same\nkind then newly erected in the same location."
								}
							]
						}
					]
				}
			]
		}
	]
}