{
	"url": "http://ecode360.com/13657303",
	"paras": [
		{
			"paragraph": "§ 146-6",
			"title": "Designation of A Residence District; deposit on construction of new homes.",
			"content": [
				{
					"text": "For the purposes of this chapter, the Village of Hewlett Bay\nPark shall consist entirely of an A Residence District. The Incorporated\nVillage of Hewlett Bay Park hereby adopts the provisions of Article\n37 of the General Business Law of the State of New York in relation\nto deposits on construction of new homes."
				}
			]
		},
	    {
			"paragraph": "§ 146-7",
			"title": "Applicability.",
			"content": [
				{
					"text": "The following regulations shall apply throughout the Residence\nDistrict."
				}
			]
		},
		{
			"paragraph": "§ 146-8",
			"title": "Application for construction permit.",
			"content": [
				{
					"text": "Before the construction or alteration of any building or any\npart of a building is commenced, the person causing such construction\nor alteration to be done, or his agent or the architect or builder\nemployed in connection with the proposed construction or alteration,\nshall file in the office of the Village Clerk, addressed to the Board\nof Trustees of the village, an application for a permit to construct\nor alter."
				}
			]
		},
		{
			"paragraph": "§ 146-9",
			"title": "Permitted uses.",
			"content": [
				{
					"text": "A building or structure may be erected, altered or maintained,\nor a lot or premises used, in the A Residence District for any of\nthe purposes stated in this section. No building or structure may\nbe erected, altered or maintained, and no lot or premises used, for\nany other purpose:"
				},
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "A single-family detached residence, provided that such residence\nhas an enclosed garage for the parking of at least two, but not more\nthan four, automobiles, together with a driveway of sufficient width\nand area to permit proper ingress and egress for automobiles."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "With the permission of the Board of Trustees, a religious use or\nan educational use, in conformity with any other applicable requirements\nin this chapter.[1] For the purposes of this section, the term educational\nuse shall be limited to a school accredited or registered with the\nNew York State Board of Regents."
								},
								{
									"footnote": "[1]:\nEditor's Note: See Art. VI, Educational and Religious\nUses.\n"
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Accessory uses, only as enumerated herein, subject to the limitations\nprovided hereinafter."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Every accessory use shall be located on the same lot with the permitted principal use. Uses accessory to a principal residential use shall be limited to those uses customarily incidental to the permitted principal use and those accessory uses expressly permitted in this chapter. Uses accessory to a principal nonresidential use shall be limited to those set forth in this section as permitted under such circumstances and those permitted by §§ 146-10, 146-24.1 and 146-24.2."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Uses accessory to a principal residential use may include a private\nenclosed garage for parking of two or more, but not more than four,\nautomobiles, but shall not include a carport, with sufficient driveway\nwidth and area for the proper ingress and egress of such automobiles.\nWhere the lot on which the accessory use is located has at least one\nborder along or under a pond or waterway, a private boathouse, dock\nor wharf may be a permitted accessory use. A use accessory to a principal\nresidential use shall not include use of a building or structure for\nhabitable space (e.g., for living, sleeping, eating or cooking).[Amended 3-17-2014 by L.L. No. 2-2014]"
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "The maximum combined building area of all buildings and structures\nshall not exceed 25% of the lot area for the first 40,000 square feet\nof lot area plus 10% of the lot area in excess of 40,000 square feet.[Added 3-17-2014 by L.L. No. 2-2014[2]]"
												},
												{
													"footnote": "[2]:\nEditor's Note: This local law also renumbered former\nSubsection C(3) as Subsection C(3-a).\n"
												}
											]
										},
										{
											"number": "(3-a) ",
											"content": [
												{
													"text": "No individual accessory building, structure or use\nshall occupy an area more than 3% of the total lot area, exclusive\nof any use which is customarily or frequently under water. All accessory\nbuildings, structures and uses shall in the aggregate occupy an area\nnot more than 5% of the total lot area, exclusive of any area which\nis customarily or frequently under water.[Amended 3-17-2014 by L.L. No. 2-2014]"
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "A use accessory to a principal residential use may include the office\nof a physician, dentist, architect, teacher, artist, musician, accountant,\nengineer or lawyer, provided that:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "The office shall be located in the dwelling in which the practitioner\nresides."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "No more than one sign may be displayed on the premises, with\nan area not more than 72 square inches and bearing only then name\nand occupation of the practitioner."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "The use shall be limited to the office of a single practitioner\nduly licensed under the laws of the State of New York to practice\nthe accessory use."
																}
															]
														},
														{
															"number": "(d) ",
															"content": [
																{
																	"text": "No more than one employee or assistant shall be present at any\ntime that the use is being conducted."
																}
															]
														},
														{
															"number": "(e) ",
															"content": [
																{
																	"text": "The office shall be located in, and be part of, the principal\ndwelling on the lot or premises and may not be located in whole or\nin part in a separate building."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "Not more than one sign, provided that no dimension of such sign may\nbe greater than two feet, and further provided that such sign shall\nbe set back a minimum of 15 feet from each property line. Without\nthe prior permission of the Board of Trustees, no such sign may be\nmaintained for a period in excess of 30 consecutive calendar days\nnor more than a total of 60 days in any consecutive period of 120\ndays. Notwithstanding the foregoing, no sign shall be permitted except\na sign advertising the sale of the premises on which the sign is located\nor a sign expressing any view or opinion the expression of which is\nprotected by the United States Constitution or the New York State\nConstitution."
												}
											]
										},
										{
											"number": "(6) ",
											"content": [
												{
													"text": "Fences, provided that they conform to the following conditions and\nlimitations:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "A fence erected along the boundary of a property which coincides\nwith a boundary line of the village, which shall not exceed eight\nfeet in height. Each such fence shall be of either open or stockade\ndesign, or of such other similar type or design as may be approved\nby the Board of Trustees. Unless required by the Board of Trustees,\nno public hearing shall be required prior to such approval. No such\nfence may unreasonably obstruct the view of any vehicle or pedestrian\nlawfully on a public right-of-way from or by any other vehicle or\npedestrian lawfully on the same or another public right-of-way. A\nfinished side of such fence shall face the property within the village.[Amended 9-26-2000 by L.L. No. 2-2000]"
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "A fence along any other property boundary, or within five feet\nof a property boundary, which shall not exceed four feet in height.\nEach such fence shall be of stockade or open design, or of such other\nsimilar type or design as may be approved by the Board of Trustees.\nUnless required by the Board of Trustees, no public hearing shall\nbe required prior to such approval. One finished side of any such\nfence shall face the property adjoining the premises on which the\nfence is located. Landscaping shall be placed and maintained on the\nexterior side of each such fence, consisting of shrubs or other natural\nplanting of a height when mature of not less than four feet. Such\nlandscaping shall be of suitable density throughout the entire length\nof the fence and shall be of a type, species and size approved by\nthe Code Official. No such fence or landscaping may create a traffic\nhazard or unreasonably obstruct the view of any vehicle or pedestrian\nlawfully on a public right-of-way of, from or by any vehicle or pedestrian\nlawfully on the same or any other public right-of-way.[Amended 9-26-2000 by L.L. No. 2-2000; 12-18-2000 by L.L. No. 3-2000]"
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "No fence permitted by this section shall constitute or create\na traffic hazard nor unreasonably obstruct the view by any vehicle\nor pedestrian lawfully on a public right-of-way from or by any vehicle\nor pedestrian lawfully on the same or any other public right-of-way."
																}
															]
														},
														{
															"number": "(d) ",
															"content": [
																{
																	"text": "A fence facing a public right-of-way or Macy Channel shall be\nan open-type fence, the closed/open ratio of which shall not be more\nthan one to one and the closed sections of which shall not be more\nthan four inches in width. Gates in any such fences shall be limited\nto open-type gates and only for the purposes of blocking entry to\nor from a public right-of-way. Notwithstanding the foregoing, a chain\nlink fence satisfactory to the Board of Trustees may be erected on\nthat portion of any property which is contiguous to Macy Channel,\nprovided that the fence shall be not more than four feet in height."
																}
															]
														},
														{
															"number": "(e) ",
															"content": [
																{
																	"text": "Ornamental screens may be constructed on or within 10 feet of\nany property line, provided that they shall otherwise comply with\nthe requirements for fences."
																}
															]
														},
														{
															"number": "(f) ",
															"content": [
																{
																	"text": "No fence shall be constructed or erected without a building\npermit, and no such permit shall issue unless a survey of the property,\nan architectural rendering of the fence, and a plan for required landscaping\nhas been filed with, and approved by, the Code Official and all required\nfees paid. In approving any such landscaping plan, the Code Official\nshall determine whether the proposed landscaping is suitable to achieve\nscreening of the fence from view from the exterior of the property.\nAny such permit shall expire six months from the date of its issuance,\nunless a certificate of completion has been issued prior to such time\ncertifying that the fence, including the landscaping, complies with\nall applicable requirements of this section.[Amended 12-18-2000 by L.L. No. 3-2000]"
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(7) ",
											"content": [
												{
													"text": "No accessory use shall be permitted on any lot or premises, or any\npart thereof, within the village in connection with any building,\nstructure, lot or premises located outside the village unless:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "The accessory use would be permitted if the building, structure,\nlot or premises were located in the village; and"
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "Such accessory use is permitted by the Board of Trustees, upon\nsuch terms and conditions as the Board of Trustees may impose."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(8) ",
											"content": [
												{
													"text": "A use accessory to a principal residential use may include a swimming\npool, subject to the following restrictions and limitations:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "The term \"swimming pool,\" as used herein, shall mean any outdoor\nstructure, tank or excavation intended for or used for the purposes\nof bathing or swimming, but such term shall not be deemed to include\na portable wading pool located above ground and containing not more\nthan 90 square feet of water surface and having a maximum depth of\n24 inches or less. The term \"swimming pool\" shall not include a swimming\npool completely and permanently enclosed within a principal dwelling,\nwhich swimming pool shall be considered part of the principal use\nand not an accessory use."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "No swimming pool shall be constructed or erected unless a building\npermit for the same shall have been issued. An application for such\npermit shall include plot, site and building plans for the pool, showing\ndimensions, design, location and use of all structures, equipment,\ndrainage, sanitary filtration, water supply and disposal facilities,\nfencing, screening and landscaping, covering of pool and such other\ninformation as may be requested by the Building Official. Such application\nshall also include a current certification by a licensed professional\nengineer that the facilities and equipment for drainage of such pool\nare or will be adequate and will not interfere with the public water\nsupply system, with existing sanitary and drainage facilities or with\npublic rights-of-way or their use. No drainage onto adjacent properties\nor a public right-of-way shall be permitted."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "Every swimming pool shall be enclosed by either a good-quality link wire fence or a wrought iron or wrought aluminum fence, or such other type of fence as may be approved by resolution of the Board of Trustees, four feet in height, entirely enclosing the area in which the pool is located. A swimming pool fence located on or within five feet of a property boundary line also shall comply with the requirements of § 146-9C(6) and may be a stockade fence as permitted by that section. Each swimming pool fence shall be properly screened with evergreen shrubs and plants, shall be no closer to any part of the pool than four feet, and shall completely enclose (a) the pool itself or (b) the particular yard area in which the pool is situated or (c) the entire portion of the property behind the rear line of the principal building. A building permit is required for a swimming pool fence.[Amended 6-9-2010 by L.L. No. 1-2010]"
																},
																{
																	"content": [
																		{
																			"number": "[1] ",
																			"content": [
																				{
																					"text": "In the event that a chain-link fence is utilized, said fence\nshall extend from the ground to a height of four feet, with top and\nbottom rails, posts spaced not more than eight feet apart on centers\nand extending not less than three feet below grade in an eight-inch-diameter\nconcrete footing. Chain-link fabric shall be galvanized steel, two-inch-mesh\nNo. 9 wire. The fabric shall be fastened to posts and rails so that\nthe bottom of the mesh is not more than one-inch above grade. The\nfabric shall be fastened securely to posts and rails by means of wire\nclips not more than 30 inches on center."
																				}
																			]
																		},
																		{
																			"number": "[2] ",
																			"content": [
																				{
																					"text": "In the event that a wrought iron or wrought aluminum fence is\ninstalled, it shall extend from the ground to a height of four feet,\nwith top and bottom rails, posts of a minimum diameter of two inches\nspaced not more than eight feet on centers, and said posts shall extend\na minimum of three feet below grade in an eight-inch-diameter concrete\nfooting. Such wrought iron or wrought aluminum fence shall have minimum\none-half-inch vertical bars spaced not more than 5 1/2 inches\napart and welded to the top and bottom rails, and horizontal bars\nor rails shall not be less than three feet eight inches from the bottom\nrailing to the next horizontal bar or rail. The bottom rails of such\nwrought iron or wrought aluminum fences shall not be more than four\ninches above finished grade."
																				}
																			]
																		},
																		{
																			"number": "[3] ",
																			"content": [
																				{
																					"text": "In the event that any other type of fence is approved by the\nBoard of Trustees, the Board of Trustees may specify the details of\nconstruction and installation of such fence."
																				}
																			]
																		}
																	]
																}
															]
														},
														{
															"number": "(d) ",
															"content": [
																{
																	"text": "All fences shall be designed to produce a rigid structure and\nshall be of a sufficient fabrication, construction, design and quality\nof materials to prevent the accidental entry or unauthorized use of\nthe pool by one or more children."
																}
															]
														},
														{
															"number": "(e) ",
															"content": [
																{
																	"text": "All fences shall have not more than two openings for ingress\nand egress, each of which openings shall have a self-closing gate\nor door with an automatic latch and a lock of such character that\nit can be opened from the outside of the pool enclosure only by means\nof a key or combination. Each gate, door, latch and lock shall at\nall times be maintained in good working order, and each gate or door\nshall be kept closed and locked at all times when the pool is not\nin use by one or more adults, regardless of whether the pool contains\nwater."
																}
															]
														},
														{
															"number": "(f) ",
															"content": [
																{
																	"text": "Each pool and its fences, gates, doors and locks shall at all\ntimes be maintained in the same condition as they were at the time\nthe certificate of completion for the same was issued."
																}
															]
														},
														{
															"number": "(g) ",
															"content": [
																{
																	"text": "Should the owner of property abandon a swimming pool, or should\nthe Board of Trustees determine that an owner of property has abandoned\na swimming pool, the owner of the property where the pool is located\nshall remove the pool, and fill in or remove the excavation or depression,\nand restore the surface of the ground to its original grade and approximately\nthe same condition as prior to the installation of the pool. The owner\nshall notify the Building Inspector of such abandonment, and the completion\nof the required remediation work, so that the same may be inspected."
																}
															]
														},
														{
															"number": "(h) ",
															"content": [
																{
																	"text": "No swimming pool may be installed, constructed or maintained\nexcept in a rear yard. Notwithstanding any other provision of this\nchapter, the pool, including the foundation and mechanical equipment\nin connection therewith, shall be located not less than 35 feet from\nthe rear lot line, and not less than 30 feet from any side lot line,\nand in the case of a corner lot, such pool, foundation and equipment\nshall be located at least 50 feet from any property line abutting\na public right-of-way.[Amended 6-9-2010 by L.L. No. 1-2010]"
																}
															]
														},
														{
															"number": "(i) ",
															"content": [
																{
																	"text": "No swimming pool may occupy more than 25% of the area of the\nrear yard, excluding all garages or other permitted structures. For\nthe purposes of computing the pool area, the base for any springboard\nor diving platform and the foundation for any mechanical equipment\nshall be included. Notwithstanding any other provision of this chapter,\nthe area occupied by the pool shall not be included in computing the\nmaximum percentage of lot area upon which buildings or structures\nmay be located. No covering of any kind or nature shall be installed\nor maintained over any swimming pool except a protective covering\nwhich may be installed and maintained at pool level.[Amended 6-9-2010 by L.L. No. 1-2010]"
																}
															]
														},
														{
															"number": "(j) ",
															"content": [
																{
																	"text": "Every swimming pool, and its related equipment and apparatus,\nshall be used and operated in such manner as not to cause disturbance\nor annoyance to any other person within the village. No loudspeaker\nor amplifying devices shall be permitted to be used on or near the\npool or in connection with the use of the pool. No pool shall be equipped\nwith lighting other than underwater lighting, and the area surrounding\nany pool shall be lighted only with lights which do not cast light\nor glare directly onto any adjoining property."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(9) ",
											"content": [
												{
													"text": "A use accessory to a principal residential use may include a tennis\nor sports court, subject to the following restrictions:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "No tennis or sports court may be constructed, maintained or\nused on any lot or premises except as a use accessory to a single\nfamily residence located on the same lot or premises within the village."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "No tennis or sports court may be constructed or maintained in\na front yard, nor within 35 feet of a rear property line, nor within\n30 feet of a side property line."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "All tennis or sports courts shall be enclosed with permanent\nfencing, of a type and design approved by the Building Inspector,\nsufficient to prevent balls or other implements or equipment used\nat such location from leaving the premises or immediate vicinity of\nsuch court."
																}
															]
														},
														{
															"number": "(d) ",
															"content": [
																{
																	"text": "No tennis or other sports court shall be constructed or maintained\nso as to permit any drainage of water to flow onto adjacent property\nor a public right-of-way."
																}
															]
														},
														{
															"number": "(e) ",
															"content": [
																{
																	"text": "No covering of any type shall be erected or maintained over\nany tennis or sports court."
																}
															]
														},
														{
															"number": "(f) ",
															"content": [
																{
																	"text": "No tennis or other sports court may be constructed, installed\nor maintained without permission of the Board of Trustees. An application\nfor such permit shall be accompanied by plot, site and construction\nplans showing location, dimensions, drainage, design, fencing, screening\nand landscaping, such other information as may be required by the\nBoard of Trustees and payment of an application fee in an amount determined\nby the Board of Trustees by resolution.[3]"
																},
																{
																	"footnote": "[3]:\nEditor's Note: See Ch. A149, Fees.\n"
																}
															]
														},
														{
															"number": "(g) ",
															"content": [
																{
																	"text": "Any tennis or sports court lawfully constructed or maintained\nprior to 1981 shall comply with all of the provisions of this section."
																}
															]
														}
													]
												}
											]
										}
									]
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 146-9.1",
			"title": "Site plan approval.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "No permit shall be granted for a physical alteration or improvement\nof any property used for any principal use, other than a single-family\nresidence, without the prior approval, by the Board of Trustees, of\na site plan for such premises. Where a site plan has been approved\nfor any property, no physical alteration of such property shall be\nperformed other than in accordance with the approved site plan."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "As used in this section, the term \"physical alteration\" shall include,\nbut not be limited to:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Installation or relocation of parking areas, sidewalks, driveways\nor other impervious surfaces or outdoor recreational facilities."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Construction, relocation or removal of any building, structure,\nor other physical improvement on such property, or alteration of any\nexisting building or structure which results in increased or relocated\nfloor area or building area."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Subdivision of property into more than one lot."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "A change of the grade or topography of any part of the property."
												}
											]
										}
									]
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 146-9.2",
			"title": "Changes in topography.",
			"content": [
				{
					"text": "No substantial change shall be made in the topography of any\nland without the approval of the Board of Trustees after written application.\nSuch approval may be granted without a public hearing, in the discretion\nof the Board of Trustees. For the purposes of this section, any change\nin topography in excess of one foot in height or elevation shall be\nconsidered a substantial change."
				}
			]
		},
		{
			"paragraph": "§ 146-9.3",
			"title": "Retaining walls.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Any wall in excess of 18 inches in height constructed or erected\nfor the purpose of retaining or supporting adjoining earth or rock\nshall be considered to be a retaining wall."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "When the difference between the grades on either side of a wall exceeds\n18 inches, it shall be presumed that the wall is retaining or supporting\nthe earth or rock on the higher grade, and such wall shall be considered\nto be a retaining wall."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "No retaining wall may be constructed, erected, or altered without\na building permit."
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "All retaining walls shall be constructed of approved masonry, reinforced\nconcrete, or timber, in accordance with plans approved by the Building\nOfficial."
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "No retaining wall may exceed five feet in height."
								}
							]
						},
						{
							"number": "F. ",
							"content": [
								{
									"text": "No retaining wall may be located within three feet of a property\nboundary."
								}
							]
						},
						{
							"number": "G. ",
							"content": [
								{
									"text": "No retaining wall may be located within four feet of any other retaining\nwall."
								}
							]
						},
						{
							"number": "H. ",
							"content": [
								{
									"text": "All retaining walls and surrounding areas of the property shall be\ndesigned such that all surface and subsurface drainage water from\nsuch retaining walls shall be collected and disposed of on the property\non which the retaining wall is located, in accordance with a plan\nof water collection and disposal system approved by the Building Inspector\nand the Village Engineer."
								}
							]
						},
						{
							"number": "I. ",
							"content": [
								{
									"text": "The owner and occupant of property on which a retaining wall is located\nshall maintain such retaining wall, and any surface or subsurface\nwater collection and disposal system, in good working order and in\naccordance with the approved plans therefor."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 146-10",
			"title": "Air conditioning.",
			"content": [
				{
					"text": "The construction or alteration of a central air-conditioning\nunit which is designed and intended to provide central air conditioning\nfor one or more buildings on the lot and located outside of a building\nis hereby deemed to be an alteration requiring the filing of an application\nfor a building permit. Such application shall contain a statement\nof the full name and residence of each of the persons having an interest\nas owner, tenant or otherwise and of the use to which the building\nis to be put and such other information as the Board of Trustees may\nrequire. Air-conditioning fixtures and units which are designed and\nintended to provide central air conditioning for one or more buildings\non the lot and located outside of a building shall not be less than\n30 feet from the side property line nor 35 feet from the rear lot\nline. Said application shall be accompanied by such plans and drawings\nand such a diagram of the lot showing the exact location of the existing\nand proposed buildings. The application will be filed with the Village\nClerk, together with a fee established by the Board of Trustees.[1]"
				},
				{
					"footnote": "[1]:\nEditor's Note: For a schedule of fees, see Ch. A149.\n"
				}
			]
		},
		{
			"paragraph": "§ 146-11",
			"title": "Height of buildings or structures.",
			"content": [
				{
					"text": "No building or structure shall have a height greater than 2\n1/2 stories or 35 feet, whichever is less."
				}
			]
		},
		{
			"paragraph": "§ 146-12",
			"title": "Height/setback ratios.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Front\nheight/setback ratio. The maximum permitted front height/setback ratio\nis 0.55."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Side height/setback\nratio. The maximum permitted side height/setback ratio is 0.85."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Rear height/setback\nratio. The maximum permitted rear height/setback ratio is 0.80."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 146-13",
			"title": "Building area.",
			"content": [
				{
					"text": "The building area shall not exceed 25% of the lot area."
				}
			]
		},
		{
			"paragraph": "§ 146-13.1",
			"title": "Lot coverage limitations.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Not more than 30% of the total surface area of a front yard may be\ncovered by impervious surface(s), and not more than 30% of the total\narea of all front yards of a lot may be covered by impervious surface(s)."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Not more than 30% of the area of a lot may be covered by impervious\nsurface(s)."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 146-14",
			"title": "Livable floor area.",
			"content": [
				{
					"text": "\"Livable floor area\" means the total floor area used, designed\nand available to be used for living accommodations on all stories\nof the principal building, excluding basement, rooms for heating equipment,\nopen porches, breezeways, unheated areas and garage, but including\nany living space over such garage. In rooms with sloped ceilings,\nonly those areas where headroom is greater than five feet may be included,\nprovided that at least 50% of this total area has a minimum ceiling\nheight of seven feet six inches. Walls and partitions may be included."
				}
			]
		},
		{
			"paragraph": "§ 146-15",
			"title": "Floor area requirements.",
			"content": [
				{
					"text": "No dwelling shall hereafter be erected in any residence district\nunless it complies with the following livable floor area requirements:"
				},
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Minimum total livable floor area: 2,625 square feet, unless all of\nthe livable floor area is on the ground or first story, in which case\nthe total livable floor area shall not be less than 3,000 square feet."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Minimum livable first-floor area in other than one-story buildings:\n1,750 square feet."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Minimum livable floor area in each level above the first floor in\nother than one-story buildings: 875 square feet or 40% of the livable\nfloor area of the story immediately below it, whichever is greater."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 146-16",
			"title": "Applicability.",
			"content": [
				{
					"text": "In the A Residence District, the following regulations shall apply in addition to those mentioned in Article IV hereof."
				}
			]
		},
		{
			"paragraph": "§ 146-17",
			"title": "Front yard.",
			"content": [
				{
					"text": "There shall be a front yard, the depth of which shall for its\nentire width be at least 50 feet from the street line. In the case\nof a corner lot, a front yard shall be on each street on which the\nlot abuts. The interior angle formed by the intersection of the lot\nline with the street line shall not be less than 75° for the entire\ndistance from the street line to the front setback line or lines."
				}
			]
		},
		{
			"paragraph": "§ 146-18",
			"title": "Side yards.",
			"content": [
				{
					"text": "There shall be two side yards, one on each side of the main\nbuilding. Neither side yard shall for its entire depth be less than\n30 feet wide."
				}
			]
		},
		{
			"paragraph": "§ 146-19",
			"title": "Rear yard.",
			"content": [
				{
					"text": "There shall be a rear yard, the depth of which shall for its\nentire width be at least 35 feet."
				}
			]
		},
		{
			"paragraph": "§ 146-20",
			"title": "Accessory buildings.",
			"content": [
				{
					"text": "The area occupied by accessory buildings shall be included in\ncomputing the maximum percentage of lot area which may be built upon.\nNo part of an accessory building shall occupy the front yard, nor\nshall any part of such accessory building occupy such part of a side\nor rear yard as may not be occupied by the main building under this\nchapter."
				},
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "A private boathouse, private dock or private wharf used as an accessory\nbuilding may occupy a side yard or rear yard of any lot, a boundary\nof which is along or under a pond or waterway, but such boathouse,\ndock or wharf shall be located along not more than 20% of such waterfront."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "A dock may be constructed adjacent to and abutting the waterline\nof any waterfront property which has a frontage on the water of not\nless than 100 feet. Such waterfront parcel must be accessory to any\nimproved residential property under the same ownership and located\nwithin the Village. A dock located on any parcel described herein\nshall be used exclusively by the owner of the dwelling to which it\nis accessory. The frontage requirements of this subsection as it affects\nwaterfront lots shall not apply to any such lot having less than 100\nfeet of frontage on the water where said lot appears on the Official\nMap of the Village of Hewlett Bay Park as of March 14, 1977."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 146-21",
			"title": "Boats and trailers.",
			"content": [
				{
					"text": "No trailer of any kind and no boat of any kind shall be stored\nin any required front, side or rear yard or on any other property\nin the Village, except that:"
				},
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "A boat that is afloat may be moored at a legally permitted dock,\nbulkhead, pier or other mooring facility."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "A trailer or a boat may be stored when wholly enclosed within a building\nwhich complies in all respects with the laws and regulations of the\nVillage."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 146-21.1",
			"title": "Parking of commercial vehicles.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Definition. For the purposes of this section, a \"commercial vehicle\"\nshall be:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "A mobile home, whether or not such vehicle is supported on wheels;"
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Any vehicle which, by reason of the attachment of advertising\nor commercial messages and/or storage of service equipment or other\ncommercial merchandise or hardware, presents the outward appearance\nof a vehicle which is utilized primarily in furtherance of commercial\nor industrial enterprise; or"
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Except for vehicles used for an active construction project\nin connection with the same premises, any vehicle which is not registered\nwith the appropriate state agency or department or which does not\nhave a distinct registration number plate conspicuously displayed\non such vehicle, and which remains parked or stored on any premises\nin the Village for a period of more than seven consecutive calendar\ndays."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "No commercial vehicle shall be parked, stored or otherwise located\noutdoors on any residential premises in the Village at any time between\nthe hours of 9:00 p.m. and 9:00 a.m. the following day for a period\nof three consecutive days; provided, however, that nothing herein\ncontained shall be construed to prohibit the temporary stopping, standing\nor parking of a commercial vehicle during the act of making local\ndeliveries, loading or unloading merchandise, or rendering a commercial\nservice or duty, undertaken by the operator of such vehicle, at the\npremises upon which such vehicle is stopped, standing or parked."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 146-22",
			"title": "Required lot size.",
			"content": [
				{
					"text": "No building, with all accessory buildings, shall occupy a lot\nof less than 43,560 square feet area, nor shall there be more than\none such building, with all accessory buildings, for each 43,560 square\nfeet. Such lot shall have street frontage of not less than 100 feet\nand shall have a width at the front yard setback line of not less\nthan 150 feet, except that in the case of a corner lot, such lot shall\nhave a street frontage of not less than 150 feet on one street upon\nwhich the said lot abuts and not less than 100 feet on any other street\nupon which the said lot abuts. Said lot shall have a width at the\nfront yard setback line of not less than 150 feet. In the event such\nlot abuts upon a waterway, such lot shall have a frontage upon such\nwaterway of not less than 100 feet."
				}
			]
		},
		{
			"paragraph": "§ 146-23",
			"title": "Legal nonconforming lots.",
			"content": [
				{
					"text": "Any lot which existed on January 1, 1990, and which was on said date and at all subsequent times in different ownership than all adjoining lots, and the area or dimensions of which failed on such date to conform to one or more of the requirements of § 146-22 of this Code, may be used for a purpose permitted in the A Residence District, and a building or structure may be erected or maintained thereon, notwithstanding such insufficient area or dimensions, provided that such use and any such building or structure on such lot shall otherwise conform to the requirements of this chapter."
				}
			]
		}
	]	
}	