{
  "url": "http://ecode360.com/11008719",
  "paras": [
    {
      "paragraph": "§ 161-7",
      "title": "Applicability.",
      "content": [
        {
          "text": "In an A2 Residence District, the following regulations\nshall apply."
        },
        {
          "text": "A building may be erected, altered or used and\na lot or premises may be used for any of the following purposes and\nfor no other:"
        },
        {
          "content": [
            {
              "number": "A. ",
              "content": [
                {
                  "text": "One single-family detached dwelling.[Amended 6-20-1989 by L.L. No. 11-1989]"
                }
              ]
            },
            {
              "number": "B. ",
              "content": [
                {
                  "text": "Nonprofit elementary or secondary schools having a\ncurriculum approved by the New York State Education Department or\nNew York State Board of Regents and houses of worship and facilities\ncustomarily operated in connection therewith, when approved and permitted\nas a special exception by the Board of Trustees, upon proper application\ntherefor and after a public hearing on published notice and in accordance\nwith the provisions set forth. As used in this subsection, the term\n\"elementary school\" shall include grades prekindergarten through eighth\nand the term \"secondary school\" shall include grades ninth through\n12th.[Amended 10-17-1968; 10-23-1984 by L.L. No. 4-1984; 6-17-1986 by L.L. No. 2-1986; 8-1-1989 by L.L. No. 13-1989]"
                },
                {
                  "content": [
                    {
                      "number": "(1) ",
                      "content": [
                        {
                          "text": "The application shall show and be accompanied by appropriate\ndocuments and plans sufficient to indicate the size, location and\nuse of all buildings, facilities and open areas, including the provisions\nto be made for screening, traffic flow, fencing, parking and lighting."
                        }
                      ]
                    },
                    {
                      "number": "(2) ",
                      "content": [
                        {
                          "text": "The Board of Trustees shall approve said application\nsubject to the restrictions set forth below and upon a finding that\nthe proposed plan and improvements will not endanger the public health,\nsafety and general welfare, will provide adequate and sufficient setbacks,\nscreening, fencing, off-street parking, safe traffic flow and adequate\nand sufficient safeguards to protect and secure the use and enjoyment\nof neighboring properties and the general area in which the subject\npremises are located, without unreasonable interference."
                        }
                      ]
                    },
                    {
                      "number": "(3) ",
                      "content": [
                        {
                          "text": "Said restrictions are as follows:"
                        },
                        {
                          "content": [
                            {
                              "number": "(a) ",
                              "content": [
                                {
                                  "text": "The lot shall not be less than five acres in\narea, provided that in the case of an elementary school, the lot shall\ncontain a usable area of not less than five acres, plus one acre for\neach 100 students or fraction thereof enrolled in excess of 200, and\nin the case of a secondary school, the lot shall contain a usable\narea of not less than 10 acres, plus one acre for each 100 pupils\nenrolled. For purposes of this subsection, the term \"usable area\"\nis defined to exclude tidal and freshwater wetlands and their adjacent\nareas, floodplains, slopes equal to or greater than 20% or any other\ntopographic features which the Board of Trustees may find to be hazardous\nin view of the intended use of the lot."
                                }
                              ]
                            },
                            {
                              "number": "(b) ",
                              "content": [
                                {
                                  "text": "The front yard setback shall not be less than\n100 feet."
                                }
                              ]
                            },
                            {
                              "number": "(c) ",
                              "content": [
                                {
                                  "text": "The side yard setback shall not be less than\n75 feet."
                                }
                              ]
                            },
                            {
                              "number": "(d) ",
                              "content": [
                                {
                                  "text": "The rear yard setback shall not be less than\n75 feet."
                                }
                              ]
                            },
                            {
                              "number": "(e) ",
                              "content": [
                                {
                                  "text": "Except for access driveways, the existing topography\nvegetation within 50 feet of the outer perimeter of all required yards\nshall be maintained and supplemented as deemed necessary by the Board\nof Trustees to provide an effective screening buffer for adjoining\nproperties and streets."
                                }
                              ]
                            },
                            {
                              "number": "(f) ",
                              "content": [
                                {
                                  "text": "No areas, such as playgrounds, intended for\nactivities that customarily generate high levels of noise shall be\nlocated in any required yard."
                                }
                              ]
                            },
                            {
                              "number": "(g) ",
                              "content": [
                                {
                                  "text": "On-premises parking shall be provided as follows:"
                                },
                                {
                                  "content": [
                                    {
                                      "number": "[1] ",
                                      "content": [
                                        {
                                          "text": "Elementary schools: one parking space for each\nstaff person and one parking space for every 20 pupils or fraction\nthereof."
                                        }
                                      ]
                                    },
                                    {
                                      "number": "[2] ",
                                      "content": [
                                        {
                                          "text": "Secondary schools: one parking space for each\nstaff person, one parking space for every 20 pupils (or fraction thereof)\nin the ninth and 10th grades and one parking space for every 10 pupils\n(or fraction thereof) in the 11th and 12th grades."
                                        }
                                      ]
                                    },
                                    {
                                      "number": "[3] ",
                                      "content": [
                                        {
                                          "text": "All other uses permitted under this subsection:\none parking space for every two persons who can be legally accommodated\nat the premises."
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            },
                            {
                              "number": "(h) ",
                              "content": [
                                {
                                  "text": "An adequate on-premises loading and unloading\narea for buses shall be provided on school sites."
                                }
                              ]
                            },
                            {
                              "number": "(i) ",
                              "content": [
                                {
                                  "text": "All buildings shall comply with the height and\npercentage of lot coverage restrictions generally applicable to buildings\nin this district."
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "number": "(4) ",
                      "content": [
                        {
                          "text": "The conditions and requirements imposed shall in all\ncases include limitations on the number of persons who may safely\noccupy the premises and any part or parts thereof at one time, ways\nand means of reducing noise and disturbance in the neighborhood, including\nlimitation of hours and days during which social or nonreligious and/or\nnoneducation functions may be conducted, and use of such structural\nmaterials and procedures and implements, equipment and appliances\nas shall be necessary or appropriate to safeguard against fire, health\nand safety hazards and panic and shall prescribe the height, location\nand type of fencing."
                        }
                      ]
                    },
                    {
                      "number": "(5) ",
                      "content": [
                        {
                          "text": "The Board of Trustees, in approving said application,\nmay impose such additional conditions and restrictions as it deems\nproper in the particular circumstances to assure the safeguards hereinabove\ndescribed."
                        }
                      ]
                    },
                    {
                      "number": "(6) ",
                      "content": [
                        {
                          "text": "Every application for a special exception use shall\nbe submitted in writing on a form provided by the Village and shall\nbe accompanied by an application fee as established from time to time\nby resolution of the Board of Trustees.[1][Added 6-21-1994 by L.L. No. 9-1994;\namended 11-27-2007 by L.L. No. 8-2007]"
                        },
                        {
                          "footnote": "[1]\nEditor's Note: See Ch. A162, Fees.\n"
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "number": "C. ",
              "content": [
                {
                  "text": "Greenhouses.[Amended 9-25-2003 by L.L. No. 11-2003]"
                }
              ]
            },
            {
              "number": "D. ",
              "content": [
                {
                  "text": "Accessory uses on the same lot with and customarily\nincidental to any of the above-permitted uses, including a private\ngarage."
                }
              ]
            },
            {
              "number": "E. ",
              "content": [
                {
                  "text": "A gatehouse on a private road that serves a private community of\nnot less than 75 acres in gross area, when approved and permitted\nas a special exception by the Board of Trustees upon proper application\ntherefor and after a public hearing on published notice and in accordance\nwith the provisions set forth.[Added 12-8-2014 by L.L. No. 6-2014]"
                },
                {
                  "content": [
                    {
                      "number": "(1) ",
                      "content": [
                        {
                          "text": "The application shall show and be accompanied by appropriate documents\nand plans sufficient to indicate the size and location of the gatehouse,\ngates, stacking area, turnaround lanes, and include the provisions\nto be made for traffic stacking and flow, emergency ingress, screening,\nand lighting."
                        }
                      ]
                    },
                    {
                      "number": "(2) ",
                      "content": [
                        {
                          "text": "The Board of Trustees shall approve said application subject to the\nrestrictions set forth below and upon a finding that the proposed\nplan will provide adequate and sufficient traffic stacking and flow,\nemergency ingress, screening, and lighting, and such other sufficient\nsafeguards as it deems appropriate, so as not to endanger the public\nhealth, safety, and general welfare."
                        }
                      ]
                    },
                    {
                      "number": "(3) ",
                      "content": [
                        {
                          "text": "Said restrictions are as follows:"
                        },
                        {
                          "content": [
                            {
                              "number": "(a) ",
                              "content": [
                                {
                                  "text": "The gatehouse shall be on a private road that serves a private\ncommunity of not less than 75 acres in gross area."
                                }
                              ]
                            },
                            {
                              "number": "(b) ",
                              "content": [
                                {
                                  "text": "The gatehouse shall not exceed:"
                                },
                                {
                                  "content": [
                                    {
                                      "number": "[1] ",
                                      "content": [
                                        {
                                          "text": "A height of 19 feet."
                                        }
                                      ]
                                    },
                                    {
                                      "number": "[2] ",
                                      "content": [
                                        {
                                          "text": "A building area of 160 square feet."
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            },
                            {
                              "number": "(c) ",
                              "content": [
                                {
                                  "text": "The setback from the public road shall be not less than 170\nfeet."
                                }
                              ]
                            },
                            {
                              "number": "(d) ",
                              "content": [
                                {
                                  "text": "There shall be not less than two lanes of access."
                                }
                              ]
                            },
                            {
                              "number": "(e) ",
                              "content": [
                                {
                                  "text": "There shall be a turnaround area behind the gatehouse before\nthe gates providing entry to the community."
                                }
                              ]
                            },
                            {
                              "number": "(f) ",
                              "content": [
                                {
                                  "text": "The limitations in § 161-35 with regard to driveway gates shall not apply to gates in conjunction with gatehouses approved by the Board of Trustees pursuant to this Subsection E."
                                }
                              ]
                            },
                            {
                              "number": "(g) ",
                              "content": [
                                {
                                  "text": "There shall be devices and procedures to provide immediate access\nby emergency vehicles, police, and employees and officers of the Village\nto bypass stacked traffic and pass by or through the entrance gates\nso that they may expeditiously perform their duties."
                                }
                              ]
                            },
                            {
                              "number": "(h) ",
                              "content": [
                                {
                                  "text": "There shall be compliance with all grading, sanitation, drainage,\nand other land development requirements of the Village for buildings."
                                }
                              ]
                            },
                            {
                              "number": "(i) ",
                              "content": [
                                {
                                  "text": "The building, landscaping, and lighting shall be subject to\nthe review and approval of the Village's Architectural and Preliminary\nSite Review Board.[Amended 11-20-2017 by L.L. No. 6-2017]"
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "number": "(4) ",
                      "content": [
                        {
                          "text": "The Board of Trustees, in approving said application, may impose\nsuch additional conditions and restrictions as it deems appropriate\nin the particular circumstances to assure the safeguards hereinabove\ndescribed."
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "footnote": "[1]\nEditor's Note: Former § 161-9, Building\narea, was repealed 8-19-1996 by L.L. No. 1-1996.\n"
        },
        {
          "content": [
            {
              "number": "A. ",
              "content": [
                {
                  "text": "All front yards shall have a minimum depth of at least\n60 feet. In addition, for each 125.0 square feet of floor area in\nexcess of 8,000 square feet, the aforesaid minimum depth of the front\nyard shall be increased by one foot.[Amended 8-19-1996 by L.L. No. 1-1996]"
                }
              ]
            },
            {
              "number": "B. ",
              "content": [
                {
                  "text": "In the case of a single-family dwelling, all side\nyards shall have a width of at least 28 feet, and, if there are two\nside yards, the aggregate width of such side yards shall be at least\n65 feet.[Amended 10-25-1995 by L.L. No. 2-1995]"
                }
              ]
            },
            {
              "number": "C. ",
              "content": [
                {
                  "text": "In the case of a lot with one rear yard, the rear\nyard shall have a depth of at least 40 feet. In the case of a lot\nwith two rear yards, one rear yard shall have a depth of at least\n40 feet and the other rear yard shall have a depth of at least 28\nfeet."
                }
              ]
            }
          ]
        },
        {
          "text": "Unless it is subject to the provisions of § 161-8B of this article, each lot shall meet or exceed the following minimum requirements:"
        },
        {
          "content": [
            {
              "number": "A. ",
              "content": [
                {
                  "text": "Lot area: 40,000 square feet."
                }
              ]
            },
            {
              "number": "B. ",
              "content": [
                {
                  "text": "Frontage on a public street or on a street shown on\na subdivision map approved by the Planning Board of the Village of\nKings Point: 150 feet on one street for interior lots and 175 feet\non each street for corner lots."
                }
              ]
            },
            {
              "number": "C. ",
              "content": [
                {
                  "text": "Lot width: 150 feet for the first 200 feet of lot\ndepth for an interior lot and 175 feet for a distance of 175 feet\nfrom each street for a corner lot."
                }
              ]
            }
          ]
        },
        {
          "text": "Except as may be expressly authorized by the Board of Trustees upon the grant of a special exception permit pursuant to § 161-8B of this article, the use of a lot or premises in the A2 Residence District for the parking or storage of a commercial vehicle is prohibited. As used in this section, the term \"commercial vehicle\" shall include every type of motor vehicle used for commercial purposes on the highways, such as the transportation of goods, wares and merchandise and a motor coach carrying passengers, and every type of motor vehicle which bears commercial registration plates."
        },
        {
          "footnote": "[1]\nEditor's Note: Former § 161-13, Signs, added 6-18-1985 by L.L. No. 2-1985, was repealed 11-29-2006 by L.L. No. 7-2006. See now § 161-34.1, Signs and certain lighting.\n"
        }
      ]
    },
    {
      "paragraph": "§ 161-8",
      "title": "Permitted uses.",
      "content": [
        {
          "text": "A building may be erected, altered or used and\na lot or premises may be used for any of the following purposes and\nfor no other:"
        },
        {
          "content": [
            {
              "number": "A. ",
              "content": [
                {
                  "text": "One single-family detached dwelling.[Amended 6-20-1989 by L.L. No. 11-1989]"
                }
              ]
            },
            {
              "number": "B. ",
              "content": [
                {
                  "text": "Nonprofit elementary or secondary schools having a\ncurriculum approved by the New York State Education Department or\nNew York State Board of Regents and houses of worship and facilities\ncustomarily operated in connection therewith, when approved and permitted\nas a special exception by the Board of Trustees, upon proper application\ntherefor and after a public hearing on published notice and in accordance\nwith the provisions set forth. As used in this subsection, the term\n\"elementary school\" shall include grades prekindergarten through eighth\nand the term \"secondary school\" shall include grades ninth through\n12th.[Amended 10-17-1968; 10-23-1984 by L.L. No. 4-1984; 6-17-1986 by L.L. No. 2-1986; 8-1-1989 by L.L. No. 13-1989]"
                },
                {
                  "content": [
                    {
                      "number": "(1) ",
                      "content": [
                        {
                          "text": "The application shall show and be accompanied by appropriate\ndocuments and plans sufficient to indicate the size, location and\nuse of all buildings, facilities and open areas, including the provisions\nto be made for screening, traffic flow, fencing, parking and lighting."
                        }
                      ]
                    },
                    {
                      "number": "(2) ",
                      "content": [
                        {
                          "text": "The Board of Trustees shall approve said application\nsubject to the restrictions set forth below and upon a finding that\nthe proposed plan and improvements will not endanger the public health,\nsafety and general welfare, will provide adequate and sufficient setbacks,\nscreening, fencing, off-street parking, safe traffic flow and adequate\nand sufficient safeguards to protect and secure the use and enjoyment\nof neighboring properties and the general area in which the subject\npremises are located, without unreasonable interference."
                        }
                      ]
                    },
                    {
                      "number": "(3) ",
                      "content": [
                        {
                          "text": "Said restrictions are as follows:"
                        },
                        {
                          "content": [
                            {
                              "number": "(a) ",
                              "content": [
                                {
                                  "text": "The lot shall not be less than five acres in\narea, provided that in the case of an elementary school, the lot shall\ncontain a usable area of not less than five acres, plus one acre for\neach 100 students or fraction thereof enrolled in excess of 200, and\nin the case of a secondary school, the lot shall contain a usable\narea of not less than 10 acres, plus one acre for each 100 pupils\nenrolled. For purposes of this subsection, the term \"usable area\"\nis defined to exclude tidal and freshwater wetlands and their adjacent\nareas, floodplains, slopes equal to or greater than 20% or any other\ntopographic features which the Board of Trustees may find to be hazardous\nin view of the intended use of the lot."
                                }
                              ]
                            },
                            {
                              "number": "(b) ",
                              "content": [
                                {
                                  "text": "The front yard setback shall not be less than\n100 feet."
                                }
                              ]
                            },
                            {
                              "number": "(c) ",
                              "content": [
                                {
                                  "text": "The side yard setback shall not be less than\n75 feet."
                                }
                              ]
                            },
                            {
                              "number": "(d) ",
                              "content": [
                                {
                                  "text": "The rear yard setback shall not be less than\n75 feet."
                                }
                              ]
                            },
                            {
                              "number": "(e) ",
                              "content": [
                                {
                                  "text": "Except for access driveways, the existing topography\nvegetation within 50 feet of the outer perimeter of all required yards\nshall be maintained and supplemented as deemed necessary by the Board\nof Trustees to provide an effective screening buffer for adjoining\nproperties and streets."
                                }
                              ]
                            },
                            {
                              "number": "(f) ",
                              "content": [
                                {
                                  "text": "No areas, such as playgrounds, intended for\nactivities that customarily generate high levels of noise shall be\nlocated in any required yard."
                                }
                              ]
                            },
                            {
                              "number": "(g) ",
                              "content": [
                                {
                                  "text": "On-premises parking shall be provided as follows:"
                                },
                                {
                                  "content": [
                                    {
                                      "number": "[1] ",
                                      "content": [
                                        {
                                          "text": "Elementary schools: one parking space for each\nstaff person and one parking space for every 20 pupils or fraction\nthereof."
                                        }
                                      ]
                                    },
                                    {
                                      "number": "[2] ",
                                      "content": [
                                        {
                                          "text": "Secondary schools: one parking space for each\nstaff person, one parking space for every 20 pupils (or fraction thereof)\nin the ninth and 10th grades and one parking space for every 10 pupils\n(or fraction thereof) in the 11th and 12th grades."
                                        }
                                      ]
                                    },
                                    {
                                      "number": "[3] ",
                                      "content": [
                                        {
                                          "text": "All other uses permitted under this subsection:\none parking space for every two persons who can be legally accommodated\nat the premises."
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            },
                            {
                              "number": "(h) ",
                              "content": [
                                {
                                  "text": "An adequate on-premises loading and unloading\narea for buses shall be provided on school sites."
                                }
                              ]
                            },
                            {
                              "number": "(i) ",
                              "content": [
                                {
                                  "text": "All buildings shall comply with the height and\npercentage of lot coverage restrictions generally applicable to buildings\nin this district."
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "number": "(4) ",
                      "content": [
                        {
                          "text": "The conditions and requirements imposed shall in all\ncases include limitations on the number of persons who may safely\noccupy the premises and any part or parts thereof at one time, ways\nand means of reducing noise and disturbance in the neighborhood, including\nlimitation of hours and days during which social or nonreligious and/or\nnoneducation functions may be conducted, and use of such structural\nmaterials and procedures and implements, equipment and appliances\nas shall be necessary or appropriate to safeguard against fire, health\nand safety hazards and panic and shall prescribe the height, location\nand type of fencing."
                        }
                      ]
                    },
                    {
                      "number": "(5) ",
                      "content": [
                        {
                          "text": "The Board of Trustees, in approving said application,\nmay impose such additional conditions and restrictions as it deems\nproper in the particular circumstances to assure the safeguards hereinabove\ndescribed."
                        }
                      ]
                    },
                    {
                      "number": "(6) ",
                      "content": [
                        {
                          "text": "Every application for a special exception use shall\nbe submitted in writing on a form provided by the Village and shall\nbe accompanied by an application fee as established from time to time\nby resolution of the Board of Trustees.[1][Added 6-21-1994 by L.L. No. 9-1994;\namended 11-27-2007 by L.L. No. 8-2007]"
                        },
                        {
                          "footnote": "[1]\nEditor's Note: See Ch. A162, Fees.\n"
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "number": "C. ",
              "content": [
                {
                  "text": "Greenhouses.[Amended 9-25-2003 by L.L. No. 11-2003]"
                }
              ]
            },
            {
              "number": "D. ",
              "content": [
                {
                  "text": "Accessory uses on the same lot with and customarily\nincidental to any of the above-permitted uses, including a private\ngarage."
                }
              ]
            },
            {
              "number": "E. ",
              "content": [
                {
                  "text": "A gatehouse on a private road that serves a private community of\nnot less than 75 acres in gross area, when approved and permitted\nas a special exception by the Board of Trustees upon proper application\ntherefor and after a public hearing on published notice and in accordance\nwith the provisions set forth.[Added 12-8-2014 by L.L. No. 6-2014]"
                },
                {
                  "content": [
                    {
                      "number": "(1) ",
                      "content": [
                        {
                          "text": "The application shall show and be accompanied by appropriate documents\nand plans sufficient to indicate the size and location of the gatehouse,\ngates, stacking area, turnaround lanes, and include the provisions\nto be made for traffic stacking and flow, emergency ingress, screening,\nand lighting."
                        }
                      ]
                    },
                    {
                      "number": "(2) ",
                      "content": [
                        {
                          "text": "The Board of Trustees shall approve said application subject to the\nrestrictions set forth below and upon a finding that the proposed\nplan will provide adequate and sufficient traffic stacking and flow,\nemergency ingress, screening, and lighting, and such other sufficient\nsafeguards as it deems appropriate, so as not to endanger the public\nhealth, safety, and general welfare."
                        }
                      ]
                    },
                    {
                      "number": "(3) ",
                      "content": [
                        {
                          "text": "Said restrictions are as follows:"
                        },
                        {
                          "content": [
                            {
                              "number": "(a) ",
                              "content": [
                                {
                                  "text": "The gatehouse shall be on a private road that serves a private\ncommunity of not less than 75 acres in gross area."
                                }
                              ]
                            },
                            {
                              "number": "(b) ",
                              "content": [
                                {
                                  "text": "The gatehouse shall not exceed:"
                                },
                                {
                                  "content": [
                                    {
                                      "number": "[1] ",
                                      "content": [
                                        {
                                          "text": "A height of 19 feet."
                                        }
                                      ]
                                    },
                                    {
                                      "number": "[2] ",
                                      "content": [
                                        {
                                          "text": "A building area of 160 square feet."
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            },
                            {
                              "number": "(c) ",
                              "content": [
                                {
                                  "text": "The setback from the public road shall be not less than 170\nfeet."
                                }
                              ]
                            },
                            {
                              "number": "(d) ",
                              "content": [
                                {
                                  "text": "There shall be not less than two lanes of access."
                                }
                              ]
                            },
                            {
                              "number": "(e) ",
                              "content": [
                                {
                                  "text": "There shall be a turnaround area behind the gatehouse before\nthe gates providing entry to the community."
                                }
                              ]
                            },
                            {
                              "number": "(f) ",
                              "content": [
                                {
                                  "text": "The limitations in § 161-35 with regard to driveway gates shall not apply to gates in conjunction with gatehouses approved by the Board of Trustees pursuant to this Subsection E."
                                }
                              ]
                            },
                            {
                              "number": "(g) ",
                              "content": [
                                {
                                  "text": "There shall be devices and procedures to provide immediate access\nby emergency vehicles, police, and employees and officers of the Village\nto bypass stacked traffic and pass by or through the entrance gates\nso that they may expeditiously perform their duties."
                                }
                              ]
                            },
                            {
                              "number": "(h) ",
                              "content": [
                                {
                                  "text": "There shall be compliance with all grading, sanitation, drainage,\nand other land development requirements of the Village for buildings."
                                }
                              ]
                            },
                            {
                              "number": "(i) ",
                              "content": [
                                {
                                  "text": "The building, landscaping, and lighting shall be subject to\nthe review and approval of the Village's Architectural and Preliminary\nSite Review Board.[Amended 11-20-2017 by L.L. No. 6-2017]"
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "number": "(4) ",
                      "content": [
                        {
                          "text": "The Board of Trustees, in approving said application, may impose\nsuch additional conditions and restrictions as it deems appropriate\nin the particular circumstances to assure the safeguards hereinabove\ndescribed."
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "footnote": "[1]\nEditor's Note: Former § 161-9, Building\narea, was repealed 8-19-1996 by L.L. No. 1-1996.\n"
        },
        {
          "content": [
            {
              "number": "A. ",
              "content": [
                {
                  "text": "All front yards shall have a minimum depth of at least\n60 feet. In addition, for each 125.0 square feet of floor area in\nexcess of 8,000 square feet, the aforesaid minimum depth of the front\nyard shall be increased by one foot.[Amended 8-19-1996 by L.L. No. 1-1996]"
                }
              ]
            },
            {
              "number": "B. ",
              "content": [
                {
                  "text": "In the case of a single-family dwelling, all side\nyards shall have a width of at least 28 feet, and, if there are two\nside yards, the aggregate width of such side yards shall be at least\n65 feet.[Amended 10-25-1995 by L.L. No. 2-1995]"
                }
              ]
            },
            {
              "number": "C. ",
              "content": [
                {
                  "text": "In the case of a lot with one rear yard, the rear\nyard shall have a depth of at least 40 feet. In the case of a lot\nwith two rear yards, one rear yard shall have a depth of at least\n40 feet and the other rear yard shall have a depth of at least 28\nfeet."
                }
              ]
            }
          ]
        },
        {
          "text": "Unless it is subject to the provisions of § 161-8B of this article, each lot shall meet or exceed the following minimum requirements:"
        },
        {
          "content": [
            {
              "number": "A. ",
              "content": [
                {
                  "text": "Lot area: 40,000 square feet."
                }
              ]
            },
            {
              "number": "B. ",
              "content": [
                {
                  "text": "Frontage on a public street or on a street shown on\na subdivision map approved by the Planning Board of the Village of\nKings Point: 150 feet on one street for interior lots and 175 feet\non each street for corner lots."
                }
              ]
            },
            {
              "number": "C. ",
              "content": [
                {
                  "text": "Lot width: 150 feet for the first 200 feet of lot\ndepth for an interior lot and 175 feet for a distance of 175 feet\nfrom each street for a corner lot."
                }
              ]
            }
          ]
        },
        {
          "text": "Except as may be expressly authorized by the Board of Trustees upon the grant of a special exception permit pursuant to § 161-8B of this article, the use of a lot or premises in the A2 Residence District for the parking or storage of a commercial vehicle is prohibited. As used in this section, the term \"commercial vehicle\" shall include every type of motor vehicle used for commercial purposes on the highways, such as the transportation of goods, wares and merchandise and a motor coach carrying passengers, and every type of motor vehicle which bears commercial registration plates."
        },
        {
          "footnote": "[1]\nEditor's Note: Former § 161-13, Signs, added 6-18-1985 by L.L. No. 2-1985, was repealed 11-29-2006 by L.L. No. 7-2006. See now § 161-34.1, Signs and certain lighting.\n"
        }
      ]
    },
    {
      "paragraph": "§ 161-9",
      "title": "(Reserved)        \n          [1]",
      "content": [
        {
          "footnote": "[1]\nEditor's Note: Former § 161-9, Building\narea, was repealed 8-19-1996 by L.L. No. 1-1996.\n"
        },
        {
          "content": [
            {
              "number": "A. ",
              "content": [
                {
                  "text": "All front yards shall have a minimum depth of at least\n60 feet. In addition, for each 125.0 square feet of floor area in\nexcess of 8,000 square feet, the aforesaid minimum depth of the front\nyard shall be increased by one foot.[Amended 8-19-1996 by L.L. No. 1-1996]"
                }
              ]
            },
            {
              "number": "B. ",
              "content": [
                {
                  "text": "In the case of a single-family dwelling, all side\nyards shall have a width of at least 28 feet, and, if there are two\nside yards, the aggregate width of such side yards shall be at least\n65 feet.[Amended 10-25-1995 by L.L. No. 2-1995]"
                }
              ]
            },
            {
              "number": "C. ",
              "content": [
                {
                  "text": "In the case of a lot with one rear yard, the rear\nyard shall have a depth of at least 40 feet. In the case of a lot\nwith two rear yards, one rear yard shall have a depth of at least\n40 feet and the other rear yard shall have a depth of at least 28\nfeet."
                }
              ]
            }
          ]
        },
        {
          "text": "Unless it is subject to the provisions of § 161-8B of this article, each lot shall meet or exceed the following minimum requirements:"
        },
        {
          "content": [
            {
              "number": "A. ",
              "content": [
                {
                  "text": "Lot area: 40,000 square feet."
                }
              ]
            },
            {
              "number": "B. ",
              "content": [
                {
                  "text": "Frontage on a public street or on a street shown on\na subdivision map approved by the Planning Board of the Village of\nKings Point: 150 feet on one street for interior lots and 175 feet\non each street for corner lots."
                }
              ]
            },
            {
              "number": "C. ",
              "content": [
                {
                  "text": "Lot width: 150 feet for the first 200 feet of lot\ndepth for an interior lot and 175 feet for a distance of 175 feet\nfrom each street for a corner lot."
                }
              ]
            }
          ]
        },
        {
          "text": "Except as may be expressly authorized by the Board of Trustees upon the grant of a special exception permit pursuant to § 161-8B of this article, the use of a lot or premises in the A2 Residence District for the parking or storage of a commercial vehicle is prohibited. As used in this section, the term \"commercial vehicle\" shall include every type of motor vehicle used for commercial purposes on the highways, such as the transportation of goods, wares and merchandise and a motor coach carrying passengers, and every type of motor vehicle which bears commercial registration plates."
        },
        {
          "footnote": "[1]\nEditor's Note: Former § 161-13, Signs, added 6-18-1985 by L.L. No. 2-1985, was repealed 11-29-2006 by L.L. No. 7-2006. See now § 161-34.1, Signs and certain lighting.\n"
        }
      ]
    },
    {
      "paragraph": "§ 161-10",
      "title": "Yards.",
      "content": [
        {
          "content": [
            {
              "number": "A. ",
              "content": [
                {
                  "text": "All front yards shall have a minimum depth of at least\n60 feet. In addition, for each 125.0 square feet of floor area in\nexcess of 8,000 square feet, the aforesaid minimum depth of the front\nyard shall be increased by one foot.[Amended 8-19-1996 by L.L. No. 1-1996]"
                }
              ]
            },
            {
              "number": "B. ",
              "content": [
                {
                  "text": "In the case of a single-family dwelling, all side\nyards shall have a width of at least 28 feet, and, if there are two\nside yards, the aggregate width of such side yards shall be at least\n65 feet.[Amended 10-25-1995 by L.L. No. 2-1995]"
                }
              ]
            },
            {
              "number": "C. ",
              "content": [
                {
                  "text": "In the case of a lot with one rear yard, the rear\nyard shall have a depth of at least 40 feet. In the case of a lot\nwith two rear yards, one rear yard shall have a depth of at least\n40 feet and the other rear yard shall have a depth of at least 28\nfeet."
                }
              ]
            }
          ]
        },
        {
          "text": "Unless it is subject to the provisions of § 161-8B of this article, each lot shall meet or exceed the following minimum requirements:"
        },
        {
          "content": [
            {
              "number": "A. ",
              "content": [
                {
                  "text": "Lot area: 40,000 square feet."
                }
              ]
            },
            {
              "number": "B. ",
              "content": [
                {
                  "text": "Frontage on a public street or on a street shown on\na subdivision map approved by the Planning Board of the Village of\nKings Point: 150 feet on one street for interior lots and 175 feet\non each street for corner lots."
                }
              ]
            },
            {
              "number": "C. ",
              "content": [
                {
                  "text": "Lot width: 150 feet for the first 200 feet of lot\ndepth for an interior lot and 175 feet for a distance of 175 feet\nfrom each street for a corner lot."
                }
              ]
            }
          ]
        },
        {
          "text": "Except as may be expressly authorized by the Board of Trustees upon the grant of a special exception permit pursuant to § 161-8B of this article, the use of a lot or premises in the A2 Residence District for the parking or storage of a commercial vehicle is prohibited. As used in this section, the term \"commercial vehicle\" shall include every type of motor vehicle used for commercial purposes on the highways, such as the transportation of goods, wares and merchandise and a motor coach carrying passengers, and every type of motor vehicle which bears commercial registration plates."
        },
        {
          "footnote": "[1]\nEditor's Note: Former § 161-13, Signs, added 6-18-1985 by L.L. No. 2-1985, was repealed 11-29-2006 by L.L. No. 7-2006. See now § 161-34.1, Signs and certain lighting.\n"
        }
      ]
    },
    {
      "paragraph": "§ 161-11",
      "title": "Density.",
      "content": [
        {
          "text": "Unless it is subject to the provisions of § 161-8B of this article, each lot shall meet or exceed the following minimum requirements:"
        },
        {
          "content": [
            {
              "number": "A. ",
              "content": [
                {
                  "text": "Lot area: 40,000 square feet."
                }
              ]
            },
            {
              "number": "B. ",
              "content": [
                {
                  "text": "Frontage on a public street or on a street shown on\na subdivision map approved by the Planning Board of the Village of\nKings Point: 150 feet on one street for interior lots and 175 feet\non each street for corner lots."
                }
              ]
            },
            {
              "number": "C. ",
              "content": [
                {
                  "text": "Lot width: 150 feet for the first 200 feet of lot\ndepth for an interior lot and 175 feet for a distance of 175 feet\nfrom each street for a corner lot."
                }
              ]
            }
          ]
        },
        {
          "text": "Except as may be expressly authorized by the Board of Trustees upon the grant of a special exception permit pursuant to § 161-8B of this article, the use of a lot or premises in the A2 Residence District for the parking or storage of a commercial vehicle is prohibited. As used in this section, the term \"commercial vehicle\" shall include every type of motor vehicle used for commercial purposes on the highways, such as the transportation of goods, wares and merchandise and a motor coach carrying passengers, and every type of motor vehicle which bears commercial registration plates."
        },
        {
          "footnote": "[1]\nEditor's Note: Former § 161-13, Signs, added 6-18-1985 by L.L. No. 2-1985, was repealed 11-29-2006 by L.L. No. 7-2006. See now § 161-34.1, Signs and certain lighting.\n"
        }
      ]
    },
    {
      "paragraph": "§ 161-12",
      "title": "Commercial vehicle storage.",
      "content": [
        {
          "text": "Except as may be expressly authorized by the Board of Trustees upon the grant of a special exception permit pursuant to § 161-8B of this article, the use of a lot or premises in the A2 Residence District for the parking or storage of a commercial vehicle is prohibited. As used in this section, the term \"commercial vehicle\" shall include every type of motor vehicle used for commercial purposes on the highways, such as the transportation of goods, wares and merchandise and a motor coach carrying passengers, and every type of motor vehicle which bears commercial registration plates."
        },
        {
          "footnote": "[1]\nEditor's Note: Former § 161-13, Signs, added 6-18-1985 by L.L. No. 2-1985, was repealed 11-29-2006 by L.L. No. 7-2006. See now § 161-34.1, Signs and certain lighting.\n"
        }
      ]
    },
    {
      "paragraph": "§ 161-13",
      "title": "(Reserved)        \n          [1]",
      "content": [
        {
          "footnote": "[1]\nEditor's Note: Former § 161-13, Signs, added 6-18-1985 by L.L. No. 2-1985, was repealed 11-29-2006 by L.L. No. 7-2006. See now § 161-34.1, Signs and certain lighting.\n"
        }
      ]
    }
  ]
}