{
	"url": "http://ecode360.com/11016002",
	"paras": [
		{
			"paragraph": "§ 315-9",
			"title": "Conformity required; applicability of regulations.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "No building shall be erected, moved, altered, rebuilt\nor enlarged, nor shall any land, water or building be used, designed\nor arranged to be used for any purpose except in conformity with this\nchapter."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "In interpreting and applying this chapter, the requirements\ncontained herein are declared to be the minimum requirements for the\nprotection and promotion of the public health, safety, morals, comfort,\nconvenience and general welfare. This chapter shall not be deemed\nto affect in any manner whatsoever any easements, covenants, or other\nagreements between parties; provided, however, that where this chapter\nimposes a greater restriction upon the use of buildings or land, or\nupon the erection, construction, establishment, moving, alteration\nor enlargement of buildings than are imposed by other ordinances,\nrules, regulations, licenses, certificates or other authorizations,\nor by easements, or covenants, or agreements, the provisions of this\nchapter shall prevail."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 315-10",
			"title": "Supplementary regulations.",
			"content": [
				{
					"text": "The provisions of this chapter shall be subject\nto such exceptions, additions or modifications as herein provided\nby the following general supplementary regulations."
				}
			]
		},
		{
			"paragraph": "§ 315-11",
			"title": "Buildings, uses and lots.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Lot for every building. Every building hereafter erected\nshall be located on a lot as herein defined and, except as herein\nprovided, there shall be not more than one main building and its accessory\nbuildings on one lot, except for nonresidential buildings in districts\nwhere such uses are permitted."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Yard and open space for every building. No yard or\nother open space provided about any building for the purpose of complying\nwith the provisions of these regulations shall be included as any\npart of the yard or open space for any other building; no yard or\nany other open space on one lot shall be considered as a yard or open\nspace for a building on any other lot."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Subdivision and partitioning of a lot."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "No lot or lots or parcel or parcels of land shall\nbe created by the division of any existing lot or parcel unless both\nof the following conditions are met:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "Such division has been approved by the Village's\nPlanning Board in accordance with the Subdivision Rules and Regulations\nof the Village of Lattingtown,[1] except that such approval is not required in cases of\ntransfers of land between adjoining property owners which create no\nviolations of this chapter."
																},
																{
																	"footnote": "[1]\nEditor's Note: See Ch. 263, Subdivision of Land.\n"
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "The created and the remaining lots or parcels\nand all of the structures on both the created and the remaining lots\nor parcels conform in all respects to this chapter except i) when\na variance is obtained from the Village's Board of Zoning Appeals\nfor a nonconformity and ii) when, in the case of a partitioning only,\nthere is a preexisting, nonconforming setback of any structure on\nthe lot on which the principal dwelling is located as a result of\nthe partitioning."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "No building permit shall be issued for the erection,\nalteration or use of a building on any lot or parcel created or remaining\nas a result of a partitioning or subdivision effected after April\n17, 1967, unless this subsection has been complied with."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "Irregularly shaped lots. Where a question exists as\nto the proper application of any of the requirements of this chapter\nto a particular lot or parcel because of the peculiar or irregular\nshape of the lot or parcel, the Board of Appeals shall determine how\nthe requirements of this chapter shall be applied."
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "Lots under water or subject to flooding. No more than\n10% of the minimum area requirement of a lot may be fulfilled by land\nwhich is under water or subject to periodic flooding. Land which is\nunder water that is open to use by persons other than the owner of\nthe lot, shall be excluded entirely from the computation of the minimum\narea of that lot. For the purposes of this subsection, land in the\nbed of a stream not exceeding five feet in width at mean water level,\nand land in any pond not exceeding 150 square feet in area, shall\nnot be considered as under water."
								}
							]
						},
						{
							"number": "F. ",
							"content": [
								{
									"text": "Required street frontage. No building permit shall\nbe issued for any structure unless the lot upon which that structure\nis to be built has the required frontage of at least 50 feet on a\nstreet or highway as defined in former § 179-o of the Village\nLaw,[2] which street or highway shall have been suitably improved\nor a bond posted therefor to the satisfaction of the Village Board\nor Planning Board as provided in the Village Law."
								},
								{
									"footnote": "[2]\nEditor's Note: See now Village Law § 7-736.\n"
								}
							]
						},
						{
							"number": "G. ",
							"content": [
								{
									"text": "New building on preexisting, nonconforming lots in\nsingle and separate ownership."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "No building permit shall be issued for the erection,\nalteration or use of a building on a lot which does not comply with\nthe requirements of this chapter as to lot area, street frontage,\nlot width or lot depth unless all of the following three conditions\nare met:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "A valid conveyance of the lot was recorded in\nthe office of the Clerk of Nassau County prior to the adoption of\nthat provision (regarding area, frontage, width or depth) of the Village's\nZoning Ordinance as originally adopted or later amended which is violated\nby such lot, and"
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "The owner of such lot does not own other land\ncontiguous thereto, and"
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "The owner of such lot or his predecessor in\ntitle has not owned other land contiguous thereto since the adoption\nof that provision of the Village's Zoning Ordinance as originally\nadopted or later amended which is violated by such lot."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "The Board of Zoning Appeals or the Attorneys for the\nVillage shall determine whether the above conditions are met. If said\nBoard or Attorneys so find, they may authorize the issuance of the\nrequested building permit provided that no existing nonconformity\nin height, setback (yard space), land coverage and dwelling unit size\nshall be increased and provided that all the requirements of this\nchapter in effect at the time of the issuance of the requested building\npermit are complied with to the fullest extent possible."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "H. ",
							"content": [
								{
									"text": "Lots made nonconforming for conservation purposes.\nThe remaining portion of any previously conforming lot made nonconforming\nby the conveyance of a part thereof to the Village, the Town of Oyster\nBay, the County of Nassau, the State of New York or the United States\nof America, or to a duly constituted entity thereof shall be deemed\nto be a conforming lot provided i) the land so conveyed is under water\nor subject to periodic flooding, ii) the land so conveyed shall only\nbe used for conservation and related purposes, iii) the land so conveyed\nshall never be improved with any structure and iv) such conveyance\nis permitted by the Board of Appeals upon written application and\nafter public hearing duly noticed in the manner required for an appeal\nto said Board. If said Board so permits such conveyance, it may at\nthat time authorize the issuance of building permits for the remaining\nportion of said lot provided it has an area of at least 1/3 of an\nacre and the requirements of this chapter in effect at the time of\nthe issuance of such building permits are complied with to the fullest\nextent possible."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 315-12",
			"title": "Projecting architectural features; walls and fences; corner lots; visibility at intersections.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Projecting horizontal architectural features. Architectural\nfeatures, such as window sills, belt courses, chimneys, cornices,\neaves or bay windows, shall not project more than three feet into\nany required yard. The sum of any bay window projections on any wall\nshall not exceed 1/4 the length of any said wall."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Walls and fences. The yard requirements of this chapter\nshall not be deemed to prohibit any necessary retaining wall nor to\nprohibit any fence or wall, providing that no fence or wall shall\nexceed 6 1/2 feet in height, measured above the existing natural\ngrade prior to construction. The \"good\" or finished side of fences\nlocated on or near property lines shall face outward from the property\non which they are located."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Corner lots. On a corner lot there shall be provided\na side yard on the side street equal in depth to the required front\nyard on said lot."
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "Visibility at intersections. On a corner lot no fence,\nwall, hedge, or other restructure or planting, more than three feet\nin height, shall be erected, placed or maintained within the triangular\narea formed by the intersecting street lines and a straight line joining\nsaid street lines at points which are 30 feet distant from the point\nof intersection, measured along said street lines. The height of three\nfeet shall be measured above the road surface at the nearest edge\nof road way. This subsection shall not apply to existing trees, provided\nthat no branches are closer than six feet to the ground."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 315-13",
			"title": "Minimum dwelling unit size.",
			"content": [
				{
					"text": "No dwelling unit created subsequent to the adoption of this chapter shall have a gross floor area of less than required in § 315-18 hereof. No church, club, private college, university, or school shall have a usable floor area less than that set forth in § 315-18 hereof."
				}
			]
		},
		{
			"paragraph": "§ 315-14",
			"title": "Storage, parking and use of vehicles and vessels.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Prohibited storage or parking."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "None of the following types of vehicles shall be stored\nor parked on any private property within the Village:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "Commercial vehicles (except as permitted by Subsection B of this section)."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "Construction, excavation or grading equipment."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "Two or more unregistered vehicles, unless the\nsame shall be stored or parked within a fully enclosed private garage\nbuilding."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "This Subsection A shall not prohibit the delivery or pickup of merchandise nor prohibit the parking of commercial vehicles, construction, excavation or grading equipment on private property, the use of which is incidental to bona fide repair of or duly authorized construction at the premises."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "No trailer, semitrailer, mobile home, motor home,\nrecreational vehicle or any similar vehicle, as vehicle is defined\nin the Vehicle and Traffic Law, designed to be used for part- or full-time\nhuman habitation, or vessel, or trailer for such vessel, shall be\nstored or parked on any private property within the Village for more\nthan 30 days during any calendar year unless the same shall be stored\nor parked within a fully enclosed private garage building or at a\nlocation where said vehicle is concealed at all times from neighboring\nproperty, and no such vehicle shall be used for human habitation within\nthe Village at any time."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 315-15",
			"title": "Buffer areas.",
			"content": [
				{
					"text": "In order to protect adjacent property owners\nwho abut lots in the R-4A, R-2A and R-1A Zoning Districts, when said\nlots contain an improved surface located within 25 feet of a side\nor rear lot line, there shall be required a buffer area of 10 feet\nwide between said improved surface and said lot line, which buffer\narea shall contain coniferous screening and/or fencing which meets\nthe satisfaction of the Planning Board. In situations where topography\nand/or distance to the improvements on said adjacent property serve\nto mitigate visual impact, the Planning Board may waive the coniferous\nscreening and/or fencing requirement."
				}
			]
		},
		{
			"paragraph": "§ 315-16",
			"title": "Schedules of Regulations.",
			"content": [
				{
					"text": "The following Schedules of Regulations list\nand define the use of land and buildings, the height of buildings,\nthe yards and other open space to be provided in connection with buildings,\nthe area of lots, and other matters. It is the intention that the\nuses set forth for each district shall not be permitted uses in following\ndistricts unless allowed specifically or by reference as permitted\nuses in said following districts. Only those uses listed for each\ndistrict as being permitted shall be permitted. Uses not listed specifically\nor by reference as being permitted in a district shall be deemed a\nnonpermitted use in that district."
				}
			]
		},
		{
			"paragraph": "§ 315-17",
			"title": "Schedule of uses for all rural and residence districts.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Permitted principal uses:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Detached single-family dwelling not exceeding 2 1/2\nstories."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Church for public worship and other strictly religious uses and in accordance with the discipline, rules and usages of the religious corporation which will own, support and maintain such church and the ecclesiastical governing body, if any, to which such corporation is subject, the membership of which church shall be at least partially composed of Village inhabitants, said use to be subject to the applicable standards and requirements set forth in Article V and § 315-30 hereof. Such use shall include accessory uses on the same lot and customarily incidental and subordinate to such use as a church."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Pumping, storage, sale and distribution of water,\nincluding water towers when approved by and made subject to conditions\nimposed by the Board of Trustees after written application thereto\nand the issuance of a permit."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "Incorporated nonprofit clubs for outdoor recreation, expressly excepting any club, a chief activity of which is a service customarily carried on as a gainful business, subject to the applicable standards and requirements set forth in Article V and § 315-29 hereof."
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "Indoor tennis court nonprofit club with respect to\ntennis court building in existence at the time of the enactment of\nthis chapter with at least two acres surrounding the same."
												}
											]
										},
										{
											"number": "(6) ",
											"content": [
												{
													"text": "Public primary and secondary schools and other schools\nconducted by trustees of school districts under Article 89 of the\nEducation Law with customary accessory use."
												}
											]
										},
										{
											"number": "(7) ",
											"content": [
												{
													"text": "State universities, colleges and schools and community\ncolleges, with customary accessory uses."
												}
											]
										},
										{
											"number": "(8) ",
											"content": [
												{
													"text": "Private colleges and universities, chartered by the Board of Regents of the University of the State of New York or by special act of the Legislature, including accessory uses on the same lot and customarily incidental and subordinate to the main use, subject to the applicable standards and requirements set forth in Article V and § 315-28 hereof."
												}
											]
										},
										{
											"number": "(9) ",
											"content": [
												{
													"text": "Private schools as hereinbefore defined, including accessory uses on the same lot and customarily incidental and subordinate to such use as a school, subject to the applicable standards and requirements set forth in Article V and § 315-28 hereof. Such permitted private schools shall in no event be deemed to include any camp as is hereinbefore defined which said use is hereby expressly prohibited."
												}
											]
										},
										{
											"number": "(10) ",
											"content": [
												{
													"text": "Incorporated, nonprofit club having at least 500 feet of beach front and at least 20 acres of contiguous land on Long Island Sound, which premises shall be used exclusively for bathing, swimming and related recreational and social activities, subject to the applicable standards and requirements set forth in Article V and § 315-29, except as modified herein and as follows:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "Section 315-11E shall not apply to such a club, but the property on which it is located must contain at least one contiguous shorefront acre of land which is not under water or subject to periodic flooding for each 150 feet of shorefront and, in the aggregate, at least five acres of land not under water or subject to periodic flooding."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "For the purposes of §§ 315-18 and 315-29D, E and I:"
																},
																{
																	"content": [
																		{
																			"number": "[1] ",
																			"content": [
																				{
																					"text": "The rear yard of the lot shall be the shorefront\nat the normal high-water mark, to which no minimum distances shall\napply for use and to which the minimum distance for structures, pools,\nathletic facilities and parking areas shall be 50 feet."
																				}
																			]
																		},
																		{
																			"number": "[2] ",
																			"content": [
																				{
																					"text": "The minimum side yard within 300 feet of the\nshorefront shall be 100 feet for structures, pools, athletic facilities\nand parking areas. In the case of land adjoining another village,\ntown or city the restriction on parking areas may be reduced or waived\nwith the consent of the adjoining landowner."
																				}
																			]
																		},
																		{
																			"number": "[3] ",
																			"content": [
																				{
																					"text": "The minimum side yard requirements beyond 300\nfeet from the shorefront shall be as otherwise provided in this chapter\nfor country clubs."
																				}
																			]
																		},
																		{
																			"number": "[4] ",
																			"content": [
																				{
																					"text": "The size of the off-street parking area and\nthe usable minimum floor area of structures and facilities shall be\nestablished by the Board of Zoning Appeals with due consideration\nto the number of the membership and anticipated use of the facilities\nand may be made subject to periodic review."
																				}
																			]
																		}
																	]
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "After a permit has been issued to a club by the Board of Appeals in accordance with the foregoing provisions of Subsection A(10), such club may convey any of its land which i) is under water or subject to periodic flooding and ii) is part of its minimum 20 acres, or may convey an interest in such land, to the Village, the Town of Oyster Bay, the County of Nassau, the State of New York or the United States of America, or to a duly constituted entity thereof, provided i) such land shall only be used for conservation and related purposes, ii) such land shall never be improved with any structure and iii) such conveyance is permitted by the Board of Appeals upon written application and after public hearing duly noticed in the manner required for an appeal to said Board. If said Board so permits such conveyance, the Board shall specify the minimum land requirements applicable to such club thereafter. Such club shall not convey any part of its land which i) is not under water or not subject to periodic flooding and also ii) is part of its minimum 20 acres."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(11) ",
											"content": [
												{
													"text": "Addition to or extension of an existing cemetery provided a) the existing cemetery was in existence on May 22, 1962, is owned and operated not for profit and no part of its net earnings inure to the benefit of any private shareholder or individual and b) the aggregate area of all additions shall not exceed the area of such cemetery as of May 22, 1962, and subject to the applicable standards and requirements set forth in Article V and § 315-32, except as modified herein, and as follows: c) §§ 315-19 and 315-27 shall apply to the original application for this permitted use subject to additional standards but shall not apply to each individual headstone or mausoleum for which individual permits shall not be required."
												}
											]
										},
										{
											"number": "(12) ",
											"content": [
												{
													"text": "Neighborhood property owners' association beach and waterfront clubs, subject to the applicable standards and requirements set forth in Article V of this chapter, except as modified herein as follows:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "Each parcel of land devoted to said use shall\nbe contiguous to navigable waters and contain an area of at least\nthree acres."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "The principal use of such beach or waterfront\nclubs shall be limited to swimming, picnicking, sunbathing, fishing\nand boating."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "All structures shall not exceed a height of\n30 feet, nor cover more than 15% of the lot area and shall be set\nback at least 100 feet from the shorefront (mean high water) and at\nleast 60 feet from all other boundary lines. Such structures shall\nnot be used for any of the following purposes of a commercial nature\nsuch as but not limited to bars, refreshment stands, jukeboxes, coin-operated\nmachines (except a soft drink vending machine) and sale of marina-type\nproducts."
																}
															]
														},
														{
															"number": "(d) ",
															"content": [
																{
																	"text": "The main beach house on a lot devoted to said\nuse may contain living quarters, containing not more than 800 square\nfeet of habitable floor area, for a caretaker and his immediate family."
																}
															]
														},
														{
															"number": "(e) ",
															"content": [
																{
																	"text": "The actual use of such a beach club shall be\nlimited to the individual owner or lessee and the immediate family\nor bona fide guests of such owner or lessees of the lots in a residential\nsubdivision or development in which said beach club is situated and\nwhose lot owners are members of a property owners' association for\nsaid subdivision or development pursuant to the rules and regulations\nof said association not in conflict with any of the provisions of\nthis chapter or other governmental authority having jurisdiction of\nbeach club facilities."
																}
															]
														}
													]
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Permitted accessory uses:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Agriculture, including berries, fruit and garden produce\nand a noncommercial greenhouse."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Keeping of not more than any combination of six dogs\nand cats. For the purposes of this section, any dog or cat less than\nsix months old shall not be counted toward the total."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Poultry."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "Keeping of horses and other animals having an individual\nweight of over 25 pounds for the personal use of the occupants of\na lot, provided the owner obtains a special permit from the Board\nof Appeals which permit shall be subject to the following standards\nand conditions:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "No such use shall be permitted on lots having\nless than two acres of land."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "The number of horses and other animals and the number of stalls and structural facilities reasonably necessary for the shelter of same, permitted on each lot, shall not exceed the following: One horse or other animal for each acre of lot area plus one additional horse or other animal for each additional acre of lot area, subject to the provisions of Subsection B(4)(j) below."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "Any such horses or other animals shall be owned\nin fact as well as in name solely by the resident occupants of the\nlot who shall upon written request of the Building Inspector produce\na sworn affidavit and other reasonable evidence of said ownership."
																}
															]
														},
														{
															"number": "(d) ",
															"content": [
																{
																	"text": "The boarding or keeping of horses or other animals\nowned by persons other than those who are the resident occupants of\nany lot is prohibited."
																}
															]
														},
														{
															"number": "(e) ",
															"content": [
																{
																	"text": "All grain and feed shall be kept in rodent-proof\ncontainers."
																}
															]
														},
														{
															"number": "(f) ",
															"content": [
																{
																	"text": "No manure shall be stored within 100 feet of\nany boundary line and shall be sorted and treated in such a manner\nso that it shall not create any odor or attract or harbor any rodents,\nflies or other insects on adjacent property."
																}
															]
														},
														{
															"number": "(g) ",
															"content": [
																{
																	"text": "The location of stables, barns and sheds used\nto shelter horses and other animals shall be set back at least 50\nfeet from every boundary line of a lot, except that any private outdoor\nriding ring, private paddock, corral or other roofless enclosure for\nhorses, and other animals and unenclosed area for their unattended\nmaintenance shall be located not less than 25 feet from any boundary\nline."
																}
															]
														},
														{
															"number": "(h) ",
															"content": [
																{
																	"text": "Horse vans, trailers or any other vehicle used\nfor the transport of horses and other animals shall, if kept on the\npremises for more than 24 hours, be properly concealed from adjacent\nproperties."
																}
															]
														},
														{
															"number": "(i) ",
															"content": [
																{
																	"text": "Horses and other animals may be transported\nto and from residential parcels only during the hours of 6:00 a.m.\nto 6:00 p.m. of each day of the week."
																}
															]
														},
														{
															"number": "(j) ",
															"content": [
																{
																	"text": "No person shall keep more than five horses or\nother animals on any one lot in any Residence District unless a special\npermit for same is authorized and approved by the Board of Trustees."
																}
															]
														},
														{
															"number": "(k) ",
															"content": [
																{
																	"text": "Any lot or lots exceeding the foregoing standards\nat the time of enactment of this chapter must be duly registered with\nthe Village Clerk and certified in writing by the Building Inspector\nprior to said enactment in order to be recognized as a valid nonconforming\nuse."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "The carrying on of a home occupation by a person residing\nin the dwelling unit in which such home occupation is carried on provided\nthat there is no display of goods or advertising visible from any\nstreet, that no assistant is employed, that no mechanical or electrical\nequipment is used except ordinary equipment, that the space so used\ndoes not occupy more than 25% of the total floor area of the dwelling\nunit and provided further, that such home occupation is not carried\non in any accessory building."
												}
											]
										},
										{
											"number": "(6) ",
											"content": [
												{
													"text": "Real estate activities of an owner, or of his duly\nauthorized agent, in connection with his property within the Village."
												}
											]
										},
										{
											"number": "(7) ",
											"content": [
												{
													"text": "The office or studio of a physician, surgeon, architect, dentist, teacher, painter or sculptor, musician, lawyer or engineer residing in the dwelling unit in which such office or studio is located, provided there is no display or advertising on the premises in connection with such use except for a professional nameplate not over two square feet in area, provided that said nameplate shall comply with the provisions of Article VII of this chapter; provided, also, that such studio or office does not occupy more space than the equivalent of 1/3 of the area of one floor of such dwelling and that such use is merely incidental to the use of such dwelling unit primarily for residential purposes; provided, however, that any such musician's studio is equipped and used in such a manner that sounds therefrom are not unduly annoying to other persons on nearby premises or public places; and provided, further, that no assistants, whether paid or not, may participate in such use except that one assistant may be employed if the nature of the profession is such as to require an assistant; and provided, further, that no use shall be made of more than one building in connection with such professional use; and provided further, that such professional use by the artist shall not be deemed to include the right to engage in wholesale or retail trade, as such term is ordinarily understood."
												}
											]
										},
										{
											"number": "(8) ",
											"content": [
												{
													"text": "Unilluminated private tennis or other recreational\ncourts, or private swimming pool. Aboveground swimming pools shall\nbe suitably screened and concealed from adjacent properties with fencing\nor by the planting and maintenance of evergreen trees or shrubs as\nrequired by the Building Inspector."
												}
											]
										},
										{
											"number": "(9) ",
											"content": [
												{
													"text": "Private garage for noncommercial passenger vehicles\nused by occupants of the premises."
												}
											]
										},
										{
											"number": "(10) ",
											"content": [
												{
													"text": "A private beach, beach house, wharf, pier, bathhouse, boathouse, sea walls, retaining walls and jetties for the use of the owner of the residential lot on which located subject to the special standards and requirements in § 315-31."
												}
											]
										},
										{
											"number": "(11) ",
											"content": [
												{
													"text": "No use carried on as a business shall be permitted\nin any accessory building. The renting to a tenant of any accessory\nbuilding alone and not in conjunction with the principal building\nor principal use shall constitute a prohibited business use."
												}
											]
										},
										{
											"number": "(12) ",
											"content": [
												{
													"text": "Accessory dwellings. No accessory dwelling shall\nbe erected, created, altered or enlarged, and no existing structure\nshall hereafter be converted into an accessory dwelling without the\napproval of the Planning Board of the Village. Such approval shall\nbe granted only upon the following findings or conditions by the Planning\nBoard:[Amended 6-17-2004 by L.L. No. 1-2004]"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "The lot upon which the accessory dwelling is\nlocated has sufficient surplus land area so as to provide a minimum\nland area for each principal and accessory dwelling as required in\nthe district in which the lot is located as if each dwelling were\nsituated on a separate lot;"
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "The proposed location for the accessory dwelling\nwill comply with this chapter in the event of a future subdivision\nof the premises;"
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "Adequate drainage facilities are provided for\nthe accessory dwelling;"
																}
															]
														},
														{
															"number": "(d) ",
															"content": [
																{
																	"text": "Considering any other relevant factors, construction\nof the accessory dwelling will not be detrimental to the health, welfare\nor safety of the community."
																}
															]
														}
													]
												}
											]
										}
									]
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 315-18",
			"title": "Schedule of rural and residential district standards.",
			"content": [
				{
					"text": "R-15 requirements are as follows:"
				},
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Lot Area: 15000 sq ft"
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Street Frontage: 50 ft"
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Street frontage on circumference of cul-de-sac: 50 ft"
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "Lot Width: 100 ft"
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "Lot Depth: 100 ft"
								}
							]
						},
						{
							"number": "F. ",
							"content": [
								{
									"text": "Front yard setback, principal and accessory building: 40 ft"
								}
							]
						},
						{
							"number": "G. ",
							"content": [
								{
									"text": "Side yard setback, principal and accessory buildings(f): 20 ft"
								}
							]
						},
						{
							"number": "H. ",
							"content": [
								{
									"text": "Rear yard setback, principal and accessory buildings(f): 30 ft"
								}
							]
						},
						{
							"number": "I. ",
							"content": [
								{
									"text": "Maximum Height: "
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Principal Building Pitched Roof: 35 ft"
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Principal Building Flat Roof: 25 ft"
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Accessory Building & Other Structures: 25 ft"
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "Maximum Number of Stories Principal Building: 2 1/2"
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "Maximum Number of Stories Accessory Building: 1 1/2"
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "J. ",
							"content": [
								{
									"text": "Maximum gross floor area of principal building: 1500 sq ft"
								}
							]
						},
						{
							"number": "K. ",
							"content": [
								{
									"text": "Maximum gross floor area for each accessory building: 250 sq ft"
								}
							]
						},
						{
							"number": "L. ",
							"content": [
								{
									"text": "Maximum total building area (includes principal and accessory buildings, and all improved surfaces including but not limited to driveways): 35%"
								}
							]
						},
						{
							"number": "M. ",
							"content": [
								{
									"text": "Height Setback Ratios: Front: 0.60  Side: 1.20  Rear: 0.80"
								}
							]
						}
					]
				},
				{
					"text": "Standards shown are minimum requirements unless otherwise indicated.\nDimensions are in feet unless otherwise indicated. See Notes (a),\n(b), (c), (d), (e), (f), (g), (h) and (i) for further restrictions\nas indicated. Lot Area: R-15 15,000sq.ft., R-1A 1 acre, R-2A 2 acres, R-4A 4 acres. Maximum gross floor area per principal building*: R-15 3,000sqft., R-1A 4500sqft., R-2A 6000sqft, R-4A 9000sqft.Minimum gross floor area of principal building: R-15 1500sqft, R-1A 1800sqft, R-2A 2200sqft, R-4 A2200sqft. Maximum gross floor area for each accessory building: R-15 250sqft, R-1A 500sqft, R-2A 750sqft, R-4A 1000 sqft. Maximum total building area (includes principal and accessory buildings, and all improved surfaces including but not limited to driveways): R-15 35%, R-1A 30%, R-2A 25%, R-4A 20%. (a)Within any Residence District, no part of any dwelling or other structure housing a main use, and no part of any residence structure, shall be erected on that part of a lot where the lot width is less than the minimum requirement for the district in which it is located. No part of a lot having a width less than 1/2 the minimum required width for the district may be counted as a part of the required minimum lot area.(b)Left blank intentionally.(c)Except chimneys not exceeding three feet defined in building height.(d)All accessory buildings and accessory structures shall be located a minimum of 100 feet from any street line, except that a garage may be set back the same distance as a main residential building but, in no event, less than the minimum front yard setback required in the district in which it is located.(e)For all buildings having a roof with a pitch of less than four on 12, the maximum height shall be 25 feet and two stories.(f)In the R-15 District, accessory buildings not larger than 100 square feet in gross floor area may be set back 1/2 the minimum distance required for the rear and side yard setbacks.(g)In the R-4A District, the front, side and rear yard setbacks for a principal building shall increase by 2% for every 1% by which the principal building exceeds 9,000 square feet of gross floor area.(h)Air-conditioning condensing units shall be permitted to project no more than eight feet into any required side yard or rear yard setback, provided they comply with the front yard setback, are fully screened from view from the street and view of neighboring properties, and comply with the Village's Noise Ordinance and do not create unreasonable noise at a point 10 feet beyond the property line of the property on which the unit is located.(i)Generators shall be permitted to project no more than eight feet into any required side yard or rear yard setback, provided they comply with the front yard setback, are fully screened from view from the street and view of' neighboring properties, and comply with the Village's Noise Ordinance and do not create unreasonable noise at a point 10 feet beyond the property line of the property on which the generator is located.*As increased or decreased using the following formula:1)Up to and including 1.0 acre of lot area: Maximum gross floor area = lot area minus 43,560, the difference of which is then multiplied by 0.052521 and the product is then subtracted from 4,500.2)More than 1.0 acre of lot area, up to and including 4.0 acres of lot area: Maximum gross floor area = lot area minus 174,240, the sum of which is then multiplied by 0.034435 and the product is then subtracted from 9,000.3)Over 4.0 acres of lot area: Maximum gross floor area = lot area minus 174,240, the difference of which is then multiplied by 0.022957 and the product is then added to 9,000."
				}
			]
		}
	]
}