{
	"url": "http://ecode360.com/5116559",
	"paras": [
		{
			"paragraph": "§ 210-6",
			"title": "Applicability.",
			"content": [
				{
					"text": "In the Residence District the following regulations\nshall apply."
				}
			]
		},
		{
			"paragraph": "§ 210-7",
			"title": "Permitted uses.",
			"content": [
				{
					"text": "No building may be erected, altered or used,\nand no lot or premises may be used, except for one or more of the\nfollowing purposes:"
				},
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Detached single-family dwelling."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Park."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Railroad passenger station."
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "Municipal Hall or Firehouse."
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "The secondary office of a doctor, dentist, teacher,\nattorney or other professional person residing on the premises. By\n\"secondary office\" is meant an office other than that at which such\nprofessional person regularly practices his profession and shall be\nin addition to a primary office maintained by or for such professional\nperson at a location other than that of the secondary office. No office\nshall be considered as such secondary office if the professional person\nmaintains regular office hours thereat, maintains capital equipment\nthereat or maintains an employee thereat, whether on a part-time or\nfull-time basis, and no office shall be considered as such secondary\noffice if it is more than 250 square feet in size or if it or any\npart of the structure within which it is contained is devoted to a\nwaiting room or area for patients or clients of the professional person."
								}
							]
						},
						{
							"number": "F. ",
							"content": [
								{
									"text": "Accessory use on the same lot with and customarily\nincidental to any of the above permitted uses, including a private\ngarage for not more than two cars. Except as above permitted, accessory\nuses shall not include any use customarily carried on as a business\nor industry or any driveway or walk giving access thereto. A fence\nor other structure deemed by the Building Inspector to be designed\nprimarily to cause annoyance or damage to an adjoining owner shall\nin no case be permitted as an accessory use. The word \"structure,\"\nas used in this subsection, shall include hedges and growths of plant\nlife.[Amended 8-30-1976 by L.L. No. 3-1976]"
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 210-8",
			"title": "Lot size.",
			"content": [
				{
					"text": "No building shall be constructed on a lot of\nan area less than 6,000 square feet, unless in replacement of an existing\nbuilding."
				}
			]
		},
		{
			"paragraph": "§ 210-9",
			"title": "Front yard.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "On the following streets there shall be a front yard,\nthe depth of which shall not be less than 25 feet:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Commonwealth Boulevard."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Massachusetts Boulevard."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Pennsylvania Boulevard."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "On all other streets there shall be a front yard,\nthe depth of which shall be not less than 20 feet."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 210-10",
			"title": "Rear yard.",
			"content": [
				{
					"text": "There shall be a rear yard, the depth of which\nshall not be less than 30 feet."
				}
			]
		},
		{
			"paragraph": "§ 210-11",
			"title": "Side yards.",
			"content": [
				{
					"text": "There shall be two side yards, one on each side\nof the main building, the aggregate width of which shall be at least\n16 feet. Neither side yard shall be less than eight feet wide."
				}
			]
		},
		{
			"paragraph": "§ 210-12",
			"title": "Maximum height.",
			"content": [
				{
					"text": "No dwelling shall exceed 30 feet in height."
				}
			]
		},
		{
			"paragraph": "§ 210-13",
			"title": "Corner lots.",
			"content": [
				{
					"text": "In the case of a corner lot, a building shall\ncomply with the front yard requirements on both streets. However,\nwhere two other yards exist, either of the said other yards may be\nconsidered a side yard."
				}
			]
		},
		{
			"paragraph": "§ 210-14",
			"title": "Lot coverage.",
			"content": [
				{
					"text": "The building area shall not be less than 30%\nnor more than 35% of the lot area."
				}
			]
		},
		{
			"paragraph": "§ 210-15",
			"title": "Frontage.",
			"content": [
				{
					"text": "No building shall be erected on any lot or plot\nwhich has a frontage upon any street of less than 50 feet."
				}
			]
		},
		{
			"paragraph": "§ 210-16",
			"title": "Parking of trailers and vehicles; driveways.",
			"content": [
				{
					"text": "No trailer, boat, tractor, truck, camper, mobile\nhome or any other motor vehicle shall be permitted to remain on an\nopen lot or upon any open spot in or about a dwelling within the Residence\nDistrict, except temporarily while going to and from the dwelling.\nHowever, nothing in this section shall prohibit the parking of a passenger\nmotor vehicle, which is used solely for noncommercial purposes, in\nthe driveway of any premises within the Residence District. For the\npurposes of this chapter, a \"driveway\" shall be defined as a path\nleading directly from the street to a garage and shall not include\nslabs, chevrons or aprons built to the side of the driveway. If any\ndwelling shall not have a garage, a \"driveway\" shall be defined as\none path, not exceeding eight feet in width, leading directly from\nthe street to or alongside the dwelling and shall not include slabs,\nchevrons or aprons built to the side of such path."
				}
			]
		}
	]
}