{
	"url": "http://ecode360.com/12024851",
	"paras": [
		{
			"paragraph": "§ 129-23",
			"title": "Permitted uses.",
			"content": [
				{
					"text": "In Estate E1 Districts, no land, building or structure shall be used and no building or structure shall be erected or altered to be used for any purpose other than any use permitted in R1 and R2 Districts, §§ 129-7 and 129-15, subject to the same use regulations."
				}
			]
		},
		{
			"paragraph": "§ 129-24",
			"title": "Additional use regulations.",
			"content": [
				{
					"text": "Any use not permitted hereinabove shall be prohibited. Sections 129-31 through 129-40 also shall apply in E1 Districts."
				}
			]
		},
		{
			"paragraph": "§ 129-25",
			"title": "Yards.",
			"content": [
				{
					"text": "Yards shall be subject to §§ 129-41 through 129-48 and Article VII. (See § 129-56A for remaining yard requirements for permitted accessory uses and structures.)"
				},
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "In Residence E1 Districts, there shall be a front\nyard, which shall be measured from the front lot line to the front\nbuilding line."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "For dwellings, the front yard shall be not less than\n75 feet at any point."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "For permitted accessory buildings or structures, the\nfront yard shall be not less than 125 feet at any point, and in no\nevent shall the front line of such accessory building or structure\nbe closer to the front lot line than the rear line of the main dwelling\nto which it is accessory."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "For main buildings other than dwellings (see Articles IX and X), the front yard shall be not less than 200 feet at any point."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "In Residence E1 Districts, there shall be a rear yard,\nwhich shall be measured from the rear lot line to the rear building\nline."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "For dwellings, the rear yard shall be not less than\n75 feet at any point."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "For main buildings other than dwellings (see Articles IX and X), the rear yard shall be not less than 200 feet at any point."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "In E1 Residence Districts, there shall be two side\nyards, each of which shall be measured from the side building line\nto the adjacent side line of the lot."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "For dwellings, each side yard shall be at least 75\nfeet at any point."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "For main buildings other than dwellings (see Articles IX and X), each side yard shall be at least 200 feet at any point."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "On a corner lot, the exterior side yard shall be subject\nto the front yard regulations."
												}
											]
										}
									]
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 129-26",
			"title": "Building heights.",
			"content": [
				{
					"text": "Subject to §§ 129-49 through 129-51 in E1 Districts, the height of a building, as measured in accordance with § 129-51, shall not exceed 3 1/2 stories nor 40 feet in height. (See § 129-57 for height restrictions on accessory buildings and structures.)"
				}
			]
		},
		{
			"paragraph": "§ 129-27",
			"title": "Lot coverage.",
			"content": [
				{
					"text": "In E1 Districts, not more than 10% of the area\nof a lot shall be occupied by a main building and accessory buildings\nor structures."
				}
			]
		},
		{
			"paragraph": "§ 129-28",
			"title": "Lot area, width and front lot line.",
			"content": [
				{
					"text": "In E1 Districts, the following regulations apply, subject to §§ 129-41 through 129-48:"
				},
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "The area of each lot and the lot area per principal\ndwelling shall be at least five acres."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "The width of a lot shall be at least 300 feet, and\nthe front lot line shall be at least 300 feet, except that, in the\ncase of a subdivision plat duly approved by the Village, where the\nsaid front lot line coincides with the circumference of the turnaround\non a dead-end street, when such turnaround has a diameter of at least\n100 feet, the front lot line shall be not less than 125 feet. No main\nbuilding nor any part thereof shall be located within an area of the\nlot that is less than half of the minimum required lot width.[Amended 11-6-2007 by L.L. No. 2-2007]"
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 129-29",
			"title": "Courts.",
			"content": [
				{
					"text": "In E1 Districts, courts shall be subject to §§ 129-44 through 129-47."
				}
			]
		},
		{
			"paragraph": "§ 129-30",
			"title": "Floor area.",
			"content": [
				{
					"text": "In E1 Districts, § 129-48 shall apply to floor area."
				}
			]
		}
	]
}