{
	"url": "http://ecode360.com/11765351",
	"paras": [
		{
			"paragraph": "§ 129-23",
			"title": "Permitted uses.",
			"content": [
				{
					"text": "In Estate E1 Districts, no land, building or structure shall be used and no building or structure shall be erected or altered to be used for any purpose other than any use permitted in R1 and R2 Districts, §§ 129-7 and 129-15, subject to the same use regulations."
				}
			]
		},
		{
			"paragraph": "§ 129-24",
			"title": "Additional use regulations.",
			"content": [
				{
					"text": "Any use not permitted hereinabove shall be prohibited. Sections 129-31 through 129-40 also shall apply in E1 Districts."
				}
			]
		},
		{
			"paragraph": "§ 129-25",
			"title": "Yards.",
			"content": [
				{
					"text": "Yards shall be subject to §§ 129-41 through 129-48 and Article VII. (See § 129-56A for remaining yard requirements for permitted accessory uses and structures.)"
				},
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "In Residence E1 Districts, there shall be a front\nyard, which shall be measured from the front lot line to the front\nbuilding line."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "For dwellings, the front yard shall be not less than\n75 feet at any point."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "For permitted accessory buildings or structures, the\nfront yard shall be not less than 125 feet at any point, and in no\nevent shall the front line of such accessory building or structure\nbe closer to the front lot line than the rear line of the main dwelling\nto which it is accessory."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "For main buildings other than dwellings (see Articles IX and X), the front yard shall be not less than 200 feet at any point."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "In Residence E1 Districts, there shall be a rear yard,\nwhich shall be measured from the rear lot line to the rear building\nline."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "For dwellings, the rear yard shall be not less than\n75 feet at any point."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "For main buildings other than dwellings (see Articles IX and X), the rear yard shall be not less than 200 feet at any point."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "In E1 Residence Districts, there shall be two side\nyards, each of which shall be measured from the side building line\nto the adjacent side line of the lot."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "For dwellings, each side yard shall be at least 75\nfeet at any point."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "For main buildings other than dwellings (see Articles IX and X), each side yard shall be at least 200 feet at any point."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "On a corner lot, the exterior side yard shall be subject\nto the front yard regulations."
												}
											]
										}
									]
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 129-26",
			"title": "Building heights.",
			"content": [
				{
					"text": "Subject to §§ 129-49 through 129-51 in E1 Districts, the height of a building, as measured in accordance with § 129-51, shall not exceed 3 1/2 stories nor 40 feet in height. (See § 129-57 for height restrictions on accessory buildings and structures.)"
				}
			]
		},
		{
			"paragraph": "§ 129-27",
			"title": "Lot coverage.",
			"content": [
				{
					"text": "In E1 Districts, not more than 10% of the area\nof a lot shall be occupied by a main building and accessory buildings\nor structures."
				}
			]
		},
		{
			"paragraph": "§ 129-28",
			"title": "Lot area, width and front lot line.",
			"content": [
				{
					"text": "In E1 Districts, the following regulations apply, subject to §§ 129-41 through 129-48:"
				},
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "The area of each lot and the lot area per principal\ndwelling shall be at least five acres."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "The width of a lot shall be at least 300 feet, and\nthe front lot line shall be at least 300 feet, except that, in the\ncase of a subdivision plat duly approved by the Village, where the\nsaid front lot line coincides with the circumference of the turnaround\non a dead-end street, when such turnaround has a diameter of at least\n100 feet, the front lot line shall be not less than 125 feet. No main\nbuilding nor any part thereof shall be located within an area of the\nlot that is less than half of the minimum required lot width.[Amended 11-6-2007 by L.L. No. 2-2007]"
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 129-29",
			"title": "Courts.",
			"content": [
				{
					"text": "In E1 Districts, courts shall be subject to §§ 129-44 through 129-47."
				}
			]
		},
		{
			"paragraph": "§ 129-30",
			"title": "Floor area.",
			"content": [
				{
					"text": "In E1 Districts, § 129-48 shall apply to floor area."
				}
			]
		},
		{
			"paragraph": "§ 129-31",
			"title": "Permitted uses.",
			"content": [
				{
					"text": "The uses permitted in each district are set forth in pertinent Articles of this chapter. General use regulations, which apply in more than one district, are set forth in Articles V through VIII of this chapter."
				}
			]
		},
		{
			"paragraph": "§ 129-32",
			"title": "Offensive uses.",
			"content": [
				{
					"text": "Nothing in this chapter shall be construed to\npermit any use or occupancy which is or may reasonably be expected\nto be obnoxious or offensive by reason of causing or emitting dust,\ngarbage, gas, noise, vibrations, odor, radiation, refuse matter, smoke\nor waterborne waste or that is dangerous or harmful to the health,\nsafety, peace or comfort of the community, that tends to disturb or\nannoy residents of the Village or that involves any explosion, menace\nor fire hazard."
				}
			]
		},
		{
			"paragraph": "§ 129-33",
			"title": "Protection of natural assets.",
			"content": [
				{
					"text": "In order to promote the health, safety and general\nwelfare and to conserve, enhance and protect natural assets of the\ncommunity, to maintain groundwater and to prevent floods as well as\nencroachments on watercourses, drainageways, lakes, ponds, shorefront\nand tidelands, the following uses shall be prohibited in all districts,\nexcept as otherwise specifically provided herein:"
				},
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "The disturbance of steep slope land, except those activities permitted by right as set forth in Subsection D below, the clearing of wooded areas, the excavation or grading of land or the removal of natural ground cover, soil or mineral deposit from areas other than those listed under § 129-33B, or the plowing of newly cleared or uncultivated land shall be prohibited, unless a zoning permit is issued therefor in accordance with § 129-104B, except that normal home gardening and horticulture, and normal farming activities carried on in conformity with the provisions of this chapter shall not require such permit.[Amended 4-6-2010 by L.L. No. 1-2010]"
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Changing the existing water level or shoreline, dredging, excavating, removing of soil or mineral deposit from or filling of Mill Neck Creek, shorefront, tideland, lakes, ponds, marshes or other watercourses and the construction of a dam, dock, pier, levee, breakwater, jetty or other facility for drainage, recreation, shorefront protection or water conservation shall be prohibited, unless specifically approved pursuant to the procedure prescribed in § 129-104B."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "In order to minimize the hazards of hurricane storm damage, the erection of a dwelling or other building or any portion thereof shall be prohibited below an elevation of 12 feet above mean sea level, Nassau County datum as shown on the Topographic Map, dated October 1957, and prepared for the Nassau County Department of Public Works, except a private bathhouse accessory to a dwelling or a nondwelling accessory to a nonprofit club, park or reservation and which bathhouse or nondwelling shall be subject to approval pursuant to § 129-104B."
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "A zoning\npermit shall not be required with regard to the following activities\non steep slope lands:[Added 4-6-2010 by L.L. No. 1-2010]"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Normal\nground maintenance, including mowing, trimming and pruning of vegetation,\nplanting and replanting, and removal of dead or diseased vegetation,\nprovided that such activity does not involve or cause the necessity\nof any regrading or other disturbance of the land, and further provided\nthat any such activity conforms with all other applicable ordinances,\nlaws and regulations, including obtaining a tree permit, if required."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Disturbance\nrequired under temporary emergency conditions, as determined by the\nBuilding Inspector, where such disturbance is necessary to protect\npersons or property from present or imminent danger."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "The\ncustomary, ongoing maintenance and repair of existing buildings, driveways,\nwalkways, walls, utilities or other similar structures, deemed as\nsuch by the Building Inspector or Village Engineer, as applicable."
												}
											]
										}
									]
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 129-34",
			"title": "Prohibited uses.",
			"content": [
				{
					"text": "In addition to the uses prohibited hereinabove\nand in the regulations for each district, in all districts the following\nuses shall be prohibited:"
				},
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Abattoirs; agricultural or horticultural processing\nindustries; manufacturing or fabrication of products; advertising\nsigns."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Commercial dairying, poultry raising, livestock raising,\nkennels and stables."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Commercial cutting of trees and sawing of timber for\ncommercial purposes; the excavation or dredging of gravel, soil, sand\nand other mineral deposit and the stripping of sod or topsoil for\ncommercial purposes."
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "A commercial greenhouse; raising of mushrooms or other\nbusiness."
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "Commercial recreation, including polo fields, riding\nclubs, golf courses, beaches and similar activities conducted as a\nbusiness or available to the public for a fee."
								}
							]
						},
						{
							"number": "F. ",
							"content": [
								{
									"text": "Farms for the disposal of garbage or offal; places\nfor the disposal of sewage or rubbish; hog ranches; pig and livestock\nfeeding farms; small animal and fur farms."
								}
							]
						},
						{
							"number": "G. ",
							"content": [
								{
									"text": "A laboratory or experimental station, except as an\nincidental use on the same premises as a college, to which such use\nis accessory."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 129-35",
			"title": "Habitable trailers and trucks.",
			"content": [
				{
					"text": "No automobile trailer or vehicle designed to be used for human habitation shall be used, stored or parked in any district, except that an unoccupied trailer or vehicle may be stored or parked inside a private garage or screening enclosure. No truck, tractor or trailer shall be stored or parked in any district if used for commercial purposes in any district, except as may be permitted as an accessory or temporary use pursuant to Articles IX and X."
				}
			]
		},
		{
			"paragraph": "§ 129-36",
			"title": "Uses not permitted by chapter.",
			"content": [
				{
					"text": "Any use not specifically permitted by this chapter\nshall be prohibited."
				}
			]
		},
		{
			"paragraph": "§ 129-37",
			"title": "Existing water level.",
			"content": [
				{
					"text": "For the purpose of these regulations, the existing\nwater level of lakes and ponds shall be the spillway elevation above\nmean sea level and as shown on the Topographic Map, dated October\n1957, prepared for the Nassau County Department of Public Works, including,\namong others, the following spillway elevations: Beaver Lake, 6.5\nfeet; Kentuck Pond, 20.8 feet; Lower Francis Pond, 28 feet; Upper\nFrancis Pond, 41.6 feet."
				}
			]
		},
		{
			"paragraph": "§ 129-38",
			"title": "Number of principal uses and buildings on lots.",
			"content": [
				{
					"text": "Each building or structure hereafter erected or altered shall be located on a lot as defined in § 129-6. In no case shall there be more than one principal use or one main building and its accessory building or buildings on one lot, except as may be otherwise approved for a project pursuant to §§ 129-90 through 129-95. Where permitted, there shall be no more than one accessory dwelling on one lot."
				}
			]
		},
		{
			"paragraph": "§ 129-39",
			"title": "(Reserved)\n                                                                                          [1]",
			"content": [
				{
					"footnote": "[1]\nEditor's Note: Former § 129-39,\nFrontage, was repealed 10-6-1992 by L.L. No. 8-1992.\n"
				}
			]
		},
		{
			"paragraph": "§ 129-40",
			"title": "Customary and utility exceptions.",
			"content": [
				{
					"text": "Nothing herein contained shall be construed to prohibit lawful domestic uses customarily incidental to a dwelling, which uses are not otherwise proscribed, or to prohibit a lawful easement or the lawful extension of service lines of public utilities and municipal facilities from such easement, powerline right-of-way or abutting street into the property to be served by such utilities or facilities. With respect to other use exceptions, conditional uses and general requirements, the provisions are set forth in Articles VI through XII and in the following sections of this Article V."
				}
			]
		},
		{
			"paragraph": "§ 129-41",
			"title": "Lot size.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "For the purpose of this chapter, a \"lot in single\nownership\" is defined as follows: a lot or parcel of land, the ownership\nof which, by a deed of conveyance or by a will, intestacy or operation\nof law, is vested in a person or persons or a corporation that owns\nno contiguous parcel of land, provided that such a deed, will, intestacy\nor operation of law, by which such ownership was separate, has been,\nas the case may be, recorded or probated or filed by court order prior\nto the adoption of this chapter or amendment thereof which imposes\nnew or enlarged area, width or other nonuse requirements upon such\nlots. Where such lot or parcel is smaller in area or width than is\nprescribed by this chapter for the district in which it lies and is\nowned by a person who owns or has under contract to purchase at the\ntime of the passage of this chapter other lots or parcels contiguous\nthereto, such other lots or parcels or so much thereof as may be necessary\nshall be combined with the original lot or parcel to make a single\nconforming lot or parcel, whereupon a zoning permit may be issued\nbut only for such combined lots or parcels."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "No lot or parcel of land in single ownership and of\nrecord on the effective date of this chapter or amendment thereof\nshall be reduced in any manner below the minimum lot size required\nby this chapter. The lot area per dwelling unit, use or building required\nby this chapter shall be considered the minimum for each and every\nbuilding, use or dwelling existing at the effective date of this chapter\nand for any building, use or dwelling hereafter erected, altered or\nmaintained."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 129-42",
			"title": "Area of waterfront property.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "In the case of a waterfront lot in any district, the\nupland and that portion, if any, situated below the shoreline and\nspecified hereinbelow shall be included in determining the area of\nsuch lot."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "The entire area and total dimensions of a waterfront\nlot in single ownership and of record on the effective date of this\nchapter shall be included in calculating the area and size of such\nlot."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "In any district, the upland portion of each waterfront\nlot hereafter created by the subdivision of waterfront property shall\nconform to the minimum lot area and dimensions prescribed by this\nchapter for the district in which such lot is located."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 129-43",
			"title": "Area of existing lots.",
			"content": [
				{
					"text": "In case a lot of record, unimproved and in bona\nfide single ownership on the effective date of this chapter and on\nthe date of application for a zoning permit, has an area or width\nless than that prescribed by these regulations for the district within\nwhich it is located and it does not adjoin another unimproved lot\nowned or controlled by the owner of the lot in question, a building\nmay be erected thereon, subject to approval of the Board of Appeals,\nin accordance with the use regulations of the district within which\nsuch lot is located, provided that the building shall comply with\nall other provisions of these regulations."
				}
			]
		},
		{
			"paragraph": "§ 129-44",
			"title": "Yard and court areas.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "No yard or court shall be diminished and maintained\nsmaller than prescribed by this chapter."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Every part of a required yard or court shall be open\nand substantially unobstructed to the sky, except as may be otherwise\nspecified by this chapter."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "No land required for yards, courts or lot area per\ndwelling unit for an existing building or which hereafter is provided\nfor any use, building or dwelling unit, in order to comply with the\nprovisions of this chapter, shall be considered as a yard, court or\nlot area per dwelling unit for any other building; nor shall any yard,\ncourt or lot area per dwelling unit on an adjoining lot be considered\nas providing such yard, open space or lot area per dwelling unit on\na lot upon which a building is to be erected."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 129-45",
			"title": "Building on waterfront property.",
			"content": [
				{
					"text": "No building shall hereafter be erected or altered\non waterfront property in any district unless such building is set\nback at least 50 feet from the shoreline, provided that if the shoreline\nof such property is less than 200 feet in length, such building shall\nbe set back an additional distance equal to the number of feet by\nwhich said shoreline falls short of being 200 feet in length; provided,\nhowever, that no building shall be required by this section to be\nset back more than 200 feet from the shoreline."
				}
			]
		},
		{
			"paragraph": "§ 129-46",
			"title": "Courts.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Courts are defined in § 129-6."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "An outer court shall be not less than 30 feet wide\nnor, at any given height, less than 3.33 feet wide for each one foot\nof such height above the sill of the lowest window opening upon such\ncourt, and the depth of such court shall be not greater than 50% of\nits width."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "No inner court shall be entirely enclosed by building\nwalls on more than three sides. The area of an inner court shall be\nnot less than 1,800 square feet; the depth of such court shall be\nnot less than 30 feet, provided that the depth and width of such court,\nat any given height, shall each be not less than 3.33 feet for each\none foot of such height above the sill of the lowest window opening\nupon such court. The depth of such court shall not exceed twice the\nwidth, except that, when the depth and width are each 100 feet or\nmore, this provision shall not apply."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 129-47",
			"title": "Projections.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "The following projections into yards or courts may\nbe permitted, provided that the maximum projection specified hereinbelow\nshall not be exceeded:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Cornices, eaves, gutters and chimneys may project\nnot more than 18 inches."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Belt courses, sills, stormwater leaders and similar\nornamental or structural features may project not more than one foot."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Awnings serving a door or window may project not to\nexceed five feet."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Except as otherwise specifically provided by these regulations, no building or structure or part thereof shall extend or project into a yard or court required by this chapter. However, nothing herein shall be construed to prevent the construction and maintenance of access driveways, garden walks, open terraces or patios or similar lawful accessory or appurtenant facilities or of accessory subterranean facilities, such as a private sanitary system and an air-raid or fallout shelter, in a yard or court. (See Chapter 51, Fences.)"
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 129-48",
			"title": "Floor area.",
			"content": [
				{
					"text": "The following floor area regulations shall apply\nto any building hereafter erected or altered. For the purpose of these\nregulations, \"floor area\" is the sum of the gross areas of the several\nfloors of a building, measured from the exterior faces of exterior\nwalls of a building, including, without limitation, floor space in\nhabitable rooms, interior balconies and enclosed porches but excluding\nattics, cellars, garages, carports and breezeways. Within the Residence\nR1 Districts, the portion of an attached garage in excess of 500 feet\nshall count as floor area. Within both the Residence R2 and Estate\nE1 Districts, the portion of an attached garage in excess of 700 feet\nshall count as floor area."
				},
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "In a main building the floor area shall be at least:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "On the ground floor of a one-story dwelling, 1,000\nsquare feet in the Residence R1 Districts and 2,000 square feet in\nboth the Residence R2 and Estate E1 Districts."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "On the ground floor of any one-and-one-half-story\ndwelling plus the half-story above it, 1,200 square feet in the Residence\nR1 Districts and 2,500 square feet in both the Residence R2 and Estate\nE1 Districts, provided that the floor area of the half-story shall\nnot exceed 50% of the total floor area."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "On the ground floor plus the floor or floors above\nit of any two-story-or-higher dwelling, 1,400 square feet in the Residence\nR1 Districts and 2,800 square feet in both the Residence R2 and Estate\nE1 Districts."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "In an accessory dwelling, the floor area shall be\nas set forth below:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "On the ground floor of a one-story accessory dwelling,\na minimum floor area of 700 square feet."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "On the ground floor, plus the floor above it, of any\naccessory dwelling higher than one story, a minimum floor area of\n900 square feet."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "In no event shall the aggregate area exceed 2,400\nsquare feet, except that for each additional full acre of land beyond\nthe minimum area requirement for the Residence R2 and Estate E1 Districts,\nthe maximum permitted floor area as set forth herein shall be increased\nby 250 square feet, provided that such additional floor area does\nnot result in an accessory dwelling larger in floor area than 35%\nof the main building to which it is accessory."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "The maximum floor area of a main building shall be\nas set forth below:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "The floor area of a main building shall not exceed\n4,000 square feet in the Residence R1 Districts."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "The floor area of a main building shall not exceed\n7,500 square feet in the Residence R2 Districts, except that for each\nadditional full acre of land beyond the minimum area requirement for\nthe Residence R2 Districts, the maximum permitted floor area as set\nforth herein shall be increased by 500 square feet up to a maximum\nof 10,000 square feet."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "The floor area of a main building shall not exceed\n12,000 square feet in the Estate E1 Districts, except that for each\nadditional full acre of land beyond the minimum area requirement for\nthe Estate E1 Districts, the maximum permitted floor area as set forth\nherein shall be increased by 500 square feet up to a maximum of 14,000\nsquare feet."
												}
											]
										}
									]
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 129-49",
			"title": "Building heights.",
			"content": [
				{
					"text": "In order to ensure adequate light, air and open\nspace to buildings hereafter erected or altered, the following height\nprovisions shall apply in all districts: For a main building other\nthan a dwelling and a building accessory to such main building, the\nheight in feet at the building line shall not exceed 30% of the minimum\nyard prescribed by these regulations, but for each 3.33 feet that\nsuch main or accessory building or portion thereof sets back from\nthe building line, one foot may be added to the height limit of such\nbuilding or portion thereof, provided that no building shall exceed\nthe maximum height prescribed for the district in which such building\nis located."
				}
			]
		},
		{
			"paragraph": "§ 129-50",
			"title": "Building height exceptions.",
			"content": [
				{
					"text": "The height of a building or structure, as prescribed\nby these regulations shall include all roof structures, open and enclosed,\nbut the height limit may be exceeded in the following instances:"
				},
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "A church spire, cupola, clock tower, pinnacle or similar\nstructure serving as an architectural embellishment may exceed the\nheight prescribed for the district in which it is located."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "A chimney may be erected to a greater height in feet."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "A flagpole and an accessory noncommercial radio, television\nor other antenna may be erected to a height in feet in excess of the\nheight prescribed by these regulations."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 129-51",
			"title": "Measuring building heights.",
			"content": [
				{
					"text": "Whenever a building or structure or portion\nthereof is constructed on sloping ground or at different levels, the\nheight of the building and of each such portion shall be measured\nfrom the natural grade at the center of the facade of the building\nand of each unit of building."
				}
			]
		},
		{
			"paragraph": "§ 129-55",
			"title": "Regulations.",
			"content": [
				{
					"text": "An accessory use, as defined in § 129-6, shall be subject to the following regulations:"
				},
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Such accessory use is operated and maintained under\nthe same ownership or by lessees thereof and on the same lot as the\nprincipal permitted use to which it is accessory, except that accessory\nfarming may be permitted on land adjacent to and under the same ownership\nas the premises to which such farming is accessory."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Such accessory use does not involve or include any\nuse, building, structure or structural feature inconsistent with the\nprincipal permitted use."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "No accessory use shall be operated and no accessory\nbuilding or structure shall be erected on any lot prior to the time\nof the operation of the principal use or of the construction of the\nmain building to which it is accessory, as the case may be."
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "In any district a use or building accessory to a principal\ndwelling may include, among others, the following, when used for noncommercial\npurposes customarily incidental to those of the principal dwelling:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "A private garage or stable; air-raid or fallout shelter."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "A private toolhouse or children's playhouse."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "A family swimming pool and appurtenant bathhouse."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "A private tennis court or tennis house."
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "A private riding ring; noncommercial greenhouse."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "The following regulations shall govern the keeping\nof animals and fowl for domestic purposes:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Such animals or fowl are not maintained for commercial\npurposes."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "They are housed in suitable structures, which shall\nnot be located in any minimum yard prescribed by these regulations."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "No manure, fertilizer or compost shall be made or\nstored within any minimum yard prescribed by these regulations."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "Conditions under which saddle horses, cows, sheep\nor fowl are kept shall be such as may be prescribed by the County\nDepartment of Health or by other ordinances of the Village."
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "The location of stables, barns and sheds used to shelter\nhorses or other livestock shall be subject to the minimum yard requirements\nfor accessory buildings as set forth in this Zoning Ordinance, except\nthat any private riding ring, private paddock, corral or other roofless\nenclosure for horses and livestock shall be located not less than\n25 feet from any lot line in the Residence R2 District and 25 feet\nfrom any side or rear lot line in the Residence E1 District or 50\nfeet from the front lot line in the Residence E1 District. No keeping\nof horses or other livestock shall be permitted in the Residence R1\nDistrict.[Added 3-7-1989 by L.L. No. 1-1989]"
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "F. ",
							"content": [
								{
									"text": "No accessory use shall include a business, commercial\nor industrial use or activity, except that this provision shall not\napply to the incidental sale of products grown on the premises in\nconnection with a permitted accessory farming use."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 129-56",
			"title": "Location of accessory uses and structures.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "No accessory use or accessory building or structure shall be located within any minimum yard or court prescribed by this chapter, except that a one-story detached garage accessory to a principal dwelling shall be set back at least three feet from the side or rear lot line in R1 Districts and except as may otherwise be approved by the Board of Appeals or as may otherwise be specifically provided herein. (See §§ 129-47 and 129-55 and Chapter 51, Fences.)"
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Any uses or buildings accessory to a park or reservation\nmay occupy in the aggregate an area which shall not exceed the maximum\nbuilding cover permitted in the district."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "When any accessory building or structure, other than\na subterranean air-raid or fallout shelter, is attached to or constructed\nas a part of the main building to which it is accessory, it shall\nbe subject to the yard requirements of the main building."
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "Buildings and structures accessory to a park or reservation\nshall comply with all yard requirements of this chapter for a main\nbuilding in the particular district."
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "Accessory aboveground fuel tanks shall be set back\nat least 10 feet from any dwelling and shall be screened from the\nview of neighboring properties.[Added 10-6-1992 by L.L. No. 8-1992]"
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 129-57",
			"title": "Height and area of accessory structures.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Subject to the measuring requirements set forth in § 129-49, no accessory building or structure shall exceed either 2 1/2 stories or 30 feet in height in the Residence R2 and Estate E1 Districts, and no such building or structure in the Residence R1 Districts shall exceed either 1 1/2 stories or 12 feet in height."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "The footprint of a roofed accessory building or structure\nshall not exceed 500 square feet in the Residence R1 Districts and\n1,200 square feet in the Residence R2 and Estate E1 Districts."
								}
							]
						}
					]
				}
			]
		}
	]
}