{
	"url": "http://ecode360.com/12024775",
	"paras": [
		{
			"paragraph": "§ 129-7",
			"title": "Permitted uses.",
			"content": [
				{
					"text": "In Residence R1 Districts no land, building\nor structure shall be used and no building or structure shall be erected\nor altered to be used for any purpose other than:"
				},
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "A single-family detached dwelling as a principal use."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "A municipal governmental facility of the Village."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "A Village park or reservation as a principal use."
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "The following uses, only after approval of the Village Board of Trustees, subject to such conditions as said Board may impose and the issuance of a permit pursuant to § 129-104A:[Amended 12-1-1964; 10-6-1992 by L.L. No. 8-1992]"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Public water supply facilities, including a pumping\nstation, buildings and structures pertaining thereto."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Other utility facilities and structures for special\ndistricts for fire, park, police, sewer, water or other purposes as\nare necessary for the health, safety and general welfare of the area\nserved."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "A dam, levee, breakwater, jetty or other facility\nfor drainage, shorefront protection or water conservation."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "Except as hereinafter provided, accessory uses or buildings, as defined in § 129-6 and subject to Article VII, including, among others:[Amended 3-7-1989 by L.L. No. 1-1989]"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Any form of home agriculture and horticulture, except\nfor commercial purposes, and including the keeping of small animals\nas pets."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "A home occupation, subject to § 129-8."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "A fence or wall, subject to Chapter 51 of this Code."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "A nameplate or sign, subject to Article VI."
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "An office or studio of a doctor of medicine, surgeon, artist, sculptor, architect, teacher, musician, lawyer or engineer residing in the dwelling, subject to § 129-8."
												}
											]
										},
										{
											"number": "(6) ",
											"content": [
												{
													"text": "Off-street parking, subject to Article VIII."
												}
											]
										},
										{
											"number": "(7) ",
											"content": [
												{
													"text": "An accessory dwelling shall not be permitted in the\nR1 District."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "F. ",
							"content": [
								{
									"text": "The following conditional uses, subject to Article IX:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Nonprofit reservation, park or other open recreational\nuse."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "High and low wireless telecommunication services facilities.[Added 9-10-2013 by L.L. No. 4-2013]"
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "G. ",
							"content": [
								{
									"text": "Conservation of natural resources."
								}
							]
						},
						{
							"number": "H. ",
							"content": [
								{
									"text": "Temporary use, subject to Article X."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 129-8",
			"title": "Additional use regulations.",
			"content": [
				{
					"text": "In addition to the regulations in §§ 129-31 through 129-40, the following shall apply in R1 Districts:"
				},
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "An accessory home occupation shall not include the\ndisplay of goods or advertising visible from any street. In connection\nwith such occupation, there shall be kept no stock-in-trade or commodity\nsold upon the premises, no paid assistant shall be employed; and no\nelectrical or mechanical equipment shall be used other than ordinary\nhousehold equipment. The space used for a home occupation shall occupy\nnot more than 1/3 of the total floor area of the dwelling unit, and\nno such occupation shall be carried on in any accessory building."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "An accessory office or studio shall not occupy more\nspace than the equivalent of 1/3 of the area of one floor of the dwelling\nin which such office or studio is used; there shall be no display\nor advertising on the premises in connection with such use, except\na professional nameplate; no assistants, whether paid or not, shall\nparticipate in such use, except that one assistant may be employed\nif the nature of the profession is such as to require an assistant;\nand any such musician's or sculptor's studio shall be equipped and\nused in such manner that sounds therefrom are not unduly annoying\nto other persons or nearby premises or public places."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Any use not permitted hereinabove or in § 129-7 shall be prohibited."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 129-9",
			"title": "Yards.",
			"content": [
				{
					"text": "Yards shall be subject to §§ 129-41 through 129-47 and Article VII. (See § 129-56A for yard requirements for permitted accessory uses and structure.)"
				},
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "In Residence R1 Districts, there shall be a front\nyard, which shall be measured from the front lot line to the front\nbuilding line."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "For dwellings, the front yard shall not be less than\n20 feet at any point."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "For main buildings other than dwellings (see Articles IX and X), the front yard shall be not less than 40 feet at any point."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "In Residence R1 Districts, there shall be a rear yard,\nwhich shall be measured from the rear lot line to the rear building\nline."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "For dwellings, the rear yard shall be not less than\n20 feet at any point."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "For main buildings other than dwellings (see Articles IX and X), the rear yard shall be not less than 40 feet at any point."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "In Residence R1 Districts, there shall be two side\nyards, each of which shall be measured from the side building line\nto the adjacent side line of the lot."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "For dwellings, each side yard shall be at least 10\nfeet at any point."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "For main buildings other than dwellings (see Articles IX and X), each side yard shall be at least 40 feet at any point."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "On a corner lot, the exterior side yard shall be subject\nto the front yard regulations."
												}
											]
										}
									]
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 129-10",
			"title": "Building heights.",
			"content": [
				{
					"text": "Subject to the provisions of §§ 129-49 through 129-51, in R-1 Districts, the height of a building, as measured in accordance with § 129-51, shall not exceed 2 1/2 stories or 30 feet in height. (See § 129-57 for height restrictions on accessory buildings and structures.)"
				}
			]
		},
		{
			"paragraph": "§ 129-11",
			"title": "Lot coverage.",
			"content": [
				{
					"text": "In R1 Districts, not more than 30% of the area\nof a lot shall be occupied by a main building and accessory buildings\nor structures."
				}
			]
		},
		{
			"paragraph": "§ 129-12",
			"title": "Lot area, width and front lot line.",
			"content": [
				{
					"text": "In R1 Districts the following regulations apply, subject to §§ 129-41 through 129-48:"
				},
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "The area of each lot and the minimum lot area per\nprincipal dwelling shall be at least 8,000 square feet."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "The width of a lot shall be at least 75 feet, and\nthe front lot line shall be at least 75 feet, except that, in the\ncase of a subdivision plat duly approved by the Village, where the\nsaid front lot line coincides with the circumference of the turnaround\non a dead-end street, when such turnaround has a diameter of at least\n100 feet, the front lot line shall be not less than 50 feet. No main\nbuilding nor any part thereof shall be located within an area of the\nlot that is less than half of the minimum required lot width.[Amended 11-6-2007 by L.L. No. 2-2007]"
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 129-13",
			"title": "Courts.",
			"content": [
				{
					"text": "In R1 Districts, courts shall be subject to §§ 129-44 through 129-47."
				}
			]
		},
		{
			"paragraph": "§ 129-14",
			"title": "Floor area.",
			"content": [
				{
					"text": "In R1 Districts, § 129-48 shall apply to floor area."
				}
			]
		}
	]
}