{
	"url": "http://ecode360.com/7203730",
	"paras": [
		{
			"paragraph": "§ 250-14",
			"title": "Applicability.",
			"content": [
				{
					"text": "In an A Residence District, the following regulations\nshall apply."
				}
			]
		},
		{
			"paragraph": "§ 250-15",
			"title": "Permitted uses.",
			"content": [
				{
					"text": "A building may be erected, altered or used and\na lot or premises may be used for any of the following purposes, and\nfor no other:"
				},
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Single-family detached dwelling."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Municipal recreational use."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 250-16",
			"title": "Accessory uses.",
			"content": [
				{
					"text": "Accessory uses on the same lot with and customarily\nincidental to the above permitted uses, including a private garage,\nare permitted. This shall be understood to include the professional\noffice or studio of a doctor, dentist, masseur, teacher, artist, architect,\nreal estate broker, engineer, musician or lawyer, or rooms used for\nhome occupations such as dressmaking, millinery or similar handicrafts,\nand other similar uses that may be authorized by the Board of Zoning\nAppeals, provided that the office, studio or occupational room is\nlocated in the dwelling in which the practitioner resides, and provided\nfurther that no goods are publicly displayed on the premises. Such\naccessory use, exclusive of a private garage, shall not include the\nerection or maintenance hereafter of any structure other than one\nerected on the ground and not exceeding 80 square feet of floor area\nand eight feet in height maximum, unless authorized as a special exception\nby the Board of Zoning Appeals. In any event, no more than one employee\nmay be permitted at an accessory use."
				}
			]
		},
		{
			"paragraph": "§ 250-16.1",
			"title": "Tennis and sports courts, (A) Residence District.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "No tennis or sports court may be constructed, maintained or used\non any lot or premises except as an accessory use to a single-family\nresidence located on the same lot or premises within the Village,\nand except upon the grant of a special exception permit by the Board\nof Zoning Appeals. In passing on the special exception application,\nthe Board shall determine whether any aspect of the proposed court\nor the use of it will have an unreasonably adverse impact on the character\nof the surrounding area, and the value, use and enjoyment of neighboring\nproperties. In addition to any requirements, an application for such\na special exception permit shall be accompanied by plot, site and\nconstruction plans showing location, dimensions, drainage, design,\nfencing, and landscaping, all as required by the Building Inspector."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "No tennis or sports court may be constructed or maintained in the\nfront yard, nor within 30 feet of a rear property line or within 30\nfeet of a side property line."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "All tennis and sports courts shall be enclosed with permanent fencing,\nof a type and design approved by the Building Inspector, sufficient\nto prevent ball or other implements or equipment used at such location\nfrom leaving the premises or immediate area of such court."
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "No tennis or sports court shall be constructed or maintained so as\nto permit any drainage of water to flow onto adjacent property or\na public right-of-way."
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "No covering of any type shall be erected or maintained over any tennis\nor sports court."
								}
							]
						},
						{
							"number": "F. ",
							"content": [
								{
									"text": "No tennis or sports court shall have lighting as to illuminate the\ncourt from dusk to dawn."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 250-17",
			"title": "Signs.",
			"content": [
				{
					"text": "Such signs which are authorized under the provisions of Article X are permitted."
				}
			]
		},
		{
			"paragraph": "§ 250-18",
			"title": "Excavations.",
			"content": [
				{
					"text": "No excavations for purposes other than the construction\nof a driveway, walk, a permitted wall or building or part thereof\nor accessory thereto, or to remove topsoil from one part of the lands\nof an owner to another part of the same premises when such removal\nis necessary as an accessory use, or any excavation of a similar character,\nshall be made unless approved by the Building Department."
				}
			]
		},
		{
			"paragraph": "§ 250-18.1",
			"title": "Grading.",
			"content": [
				{
					"text": "For all lots upon which any proposed grade change\nis in excess of two feet, where the total area of the lot containing\nthe proposed work is in excess of 100 square feet and  where the grade\nis permitted to be increased up to two feet, the grade shall not be\npermitted to be increased to within 10 feet of the front, side and\nrear property lines. No person, firm, or corporation or entity shall\nalter the grade of any parcel of land without first having obtained\nthe approval of the Board of Zoning Appeals."
				}
			]
		},
		{
			"paragraph": "§ 250-19",
			"title": "Special uses.",
			"content": [
				{
					"text": "Special uses, when approved by the Board of Zoning Appeals pursuant to Article XIII, are permitted."
				}
			]
		},
		{
			"paragraph": "§ 250-20",
			"title": "Height.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "In the case of a single-family dwelling, no building shall be greater\nin height than 2 1/2 stories with a maximum height of 28 feet\nto peak."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Roof slopes less than four feet vertically for every 12 feet horizontally\nshall have a maximum height of 24 feet to peak including any parapet\nwalls."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 250-21",
			"title": "Lot coverage.",
			"content": [
				{
					"text": "The lot coverage shall not exceed 30% of the lot area, except the lot coverage area for oversized lots shall be controlled by Article XV, § 250-129, of this chapter."
				}
			]
		},
		{
			"paragraph": "§ 250-22",
			"title": "Front yards.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "The required front yard depth shall be the same as\nthe average front yard depth of the existing buildings within 200\nfeet on each side of the lot and within the same block in the same\nuse district or, if there are less than two existing buildings on\nthe same side of the street, the average front yard depth of existing\nbuildings within 200 feet on each side directly opposite the lot in\nthe same use district. In any case, no front yard shall be required\nto have a depth greater than 40 feet."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "In case of a corner lot, a front yard shall be required\non each street, and, notwithstanding the foregoing, each front yard\nshall be not less than 25 feet, provided that, if at the effective\ndate of this chapter any corner lot is held in single and separate\nownership having a width of less than 55 feet, the depth of the front\nyard on one side of the lot may be decreased when authorized as a\nspecial exception by the Board of Zoning Appeals."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Where a building is not controlled by Subsection A above, there shall be a front yard, the depth of which shall be at least 25 feet back of the street line."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 250-23",
			"title": "Side yards.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "In case of a single-family dwelling, there shall be\ntwo side yards, one on each side of the main building, the aggregate\nwidths of which shall be at least 14 feet. Neither side yard shall\nbe less than four feet wide."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "In the case of any building other than a single-family\ndwelling or a building accessory thereto, there shall be two side\nyards. The width of each of the two side yards shall be at least 20\nfeet, except that if such building is over 40 feet high, this width\nshall be increased five feet for each 12 feet or portion thereof by\nwhich the building exceeds 40 feet."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "In the case of oversized lots, the minimum side yards shall be as set forth in Article XV, § 250-129, of this chapter."
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "For vacant lots or properties with more than 51 feet\nof frontage, in which the entire structure is being removed, the new\nstructure shall have two side yards one on each side of the main building,\nthe aggregate width of which shall be at least 15 feet. Neither side\nyard shall be less than five feet wide.[Added 1-14-2008 by L.L. No. 1-2008]"
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 250-24",
			"title": "Rear yards.",
			"content": [
				{
					"text": "There shall be a rear yard, the depth of which\nshall be at least 25 feet, provided that, if at the time this chapter\nbecomes effective any lot is held in single and separate ownership\nwith a depth of less than 100 feet, the required depth of the rear\nyard may be diminished by three inches for each foot of difference\nbetween 100 feet and the depth of the plot, but in no case shall the\ndepth of the rear yard be less than 15 feet."
				}
			]
		},
		{
			"paragraph": "§ 250-25",
			"title": "Permitted encroachments.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "The following encroachments are hereby permitted:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Cornices, eaves, gutters, chimneys or bay windows\nprojecting not more than 24 inches."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "One-story open porches and terraces not exceeding\nthree feet in height projecting not more than six feet into a front\nyard."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "One-story enclosed front vestibules not greater than\nsix feet wide and five feet deep."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "One-story additions to the main dwelling projecting\ninto one of the required side yards, provided that the area of encroachment\nshall be used for garage purposes only, and provided further that\nneither side yard shall be less than five feet wide, and provided\nfurther that the aggregate widths of the two side yards shall be at\nleast 12 feet."
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "One-story additions to the main dwelling encroaching\ninto the required rear yard, provided that the area of encroachment\nis not in excess of 240 square feet, and provided further that the\nrear yard shall not be diminished thereby to a depth of less than\n15 feet."
												}
											]
										},
										{
											"number": "(6) ",
											"content": [
												{
													"text": "One-story additions to the exterior of the main dwelling\ncontaining only an aboveground fuel-oil storage tank used for heating\nthe premises upon which installation is made, projecting into one\nof the required side yards, provided that said side yard shall not\nbe diminished thereby to a width of less than two feet."
												}
											]
										},
										{
											"number": "(7) ",
											"content": [
												{
													"text": "HVAC equipment shall be permitted in one of the required\nside yards, provided that said side yard shall not be diminished thereby\nto a width of less than four feet or as permitted by a notarized release\nform.[1][Added 8-8-2005 by L.L. No. 1-2005]"
												},
												{
													"footnote": "[1]\nEditor's Note: Said release form is on file\nin the Village offices.\n"
												}
											]
										},
										{
											"number": "(8) ",
											"content": [
												{
													"text": "Generators\n(permanent or portable) shall be permitted in one of the required\nside yards or rear yard, provided that said side yard shall not be\ndiminished thereby to a width of less than four feet and the rear\nyard shall not be diminished thereby to a distance less than five\nfeet from the rear property line in Residence A Districts.[Added 11-14-2011 by L.L. No. 2-2011]"
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "In any case where the Board of Zoning Appeals has\ndiminished a required yard by a variance or special exception, none\nof the foregoing encroachments shall be permitted encroachments in\nsuch diminished yard unless specifically authorized by the Board."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 250-26",
			"title": "Fences.",
			"content": [
				{
					"text": "A fence, not exceeding six feet in height, shall\nbe permitted on the rear lot line and those linear portions of the\nside lot lines enclosing a rear yard and side yard; provided, however,\nthat the six-foot fencing and its relationship to the street fronting\nupon the premises shall not exceed a greater distance frontward to\nthe street than the front building line of adjacent dwellings on either\nside. For purposes of interpretation, a front building line shall\nrefer only to the principal structure and shall not include patios,\nporches or other extensions thereto. Fencing for all other lot lines\nshall not exceed five feet in height except when permitted as a special\nexception by the Board of Zoning Appeals.  In every case, the finished\nor \"good\" side of the fence shall face outward facing a legal street."
				}
			]
		},
		{
			"paragraph": "§ 250-27",
			"title": "Accessory buildings.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Accessory buildings may occupy 40% of the required\narea of the rear yard up to a maximum height of 12 feet. The yard\narea occupied by such accessory building shall, however, be included\nin computing the maximum percentage of the lot area which may be built\nupon. No accessory building shall be nearer any front property line\nthan 45 feet and must be at least two feet from the rear and side\nproperty lines, except that accessory garages may have a party wall.\nHowever, in the case of an accessory private garage which may include\na porch or an enclosed patio annexed thereto, it may be located not\nnearer to the front property line than the main building which it\ntends and must be not less than five feet from any side line."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "In the case of a corner lot, an accessory building shall not be less than two feet from the rear and side property lines, except in the case of an accessory private garage. which may be located not nearer to the front property line than the main building which it tends and must be not less than five feet from any side line, but must in any other event and in all other respects conform to Subsection A of this section."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 250-28",
			"title": "Minimum lot area and width.",
			"content": [
				{
					"text": "No dwelling or other building shall be constructed\non a lot unless it contains an area of not less than 6,000 square\nfeet and has a minimum width of 55 feet at the front setback line\nand either has a minimum width of 55 feet from and on the street line\nto the front setback line or is a lot designated on a plat heretofore\nor hereafter duly filed in the office of the Clerk of the County of\nNassau. The foregoing provision shall not apply to the construction\nof accessory uses, dwelling additions or building additions on a lot.\nThe minimum lot or plot width and area and frontage regulations herein\nset forth shall not apply to any lot or plot having an area and/or\nwidth and/or frontage of less than that prescribed herein, provided\nthat such lot or plot has an area of at least 4,000 square feet and\nwas under different ownership from that of any adjoining land on October\n25, 1957, and provided further that such lot or plot and any adjoining\nland did not come into common ownership since that date."
				}
			]
		}
	]
}