{
	"url": "http://ecode360.com/7696262",
	"paras": [
		{
			"paragraph": "§ 307c",
			"title": "Table of Dimensional Regulations.\n                                                                              [1]",
			"content": [
				{
					"text": "Regulations regarding minimum lot area, minimum lot width, yards, lot area per dwelling unit, maximum building coverage, minimum landscape coverage and maximum building floor area are set forth on the Table of Dimensional Regulations. Additional dimensional regulations are contained in § 307-18 and in Article VII."
				},
				{
                	"content": [
                		{
                			"number": "A. ",
                			"content": [
                				{
                					"text": "Minimum Lot Area (square feet): 20,000"
                				}
                			]
                		},
                		{
                			"number": "B. ",
                			"content": [
                				{
                					"text": "Minimum Lot Width (feet): 100"
                				}
                			]
                		},
                		{
                			"number": "C. ",
                			"content": [
                				{
                					"text": "Maximum Height (stories/feet): 2.5/35"
                				}
                			]
                		},
                		{
                			"number": "D. ",
                			"content": [
                				{
                					"text": "Minimum Yard: Principal Structure Front (feet): 40 Two/Three/Four Family: See 307-19G(1) Multifamily: See 307-19G(1) "
                				}
                			]
                		},
                		{
                			"number": "E. ",
                			"content": [
                				{
                					"text": "Minimum Yard: Principal Structure Side (feet): 10 Two/Three/Four Family: See 307-19G(1) Multifamily: See 307-19G(1) "
                				}
                			]
                		},
                		{
                			"number": "F. ",
                			"content": [
                				{
                					"text": "Minimum Yard: Principal Structure Rear (feet): 30 Two/Three/Four Family: See 307-19G(1) Multifamily: See 307-19G(1) "
                				}
                			]
                		}
                	]
                }
			]
		},
		{
			"paragraph": "§ 307-18",
			"title": "Supplementary dimensional regulations.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Front yard exception for existing building alignment.\nWhere at least 50% of the lots on the same side of the street and\nwithin 500 feet of the side lines of a lot on which a single- or two-family\ndwelling is proposed have been improved with single- or two-family\ndwellings, no front yard for such proposed dwelling need be greater\nthan the average front yards of the aforesaid improved lots."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Exceptions to yard requirements. The following features\nmay extend into any yard for distances not to exceed those specified:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Cornices, canopies, eaves or similar features, at\nleast 10 feet above finished grade: two feet six inches."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Open fire escapes: six feet."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Terraces, decks, uncovered porches and uncovered stairs,\nwhether constructed of wood or masonry above or below grade, with\nfloor levels no higher than the building entrance: six feet into front\nand rear yards, three feet into side yards and no closer than five\nfeet to any side lot line.[Amended 8-12-2003]"
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "Chimneys: 18 inches."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": " Exceptions to yard requirements. The following features,\nwhere permitted, may be located in any yard:[Added 2-14-1995[1]]"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Signs."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Gas pumps."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Light, utility and flag poles."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "Landscape features, such as but not necessarily limited\nto fountains and sculpture."
												}
											]
										}
									]
								},
								{
									"footnote": "[1]\nEditor's Note: This resolution also provided for the relettering of former Subsections C, D, E and F as Subsections D, E, F and G, respectively. \n"
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "Fences and walls."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "The yard requirements of this chapter shall not be deemed to prohibit any otherwise lawful fence or wall, except as specified in Subsection E. In any residential district, no fence or wall shall exceed six feet in height in any front or side yard nor eight feet in height in any rear yard. In any residential district, the finished side of a fence shall face adjoining property, and all exposed stands and braces shall face the interior property. In any residential district fencing around tennis courts shall not exceed 10 feet in height. In any commercial or industrial district the height of a fence or wall shall not exceed six feet in height in any front or side yard nor eight feet in height in any rear yard unless otherwise approved by the Planning Board on a site development plan.[Amended 2-14-1995; 8-12-2003]"
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Any proposed retaining wall with an exposed face greater\nthan four feet in height and any proposed impervious surfaces within\n20 feet of a lot line must be approved by the Town Engineer or his\ndesignated representative for drainage adequacy."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "In any zoning district when a fence is placed on top\nof a wall, the height of the wall is to be considered when calculating\nthe height of a fence placed on top of it, where either the fence\nor the wall are within five feet of a property line and where the\nfence and the wall are within three feet of each other.[Added 8-12-2003]"
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "Obstruction to vision at street intersections. At\nall street intersections in all districts, no obstructions to motorist\nvision exceeding three feet in height above street pavement level\nshall be erected or maintained on any lot within the triangle formed\nby the street lines of such lot and a line drawn between points along\nsuch street line 30 feet distant from their point of intersection."
								}
							]
						},
						{
							"number": "F. ",
							"content": [
								{
									"text": "Exception to maximum height limitations."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Buildings owned and occupied by and devoted exclusively\nfor use by government or government agencies and public schools may\nbe erected to a height not exceeding 75 feet, provided that the front,\nrear and side yards shall each be increased one foot for each one\nfoot by which such building exceeds the height limit established for\nthe district in which the building is located."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "The height limitations of this chapter shall not apply\nto chimneys constructed in accordance with the New York State Uniform\nCode nor to elements located on roofs, including roof antennas, towers,\ngables, scenery lofts, cupolas, water tanks, necessary mechanical\nequipment and similar structures not for human occupancy, provided\nthat none of the aforementioned structures shall cover at any level\nmore than 25% of the area of the roof on which they are located, and\nfurther provided that no such structure shall be used for human occupancy."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "G. ",
							"content": [
								{
									"text": "Additional density and site design standards for land\nto be subdivided."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Additional density standards for lots to be created\nby subdivision."
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "Purpose. The way in which presently undeveloped acreage in the Town is developed is of critical importance to the public interest. The dimensional standards for lot areas contained in § 307-17 of this chapter are minimum standards, in some cases reflecting dimensions that were established by platting in the first half of the twentieth century when there was no Planning Board, subdivision regulations, zoning ordinance or other comprehensive review of land use development. Recent experience has shown that lots created by Planning Board subdivision approval frequently have exceeded the minimum standards due to the nature of the topography and geology of the Town, particularly in areas where there are environmentally sensitive lands. This subsection supplements the minimum standards with standards for land to be subdivided which take into account the Town's environmentally sensitive lands, which include wetlands, floodplains and steep slopes. It is the purpose of this subsection to maintain and protect environmentally sensitive lands in order to ensure the public health, safety and welfare of present and future residents of the Town of Cortlandt by reducing the potential amount of development on vacant parcels with steep slopes, wetlands and floodplains. Standards for development of environmentally sensitive areas where development cannot be avoided altogether are established in other ordinances of the Town of Cortlandt."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "Construction. Activities within wetlands, water\nbodies and watercourses, areas of special flood hazard and steep slopes\nshall be subject to the provisions of Local Law No. 3-1987, the Wetlands,\nWater Bodies and Watercourses Law, Local Law No. 4-1987, the Flood\nDamage Prevention Law, and Local Law No. 1-1992, the Steep Slopes\nProtection Law, of the Town of Cortlandt Code.[2]"
																},
																{
																	"footnote": "[2]\nEditor's Note: See, respectively, Ch. 179, Freshwater Wetlands, Water Bodies and Watercourses; Ch. 175, Flood Damage Prevention; and Ch. 259, Steeps Slopes.\n"
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "Standards for lot count. For all major subdivision\napplications, the maximum number of lots or dwelling units (N) which\nthe Planning Board may approve for land to be subdivided shall be\nthe whole number (all fractions excluded) which results from the following\ncalculation:[Amended 9-14-2004]"
																}
															]
														},
														{
															"number": "(d) ",
															"content": [
																{
																	"text": "Procedures for steep slope delineations. The\nprocedure to be utilized in quantifying the areas of steep slope for\nthe purpose of determining the number of lots or units as specified\nin Subsection F(1)(c) shall be as follows:"
																},
																{
																	"content": [
																		{
																			"number": "[1] ",
																			"content": [
																				{
																					"text": "Scale of map shall be either one inch equals\n50 feet or one inch equals 100 feet with a two-foot contour interval."
																				}
																			]
																		},
																		{
																			"number": "[2] ",
																			"content": [
																				{
																					"text": "All areas of steep slopes shall be shown on\nthe Lot Count Map. Areas of steep slopes used in lot count calculations\nand inclusions of 20% or less, too small to be excluded, shall be\nclearly differentiated from steeply sloping land which has not been\nincluded. Determination for inclusion in lot count calculations shall\nbe made by applying the guidelines in Subsection F(1)(d)[8] and [9]\nbelow."
																				}
																			]
																		},
																		{
																			"number": "[3] ",
																			"content": [
																				{
																					"text": "Calculations pursuant to the formula contained\nin Subsection F(1)(c) shall be included on the Lot Count Map."
																				}
																			]
																		},
																		{
																			"number": "[4] ",
																			"content": [
																				{
																					"text": "Sources of all topographic and other survey\ndata shall be identified on the Lot Count Map."
																				}
																			]
																		},
																		{
																			"number": "[5] ",
																			"content": [
																				{
																					"text": "The Lot Count Map, including all steep slope\nquantifications and calculations, shall be sealed by either a licensed\nprofessional engineer, licensed surveyor, licensed landscape architect\nor registered architect."
																				}
																			]
																		},
																		{
																			"number": "[6] ",
																			"content": [
																				{
																					"text": "The original Mylar(s) or other dimensionally\nstable transparency and a minimum of two copies of the original Lot\nCount Map shall be submitted to the Department of Planning and Community\nImprovement."
																				}
																			]
																		},
																		{
																			"number": "[7] ",
																			"content": [
																				{
																					"text": "Steep slopes shall be determined by measuring\nat right angles to contour lines. Whenever the distance between two\nadjacent contour lines is less than 10 feet, such area shall be shaded\nas steep slope on the worksheet maps. Limits of steeply sloping land\nshall be shown as a curvilinear line smoothly transitioning between\npoints. Allowances shall be made for the continuation of steeply sloping\nland at the top and bottom of such slopes. These methods are illustrated\nbelow in Figure 1."
																				}
																			]
																		},
																		{
																			"number": "[8] ",
																			"content": [
																				{
																					"text": "On the Lot Count Map and in the lot count calculations,\nan area of less than 25% slope located within an area which generally\nis a steep slope area shall be included as a part of such steep slope\narea, unless it is large enough to contain a fifty-foot-diameter circle\nas shown in Figure 2."
																				}
																			]
																		},
																		{
																			"number": "[9] ",
																			"content": [
																				{
																					"text": "On the Lot Count Map and in the lot count calculations,\nthe minimum area to be considered a steep slope area shall be large\nenough to contain a fifty-foot-diameter circle as shown in Figure\n3. When applying this guideline, steep slope areas continuing offside\nor into wetlands shall be considered."
																				}
																			]
																		},
																		{
																			"number": "[10] ",
																			"content": [
																				{
																					"text": "Topographic mapping."
																				},
																				{
																					"content": [
																						{
																							"number": "[a] ",
																							"content": [
																								{
																									"text": "All topographic mapping used for\nlot count calculations shall be in the National Geodetic Vertical\nDatum (NGVD) of 1929. At least three recently established or recently\nrecovered bench marks shall be properly plotted on the same, together\nwith their complete descriptions and elevations. These bench marks\nshall be readily accessible and located either on the subject parcel\nor in nearby public rights-of-way. They shall be geographically distributed\nso as to make their use generally convenient."
																								}
																							]
																						},
																						{
																							"number": "[b] ",
																							"content": [
																								{
																									"text": "The boundary (property line) of\nthe subject parcel shall be clearly marked on the topographic map(s)\nand complete metes and bounds information provided, together with\na printout or list of coordinates to permit random mathematical scale\nchecks. These scale checks will be used to prorate areas by the appropriate\nsquared scale factor."
																								}
																							]
																						},
																						{
																							"number": "[c] ",
																							"content": [
																								{
																									"text": "Photogrammetry used for this purpose\nshall be compiled to national map accuracy standards from current\naerial photography. All areas of dense foliage shall be clearly identified,\nand contours in these areas shall be verified by direct field work,\notherwise these areas shall be considered steep slope areas."
																								}
																							]
																						}
																					]
																				}
																			]
																		}
																	]
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "As determined by the Planning Board, the recreation\narea requirement shall be satisfied by either:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "A reduction of N in the calculations in this\nsubsection by 10% and a designation of at least one acre of land for\nevery 20 dwelling units for active recreation;"
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "Payment of an in-lieu-of-recreation-area fee at a rate per dwelling unit as required per building lot in Chapter 265, Subdivision of Land, of the Town of Cortlandt Code; or"
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "A combination of a reduction of N in the calculations\nin this subsection and the designation and development of active recreation\nfacilities that would be commensurate with alternatives in Subsection\nF(2)(a) and (b)."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Calculations."
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "For purposes of the calculations in this subsection,\nif a parcel falls in more than one zoning district, zoning district\nlines shall be treated as hypothetical lot lines, and separate calculations\nshall be made for each portion of the parcel so divided by zoning\ndistrict lines."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "For purposes of the calculations in this subsection,\nareas falling under more than one category to be subtracted from the\ngross parcel area shall be subtracted only once."
																}
															]
														}
													]
												}
											]
										}
									]
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 307-19",
			"title": "Cluster development.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Purpose. The purpose of a cluster development shall\nbe to enable and encourage flexibility of design and development of\nland in such a manner as to preserve the natural and scenic qualities\nof open lands."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Authorization required."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "The Town Board may at the request of a property owner or at the request of the Planning Board, authorize the Planning Board to approve a cluster development simultaneously with the approval of a plat or plats pursuant to §§ 276, 277 and 278 of the New York State Town Law and pursuant to Chapter 265, Subdivision of Land, of the Town of Cortlandt Code."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Cluster development may be allowed in any R Zoning\nDistrict or any CC Zoning Districts."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Unless otherwise stated in their resolution, Town\nBoard authorizations for cluster development shall be valid for two\nyears from the adoption date of such resolution to obtain preliminary\napproval."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Conditions."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "This procedure may be followed at the discretion of\nthe Planning Board if, in the Planning Board's judgment, its application\nwould benefit the Town. In granting such authorization to the Planning\nBoard, the Town Board may also authorize the Planning Board to require\nthe owner to submit an application for cluster development subject\nto the standards contained herein."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "A cluster development shall result in a permitted number of building lots or dwelling units which shall in no case exceed the number which could be permitted, in the Planning Board's judgment, if the land were subdivided into lots conforming to the minimum lot size and density requirements of the zoning ordinance applicable to the zoning district in which such land is situated ana conforming to all other applicable requirements, including but not necessarily limited to the additional density and site design standards contained in § 307-18G above and to the provisions of the New York State Environmental Quality Review Act."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Where the plat falls within two or more districts,\nthe Planning Board may approve a cluster development representing\nthe cumulative density as derived from the summing of all units allowed\nin all such districts and may authorize actual construction to take\nplace in all or any portion or one or more of such districts."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "The Planning Board, as a condition of plat approval,\nmay establish such conditions on the ownership, use and maintenance\nof such open lands shown on the plat as it deems necessary to assure\nthe preservation of the natural and scenic qualities of such open\nlands. The Town Board may require that such conditions shall be approved\nby the Town Board before the plat may be approved for filing."
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "The plat showing such cluster development may include\nareas within which structures may be located, the height and spacing\nof buildings, open spaces, streets, driveways and any other features\nrequired by the Planning Board. In the case of a residential plat\nor plats, the dwelling units permitted may be, at the discretion of\nthe Planning Board, in detached, semidetached, attached or multistory\nstructures."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "Application, notice and public hearing. An application for cluster development shall be submitted to the Planning Board and acted on in the same manner as required for subdivision plans under Chapter 265, Subdivision of Land, of the Town of Cortlandt Code. The proposed development shall be subject to review at a public hearing or hearings held pursuant to § 276 of the New York State Town Law, and Chapter 265 of the Town Of Cortlandt Code for the approval of plats."
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "Filing of plat. On the filing of the plat in the office\nof the County Clerk, a copy shall be filed with the Town Clerk, who\nshall make appropriate notations and references thereto on the Town\nZoning Map required to be maintained pursuant to § 264 of\nthe New York State Town Law."
								}
							]
						},
						{
							"number": "F. ",
							"content": [
								{
									"text": "Effect. The provisions of this section shall not be\ndeemed to authorize a change in the permissible use of such lands\nas provided in the zoning ordinance or local law applicable to such\nlands."
								}
							]
						},
						{
							"number": "G. ",
							"content": [
								{
									"text": "Perimeter setbacks."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "With respect to land to be subdivided pursuant to\n§ 278 of the New York State Town Law, the minimum building\nsetback from the perimeter property lines of the parcel to be subdivided\nshall be according to the following schedule:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "One-family dwellings and permitted accessory\nbuildings: the same as required in the zoning district in which they\nare located."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "Two- three- and four-family dwellings: twice\nas required for a one-family dwelling in the zoning district in which\nthey are located, to a maximum of 75 feet."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "Multifamily dwellings (five or more dwelling\nunits): 75 feet."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Accessory buildings, except those accessory to a one-family\ndwelling, shall not be located in the perimeter setback areas required\nunder this subsection."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "H. ",
							"content": [
								{
									"text": "With respect to land to be subdivided pursuant to\n§ 278 of the New York State Town Law, accessory vehicle\nparking, except that accessory to a one-family dwelling, shall not\nbe located within 20 feet of the perimeter property lines."
								}
							]
						},
						{
							"number": "I. ",
							"content": [
								{
									"text": "Building height. Unless otherwise specified in a delegation\nof authority to the Planning Board pursuant to § 278 of\nthe New York State Town Law, the maximum height of buildings shall\nbe as permitted in the zoning district in which they are located."
								}
							]
						},
						{
							"number": "J. ",
							"content": [
								{
									"text": "Parking spaces. With respect to land to be subdivided\npursuant to § 278 of the New York State Town Law, off-street\nparking spaces shall be provided at a ratio of 2.0 parking spaces\nper dwelling unit or greater. Off-street spaces may be located within\na building or outdoors."
								}
							]
						}
					]
				}
			]
		}
	]
}