{
	"url": "http://ecode360.com/11803418",
	"paras": [
		{
			"paragraph": "§ 60-410",
			"title": "District regulations.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Schedule of regulations for residence districts. (See accompanying\nschedule which is made part hereof.)[1]"
								},
								{
                					"content": [
                						{
                							"number": "A. ",
                							"content": [
                								{
                									"text": "Lot Area: 21,780"
                								}
                							]
                						},
                						{
                							"number": "B. ",
                							"content": [
                								{
                									"text": "Lot Width(feet): 100"
                								}
                							]
                						},
                						{
                							"number": "C. ",
                							"content": [
                								{
                									"text": "Lot Depth(feet): 100"
                								}
                							]
                						},
                						{
                							"number": "D. ",
                							"content": [
                								{
                									"text": "Minimum Yards(feet) Front: 50"
                								}
                							]
                						},
                						{
                							"number": "E. ",
                							"content": [
                								{
                									"text": "Minimum Yards(feet) Side/Total Both Sides: 20/50"
                								}
                							]
                						},
                						{
                							"number": "F. ",
                							"content": [
                								{
                									"text": "Minimum Yards(feet) Rear: 40"
                								}
                							]
                						},
                						{
                							"number": "G. ",
                							"content": [
                								{
                									"text": "Height(stories/feet): 2/35"
                								}
                							]
                						},
                						{
                							"number": "H. ",
                							"content": [
                								{
                									"text": "Height of Accessory Building(stories/feet): 2/35"
                								}
                							]
                						},
                						{
                							"number": "I. ",
                							"content": [
                								{
                									"text": "Minimum Floor Area(square feet): 1,250"
                								}
                							]
                						},
                						{
                							"number": "J. ",
                							"content": [
                								{
                									"text": "Maximum Builing Coverage: See § 60-420A(7) (a)"
                								}
                							]
                						},
                						{
                							"number": "K. ",
                							"content": [
                								{
                									"text": "Maximum Floor Area: See § 60- 420A(8)"
                								}
                							]
                						}
                					]
                				},
								{
									"footnote": "[1]\nEditor's Note: The schedule is included as an attachment\nto this chapter.\n"
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Schedule of regulations for business and industrial districts. (See\naccompanying schedule which is made part hereof.)[2]"
								},
								{
									"footnote": "[2]\nEditor's Note: The schedule is included as an attachment\nto this chapter.\n"
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Schedule of supplementary regulations for business and industrial\ndistricts. (See accompanying schedule which is made part hereof.)[3][Added 12-14-2004 by L.L. No. 12-2004]"
								},
								{
									"footnote": "[3]\nEditor's Note: The schedule is included as an attachment\nto this chapter.\n"
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "Sign regulations. The purpose of this subsection is to establish\nreasonable regulations for the design, construction, installation\nand maintenance of signs in the Town of New Castle in order to:[Amended 6-28-1977 by L.L. No. 9-1977; 8-13-1985 by L.L. No.\n11-1985; 10-14-1997 by L.L. No. 18-1997]"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Balance\nthe right of individuals to identify their businesses and convey their\nmessages and the right of the public to be protected against the unrestricted\nproliferation of signs;"
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Further\nthe objectives of the Comprehensive Plan;"
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Protect\nthe public health, safety and welfare;"
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "Reduce\ntraffic hazards;"
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "Maintain\nand enhance the aesthetic environment and facilitate the creation\nof an attractive and harmonious community;"
												}
											]
										},
										{
											"number": "(6) ",
											"content": [
												{
													"text": "Protect\nproperty values;"
												}
											]
										},
										{
											"number": "(7) ",
											"content": [
												{
													"text": "Promote\neconomic development; and"
												}
											]
										},
										{
											"number": "(8) ",
											"content": [
												{
													"text": "Preserve\nthe right of free speech exercised through the use of signs containing\nnoncommercial messages."
												}
											]
										},
										{
											"number": "(9) ",
											"content": [
												{
													"text": "Applicability. Except as otherwise provided in this chapter, no sign\nshall be erected, installed, displayed, used, maintained, repaired,\naltered, reconstructed, replaced, moved or relocated on private property\nwithin the Town of New Castle except in conformity with and as expressly\nauthorized by the provisions of this chapter."
												}
											]
										},
										{
											"number": "(10) ",
											"content": [
												{
													"text": "Exempt signs. In the interest of promoting the public health,\nsafety and general welfare, the following signs shall be exempt from\nregulation under this chapter, subject to compliance with the standards\nspecified below:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "Any public notice or warning required by a valid and applicable\nfederal, state, county, Town or school district law, regulation or\nordinance; informational signs of a public utility regarding its poles,\nlines, pipes or facilities; and signs erected by or on behalf of a\npublic transit company to identify the location of bus stops and train\nstations as well as related route and schedule information."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "Property identification signs containing street address numbers,\nnot exceeding six inches in height and attached to a building or post\nlocated on private property behind the lot line."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "In a residence district, one sign identifying the sale, lease\nor rental of property on which it is located, not exceeding one square\nfoot in area, containing no illumination and located behind the lot\nline of such property so as to not obstruct vehicular sight lines\nfor passing drivers. In a business or industrial district, one sign\nfor each street frontage, not to exceed two such signs, identifying\nthe sale, lease or rental of property on which it is located, not\nexceeding 12 square feet in area for each sign, containing no illumination\nand located behind the lot line of such property so as to not obstruct\nvehicular sight lines for passing drivers."
																}
															]
														},
														{
															"number": "(d) ",
															"content": [
																{
																	"text": "One temporary contractor's identification sign on the property\non which such contractor is working for each such contractor, not\nexceeding two square feet in area, containing no illumination, located\nbehind the lot line of such property so as to not obscure vehicular\nsight lines for passing drivers and to remain only during the course\nof construction or repair on such property."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(11) ",
											"content": [
												{
													"text": "Prohibited signs.[Amended 11-9-2004 by L.L. No. 11-2004]"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "All signs not expressly permitted under this chapter, or exempt from regulation in accordance with § 60-410D(10) herein, are prohibited."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "Prohibited signs shall include, but are not limited to, neon\nsigns of any kind; except that a neon sign that was in actual use\non November 1, 2004 (\"permitted neon sign\") may continue to be used,\nand any permitted neon sign may be repaired or replaced so long as\nthe repaired or replacement sign is a duplicate of that which was\nin actual use on November 1, 2004."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(12) ",
											"content": [
												{
													"text": "Signs permitted in residence districts."
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "The following signs are permitted in residence districts:"
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "Where more than one residential sign is proposed for a single\nproperty, the total area of all such shall not exceed 10 square feet\nfor each detached principal dwelling unit on lots of one acre or greater\nand five square feet for each detached principal dwelling unit on\nlots of less than one acre or for each attached dwelling unit or multifamily\ndwelling unit."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(13) ",
											"content": [
												{
													"text": "Signs permitted in business and industrial districts."
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "The following signs are permitted in business and industrial districts, subject to the additional provisions set forth in § 60-410B of this chapter:"
																},
																{
																	"footnote": "[4]\nEditor's Note: This local law also renumbered former\nsubsections (f), (g) and (h) as (g), (h) and (i), respectively.\n"
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "Where more than one sign type is proposed for a single use, the total (aggregated) sign area of all such signs, as set forth in § 60-410D(14)(d) herein, shall not exceed 200%."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(14) ",
											"content": [
												{
													"text": "Sign computations."
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "The area of an individual sign face shall be determined by the\nsmallest circle or polygon that can be drawn to include all lettering,\nsymbols, accompanying designs, framing and background coloring that\ndifferentiates the sign from the structure to which it is attached,\nexcept that the structural supports and braces for a freestanding\nsign or a bracket sign shall not be included in determining sign area\nunless such structural supports constitute an integral part of the\nsign's aesthetic design. In the case of a sidewalk sign, the\narea of such sign face shall be determined by including the frame,\neasel and any or other method of displaying on supporting such sidewalk\nsign.[Amended 7-13-2004 by L.L. No. 6-2004]"
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "The sign area for a sign with more than one face shall be computed\nby adding together the area of all sign faces visible from any one\npoint. However, notwithstanding the above, when two sign faces are\nplaced back-to-back more than two feet apart, each sign face shall\nconstitute an individual sign."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "The height of a sign shall be computed as the distance from\nthe base of the sign at normal grade to the top of the highest attached\ncomponent of the sign. As applied to signage regulated under this\nchapter, normal grade shall be the lower of one of the following:"
																},
																{
																	"content": [
																		{
																			"number": "[1] ",
																			"content": [
																				{
																					"text": "The existing grade prior to construction; or"
																				}
																			]
																		},
																		{
																			"number": "[2] ",
																			"content": [
																				{
																					"text": "The newly established grade after construction, exclusive of\nany filling, berming, mounding or excavating undertaken solely for\nthe purpose of locating the sign."
																				}
																			]
																		}
																	]
																}
															]
														},
														{
															"number": "(d) ",
															"content": [
																{
																	"text": "The total (aggregated) sign area shall be computed by first calculating the sign area, as set forth in § 60-410D(14)(a) and (b) herein, of each existing and proposed sign for a single use, and comparing the area calculated for each sign to the maximum sign area permitted for that sign type in the zoning district in which such use is located or is proposed to be located. The calculated sign area of each existing and proposed sign shall be expressed as a percentage (1% to 100%) of the maximum sign area permitted for that sign type in the zoning district in which such use is located or proposed to be located. The sum of the individual percentages computed for each existing and proposed sign shall be defined as the total (aggregated) sign area for such use."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(15) ",
											"content": [
												{
													"text": "General provisions."
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "Location."
																},
																{
																	"content": [
																		{
																			"number": "[1] ",
																			"content": [
																				{
																					"text": "No sign shall hang or project over, or be placed upon, a public right-of-way, except as set forth in § 60-410D(10) herein."
																				}
																			]
																		},
																		{
																			"number": "[2] ",
																			"content": [
																				{
																					"text": "All signs on private property shall be located so as to not\ninterfere with the vision of a driver entering or leaving the property\non which they are located, or interfere with visibility at an intersection\nor traffic light."
																				}
																			]
																		},
																		{
																			"number": "[3] ",
																			"content": [
																				{
																					"text": "No sign shall be located on any exterior building wall so as\nto project above the top of such wall at the location of the sign\nor project beyond the ends of the wall to which it is attached."
																				}
																			]
																		}
																	]
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "Illumination. Where illumination of signage is permitted under § 60-410D(12) and (13) herein, such illumination shall comply with the following requirements:"
																},
																{
																	"content": [
																		{
																			"number": "[1] ",
																			"content": [
																				{
																					"text": "Illumination shall be confined to, or directed to, the surface\nof the sign."
																				}
																			]
																		},
																		{
																			"number": "[2] ",
																			"content": [
																				{
																					"text": "No flashing, rotating or intermittent illumination shall be\npermitted."
																				}
																			]
																		},
																		{
																			"number": "[3] ",
																			"content": [
																				{
																					"text": "The sign, including its lighting sources, shall be designed\nand shielded so that the light sources cannot be seen from any neighboring\nresidence district or from the street."
																				}
																			]
																		},
																		{
																			"number": "[4] ",
																			"content": [
																				{
																					"text": "Interior illumination of a sign shall not be permitted unless\nsuch illumination is confined to the sign's lettering and/or\nsymbols, except that the illumination of the background area of a\nsign with interior illumination may be permitted, provided that the\napplicant can demonstrate to the satisfaction of the approving authority\nthat such lighting will not result in a level of illumination or glare\nsuch that the sign may cause a distraction to motorists or negatively\nimpact surrounding properties. Where interior illumination of a sign's\nbackground materials is sought, the applicant shall bear the burden\nof proof of demonstrating compliance with the above standards."
																				}
																			]
																		},
																		{
																			"number": "[5] ",
																			"content": [
																				{
																					"text": "Illumination of signage regulated under § 60-410D(13) herein shall be limited to not later than 10:00 p.m. or the close of business for the establishment displaying the illuminated signage, whichever is later."
																				}
																			]
																		}
																	]
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "Design, construction and maintenance."
																},
																{
																	"content": [
																		{
																			"number": "[1] ",
																			"content": [
																				{
																					"text": "All signs shall comply at all times with applicable provisions\nof the New York State Uniform Fire Prevention and Building Code and\nthe electrical code of the Town of New Castle."
																				}
																			]
																		},
																		{
																			"number": "[2] ",
																			"content": [
																				{
																					"text": "Except for window signs conforming in all respects with the provisions of § 60-410D and sidewalk signs conforming in all respects with the provisions of § 60-410D(13)(a)(f), all signs shall be constructed of permanent materials and shall be permanently attached to the ground, a building or another structure by direct attachment to a rigid wall, frame or structure.[Amended 7-13-2004 by L.L. No. 6-0004]"
																				}
																			]
																		},
																		{
																			"number": "[3] ",
																			"content": [
																				{
																					"text": "All signs shall be maintained in good structural condition and\nfree from all hazards, in compliance with all applicable building\nand electrical codes and in conformance with all applicable provisions\nof this chapter."
																				}
																			]
																		},
																		{
																			"number": "[4] ",
																			"content": [
																				{
																					"text": "All signs shall be maintained at all times in a safe and attractive\ncondition so as not to be detrimental to the public health, safety\nand welfare."
																				}
																			]
																		}
																	]
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(16) ",
											"content": [
												{
													"text": "Existing signs."
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "Except as set forth below, no other provisions of this chapter shall require the removal of any existing sign that was erected prior to the effective date of § 60-410D, and which conformed in all respects to the requirements then in effect and which has a sign permit, provided that such sign is not modified or relocated after the effective date of § 60-410D."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "Any existing sign that was erected prior to the effective date of § 60-410D and which does not have a sign permit shall be removed or brought into conformance with the provisions of this chapter at the time of any proposed change to the site or within 180 days after the effective date of § 60-410D, whichever date is sooner."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "Existing signs having a sign permit may be maintained and/or repaired by repainting, identical replacement of lettering, wording and accompanying symbols, reinforcement of the structural supports or replacement of electrical wiring. Such maintenance and/or repair shall not be considered a modification requiring compliance with § 60-410D(17) herein. Any modification to an existing sign that alters its appearance or structural design, including but not limited to a change in the dimensions, location, height or illumination, shall require that all applicable permitting procedures of § 60-410D be followed. As used herein, the term \"modification\" shall not include a change in lettering, symbols, coloring or other design features of an existing sign, provided that such change does not alter any other characteristic of the sign's appearance or its structural design."
																}
															]
														},
														{
															"number": "(d) ",
															"content": [
																{
																	"text": "Any existing sign removed for purposes other than routine maintenance and/or repair activities, as set forth in § 60-410D(16)(c) herein, after the effective date of § 60-410D shall be deemed to be permanently removed and shall be replaced only in accordance with all applicable provisions of § 60-410D."
																}
															]
														},
														{
															"number": "(e) ",
															"content": [
																{
																	"text": "Any sign that concerns a use that is no longer in existence\non the property on which such sign is located shall be removed by\nthe property owner, or his authorized agent, within 30 days after\nthe use vacates the premises."
																}
															]
														},
														{
															"number": "(f) ",
															"content": [
																{
																	"text": "Where additional signage is proposed for any use, all existing signage having a sign permit shall be permitted to remain; provided, however, that any proposed signs shall be required to comply with all applicable provisions of § 60-410D, including but not limited to total (aggregated) sign area requirements."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(17) ",
											"content": [
												{
													"text": "Approval required.[Amended 11-22-2011 by L.L. No. 15-2011]"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "It shall be unlawful for any person to erect, install, display, use, alter, reconstruct, replace, move or relocate any sign for which a sign permit is required in accordance with § 60-410D(12) and (13) herein without having first obtained and paid for, and having in force and effect, a sign permit therefor in accordance with the provisions of § 60-410D(18) and (19) herein and a building permit therefor in accordance with the provisions of Chapter 48 of the Code of the Town of New Castle."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "It shall be unlawful for any person to erect, install, display, use, reconstruct, replace, move or relocate any nonilluminated wall sign for which Town Building Department approval is required in accordance with § 60-410D(18)(c) herein without having first obtained and paid for, and having in force and effect, a building permit therefor in accordance with the provisions of Chapter 48 of the Code of the Town of New Castle."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "No sign permit or building permit shall be issued for any existing or proposed sign unless such sign is in conformance with the requirements of this chapter and Chapter 48 of the Code of the Town of New Castle."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(18) ",
											"content": [
												{
													"text": "Approving authority."
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "Except as provided for in § 60-410D(18)(b) and (c) herein, the Board of Architectural Review shall be the approving authority for all applications for a sign permit, including but not limited to any application for amended sign permit approval for a sign over which the Planning Board had jurisdiction prior to the effective date of § 60-410D."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "Where the initial placement or relocation of a freestanding sign, as described in § 60-410D(12) or (13) herein, is proposed, the approving authority for the sign permit shall be the Planning Board. Each application for a sign permit for a freestanding sign, together with all accompanying submissions, shall be referred to the Board of Architectural Review for report and recommendation on the architectural features of the proposed freestanding sign in accordance with the purposes and criteria as set forth in § 60-550 of this chapter, which report shall be rendered within 45 days of the date of such referral."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "Where the erection of a nonilluminated wall sign is proposed\nin a business or industrial district for display by an establishment\nthat will have no other existing signs on display at the same time\nand/or as a replacement for an existing wall sign, the approving authority\nfor such nonilluminated wall sign shall be the Town Building Department\nand no review by the Board of Architectural Review shall be required."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(19) ",
											"content": [
												{
													"text": "Application requirements."
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "Any person desiring to secure a sign permit in accordance with the provisions of § 60-410D shall submit an application for a sign permit on forms furnished by the Town Building Department. The application and documents accompanying the application as set forth in Subsection D(19)(b) and (c) of this section shall also be submitted in an electronic file format.[Amended 3-27-2012 by L.L. No. 1-2012]"
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "An application for a sign permit for a nonilluminated wall sign as described in § 60-410D(13)(a) herein shall also be accompanied by the following:"
																},
																{
																	"content": [
																		{
																			"number": "[1] ",
																			"content": [
																				{
																					"text": "Drawing identifying the building and the unit of occupancy within\nthe building to which any building-mounted sign applies; whether existing\nsigns are to remain or be removed; the name of the application or\nother identifying title; the name, address and telephone number of\nthe person who prepared the drawing; and the date of the original\nsubmission and all revisions, with notations identifying the revisions."
																				}
																			]
																		},
																		{
																			"number": "[2] ",
																			"content": [
																				{
																					"text": "Elevation, color rendering and specifications for the proposed\nsign; its vertical, horizontal and depth dimensions; its projection\nfrom the building; total exterior wall length for the unit of occupancy\nfor which the sign is proposed; and lettering, wording and symbols;\ncolors, texture and materials."
																				}
																			]
																		},
																		{
																			"number": "[3] ",
																			"content": [
																				{
																					"text": "Application fee."
																				}
																			]
																		}
																	]
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "An application for a sign permit for any other type of sign\nshall also be accompanied by the following:"
																},
																{
																	"content": [
																		{
																			"number": "[1] ",
																			"content": [
																				{
																					"text": "Drawing of the entire site, prepared at a scale of not less than one inch equals forty feet, identifying the location of all existing and proposed signage and other structures, parking areas, vehicular and pedestrian circulation areas; the setback from any freestanding sign to the lot line; lot area for any site used for residential purposes and total (aggregated) sign area for any other site; the unit of occupancy within a building to which any building-mounted sign applies; the square footage of any occupancies which are the subject of an application for a Type \"(d)\" sign permit as described in § 60-410D(13) herein; whether existing signs are to remain or be removed; the name of the application or other identifying title; the name, address and telephone number of the person who prepared the drawing; a vicinity map, at a convenient scale, showing the applicant's entire property in relation to surrounding properties, streets, etc., within 500 feet of the site; North arrow, written and graphic scales, and the date of the original submission and all revisions, with notations identifying the revisions."
																				}
																			]
																		},
																		{
																			"number": "[2] ",
																			"content": [
																				{
																					"text": "Elevations, artist's rendering and specifications for proposed\nsign(s) and any existing sign(s) which has not received a sign permit,\nindicating type of sign(s); its vertical, horizontal and depth dimensions;\nprojection above and from building (if applicable); height above ground\n(if applicable); clearance below sign (if applicable); total exterior\nwall length for any sign(s) proposed to be attached flush to the wall\nof a building (if applicable); lettering, wording and symbols; colors,\ntexture and materials; and details of illumination (if applicable)."
																				}
																			]
																		},
																		{
																			"number": "[3] ",
																			"content": [
																				{
																					"text": "Specifications for existing sign(s) to remain, indicating type\nof sign(s); its sign area; and location."
																				}
																			]
																		},
																		{
																			"number": "[4] ",
																			"content": [
																				{
																					"text": "Photographs indicating location(s) of existing sign(s) to remain\nand proposed sign(s) on the subject property."
																				}
																			]
																		},
																		{
																			"number": "[5] ",
																			"content": [
																				{
																					"text": "Color swatches and material samples for proposed signs."
																				}
																			]
																		},
																		{
																			"number": "[6] ",
																			"content": [
																				{
																					"text": "Application fee."
																				}
																			]
																		}
																	]
																}
															]
														}
													]
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "(Reserved)[5]"
								},
								{
									"footnote": "[5]\nEditor's Note: Former §§ 60-14.1, Sign\ntypes, and 60-14.2, Sign regulations, as amended, were repealed 10-14-1997\nby L.L. No. 18-1997.\n"
								}
							]
						},
						{
							"number": "F. ",
							"content": [
								{
									"text": "Public garages and gasoline filling stations. Public garages and\ngasoline filling stations shall be subject to the following special\nprovisions in regard to their location and design:[Amended 5-8-1984 by L.L. No. 4-1984]"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "No part of any vehicle entrance to or exit from any public garage\nor gasoline filling station shall be closer than 50 feet to the boundary\nline of any residential district."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "No part of any public garage or gasoline filling station and no gasoline\nor oil pump, car lift or other service appliance used to serve or\nsupply motor vehicles shall be erected within 25 feet of any boundary\nline of any residential district."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "No canopy or similar type of roof structure provided over fuel pumps\nshall be permitted within 50 feet of any public street or the boundary\nline of any residential district."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "G. ",
							"content": [
								{
									"text": "Professional offices and customary home occupations. A professional\noffice or customary home occupation may be established as an accessory\nuse in a dwelling in any residence district, provided that the following\nstandards and requirements are complied with:[Added 8-22-1978 by L.L. No. 5-1978]"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Any such use must be located entirely within the principal dwelling\nbuilding."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "The primary person or persons involved in such use must be inhabitants\nof the dwelling."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "No more than one nonresident partner, associate or employee shall\nbe permitted to work on the premises."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "No more than 1/4 of the floor area of one floor or 400 square feet,\nwhichever is less, shall be used for such purposes, except that the\nPlanning Board, in acting on the site plan for such accessory use,\nmay permit the use of a greater amount of floor space, provided that\nsaid Board determines that the nature of the use and the location\nof the site are such that there will be no conflict with the basic\npurpose and intent of this chapter."
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "If instruction is involved, it shall be limited to a single pupil\nat a time."
												}
											]
										},
										{
											"number": "(6) ",
											"content": [
												{
													"text": "No use shall be permitted which produces or emits beyond the boundaries\nof the property any hazard or nuisance, including, in particular,\nunusual noise, odor, radiation, light or radio or television interference,\nor which involves the treatment, care, experimentation with or breeding\nof animals."
												}
											]
										},
										{
											"number": "(7) ",
											"content": [
												{
													"text": "In acting on any site plan for such accessory uses, the Planning\nBoard may require such screening and limit the nature and hours of\noperation to the extent which it determines necessary to reasonably\nprotect the rights of neighboring property owners and to maintain\nthe residential character of the area."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "H. ",
							"content": [
								{
									"text": "Multifamily districts.[Added 10-29-1979 by L.L. No. 16-1979]"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "General purpose and intent. In order to provide suitable opportunities\nwithin the Town for the development of housing designed to satisfy\nthe needs of smaller households, particularly the young and the elderly,\nand of families of low/moderate income and to encourage a broad array\nof housing types, dwelling unit sizes and forms of ownership/occupancy,\nmultifamily zoning districts are hereby established. These districts\nare intended to encourage the construction of multifamily housing\non sites determined to be appropriate, based upon criteria established\nin the Town Plan and in conformance with the standards recommended\ntherein, which standards are designed to promote the public health,\nsafety and general welfare, and to encourage the development of housing\nwhich is responsive to the variety of special size, design, locational\nand economic needs of present and future residents of the Town and\nthe region."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Multifamily Residence District -- Chappaqua (MFR-C). It is the specific\npurpose and intent of the MFR-C District to provide the opportunity\nfor and encourage the development of energy efficient multifamily\nhousing in and adjacent to the business center of Chappaqua Hamlet\non sites served by public sewer and water and with the most convenient\naccess to shopping, mass transportation, major roads and other community\nfacilities and services. It is the Town's further objective that\nthe MFR-C District provide both the opportunity for and encourage\nthe construction of housing at relatively moderate prices. To help\nachieve these goals, the following specific standards are set forth\nfor this district:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "Density. The maximum permitted density within an MFR-C District shall be determined based upon the lot area, percentage of wetlands, waterbodies and watercourses as defined in Chapter 137, Wetlands, or Chapter 64, Environmental Protection Overlay Regulations, if the property is located within an Environmental Protection Overlay District, of the Code of the Town of New Castle, and the degree to which the proposed development is designed to achieve the planning and housing goals as set forth in this chapter and in the Town Plan.[Amended 7-23-2002 by L.L. No. 5-2002]"
																},
																{
																	"content": [
																		{
																			"number": "[1] ",
																			"content": [
																				{
																					"text": "Basic permitted density."
																				},
																				{
																					"content": [
																						{
																							"number": "[a] ",
																							"content": [
																								{
																									"text": "The basic multifamily density permitted by right in an MFR-C District, subject only to site plan approval by the Planning Board in accordance with § 60-440 of this chapter, and subdivision plat approval, if appropriate, shall be as follows:"
																								}
																							]
																						},
																						{
																							"number": "[b] ",
																							"content": [
																								{
																									"text": "The determination of dwelling unit size for the\npurpose of calculating the basic permitted density as described above\nshall in each case be made by the Planning Board, taking into consideration\nthe floor plans proposed by the applicant and such other information\nas said Board may determine appropriate."
																								}
																							]
																						},
																						{
																							"number": "[c] ",
																							"content": [
																								{
																									"text": "The area of any wetlands, water bodies or watercourses shall first be multiplied by a factor of 0.33 before being used in accordance with the preceding gross lot-area formula to calculate the basic permitted density on a proposed multifamily development site. All actual construction, however, shall be located on each site in accordance with the requirements of Chapter 137, Watercourses, and in consideration of the need to avoid or minimize adverse environmental impacts in accordance with SEQR requirements."
																								}
																							]
																						}
																					]
																				}
																			]
																		},
																		{
																			"number": "[2] ",
																			"content": [
																				{
																					"text": "Incentive density. Where an applicant for approval of a multifamily development within an MFR-C District agrees to provide certain special features, facilities and/or use restrictions of the types listed below and where the Planning Board determines that the provision of such will serve to further the purpose and intent of this chapter and of the Town Plan, the density within such development may be increased up to 100% beyond the basic permitted density or by so much thereof as determined appropriate by the Planning Board based upon a consideration of the number and combination of incentive features, facilities and/or use restrictions proposed, the need for them at that time, the nature and extent to which the applicant intends to provide them, the appropriateness of the location of the proposed site and the environmental suitability of the site and the proposed development design to accommodate such an increased density. In each such case the applicant must obtain a special use permit from the Planning Board pursuant to the relevant standards and requirements of § 60-430 of this chapter."
																				},
																				{
																					"content": [
																						{
																							"number": "[a] ",
																							"content": [
																								{
																									"text": "Nonwetlands areas. For that part of the basic permitted\ndensity attributable to the nonwetlands portion of any proposed multifamily\ndevelopment site, the types of special incentive features, facilities\nand/or use restrictions and the maximum permitted density increases\nwhich the Planning Board may grant for them are as follows:[Amended 8-9-2011 by L.L. No. 10-2011]"
																								},
																								{
																									"content": [
																										{
																											"number": "[i] ",
																											"content": [
																												{
																													"text": "Persons employed in the Town of New Castle;"
																												}
																											]
																										},
																										{
																											"number": "[ii] ",
																											"content": [
																												{
																													"text": "Residents of the Town of New Castle, in order of length of residence\nin the Town; and"
																												}
																											]
																										},
																										{
																											"number": "[iii] ",
																											"content": [
																												{
																													"text": "All others."
																												}
																											]
																										}
																									]
																								},
																								{
																									"footnote": "[6]\nEditor's Note: Former Item 10, which listed energy-efficient\ndesign features as an incentive feature, was repealed 12-10-1985 by\nL.L. No. 19-1985. Said local law also redesignated former Item 11\nas Item 10.\n"
																								}
																							]
																						},
																						{
																							"number": "[b] ",
																							"content": [
																								{
																									"text": "Wetland areas. Any incentive density increase in\nthe basic permitted density attributable to that portion of a site\nconsisting of wetlands, water bodies or watercourses shall be based\nupon consideration of the following incentive criteria by the Planning\nBoard, in lieu of those criteria set forth for nonwetland areas in\n§ 60-410H(2)(a)[2][a] above:"
																								},
																								{
																									"content": [
																										{
																											"number": "[i] ",
																											"content": [
																												{
																													"text": "The locational value of the wetland, water body\nor watercourse for buffer screening, open space or conservation purposes."
																												}
																											]
																										},
																										{
																											"number": "[ii] ",
																											"content": [
																												{
																													"text": "The importance of the environmental function(s)\nserved by the wetland, water body or watercourse and the extent to\nwhich such function will be preserved or enhanced as a part of the\nproposed site development plan."
																												}
																											]
																										},
																										{
																											"number": "[iii] ",
																											"content": [
																												{
																													"text": "The site design and functional relationship between\nthe wetland, water body or watercourse and the proposed multifamily\ndevelopment."
																												}
																											]
																										}
																									]
																								}
																							]
																						}
																					]
																				}
																			]
																		},
																		{
																			"number": "[3] ",
																			"content": [
																				{
																					"text": "Required model ordinance provisions affordable AFFH unit component.\nWithin all multifamily residential developments of at least five but\nless than 10 units in a MFR-C District, at least one of the units\nmust be created as a model ordinance provisions affordable AFFH unit,\nand within all multifamily residential developments of 10 or more\nunits within an MFR-C District, no less than 10% of the total number\nof units must be created as model ordinance provisions affordable\nAFFH units. No preferences shall be used to prioritize the selection\nof income-eligible tenants or purchasers of any model ordinance provisions\naffordable AFFH unit created under this section.[Added 8-9-2011 by L.L. No. 10-2011]"
																				}
																			]
																		}
																	]
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "Traffic access. Properties within an MFR-C District shall have\neither direct frontage on a major or collector road as shown on the\nTown Plan or safe and convenient access to such a road without passing\nthrough a one-family residence neighborhood."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "Utilities and services."
																},
																{
																	"content": [
																		{
																			"number": "[1] ",
																			"content": [
																				{
																					"text": "Water and sewer service. MFR-C Districts are intended to be\nestablished only on lands located within or adjacent to public water\nand sewer districts. If land in an MFR-C District is not presently\nwithin such utility district(s), the establishment of the zoning district\nshall be contingent upon the creation or expansion of such utility\ndistrict(s) to include the entire area of the lands so zoned. All\ndwelling units constructed in the MFR-C District shall be connected\nto public water and sewer systems in accordance with standards approved\nby the Town Engineer, the Westchester County Health Department and\nany other county, state or federal agencies having jurisdiction. All\ndwelling units shall be separately metered for water."
																				}
																			]
																		},
																		{
																			"number": "[2] ",
																			"content": [
																				{
																					"text": "Drainage. Stormwater drainage systems serving any multifamily\ndevelopment shall be designed so that the rate of runoff from the\nsite during a one-hundred-year storm will not exceed that which would\nhave occurred prior to its construction. The calculation of such runoff\nrate and the design of the drainage system shall be subject to the\napproval of the Town Engineer. The Planning Board may, based upon\nthe recommendation of the Town Engineer, waive or reduce this requirement\nwhere it is determined that, due to the nature or location of the\nproperty within its watershed, such a standard may be unnecessary\nor inappropriate.[Amended 3-27-1984 by L.L. No. 2-1984[7]]"
																				},
																				{
																					"footnote": "[7]\nEditor's Note: Said local law was readopted 7-31-1984.\n"
																				}
																			]
																		},
																		{
																			"number": "[3] ",
																			"content": [
																				{
																					"text": "Refuse storage and collection. Plans for the storage and collection\nof refuse within any multifamily development shall be subject to Planning\nBoard approval. The outside storage of refuse, if permitted, shall\nbe in rodentproof containers conveniently located and enclosed or\notherwise screened from view. Such facilities shall comply with all\nsetback requirements applicable to principal buildings."
																				}
																			]
																		},
																		{
																			"number": "[4] ",
																			"content": [
																				{
																					"text": "Underground utilities. All utilities within any multifamily\ndevelopment, including electric, telephone and cable television service,\nshall be placed underground."
																				}
																			]
																		},
																		{
																			"number": "[5] ",
																			"content": [
																				{
																					"text": "Fire protection. All site plans for multifamily development\nshall provide proper access for fire-fighting equipment and personnel\nand shall provide hydrants in such number and location and with such\nwater pressure as may be determined adequate and approved by the Planning\nBoard, based upon the recommendations of the Town Engineer and the\nFire Department having jurisdiction."
																				}
																			]
																		}
																	]
																}
															]
														},
														{
															"number": "(d) ",
															"content": [
																{
																	"text": "Coverage. The maximum permitted building coverage within an\nMFR-C District shall be 20%, and the maximum permitted development\ncoverage shall be 35%. Such coverage shall be calculated on the basis\nof nonwetland areas, plus 33% of any wetland areas on the site. Parking\nstructures located wholly underground shall be excluded for the purpose\nof these calculations.[Amended 5-23-1995 by L.L. No. 6-1995]"
																}
															]
														},
														{
															"number": "(e) ",
															"content": [
																{
																	"text": "Off-street parking. Off-street parking shall be provided in accordance with the standards and requirements of § 60-420F of this chapter. In addition, the following special standards shall apply in the MFR-C District:"
																},
																{
																	"content": [
																		{
																			"number": "[1] ",
																			"content": [
																				{
																					"text": "At least 1/3 but no more than 90% of the minimum number of required\nparking spaces shall be enclosed."
																				}
																			]
																		},
																		{
																			"number": "[2] ",
																			"content": [
																				{
																					"text": "No more than one of the minimum required parking spaces for\neach dwelling unit may be designed or reserved exclusively for the\nuse of the occupants of that unit."
																				}
																			]
																		},
																		{
																			"number": "[3] ",
																			"content": [
																				{
																					"text": "At least 20% of the minimum number of required parking spaces\nshall be designed and reserved for the use of visitors and guests."
																				}
																			]
																		}
																	]
																}
															]
														},
														{
															"number": "(f) ",
															"content": [
																{
																	"text": "Recreation and open space."
																},
																{
																	"content": [
																		{
																			"number": "[1] ",
																			"content": [
																				{
																					"text": "(Reserved)[8]"
																				},
																				{
																					"footnote": "[8]\nEditor's Note: Former § 60-417.261, Recreation\narea, as amended, was repealed 5-22-1990 by L.L. No. 26-1990.\n"
																				}
																			]
																		},
																		{
																			"number": "[2] ",
																			"content": [
																				{
																					"text": "Private outdoor space. Each individual multifamily dwelling\nunit shall, if practicable, be provided with a private outdoor space\nin the form of a patio, terrace, garden, courtyard, deck or balcony,\nwhich space shall be immediately adjoining and directly accessible\nto the dwelling unit which it serves."
																				}
																			]
																		},
																		{
																			"number": "[3] ",
																			"content": [
																				{
																					"text": "Other open spaces. All portions of any multifamily development\nwhich are not used for one or more of the purposes permitted above\nshall be designed and maintained as permanent open space, either to\nbe landscaped or preserved in its natural state, all in accordance\nwith plans approved by the Planning Board."
																				}
																			]
																		}
																	]
																}
															]
														},
														{
															"number": "(g) ",
															"content": [
																{
																	"text": "Other requirements."
																},
																{
																	"content": [
																		{
																			"number": "[1] ",
																			"content": [
																				{
																					"text": "Individual unit access. In general, each individual dwelling\nunit within any multifamily development shall have its own separate\nentrance/exit leading directly to the outside. The Planning Board\nmay waive this requirement as a part of site plan approval where said\nBoard determines that the basic intent of this requirement in terms\nof safety and the avoidance of common hallway areas can be met through\nother elements of the building design."
																				}
																			]
																		},
																		{
																			"number": "[2] ",
																			"content": [
																				{
																					"text": "Central antenna systems. If cable television service is not\navailable to serve a proposed multifamily development, a central exterior\nradio/television antenna system or earth station may be provided in\naccordance with plans approved by the Planning Board. Exterior antennas\nfor individual multifamily buildings or dwelling units shall not be\notherwise permitted.[Amended 12-29-1982 by L.L. No. 17-1982]"
																				}
																			]
																		}
																	]
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Multifamily Residence District -- Millwood (MFR-M). It is the specific purpose and intent of the MFR-M District to provide both the opportunity and encouragement for the development of moderately high-density, energy-efficient, multifamily housing in and around the center of the Millwood Hamlet on sites served by public or community sewer and water systems and with convenient access to shopping and major roads. It is the Town's further objective that the MFR-M District provide both the opportunity for and encourage the construction of housing at relatively moderate prices. To help achieve these goals, the standards for this District shall be the same as those set forth in Subsection H(2) above for the MFR-C District, except as modified below:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "Density. The permitted basic and incentive densities within\nan MFR-M District shall be calculated as in the MFR-C District, except\nthat they shall be based upon the following minimum lot area standards:"
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "Multifamily Planned Development District (MFPD). It is the specific\npurpose and intent of the MFPD District to provide the opportunity\nwithin the Town of New Castle for the development on a planned basis\nof medium-density multifamily housing on sites located in existing\nsingle-family residential neighborhoods but in reasonable proximity\nto shopping services and other community facilities and with access\nto major roads. To help assure the achievement of this goal with proper\nprotection for existing neighboring development, all future MFPD Districts\nwhich have not already been designated on the Town Zoning Map shall\nbe established on a floating.zone basis, subject to approval by the\nTown Board in each case, and in accordance with an approved preliminary\ndevelopment concept plan, as described and defined herein."
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "Application procedure."
																},
																{
																	"content": [
																		{
																			"number": "[1] ",
																			"content": [
																				{
																					"text": "The procedure for planning and zoning approval of any future proposed\nmultifamily development in an MFPD District which has not already\nbeen designated on the Town Zoning Map shall involve a two-stage review\nprocess as follows:"
																				},
																				{
																					"content": [
																						{
																							"number": "[a] ",
																							"content": [
																								{
																									"text": "Approval of a preliminary development concept plan and the reclassification\nof a specific parcel or parcels of land for development in accordance\nwith that plan by the Town Board; and"
																								}
																							]
																						},
																						{
																							"number": "[b] ",
																							"content": [
																								{
																									"text": "Approval of a final, detailed site development plan, as well\nas a subdivision plat, if appropriate, by the Planning Board."
																								}
																							]
																						}
																					]
																				}
																			]
																		},
																		{
																			"number": "[2] ",
																			"content": [
																				{
																					"text": "For approval of a proposed multifamily development in an MFPD District\nwhich has already been designated on the Town Zoning Map, the Planning\nBoard shall be the review authority for the approval of the preliminary\ndevelopment concept plan in Stage 1. Stage 2 shall be the same as\notherwise required herein."
																				}
																			]
																		},
																		{
																			"number": "[3] ",
																			"content": [
																				{
																					"text": "Application for the establishment of future MFPD Districts shall\nbe submitted to the Town Board in 15 copies, and in an electronic\nfile format, at a regularly scheduled meeting of said Board. The application\nshall include at least the following items of information:[Amended 3-27-2012 by L.L. No. 1-2012]"
																				},
																				{
																					"content": [
																						{
																							"number": "[a] ",
																							"content": [
																								{
																									"text": "The names and addresses of the property owner,\nof the applicant (if other than the owner) and of the planner, engineer,\narchitect, surveyor and/or other professionals engaged to work on\nthe project."
																								}
																							]
																						},
																						{
																							"number": "[b] ",
																							"content": [
																								{
																									"text": "Where the applicant is not the owner of the property,\nwritten authorization from the owner for the submission of the application."
																								}
																							]
																						},
																						{
																							"number": "[c] ",
																							"content": [
																								{
																									"text": "A written statement describing the nature of the\nproposed project, how it is designed to serve the purposes of this\nchapter (including its consistency with the Town Plan), an analysis\nof the site's relationship to immediately adjoining properties\nand the surrounding neighborhood, the availability and adequacy of\ncommunity facilities and utilities to serve it, the safety and capacity\nof the street system in the area in relation to the anticipated traffic\ngeneration and such other information as may be required by law or\ndetermined necessary by the Town Board or Planning Board to properly\nenable them to review and decide upon the application."
																								}
																							]
																						},
																						{
																							"number": "[d] ",
																							"content": [
																								{
																									"text": "A written statement of the proposed method of ownership\nand maintenance of all common utilities, facilities and open space\nlands within the proposed development."
																								}
																							]
																						},
																						{
																							"number": "[e] ",
																							"content": [
																								{
																									"text": "A preliminary development concept plan for the\nproposed project, drawn to a convenient scale and including the following\nitems of information:"
																								},
																								{
																									"content": [
																										{
																											"number": "[i] ",
																											"content": [
																												{
																													"text": "The area of the property in both acres and square\nfeet."
																												}
																											]
																										},
																										{
																											"number": "[ii] ",
																											"content": [
																												{
																													"text": "A map of existing terrain conditions, including\ntopography with a vertical contour interval of no more than two feet,\nidentification of soil types (including wetlands), existing drainage\nfeatures, major rock outcroppings, the extent of existing wooded areas\nand other significant vegetation, existing stone walls, etc."
																												}
																											]
																										},
																										{
																											"number": "[iii] ",
																											"content": [
																												{
																													"text": "A site location sketch indicating the location\nof the property with respect to neighboring streets and properties,\nincluding the names of all owners of property within 500 feet thereof.\nThis should also show the existing zoning of the property and the\nlocation of all zoning district boundaries in the surrounding neighborhood."
																												}
																											]
																										},
																										{
																											"number": "[iv] ",
																											"content": [
																												{
																													"text": "A preliminary site development plan indicating\nthe approximate location, height and design of all buildings, the\narrangement of parking areas and access drives and the general nature\nand location of other proposed site improvements, including recreational\nfacilities, landscaping and screening, the storm drainage system,\nwater and sewer connections, etc."
																												}
																											]
																										},
																										{
																											"number": "[v] ",
																											"content": [
																												{
																													"text": "A generalized time schedule for the staging and\ncompletion of the proposed project."
																												}
																											]
																										},
																										{
																											"number": "[vi] ",
																											"content": [
																												{
																													"text": "An application fee in an amount as set forth by\nresolution of the Town Board in the Master Fee Schedule, which may\nbe amended, for each proposed dwelling unit.[Amended 9-10-2002 by L.L. No. 8-2002]"
																												}
																											]
																										}
																									]
																								}
																							]
																						},
																						{
																							"number": "[f] ",
																							"content": [
																								{
																									"text": "If required by the Planning Board for purposes\nof better illustrating or understanding the applicant's proposal,\na three-dimensional scale model of the site's terrain and the\nproposed development concept, in part or in its entirety, at the discretion\nof the Planning Board, and at a scale acceptable to the Planning Board.[Added 3-27-1984 by L.L. No. 2-1984[9]]"
																								},
																								{
																									"footnote": "[9]\nEditor's Note: Said local law was readopted 7-31-1984.\n"
																								}
																							]
																						}
																					]
																				}
																			]
																		},
																		{
																			"number": "[4] ",
																			"content": [
																				{
																					"text": "Referral to Planning Board. Upon receipt of a properly completed\napplication for establishment of a new MFPD District, eight copies\nof such application shall be referred to the Planning Board for review\nand report. Within 65 days of the date of the Planning Board meeting\nat which such referral is received, the Planning Board shall report\nits recommendations back to the Town Board. No action shall be taken\nby the Town Board until receipt of the Planning Board report or the\nexpiration of the Planning Board review period, whichever comes first.\nSaid review period may be extended by mutual consent of the Planning\nBoard and the applicant."
																				}
																			]
																		},
																		{
																			"number": "[5] ",
																			"content": [
																				{
																					"text": "Planning Board report. The Planning Board, in its report to\nthe Town Board, may recommend either approval of the proposed application\nfor the establishment of the MFPD District, with or without modifications,\nor disapproval. In the event of a recommendation for disapproval,\nthe Planning Board shall state in its report the reasons therefor.\nIn preparing its report and recommendation, the Planning Board shall\ntake into consideration the recommendations of the Town Plan, the\nexisting nature and arrangement of land uses in the area, the relationship\nof the proposed design and location of buildings on the site, traffic\ncirculation both on and off the site, the adequacy of available community\nfacilities and utilities to service the proposed development, compliance\nof the proposed development with the standards and requirements of\nthis chapter, the then current need for such housing and such other\nfactors as may be appropriately related to the purpose and intent\nof this section and the Town Code."
																				}
																			]
																		},
																		{
																			"number": "[6] ",
																			"content": [
																				{
																					"text": "Town Board public hearing. Within 45 days of the date of Town\nBoard receipt of the Planning Board's report and recommendation\nor the expiration of the Planning Board review period, whichever occurs\nfirst, the Town Board shall schedule and hold a public hearing on\nthe MFPD zoning application with the same notice as prescribed by\nlaw for zoning amendments.[10]"
																				},
																				{
																					"footnote": "[10]\nEditor's Note: For zoning amendment procedure, see § 60-600 of this chapter.\n"
																				}
																			]
																		},
																		{
																			"number": "[7] ",
																			"content": [
																				{
																					"text": "Town Board action."
																				},
																				{
																					"content": [
																						{
																							"number": "[a] ",
																							"content": [
																								{
																									"text": "Within 45 days of the date of the close of the\npublic hearing, the Town Board shall act either to approve, approve\nwith modifications or disapprove the preliminary development concept\nplan and the establishment of the MFPD District. Approval or approval\nwith modifications is required for and shall be deemed to authorize\nthe applicant to proceed with the detailed design of the proposed\ndevelopment in accordance with such concept plan and the subsequent\nprocedures and requirements of this section. A copy of the resolution\ncontaining the Town Board's decision shall be forwarded to the\nPlanning Board and to the applicant. A copy shall also be placed on\nfile in the office of the Town Clerk and, if in the form of an approval,\nthe official copy of the Town Zoning Map shall be amended accordingly."
																								}
																							]
																						},
																						{
																							"number": "[b] ",
																							"content": [
																								{
																									"text": "Approval of the establishment of an MFPD District\nwhich was not designated on the Town Zoning Map prior to January 1,\n1980, shall expire within 12 months of the date of Town Board approval\nif the applicant has not applied for and received site development\nplan approval and final subdivision approval, if appropriate, for\nat least the first section of the planned development from the Planning\nBoard in accordance with the subsequent requirements of this chapter\nand unless work on the site is begun within 18 months of Town Board\napproval and is being prosecuted to conclusion with reasonable diligence.\nThe Town Board, upon request of the applicant, may extend either or\nboth of the above time periods in increments of not more than six\nmonths each time that an extension is granted. In the event of expiration\nof approval, the MFPD District shall automatically be removed from\nthe subject property, and such property shall revert to its prior\nzoning classification. The Town Clerk shall amend the official copy\nof the Zoning Map accordingly.[Amended 3-12-2013 by L.L. No. 4-2013]"
																								}
																							]
																						}
																					]
																				}
																			]
																		},
																		{
																			"number": "[8] ",
																			"content": [
																				{
																					"text": "Final site development plan approval by the Planning Board."
																				},
																				{
																					"content": [
																						{
																							"number": "[a] ",
																							"content": [
																								{
																									"text": "No earthwork, land clearing, construction or development shall take place on any property within an MFPD District except in accordance with a site development plan approved by the Planning Board in accordance with this section and with the procedures and standards for site development plan approval as set forth in § 60-440 of this chapter."
																								}
																							]
																						},
																						{
																							"number": "[b] ",
																							"content": [
																								{
																									"text": "Where a proposed multifamily development also involves the construction of a new street or any subdivision or resubdivision of land, no development may proceed until the Planning Board has also granted final subdivision approval in accordance with the standards and procedures of the Land Subdivision Regulations, Chapter 113 of this Code."
																								}
																							]
																						}
																					]
																				}
																			]
																		}
																	]
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "Development standards. Development within MFPD Districts shall be governed by the same standards as those set forth in Subsection H(2) above for MFR-C Districts, except as modified below:"
																},
																{
																	"content": [
																		{
																			"number": "[1] ",
																			"content": [
																				{
																					"text": "Location. The establishment of MFPD Districts shall be permitted\nonly within R-1/4A, R-1/2A, R-1A and nonresidential districts and\nonly when the location is within 1/2 mile of the boundary of a business\ndistrict."
																				}
																			]
																		},
																		{
																			"number": "[2] ",
																			"content": [
																				{
																					"text": "Minimum site size. The minimum site size required for the establishment\nof an MFPD District shall be five acres, but, in any case, the site\nshall be of such shape, dimension, topography and location as will\nallow for an appropriate and attractive development with proper setbacks,\nscreening and a harmonious relationship with adjoining land uses and\nthe natural physical terrain."
																				}
																			]
																		},
																		{
																			"number": "[3] ",
																			"content": [
																				{
																					"text": "Ownership. A proposed MFPD District site may be owned by one\nor more persons or corporations but shall be presented as a single\nparcel of land at the time application for rezoning is made. The application\nshall be jointly filed by all owners and, if approved, shall be jointly\nbinding on them. If required by the Planning Board, this shall be\nconfirmed by written agreement, in recordable form satisfactory to\nthe Town Attorney."
																				}
																			]
																		},
																		{
																			"number": "[4] ",
																			"content": [
																				{
																					"text": "Density. The permitted basic and incentive densities within\nan MFPD District shall be calculated as in the MFR-C District, except\nthat they shall be based upon the following minimum lot area standards:"
																				}
																			]
																		},
																		{
																			"number": "[5] ",
																			"content": [
																				{
																					"text": "Coverage. The maximum permitted building coverage within an\nMFPD District shall be 15%, and the maximum permitted development\ncoverage shall be 30%. Such coverage shall be calculated on the basis\nof nonwetland areas, plus 33% of any wetland areas on the site. Parking\nstructures located wholly underground shall be excluded for the purpose\nof these calculations.[Amended 5-23-1995 by L.L. No. 6-1995]"
																				}
																			]
																		}
																	]
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "Accessory apartments in one-family residence districts. It is the\nspecific purpose and intent of allowing accessory apartments on one-family\nproperties in all one-family residence districts to provide the opportunity\nand encouragement for the development of small, rental housing units\ndesigned, in particular, to meet the special housing needs of single\npersons and couples of low and moderate income, both young and old,\nand of relatives of families presently living in New Castle. Furthermore,\nit is the purpose and intent of this provision to allow the more efficient\nuse of the Town's existing stock of dwellings and accessory buildings,\nto provide economic support for present resident families of limited\nincome and to protect and preserve property values. To help achieve\nthese goals and to promote the other objectives of this chapter and\nof the Town Development Plan, the following specific standards are\nset forth for such accessory apartment uses:[Amended 7-7-1981 by L.L. No. 6-1981; 3-9-1982 by L.L. No.\n3-1982; 6-9-1987 by L.L. No. 5-1987; 5-22-1990 by L.L. No.\n26-1990; 6-25-1991 by L.L. No. 13-1991; 10-8-2002 by L.L. No.\n10-2002[11]]"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "Owner occupancy required. An owner of the one-family lot upon\nwhich the accessory apartment is located shall occupy at least one\nof the dwelling units on the premises as a principal residence."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "Location on the lot. An accessory apartment may be located either\nin the principal dwelling building or in an accessory building, provided\nthat such principal dwelling building or accessory building conforms\nto the other requirements of this chapter, unless a variance therefor\nshall have been granted by the Zoning Board of Appeals. An accessory\napartment shall not be located in space originally designed to be\nused for the indoor storage of vehicles, unless such space is in excess\nof that which is needed to satisfy the minimum off-street parking\nrequirement for the existing principal use on the subject property\nor unless an alternative location for such parking satisfactory to\nthe Planning Board is provided. Such alternative location may include\nbut shall not be limited to newly constructed garage space or an outdoor\nparking area that is adequately buffered to visually screen its location\nfrom adjacent streets and residences on abutting lots."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "Apartment size. The floor area for an accessory apartment within\na principal dwelling building shall be at least 300 square feet, but\nin no case shall it exceed the lesser of 1,000 square feet or 30%\nof the total area of the dwelling building in which it is located,\nunless, in the opinion of the Planning Board, a greater or lesser\namount of floor area is warranted by the characteristics of the particular\nbuilding, which may include but not be limited to consideration of\nits existing floor plan and structural characteristics. The floor\narea for an accessory apartment located in an accessory building shall\nbe at least 300 square feet, but in no case shall it exceed 1,000\nsquare feet. There shall be no more than two bedrooms in any accessory\napartment."
																},
																{
																	"content": [
																		{
																			"number": "[1] ",
																			"content": [
																				{
																					"text": "Requirements for construction, alteration or enlargement:"
																				},
																				{
																					"content": [
																						{
																							"number": "[a] ",
																							"content": [
																								{
																									"text": "A principal dwelling building may be altered, enlarged or constructed to accommodate an accessory apartment, provided that such alteration, enlargement or construction conforms to the other requirements of this chapter, unless a variance therefor shall be granted by the Zoning Board of Appeals upon a showing of unnecessary hardship as required for the granting of a use variance under § 60-540D(2)(b)."
																								}
																							]
																						},
																						{
																							"number": "[b] ",
																							"content": [
																								{
																									"text": "An accessory building may be altered, enlarged or constructed to accommodate an accessory apartment, provided that such alteration, enlargement or construction conforms to the other requirements of this chapter, unless a variance therefor shall be granted by the Zoning Board of Appeals upon a showing of unnecessary hardship as required for the granting of a use variance under § 60-540D(2)(b) and, if such alteration or enlargement is of an existing accessory building, the Planning Board finds that such alteration or enlargement is warranted by the characteristics of the particular building, which may include but not be limited to consideration of desirable functional and aesthetic modifications, and will not produce a result that is inconsistent with the purposes of this chapter."
																								}
																							]
																						}
																					]
																				}
																			]
																		}
																	]
																}
															]
														},
														{
															"number": "(d) ",
															"content": [
																{
																	"text": "Number of accessory apartments per lot. There shall be no more\nthan one accessory apartment permitted on a one-family building lot."
																}
															]
														},
														{
															"number": "(e) ",
															"content": [
																{
																	"text": "Exterior appearance. If an accessory apartment is located in\nthe principal dwelling building, the entry to such unit and its design\nshall be such that, to the degree reasonably feasible, the appearance\nof the building will remain as a one-family residence."
																}
															]
														},
														{
															"number": "(f) ",
															"content": [
																{
																	"text": "Water and sewer service. Prior to the issuance of a building\npermit for the establishment of an accessory apartment in a principal\ndwelling building or the conversion of a portion of an existing accessory\nbuilding to an accessory apartment use or construction of an accessory\nbuilding to accommodate an accessory apartment, approval of the proposed\nmethod of water supply and sewage disposal shall be obtained from\nthe Westchester County Department of Health and shall be further subject\nto approval by the Town Engineer. Wherever determined reasonably feasible\nby the Town Engineer, separate metering of water service shall be\nrequired."
																}
															]
														},
														{
															"number": "(g) ",
															"content": [
																{
																	"text": "Off-street parking. Off-street parking shall be provided in accordance with the standards and requirements of § 60-420F of this chapter."
																}
															]
														},
														{
															"number": "(h) ",
															"content": [
																{
																	"text": "Application procedure. Site development plan approval for an accessory apartment shall be secured in accordance with the provisions of § 60-440 of this chapter, except as modified below:"
																},
																{
																	"content": [
																		{
																			"number": "[1] ",
																			"content": [
																				{
																					"text": "In lieu of the requirements set forth in § 60-440B(2) of this chapter, the application shall be accompanied by a site development plan based on a property survey and shall contain the following information:"
																				},
																				{
																					"content": [
																						{
																							"number": "[a] ",
																							"content": [
																								{
																									"text": "A location map showing the applicant's entire\nproperty and adjacent properties and streets at a convenient scale.\nA copy of the pertinent portion of the Town's tax maps may be\nused for this purpose, provided that the applicant's property\nis clearly identified."
																								}
																							]
																						},
																						{
																							"number": "[b] ",
																							"content": [
																								{
																									"text": "The location of the building in which the proposed\naccessory apartment is to be established and the location of any other\nbuilding or structure on the subject property."
																								}
																							]
																						},
																						{
																							"number": "[c] ",
																							"content": [
																								{
																									"text": "A floor plan showing the proposed accessory apartment\nin relation to the overall floor plan of the building in which it\nis located."
																								}
																							]
																						},
																						{
																							"number": "[d] ",
																							"content": [
																								{
																									"text": "The location of all existing and proposed parking\nareas, with ingress and egress drives thereto."
																								}
																							]
																						},
																						{
																							"number": "[e] ",
																							"content": [
																								{
																									"text": "A description of the method of sewage disposal\nand the location of such facilities."
																								}
																							]
																						},
																						{
																							"number": "[f] ",
																							"content": [
																								{
																									"text": "If new construction is proposed within an area of special flood hazard, the data required to ensure compliance with Chapter 70, Flood Damage Prevention; Chapter 108, Steep Slopes; Chapter 121, Tree Preservation; Chapter 137, Wetlands; and Chapter 60, § 60-300A(8), Overlay Zoning."
																								}
																							]
																						},
																						{
																							"number": "[g] ",
																							"content": [
																								{
																									"text": "After review by the Planning Board, any other pertinent\ninformation required by the Planning Board that is reasonably related\nto the health, safety and general welfare of the community, which\nmay include but not be limited to the location and proposed development\nof landscaping and buffer screening areas, if applicable."
																								}
																							]
																						}
																					]
																				}
																			]
																		},
																		{
																			"number": "[2] ",
																			"content": [
																				{
																					"text": "Review by Town Engineer. Upon receipt of an application for site development plan approval and prior to submission of such application to the Planning Board, the Town Engineer shall undertake a preliminary review of such application for the purpose of determining its completeness and its conformance with the provisions of this chapter and shall so advise the applicant of his recommendation. As part of his preliminary review, the Town Engineer also may request the submission of additional pertinent information which is reasonably related to the health, safety and general welfare of the community. When the Town Engineer determines that the application contains the information required in § 60-410H(5)(h)[1] hereof and is in conformance with the basic zoning requirements set forth in this chapter, the application shall be scheduled for discussion at the next available regular meeting of the Planning Board, at which time a public hearing shall also be held."
																				}
																			]
																		},
																		{
																			"number": "[3] ",
																			"content": [
																				{
																					"text": "Referral to the Police Chief, Fire Marshal and Fire Chief as described in § 60-440B(3) of this chapter shall not be required."
																				}
																			]
																		}
																	]
																}
															]
														}
													]
												},
												{
													"footnote": "[11]\nEditor's Note: This local law also stated that it superseded\nany inconsistent provisions of Town Law §§ 267 and\n267-b.\n"
												}
											]
										},
										{
											"number": "(6) ",
											"content": [
												{
													"text": "Apartments in B-R Retail Business and B-RP Business Retail and Parking\nDistricts. It is the specific purpose and intent of allowing apartments\nin buildings that are also used for nonresidential purposes in the\nB-R and B-RP Districts to add round-the-clock vitality to the Town's\nhamlet business centers, provide the opportunity for the creation\nof housing in locations that are conveniently served by community\nfacilities and services, and encourage the preservation and rehabilitation\nof existing buildings. To help achieve these goals and to promote\nthe other objectives of this chapter and of the Town Development Plan,\nthe following specific standards are set forth for such apartment\nuses:[Added 12-14-2004 by L.L. No. 12-2004]"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "Individual dwelling units may be of the efficiency, studio,\none-bedroom or two-bedroom type, but shall not contain more than two\nbedrooms. The Planning Board shall have the authority to determine\nwhich rooms may function as bedrooms for the purpose of determining\ncompliance with this requirement and may include any room other than\nbathrooms, kitchens, entrance ways, foyers and closets under the definition\nof a bedroom."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "The floor area for an individual dwelling unit shall be at least\n300 square feet, but in no case shall it exceed the lesser of 1,000\nsquare feet or 30% of the total area of the building in which it is\nlocated."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "All dwelling units shall comply with all applicable provisions\nof the New York State Building Codes and all other applicable laws."
																}
															]
														},
														{
															"number": "(d) ",
															"content": [
																{
																	"text": "Water and sewer service. Prior to the issuance of a building\npermit for the establishment of an apartment, approval of the proposed\nmethod of water supply and sewage disposal shall be obtained from\nthe Westchester County Department of Health and shall be further subject\nto approval by the Town Engineer, acting in consultation with the\nCommissioner of the Town of New Castle Department of Public Works.\nWherever determined reasonably feasible by the Town Engineer, separate\nmetering of water service shall be required."
																}
															]
														},
														{
															"number": "(e) ",
															"content": [
																{
																	"text": "Other utility services. If a connection to cable television\nservice is not proposed to serve the building containing apartments,\na central exterior radio/television antenna system or earth station\nshall be provided in accordance with plans approved by the Planning\nBoard. Exterior antennas for individual apartments shall not otherwise\nbe permitted. Provision shall be made for connecting all proposed\ncommunication utility services to the building at a single location.\nThe proposed location of the common utility area shall be depicted\non the site plan approved by the Planning Board."
																}
															]
														},
														{
															"number": "(f) ",
															"content": [
																{
																	"text": "Refuse storage and collection. Plans for the storage and collection\nof refuse within any building containing apartments shall be subject\nto Planning Board approval, acting in consultation with the Commissioner\nof the Town of New Castle Department of Public Works. The outside\nstorage of refuse, if permitted, shall be in rodent-proof containers\nconveniently located and enclosed or otherwise screened from view."
																}
															]
														},
														{
															"number": "(g) ",
															"content": [
																{
																	"text": "Fire protection. All site plans for apartments in buildings containing nonresidential uses shall provide proper access for fire-fighting equipment and personnel, and shall provide hydrants in such number and location and with such water pressure as may be determined adequate and approved by the Planning Board, based upon the recommendations of the Town Engineer and the Fire Department having jurisdiction. No-parking zones shall be designated as deemed necessary and if required by the Planning Hoard in accordance with the provisions of § 60-440B(3) of this chapter."
																}
															]
														},
														{
															"number": "(h) ",
															"content": [
																{
																	"text": "Off-street parking. Off-street parking shall be provided in accordance with the standards and requirements of § 60-420F of this chapter for multifamily dwellings in business districts."
																}
															]
														},
														{
															"number": "(i) ",
															"content": [
																{
																	"text": "Apartment access. The portion of the building that is used for\nresidential purposes shall have an entrance that does not require\naccess through the portion of the building that is used for nonresidential\npurposes and that is not located on the same side of the building\nas the location of a principal entrance to the nonresidential portion\nof the building."
																}
															]
														},
														{
															"number": "(j) ",
															"content": [
																{
																	"text": "Residential storage. The architectural design of the building\nto be used for residential purposes shall take into consideration\nthe need for residential storage for each apartment. If adequate storage\nareas cannot be provided within individual dwelling units, provision\nshall be made for common storage areas within the building. Attic\nstorage may be considered provided that it complies with all applicable\nregulations."
																}
															]
														}
													]
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "I. ",
							"content": [
								{
									"text": "Dish antennas. The following regulations shall apply to the construction\nor placement of dish antennas:[Added 5-8-1984 by L.L. No. 4-1984]"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "In any zoning district, freestanding dish antennas with a diameter or height of more than three feet and all roof-mounted dish antennas shall be subject to site plan approval by the Planning Board in accordance with the standards, procedures and requirements as set forth in § 60-440 of this chapter. Freestanding dish antennas with a diameter or height of three feet or less shall be considered as permitted accessory uses customarily incidental to a permitted principal use on the same lot, subject to all applicable yard and height requirements. All dish antennas shall be properly located and screened to minimize visual impact in accordance with a design approved by the Architectural Review Board."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "As used in this chapter, dish antenna height shall be measured vertically\nfrom the highest point of the antenna, when positioned for operation,\nto the bottom of the base which supports the antenna."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Dish antennas shall not exceed 10 feet in diameter."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "A freestanding dish antenna shall not exceed eight feet in height.\nDish antennas shall not be located within any required yard and, unless\nmodified by the Planning Board due to unique circumstances, shall\nbe excluded from the front yard."
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "A dish antenna located on a building shall not exceed six feet in height and shall otherwise be subject to the provisions of § 60-420C(3)."
												}
											]
										},
										{
											"number": "(6) ",
											"content": [
												{
													"text": "In reviewing any site plan for a proposed dish antenna, the Planning\nBoard shall require that its location, design and screening be such\nas to mitigate any potential visual impact on neighboring properties\nor streets through the use of increased setbacks, evergreen landscaping,\nearth berms, fencing, architectural features or other such techniques\nwhich encourage harmony with and the protection of the character of\nexisting buildings and properties."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "J. ",
							"content": [
								{
									"text": "Athletic training centers. The operation of athletic training centers\nshall be subject to the following special provisions in regard to\ntheir operation:[Added 7-12-1988 by L.L. No. 10-1988; amended 7-24-1990 by L.L. No.\n30-1990; 12-10-1990 by L.L. No. 45-1990]"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "The offering of classes in gymnastics instruction to athletes engaged in a formal training program as well as to prospective athletes shall be permitted by right. The inclusion of ancillary activities, limited to the offering of classes in ballet dance instruction and the holding of social functions of one day or less in duration for special groups using the gymnastics equipment, shall be subject to the issuance of a special permit by the Planning Board in accordance with the provisions of § 60-430 and § 60-430O(12) of this chapter."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "K. ",
							"content": [
								{
									"text": "Keeping, breeding, maintenance and flying of pigeons. The use of\nproperty for the keeping, breeding, maintenance and flying of pigeons\nshall be permitted on the following conditions:[Added 7-13-1999 by L.L. No. 12-1999]"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "The following types of pigeons shall be permitted. \"Pigeon\" means\na member of the family Columbidae, and shall include \"racing pigeons,\"\n\"fancy pigeons\" and \"sporting pigeons,\" as defined herein:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "\"Racing pigeon\" means a pigeon which, through selective past\nbreeding, has developed the distinctive physical and mental characteristics\nas to enable it to return to its home after having been released a\nconsiderable distance therefrom, and which is accepted as such by\nthe American Racing Pigeon Union, Inc. or the International Federation\nof Racing Pigeon Fanciers. Also commonly known as \"racing homer,\"\n\"homing pigeon\" or \"carrier pigeon.\""
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "\"Fancy pigeon\" means a pigeon which, through past breeding,\nhas developed certain distinctive physical and performing characteristics\nas to be clearly identified and accepted as such by the National Pigeon\nAssociation, the American Pigeon Club or the Rare Breeds Pigeon Club.\nExamples include fantails, pouters and trumpeters."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "\"Sporting pigeon\" means a pigeon which, through selective past\nbreeding, has developed the ability to fly in a distinctive manner,\nsuch as aerial aerobatics or endurance flying. Examples include rollers\nand tipplers."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "An owner of pigeons at the time of the enactment of this section shall be permitted to keep, maintain and fly any existing and replacement pigeons in their current place of confinement, provided that the keeping, maintenance and flying of such pigeons is in accordance with this section and applicable requirements of this chapter and Chapter 48 of the Code of the Town of New Castle and that the owner may keep, maintain or fly no more pigeons than the number that he or she keeps, maintains or flies at the time of the filing of this law.[Amended 11-22-2011 by L.L. No. 15-2011]"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "Such owner of pigeons shall not be permitted to increase by\nacquisition, breeding or otherwise the number of pigeons above the\nnumber of pigeons the owner currently maintains."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "Such existing use shall be deemed a legal nonconforming use, provided\nthat the owner receives a permit from the Building Department and\ncomplies with this section and all applicable provisions of this chapter."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "After the effective date of this section, no property owner or person\nshall be permitted to establish a new use of property for the keeping,\nmaintenance, breeding or flying of pigeons."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Within 30 days after the effective date of this section, an owner\nof pigeons shall submit an application to the Building Department.\nThe owner shall certify that the facts contained in the application\nare true and accurate. Such application shall state, among other things,\nthe existing number and type of pigeons owned and a statement describing\nthe existing loft or other structure for the keeping or housing of\npigeons and whether such structure complies with all applicable provisions\nof this chapter. Such application shall also demonstrate to the satisfaction\nof the Building Department that the owner has complied with the following\nconditions:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "The loft or structure(s) for the keeping or housing of pigeons\npermitted by this section shall be of such sufficient size and design,\nand constructed of such material, that it can be maintained in a clean\nand sanitary condition."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "There shall be at least one square foot of floor space in any\nloft for each mature pigeon (aged six months or older) kept therein."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "The construction and location of the loft shall not conflict\nwith the requirements of this chapter."
																}
															]
														},
														{
															"number": "(d) ",
															"content": [
																{
																	"text": "All feed for said pigeons shall be stored in such containers\nas to protect against intrusions by rodents and other vermin."
																}
															]
														},
														{
															"number": "(e) ",
															"content": [
																{
																	"text": "The loft shall be maintained in a sanitary condition and in\ncompliance with all applicable health regulations of the Town and\nWestchester County."
																}
															]
														},
														{
															"number": "(f) ",
															"content": [
																{
																	"text": "All pigeons shall be confined to the loft, except for limited\nperiods necessary for exercise, training and competition; and at no\ntime shall pigeons be allowed to perch or linger on the buildings\nor property of others."
																}
															]
														},
														{
															"number": "(g) ",
															"content": [
																{
																	"text": "All pigeons shall be fed within the confines of the loft."
																}
															]
														},
														{
															"number": "(h) ",
															"content": [
																{
																	"text": "No one shall release pigeons to fly for exercise, training or\ncompetition except in compliance with the following rules:"
																},
																{
																	"content": [
																		{
																			"number": "[1] ",
																			"content": [
																				{
																					"text": "The owner of the pigeons must abide by the rules of an organized\npigeon club, such as the American Racing Pigeon Union, Inc., the International\nFederation of Racing Pigeon Fanciers, the National Pigeon Association,\nthe American Tippler Society, the International Roller Association,\nthe Rare Breeds Pigeon Club or a local club which has rules that will\nhelp preserve the peace and tranquility of the neighborhood."
																				}
																			]
																		},
																		{
																			"number": "[2] ",
																			"content": [
																				{
																					"text": "Pigeons will not be released for flying which have been fed\nwithin the previous four hours."
																				}
																			]
																		}
																	]
																}
															]
														},
														{
															"number": "(i) ",
															"content": [
																{
																	"text": "Pigeons shall be banded and registered with one of the national\npigeon associations/registries."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "Upon payment of a fee as set forth by resolution of the Town Board in the Master Fee Schedule, which may be amended, and upon demonstration to the satisfaction of the Building Inspector of compliance with the requirements of this section and applicable regulations of this chapter and Chapter 48 of the Code of the Town of New Castle, a permit shall be issued to the owner, which shall remain in full force and effect unless suspended or revoked. If the use of the loft or other structure for the keeping or housing of pigeons ceases for any reason for a continuous period of more than six months, the permit issued hereunder shall be permanently revoked. If the property owner ceases to own or occupy the property in which the loft has been constructed, the permit issued hereunder is not assignable, and such permit shall be permanently revoked.[Amended 9-10-2002 by L.L. No. 8-2002; 11-22-2011 by L.L. No.\n15-2011]"
												}
											]
										}
									]
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 60-420",
			"title": "General regulations.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Lots."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Lots for every building. Every building hereafter erected shall be\nlocated on a lot as herein defined."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Required street frontage and lot width.[Amended 6-12-1984 by L.L. No. 5-1984; 10-9-1990 by L.L. No.\n36-1990]"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "No permit shall be issued for any land use or structure unless\nthe lot upon which such land use is to be established or structure\nis to be built has the required frontage and access on a street or\nhighway as specified in this chapter. As used herein, frontage shall\nbe measured along an unbroken line formed by a single street line\nor the continuation of intersecting street lines."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "Notwithstanding any provision of this chapter to the contrary\nand except with respect to the application of § 281 of the\nTown Law,[1] the subdivision of property into lots having no street\nfrontage and for which access to a street is derived by way of an\neasement shall be prohibited. Relief from this provision may be granted\nonly upon application to and after hearing on due notice to the parties\nby the Zoning Board of Appeals upon a showing of unnecessary hardship\nas required in connection with the granting of a use variance."
																},
																{
																	"footnote": "[1]\nEditor's Note: Former § 281 of the Town Law\nwas renumbered as § 278 by L. 1992, c. 727.\n"
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "No part of any lot which lies between the front lot line and\nthe principal building shall be narrower in lot width than the street\nfrontage for such lot, unless such frontage is greater than the required\nminimum lot width, in which case that part of the lot which lies between\nthe front lot line and the principal building shall be at least as\nwide as the required minimum lot width. For all lots created after\nthe effective date of this provision, a principal building shall not\nbe permitted on any portion of a lot which does not meet the required\nminimum lot width."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Subdivision of a lot. Where a lot is formed hereafter from part of a lot already occupied by a building, such separation shall be effected in such manner as to conform to all of the requirements of this chapter with respect to the existing building and building coverage, floor area ratio, development coverage and all yards and other required spaces in connection therewith, and no permit shall be issued for the establishment of a land use or the erection of a building on the new lot thus created, unless it complies with all the provisions of this chapter and Chapter 48 of the Code of the Town of New Castle.[Amended 5-23-1995 by L.L. No. 6-1995; 11-22-2011 by L.L. No.\n15-2011]"
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "New buildings on substandard lots (lots having less than the minimum\narea). A permit may be issued for the erection of a building for a\npermitted use on a lot for which a valid conveyance has been recorded\nprior to the adoption of any zoning ordinance or amendment making\nsaid lot nonconforming in area, notwithstanding that the area of such\nlot is less than that required for the district in which such lot\nlies, provided that:[Amended 8-22-1978 by L.L. No. 5-1978; 4-28-1992 by L.L. No.\n7-1992; 1-24-1995 by L.L. No. 1-1995]"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "The lot met the zoning requirements at the time the deed to\nthe lot was recorded."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "All yard setbacks and other building related requirements which\nare in effect at the time of the obtaining of the building permit\nare complied with."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "The ownership of such lot was not the same as other lots contiguous\nthereto at any time on or after the adoption of a zoning ordinance\nor amendment making such lot nonconforming in area. If the lot was\nnot in separate ownership, such other lot, or so much thereof as may\nbe necessary, shall be combined with the first-named lot to make one\nor more conforming lots, whereupon a permit may be issued, but only\nfor such combined lots."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "Parts of a lot not counted toward area requirements. For any lot\ncreated by a subdivision subsequent to the date of adoption of this\nchapter, no part of such lot which is less in width than 1/2 the minimum\nrequirement for the district in which it is located shall be counted\nas part of the required minimum lot area."
												}
											]
										},
										{
											"number": "(6) ",
											"content": [
												{
													"text": "Lots under water or subject to flooding. No more than 10% of the minimum area requirement of a lot may be fulfilled by land which is under water, subject to flooding, classified as a floodway under Chapter 70, Flood Damage Prevention, of the Code of the Town of New Castle or classified as a wetland under Chapter 137, Watercourses, of the Code of the Town of New Castle.[Amended 6-12-1984 by L.L. No. 5-1984; 9-13-1988 by L.L. No.\n14-1988]"
												}
											]
										},
										{
											"number": "(7) ",
											"content": [
												{
													"text": "Coverage.[Added 5-23-1995 by L.L. No. 6-1995]"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "Building coverage. The maximum permitted building coverage for\nany lot containing a one-family detached dwelling in an R-2A, R-1A,\nR-1/2A or R-1/4A District shall be as set forth below:"
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "Development coverage. The maximum permitted development coverage\nfor any lot containing a one-family detached dwelling in an R-2A,\nR-1A, R-1/2A or R-1/4A District shall be as set forth below:"
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "Coverage benefiting other lots. The square footage of any improvement\non any lot containing a one-family detached dwelling in an R-2A, R-1A,\nR-1/2A or R-1/4A District, which improvement is solely for the benefit\nof a lot other than the lot upon which that improvement has been constructed,\nshall be applied in its entirety to the computation of the maximum\npermitted building coverage and/or maximum permitted development coverage\nof the lot which benefits from the improvement. The square footage\nof any such improvement which benefits both the lot upon which it\nhas been constructed and another lot or lots shall be applied to the\ncomputation of the maximum permitted building coverage and/or maximum\npermitted development coverage of those lots which the improvement\nbenefits pro rata based on the number of lots benefitted.[Added 6-8-1999 by L.L. No. 9-1999]"
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(8) ",
											"content": [
												{
													"text": "One-Family Residence District maximum floor areas. The maximum permitted floor area for any lot used for residential purposes in any of the R-1/4A One-Family Residence District, the R-1/2A One-Family Residence District, the R-1A One-Family Residence District, or the R-2A One-Family Residence District shall be computed in accordance with this § 60-420A(8).[Added 5-8-2007 by L.L. No. 4-2007]"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "One-Family District floor area. The floor area for any lot in any One-Family Residence District shall be calculated for the purposes of this § 60-420A(8) (\"One-Family District Floor Area\") as the sum of:"
																},
																{
																	"content": [
																		{
																			"number": "[1] ",
																			"content": [
																				{
																					"text": "The floor area of each building on that lot, as \"floor area\" is defined in Town Code § 60-210, plus"
																				}
																			]
																		},
																		{
																			"number": "[2] ",
																			"content": [
																				{
																					"text": "One-half of the gross horizontal area of each floor of each garage on that lot, as \"garage\" is defined in Town Code § 60-210, plus"
																				}
																			]
																		},
																		{
																			"number": "[3] ",
																			"content": [
																				{
																					"text": "One-half of the gross horizontal area of each floor of each basement on that lot, as \"basement\" is defined in Town Code § 60-210."
																				}
																			]
																		}
																	]
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "One-Family District maximum permitted floor area. The maximum\npermitted One-Family District floor area for any lot used for residential\npurposes in any One-Family Residence District shall be:"
																},
																{
																	"content": [
																		{
																			"number": "[1] ",
																			"content": [
																				{
																					"text": "In a R-1/4 District:"
																				},
																				{
                                                                                	"content": [
                                                                                		{
                                                                                			"number": "A. ",
                                                                                			"content": [
                                                                                				{
                                                                                					"text": "Lot Area(square feet): At least 10,890 but less than 12,100 Maximum Floor Area: 3,158"
                                                                                				}
                                                                                			]
                                                                                		},
                                                                                		{
                                                                                			"number": "B. ",
                                                                                			"content": [
                                                                                				{
                                                                                					"text": "Lot Area(square feet): At least 12,100 but less than 13,310 Maximum Floor Area: 3,340"
                                                                                				}
                                                                                			]
                                                                                		},
                                                                                		{
                                                                                			"number": "C. ",
                                                                                			"content": [
                                                                                				{
                                                                                					"text": "Lot Area(square feet): At least 13,310 but less than 14,520 Maximum Floor Area: 3,522"
                                                                                				}
                                                                                			]
                                                                                		},
                                                                                		{
                                                                                			"number": "D. ",
                                                                                			"content": [
                                                                                				{
                                                                                					"text": "Lot Area(square feet): At least 14,520 but less than 15,730 Maximum Floor Area: 3,704"
                                                                                				}
                                                                                			]
                                                                                		},
                                                                                		{
                                                                                			"number": "E. ",
                                                                                			"content": [
                                                                                				{
                                                                                					"text": "Lot Area(square feet): At least 15,730 but less than 16,940 Maximum Floor Area: 3,886"
                                                                                				}
                                                                                			]
                                                                                		},
                                                                                		{
                                                                                			"number": "F. ",
                                                                                			"content": [
                                                                                				{
                                                                                					"text": "Lot Area(square feet): At least 16,940 but less than 18,150 Maximum Floor Area: 4,068"
                                                                                				}
                                                                                			]
                                                                                		},
                                                                                		{
                                                                                			"number": "G. ",
                                                                                			"content": [
                                                                                				{
                                                                                					"text": "Lot Area(square feet): At least 18,150 Maximum Floor Area: 4,100"
                                                                                				}
                                                                                			]
                                                                                		}
                                                                                	]
                                                                                }
																			]
																		},
																		{
																			"number": "[2] ",
																			"content": [
																				{
																					"text": "In a R-1/2 District:"
																				},
																				{
                                                                                	"content": [
                                                                                		{
                                                                                			"number": "A. ",
                                                                                			"content": [
                                                                                				{
                                                                                					"text": "Lot Area(square feet): At least 21,780 but less than 24,200 Maximum Floor Area: 4,792"
                                                                                				}
                                                                                			]
                                                                                		},
                                                                                		{
                                                                                			"number": "B. ",
                                                                                			"content": [
                                                                                				{
                                                                                					"text": "Lot Area(square feet): At least 24,200 but less than 26,620 Maximum Floor Area: 4,937"
                                                                                				}
                                                                                			]
                                                                                		},
                                                                                		{
                                                                                			"number": "C. ",
                                                                                			"content": [
                                                                                				{
                                                                                					"text": "Lot Area(square feet): At least 26,620 but less than 29,040 Maximum Floor Area: 5,082"
                                                                                				}
                                                                                			]
                                                                                		},
                                                                                		{
                                                                                			"number": "D. ",
                                                                                			"content": [
                                                                                				{
                                                                                					"text": "Lot Area(square feet): At least 29,040 but less than 31,460 Maximum Floor Area: 5,227"
                                                                                				}
                                                                                			]
                                                                                		},
                                                                                		{
                                                                                			"number": "E. ",
                                                                                			"content": [
                                                                                				{
                                                                                					"text": "Lot Area(square feet): At least 31,460 but less than 33,880 Maximum Floor Area: 5,372"
                                                                                				}
                                                                                			]
                                                                                		},
                                                                                		{
                                                                                			"number": "F. ",
                                                                                			"content": [
                                                                                				{
                                                                                					"text": "Lot Area(square feet): At least 33,880 but less than 36,300 Maximum Floor Area: 5,517"
                                                                                				}
                                                                                			]
                                                                                		},
                                                                                		{
                                                                                			"number": "G. ",
                                                                                			"content": [
                                                                                				{
                                                                                					"text": "Lot Area(square feet): At least 36,300 but less than 38,720 Maximum Floor Area: 5,662"
                                                                                				}
                                                                                			]
                                                                                		},
                                                                                		{
                                                                                			"number": "H. ",
                                                                                			"content": [
                                                                                				{
                                                                                					"text": "Lot Area(square feet): At least 38,720 Maximum Floor Area: 5,770"
                                                                                				}
                                                                                			]
                                                                                		}
                                                                                	]
                                                                                }
																			]
																		},
																		{
																			"number": "[3] ",
																			"content": [
																				{
																					"text": "In a R-1A District:"
																				},
																				{
                                                                                	"content": [
                                                                                		{
                                                                                			"number": "A. ",
                                                                                			"content": [
                                                                                				{
                                                                                					"text": "Lot Area(square feet): At least 43,560 but less than 48,400 Maximum Floor Area: 6,098"
                                                                                				}
                                                                                			]
                                                                                		},
                                                                                		{
                                                                                			"number": "B. ",
                                                                                			"content": [
                                                                                				{
                                                                                					"text": "Lot Area(square feet): At least 48,400 but less than 53,240 Maximum Floor Area: 6,292"
                                                                                				}
                                                                                			]
                                                                                		},
                                                                                		{
                                                                                			"number": "C. ",
                                                                                			"content": [
                                                                                				{
                                                                                					"text": "Lot Area(square feet): At least 53,240 but less than 58,080 Maximum Floor Area: 6,486"
                                                                                				}
                                                                                			]
                                                                                		},
                                                                                		{
                                                                                			"number": "D. ",
                                                                                			"content": [
                                                                                				{
                                                                                					"text": "Lot Area(square feet): At least 58,080 but less than 62,920 Maximum Floor Area: 6,680"
                                                                                				}
                                                                                			]
                                                                                		},
                                                                                		{
                                                                                			"number": "E. ",
                                                                                			"content": [
                                                                                				{
                                                                                					"text": "Lot Area(square feet): At least 62,920 but less than 67,760 Maximum Floor Area: 6,874"
                                                                                				}
                                                                                			]
                                                                                		},
                                                                                		{
                                                                                			"number": "F. ",
                                                                                			"content": [
                                                                                				{
                                                                                					"text": "Lot Area(square feet): At least 67,760 but less than 72,600 Maximum Floor Area: 7,068"
                                                                                				}
                                                                                			]
                                                                                		},
                                                                                		{
                                                                                			"number": "G. ",
                                                                                			"content": [
                                                                                				{
                                                                                					"text": "Lot Area(square feet): At least 72,600 but less than 77,440 Maximum Floor Area: 7,262"
                                                                                				}
                                                                                			]
                                                                                		},
                                                                                		{
                                                                                			"number": "H. ",
                                                                                			"content": [
                                                                                				{
                                                                                					"text": "Lot Area(square feet): At least 77,440 Maximum Floor Area: 7,320"
                                                                                				}
                                                                                			]
                                                                                		}
                                                                                	]
                                                                                }
																			]
																		},
																		{
																			"number": "[4] ",
																			"content": [
																				{
																					"text": "In a R-2A District:"
																				},
																				{
                                                                                	"content": [
                                                                                		{
                                                                                			"number": "A. ",
                                                                                			"content": [
                                                                                				{
                                                                                					"text": "Lot Area(square feet): At least 87,120 but less than 98,010 Maximum Floor Area: 7,841"
                                                                                				}
                                                                                			]
                                                                                		},
                                                                                		{
                                                                                			"number": "B. ",
                                                                                			"content": [
                                                                                				{
                                                                                					"text": "Lot Area(square feet): At least 98,010 but less than 108,900 Maximum Floor Area: 8,821"
                                                                                				}
                                                                                			]
                                                                                		},
                                                                                		{
                                                                                			"number": "C. ",
                                                                                			"content": [
                                                                                				{
                                                                                					"text": "Lot Area(square feet): At least 108,900 but less than 113,256 Maximum Floor Area: 9,801"
                                                                                				}
                                                                                			]
                                                                                		},
                                                                                		{
                                                                                			"number": "D. ",
                                                                                			"content": [
                                                                                				{
                                                                                					"text": "Lot Area(square feet): At least 113,256 but less than 196,020 Maximum Floor Area: 10,193"
                                                                                				}
                                                                                			]
                                                                                		}
                                                                                	]
                                                                                }
																			]
																		}
																	]
																}
															]
														}
													]
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Buildings and uses."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Location of accessory buildings. On a lot in any residence district,\nno accessory building shall be erected, altered or moved so as to\nbe set back a lesser distance from any property line than the distance\nrequired for principal buildings.[Amended 5-23-1995 by L.L. No. 6-1995]"
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Rear dwellings. No building located to the rear of another building\nshall be used as a dwelling unless there shall be a suitable open\nspace at least 15 feet wide from the street to said rear building\nfor direct access of fire-fighting equipment."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Prohibited use characteristics. No use shall be permitted or allowed\nto exist if it is determined by the Building Inspector that such use\ncauses or results in:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "Dissemination of undue noise, vibration, excessive light, dust,\nsmoke, gas, fumes, odor or other measurable atmospheric pollutant\nor harmful discharge of waste materials beyond the boundaries of the\nsite on which the use is located."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "Interference with radio or television reception beyond the lot\nupon which the building is located in which such use is conducted,\nor scientific testing of instruments which require the flying of aircraft\nin the vicinity in such manner as to constitute a public nuisance."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "Menace by reason of fire, explosion or other physical hazard."
																}
															]
														},
														{
															"number": "(d) ",
															"content": [
																{
																	"text": "Undue traffic hazards or congestion due to the type or number\nof vehicles associated with such use."
																}
															]
														},
														{
															"number": "(e) ",
															"content": [
																{
																	"text": "Dangerous radioactivity at any point beyond the boundaries of the site on which the use is located. (The handling of radioactive materials, the discharge of such materials into air and water and the disposal of radioactive wastes shall be in conformance with the regulations of the Atomic Energy Commission as set forth in Title 10, Chapter 1, Part 20 -- Standards for Protection Against Radiation, as amended, and all applicable regulations of the State of New York.)"
																}
															]
														}
													]
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Yards and building projections."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Yard and open space for every building. No yard or other open space\nprovided about any building for the purpose of complying with the\nprovisions of these regulations shall be included as any part of the\nyard or open space for any other building. No yard or other open space\non one lot shall be considered as a yard or open space for a building\non any other lot. No principal business use may be conducted within\nany required yard area. No accessory buildings, decks, porches or\nterraces may be located within any required yard. On all lots, a yard\nequal to the required front yard shall be provided with respect to\nany side lot line at an angle of 45° or less to the street and\nlocated between the street and a principal building contained thereon\nif such line is wholly or partially in front of said building, as\nwell as with respect to any side lot line that is generally opposite\nthe front facade of the principal building located on said lot. On\nall lots, a yard equal to the required rear yard shall be provided\nwith respect to any side lot line at an angle of 45° or less to\nthe street if such line is wholly or partially behind the principal\nbuilding, as well as with respect to any side lot line that is generally\nopposite the rear facade of the principal building contained on said\nlot.[Amended 10-9-1990 by L.L. No. 36-1990; 5-23-1995 by L.L. No.\n6-1995]"
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Projections into yards. The space in any required yard shall be open\nand unobstructed, except for the ordinary projection of the windowsills,\nbay windows, belt courses, chimneys, cornices, eaves and other architectural\nfeatures, provided that such architectural features shall not project\nmore than three feet into any required yard and shall not in the aggregate\noccupy more than 1/4 of the length of the wall on which they are located.[Amended 5-23-1995 by L.L. No. 6-1995]"
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Projections above the roof level. Chimneys antennas, towers, gables, elevator enclosures, church spires, cupolas, water tanks, solar energy collectors, similar structures and necessary mechanical appurtenances may be erected on a building to a height greater than the limit established for the district in which the building is located, provided that they are not used for sleeping or housekeeping purposes or for any purposes other than such as may be incident to the permitted use of the principal building. However, such structures and appurtenances shall be erected only to a height necessary to accomplish the purpose they are intended to serve, and except for solar energy collectors, they shall not cover at any level more than 10% of the area of the section of the roof on which they are located. Except for antenna structures expressly permitted in § 60-410A, any such structure or appurtenance proposed to be erected to a height exceeding the maximum permitted building height in the district in which it is located shall not be granted a building permit until such structure shall have been approved as to height and design by the Board of Architectural Review. Such structures and appurtenances shall be enclosed with materials of a type and design that will be in harmony with the materials and design of the building on which they are located. In the B-RO-150 District, no projection above the roof level shall exceed seven feet above the maximum building height allowed in said district except where, in addition to complying with above standards and requirements, including Board of Architectural Review approval, specific approval for such additional height shall have been granted by the Planning Board.[Amended 9-14-1982 by L.L. No. 11-1982; 6-22-1983 by L.L. No.\n5-1983]"
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "Corner lots, double-frontage lots and lots deriving access to a street\nby way of an easement. A yard equal to the required front yard shall\nbe provided with respect to any lot line that abuts a street.[Amended 2-11-1985 by L.L. No. 3-1985; 10-9-1990 by L.L. No.\n36-1990]"
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "Walls and fences.[Amended 2-27-1990 by L.L. No. 3-1990; 5-23-1995 by L.L. No.\n6-1995; 1-27-1998 by L.L. No. 2-1998]"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "Walls. Regardless of the location of a freestanding wall on a lot, parcel or property, such wall shall not exceed six feet in height and shall not conflict with the standards in § 60-420C(6)."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "Fences. Subject to the standards set forth in § 60-420C(6), (a) fences located at the property line or within a required minimum yard setback shall not exceed six feet in height; (b) fences which are not located within required minimum yard setbacks shall be subject to the following height limitations: (I) solid fences (as defined below) shall not exceed six feet in height; (II) open fences (as defined below) shall not exceed eight feet in height; and (III) open mesh fences (as defined below) shall not exceed eight feet in height. In addition, fences shall be erected with the finished side facing the street and the finished side facing the abutting property wherever the finished side of the fence may be visible. A \"solid fence\" is defined as a fence made of materials or construction with more than 1/4 solid material when viewed from a position which is at a right angle to the fence. An \"open fence\" is defined as a fence made of materials or construction with 1/4 or less solid material when viewed from a position which is at a right angle to the fence. An \"open mesh fence\" is defined as an open fence constructed of a black, plastic or metallic threaded network or grid commonly used to protect gardens and shrubber from deer and other large animals. If there is any inconsistency between the provisions of this section and the provisions of the requirements of § 720.1(g) of the State Uniform Fire Prevention and Building Code (\"State Code\") with regard to fencing of a swimming pool, then the provisions of the State Code shall control.[Amended 7-27-1999 by L.L. No. 13-1999]"
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(6) ",
											"content": [
												{
													"text": "Visibility at intersections."
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "On any corner lot, no building, fence, sign, wall, hedge or\nother structure or planting, except an open-mesh wire fence, shall\nbe erected, placed or maintained in such a way as to interfere with\nclear sight distance within the triangular area formed by the two\nintersecting street right-of-way lines and a straight line connecting\npoints along said lines, which points are located 50 feet back from\nthe theoretical point of intersection of such lines extended. Such\nrequired sight distance shall assume the observer's eye to be\n31/2 feet above the street surface at the nearest edge of pavement\nand the object one foot above the nearest edge of pavement on the\nintersecting street. This paragraph shall not apply to existing trees,\nprovided that no branches less than six feet in height above the ground\nare blocking such clear sight distance."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "Conditions on corner lots within the Town that impair the clear\nsight distance of vehicles entering into intersections constitute\na public nuisance and are dangerous to the public health, safety and\nwelfare. Where a property owner fails to correct such nuisance, it\nis imperative that the Town have the authority to correct such a condition.\nPursuant to the Municipal Home Rule Law, the Town hereby enacts this\nsubsection to provide for a property owner to reimburse the Town for\nany expense incurred in connection with correcting a public nuisance.[Added 12-22-1992 by L.L. No. 19-1992]"
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "In the event that a condition exists on a corner lot, subject to the above, which interferes with or obstructs clear sight distance, as described herein, the Town shall provide the owner of such lot with a notice, which shall be delivered by regular mail at the address shown on the last assessment roll of the Town, advising said owner of the existence of a violation of this provision and that said violation must be cured within 30 days of the date of such notice. If at the end of such thirty-day period, such condition is not cured, then the Town is hereby authorized to enter upon said lot and to correct such condition. The owner of said lot shall be responsible for all costs incurred by the Town in connection with its correcting said condition. The Town shall provide the owner of said lot with an invoice representing the cost to the Town for correcting the condition. The owner shall be responsible for remitting payment in full to the Town within 30 days of the date of such invoice. Failure of the owner to remit payment in full pursuant to such invoice shall result in the amount owed being a lien upon the property and placed upon the next Town tax bill as an additional tax lien and collected in the same manner as other Town taxes. The rights, remedies, penalties and provisions, as provided hereunder, shall be in addition to those provided elsewhere in this chapter, including § 60-530 hereof.[Added 12-22-1992 by L.L. No. 19-1992]"
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(7) ",
											"content": [
												{
													"text": "Courts. The least horizontal dimension of any court, at any level,\nshall not be less than the height of any vertical wall forming part\nof such court above the sill of the lowest window served by such court,\nbut not less than 20 feet in any case."
												}
											]
										},
										{
											"number": "(8) ",
											"content": [
												{
													"text": "Swimming pools."
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "A swimming pool shall be set back from lot lines at least the\nminimum distance required for a principal building in the district\nin which it is located, except that such facility shall not be located\nin a front yard unless it is set back at least three times the distance\nrequired for a principal building and the lot has an area equal to\nat least three times the minimum requirement for the district in which\nit is located. The minimum required setbacks established for swimming\npools shall also apply to cabanas and decks or terraces surrounding\nthe pool, as well as to all structures and mechanical equipment or\nother appurtenances related to their use and operation.[Amended 7-26-1988 by L.L. No. 11-88; 5-23-1995 by L.L. No. 6-1995]"
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "Swimming pool enclosures shall comply with the New York State\nUniform Fire Prevention and Building Code, as the same may be amended\nfrom time to time.[Amended 3-8-1988 by L.L. No. 2-1988[2]]"
																},
																{
																	"footnote": "[2]\nEditor's Note: This local law also repealed former §§ 60-423.83\nand 60-433.84, which dealt with pool enclosures.\n"
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(9) ",
											"content": [
												{
													"text": "Tennis and platform tennis courts.[Added 4-26-1977 by L.L. No. 5-1977]"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "The construction and use of a tennis court or platform tennis\ncourt shall be permitted only where such facility is clearly incidental\nand accessory to a permitted principal use on the same premises therewith\nand only when it is limited to the personal use and enjoyment to the\nresidents of the premises and their guests and is not operated for\nprofit."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "A tennis court or platform tennis court and appurtenant enclosure\nshall be set back from all lot lines at least the minimum distance\nrequired for a principal building in the district in which it is located,\nexcept that such facility shall not be located in a front yard unless\nset back at least three times the distance required for a principal\nbuilding and the lot has an area equal to at least three times the\nminimum requirements for the district in which it is located.[Amended 5-23-1995 by L.L. No. 6-1995]"
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "A tennis court or platform tennis court shall not be lighted\nfor night play, except by special permit issued by the Zoning Board\nof Appeals, upon a determination that such lighting will have no adverse\nimpact upon, or interfere with, the use and enjoyment of neighboring\nresidential properties. The Board shall attach such conditions and\nsafeguards to any special use permit, which are, in its opinion, necessary\nto ensure initial and continual conformity with this requirement.\nIn all cases, the Board shall retain continuing jurisdiction."
																}
															]
														},
														{
															"number": "(d) ",
															"content": [
																{
																	"text": "Drainage facilities, subject to the approval of the Town Engineer,\nshall be provided as necessary to prevent any increase in the quantity\nof off-site runoff or in its surface channelization as a result of\nthe construction of such tennis court or platform tennis court."
																}
															]
														},
														{
															"number": "(e) ",
															"content": [
																{
																	"text": "Where determined necessary or appropriate by the Building Inspector, a buffer screening area complying with the requirements of § 60-420D(2) of this chapter may be required."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(10) ",
											"content": [
												{
													"text": "Exception for existing alignment of buildings. In any district\nif, on the same side of a street, there is a pronounced uniformity\nof alignment of the fronts of existing buildings and of the depths\nof front yards less than the requirements specified in the Schedule\nof District Regulations,[3] said proposed building need not be set back from the street\nline a distance greater than the average setback of such existing\nbuildings, except that such reduced setbacks in business and industrial\ndistricts shall be permitted only where approved by the Zoning Board\nof Appeals as being in accordance with the spirit and intent of this\nchapter.[Amended 5-23-1995 by L.L. No. 6-1995]"
												},
												{
													"footnote": "[3]\nEditor's Note: Said Schedule is located at the end of\nthis chapter.\n"
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "Miscellaneous regulations."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Exterior lighting.[Amended 10-23-1990 by L.L. No. 38-1990]"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "To the extent reasonably practicable, all exterior lighting\nused for nonresidential purposes, including the lighting of signs,\nshall be directed away from adjoining residential properties and streets."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "It shall be unlawful for any person owning, using or occupying\nproperty that is subject to this chapter to use or permit the use\nof exterior lighting upon such property in a manner which unreasonably\ninterferes with the use or enjoyment of neighboring residential property\nor creates a public safety hazard or nuisance."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Buffer screening areas. Any application for the erection, construction,\nenlargement, alteration or movement of any building or structure or\nfor the establishment of any use within any business or industrial\ndistrict or any nonresidential use in any residence district shall\ninclude provisions for a buffer screening area at least 10 feet in\nwidth along any lot line abutting or, if determined necessary by the\napproving authority, directly across the street from any lot in a\nresidence district. This requirement may be waived by the approving\nauthority in situations where it determines that large distances,\ntopographic features or existing vegetation satisfy the same purpose.\nWhere such a buffer screening area is required, it shall meet the\nfollowing standards:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "Be of evergreen planting of such type, height, spacing and arrangement\nas, in the judgment of the approving authority, will screen the activity\ninvolved from the neighboring residential area. Nonevergreen planting\nmay seasonally supplement evergreen planting but not take its place."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "The plan and specifications for such planting shall be filed\nwith the plans for the use of the lot."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "Required planting shall be properly trimmed and maintained in\ngood condition at all times."
																}
															]
														},
														{
															"number": "(d) ",
															"content": [
																{
																	"text": "A wall or fence, of location, height, design and materials approved\nby the approving authority as providing equivalent screening, may\nbe substituted for part or all of the required planting."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "General property maintenance. Every owner or tenant of any property used for commercial purposes shall maintain the premises free of litter, garbage, refuse and rubbish of every kind, as such materials are defined in Chapter 85, Littering, of the New Castle Town Code.[Amended 10-8-1991 by L.L. No. 19-1991]"
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "(Reserved)[4]"
												},
												{
													"footnote": "[4]\nEditor's Note: Former § 60-424.4, Noise, added 12-16-1980 by L.L. No. 19-1980, as amended 6-25-1985 by L.L. No. 9-1985, was repealed 4-11-1989 by L.L. No. 8-1989. See now Ch. 90, Noise.\n"
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "Solar access and energy considerations. Access to sunlight for present\nand potential solar energy systems, both on- and off-site, as well\nas building siting, orientation and landscaping shall be considered\nby approving authorities as part of their review of any application.[Added 9-14-1982 by L.L. No. 11-1982]"
												}
											]
										},
										{
											"number": "(6) ",
											"content": [
												{
													"text": "Transition between residential and nonresidential districts.[Added 10-25-1983 by L.L. No. 10-1983]"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "Recognizing that the potential for conflict between incompatible land uses is greatest at the border between residential and nonresidential districts, and for the purpose of protecting the health, safety, welfare and property values of persons and properties in such areas by assuring a more orderly transition between commercial and residential neighborhoods,including the possible limitation of potentially undesirable uses in such locations, it is hereby declared to be the policy of the Town of New Castle to establish transition areas at the perimeter of all business and industrial districts. This is in addition and supplementary to the requirement for the provision of landscaped buffer screening in such areas, as required by § 60-420D(2) above."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "Within such transition areas, the reviewing agency, whether\nit is the Planning Board or the Zoning Board of Appeals, is hereby\ngranted the authority necessary to accomplish the purposes of this\nsection within the limitations as set forth below. This additional\nauthority shall apply only to lots within business and industrial\ndistricts, any portion of which is situated within 100 feet of any\nportion of a lot in a residence district. Implementation of this authority\nshall be accomplished as part of the site plan or special permit review\nprocess, as appropriate to the particular application involved."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "On lots within the defined transition area, the Planning Board\nor the Zoning Board of Appeals, as appropriate, may require limitations\non the types of uses permitted, the type, intensity and location of\nexterior lighting, the storage of refuse, the loading and unloading\nof trucks, the location of signs and other similar factors to the\nextent determined necessary by said Board to accomplish the purposes\nof transition zoning as set forth herein. These limitations may include,\nbut are not limited to, the authority to prohibit certain special\npermit uses entirely within such transition areas if it is determined\nby the reviewing agency that the potentially adverse impacts of such\nuses cannot be sufficiently mitigated by other means."
																}
															]
														}
													]
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "Nonconforming uses and other nonconformities."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Continuing existing uses. Except as otherwise provided herein [particularly in § 60-420E(6) and (7)], the lawfully permitted use of land or structures existing at the time of the adoption of this chapter may be continued although such use does not conform to the standards specified for the zone in which such land or structure is located. Said uses shall be deemed legal nonconforming uses."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Legal nonconforming use of land. Where no structure is involved,\nthe legal nonconforming use of land may be continued, provided, however:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "That no such nonconforming use shall be enlarged or increased,\nnor shall it be extended to occupy a greater area of land than that\noccupied by such use at the time of the adoption of this chapter."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "That no such nonconforming use shall be moved in whole or in\npart to any other portion of the lot or parcel of land occupied by\nsuch nonconforming use at the time of the adoption of this chapter."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "That if such nonconforming use or any portion thereof ceases\nfor any reason for any continuous period of more than 90 days, or\nis changed to a conforming use, any future use shall be in conformity\nwith the provisions of this chapter for the district in which such\nuse is located."
																}
															]
														},
														{
															"number": "(d) ",
															"content": [
																{
																	"text": "That no nonconforming use of land shall be changed to another\nnonconforming use."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Legal nonconforming use of structures."
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "A structure, the use of which does not conform to the use regulations\nfor the district in which it is situated shall not be altered, enlarged\nor extended unless the use thereof is changed to a conforming use,\nexcept that the Board of Appeals, after public notice and hearing,\nmay permit a legal nonconforming use to be extended throughout those\nparts of a structure which were manifestly arranged or designed for\nsuch use prior to the time of the enactment of the chapter provision\nthat made the use nonconforming, if no structural alterations other\nthan those required for health or safety are made therein."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "Such nonconforming use of a structure shall not be changed to\nanother nonconforming use, except where approved by the Board of Appeals\nafter a finding that the change will be to a substantially less nonconforming\nuse and one that will be more harmonious with the surrounding area."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "If any legal nonconforming use of a structure ceases for any\nreason for a continuous period of more than six months, or is changed\nto a conforming use, or if the structure in or on which such use is\nconducted or maintained is moved for any distance whatever, for any\nreason, then any future use of such structure shall be in conformity\nwith the standards specified by this chapter for the district in which\nsuch structure is located."
																}
															]
														},
														{
															"number": "(d) ",
															"content": [
																{
																	"text": "If any structure in which any such nonconforming use is conducted\nor maintained is hereafter removed, the subsequent use of the land\non which such structure was located and the subsequent use of any\nstructure thereon shall be in conformity with the standards specified\nby this chapter for the district in which such land or structure is\nlocated."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "Notwithstanding the provisions of § 60-420E(2) and (3), an owner of any land, building or structure containing a nonconforming use may apply to the Planning Board for site development plan approval which includes proposed changes and modifications to the nonconforming use in order that the nonconforming use may be brought into greater conformity with this chapter and that the adverse external impacts of such use may be reduced. Such application shall include a site development plan indicating the proposed changes in the nonconforming building, structure or use as well as proposals for related improvements in landscaping, buffer areas, the location and layout of parking areas and access drives, aesthetics, reduction of noise, smoke, odors and the discharge of effluents, changes in lighting, signage, buildings and drainage and other such similar modifications and improvements. Following a public hearing, as may be otherwise required for site development plan approval, the Planning Board may approve or modify and approve the application, provided that it is determined that the purposes of this section will be met. In the absence of such determination by the Planning Board, the application shall be disapproved.[Added 10-25-1983 by L.L. No. 9-1983]"
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "Legal nonconformity, other than use.[Amended 6-27-1989 by L.L. No. 12-1989; 5-23-1995 by L.L. No.\n6-1995]"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "A nonconforming building or structure may not be added to, extended or enlarged to result in an increase or expansion of a nonconformity, other than use, without a variance from the Zoning Board of Appeals in accordance with § 60-540D(2) of this chapter. An increase or expansion of a nonconformity, other than use, shall include but not be limited to an extension of a structure that is nonconforming as to the required yard along the same line that established the nonconforming yard and that maintains the same legal nonconforming distance from the property line as existed for the original portion of the building."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "A nonconforming structure may be altered in whole or in part\nin a way that diminishes the extent of its nonconformity, other than\nuse, without first receiving approval from the Zoning Board of Appeals\nas required in the previous subsection; provided, however, that once\na nonconforming structure is made less nonconforming, it shall not\nbe permitted to return to any extent or degree of its previous nonconformity,\nother than use."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "A nonconforming building or structure shall not be moved in\nwhole or in part unless such building or structure is made to conform\nto all of the regulations of the district in which it is to be located."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(6) ",
											"content": [
												{
													"text": "Restoration of damaged structures. If a building is damaged or destroyed\nby fire or other casualty, it may be repaired or reconstructed in\nthe same location with the same habitable floor area and height, or\nless, as it existed prior to such fire or other casualty, notwithstanding\nthat prior to such fire or other casualty it fell within the definition\nof \"nonconforming use, legal,\" or \"nonconformity other than use, legal,\"\nof this chapter. However, any such repair or reconstruction must comply\nwith all fire, construction, health and safety rules, regulations,\nordinances and laws applicable at the time of repair or reconstruction.\nSubstantial work of any such repair or reconstruction must be commenced\nwithin a period of 24 months after the damage or destruction of the\nbuilding and shall be diligently prosecuted to completion.[Amended 7-11-1995 by L.L. No. 7-1995]"
												}
											]
										},
										{
											"number": "(7) ",
											"content": [
												{
													"text": "(Reserved)[5]"
												},
												{
													"footnote": "[5]\nEditor's Note: Former § 60-425.6, Removal of\nexisting nonconforming signs, was repealed 10-14-1997 by L.L. No.\n18-1997.\n"
												}
											]
										},
										{
											"number": "(8) ",
											"content": [
												{
													"text": "Compliance with limitations on external effects of uses. In order that all legal nonconforming uses may gradually be brought into greater conformity with the chapter or the adverse external effects of such nonconforming uses may be reduced, the Planning Board may review any nonconforming use and propose a plan where, through better screening areas, control of outdoor storage, noise, smoke, odors, lighting and other characteristics described in § 60-420B(3), architectural changes, location and layout of parking areas and access drives, or by other appropriate means, such purposes may be achieved. Such plan shall be presented to the Town Board, which, after public notice and hearing, may approve such plan. Within a period of not more than three years from the date the Town Board approves such a plan, the owner of the property where the nonconforming use is located shall bring such use into compliance with such plan as a condition of continuing its legal nonconforming status under this chapter."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "F. ",
							"content": [
								{
									"text": "Off-street parking and loading facilities."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "General. All structures and land uses shall be provided with a sufficient\namount of off-street parking to meet the needs of persons employed\nat or making use of such structures or land uses and sufficient off-street\nfacilities to meet the needs of such structures or land uses, but\nnot less than the minimum standards of § 60-42F(3) and (6).\nNo certificate of occupancy shall be issued for any structure or land\nuse until the required off-street parking and loading space has been\nestablished. Notwithstanding the foregoing, in the B-RP District,\nthe requirement for providing off-street parking and loading spaces\nshall be waived where the applicant has voluntarily offered to dedicate\nto the parking district or the Town of New Castle an easement over\nthe entire designated parking/loading/circulation/setback area on\nthe site proposed for development for off-street parking, loading\nand/or circulation purposes.[Amended 3-12-1991 by L.L. No. 5-1991]"
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Existing structures and uses."
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "Structures and land uses in existence or for which building\npermits have been approved at the time of the adoption of this chapter\nshall not be subject to the parking or loading space requirements\nof this chapter, provided that any parking and loading facilities\nthen existing to serve such structures or uses shall not, with the\nexceptions hereinafter provided, in the future be reduced except where\nthey exceed such requirements. Required parking and loading facilities\nfor the existing portion of such shall, however, be provided at the\ntime of any enlargement of such existing structures or uses in the\nfuture.[Amended 10-8-1974]"
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "In case of practical difficulty or unnecessary hardship to such\nproperties arising out of this requirement, appeal may be made to\nthe Board of Appeals, which shall require such degree of compliance\nas it may deem reasonable for that part of the structure or use that\nis legally nonconforming, but shall not waive any part of the requirement\nfor that part of the structure or use that constitutes an enlargement\nor expansion, and shall not permit reduction or elimination of whatever\nquantity of parking or loading that may already exist, unless it is\nin excess of requirements, in which case it shall not be reduced below\nsuch requirements. Notwithstanding the foregoing, in case of practical\ndifficulty or unnecessary hardship, the Board of Appeals may waive\npart or all of the parking requirement in connection with the expansion\nof a place of worship when such use is located within a business district\nand when the expanded facilities shall be used solely on Sunday or\nafter 6:00 p.m. or in connection with worship services, provided that\nsaid Board shall attach such conditions and safeguards to the waiver\nas it may deem necessary to protect the public health, safety, morals\nand general welfare.[Amended 10-8-1974]"
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "Required off-street parking facilities which after development\nare later dedicated and accepted by the Town shall be deemed to continue\nto serve the uses or structures for which they were originally provided."
																}
															]
														},
														{
															"number": "(d) ",
															"content": [
																{
																	"text": "(Reserved)[6]"
																},
																{
																	"footnote": "[6]\nEditor's Note: Former § 60-426.2(d), which\ndealt with requirements in the B-RP District, as amended, was repealed\n3-12-1991 by L.L. No. 5-1991.\n"
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Parking standards.[Amended 12-9-1986 by L.L. No. 22-1986]"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "Schedule of off-street parking requirements."
																},
																{
																	"content": [
																		{
																			"number": "[1] ",
																			"content": [
																				{
																					"text": "Off-street parking facilities shall be provided as required by the list below, except where additional parking may be required under § 60-430, or as may be modified under the provisions of § 60-420F(2)."
																				}
																			]
																		},
																		{
																			"number": "[2] ",
																			"content": [
																				{
																					"text": "Where two or more different uses occur on a single lot, the\ntotal amount of parking facilities to be provided shall be the sum\nof the requirements for each individual use on the lot, except that\nthe Planning Board may approve the joint use of parking spaces by\ntwo or more establishments on the same or contiguous lots, the total\ncapacity of which is no more than 15% less than the sum of the spaces\nrequired for each, provided that the Planning Board finds that the\ncapacity to be provided will substantially meet the intent of the\nrequirements by reason of variation in the probable time of maximum\nuse by patrons and employees among such establishments, and provided\nthat such approval of such joint use shall be automatically terminated\nupon the termination of the operation of any such establishments.\nIf more than one lot is involved, the Planning Board shall require,\nas condition of its approval, a legal instrument, satisfactory to\nthe Town Attorney, assuring the continued use of joint parking facilities\nin connection with the uses they serve."
																				}
																			]
																		}
																	]
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "Size of parking spaces. Unless specifically provided for elsewhere\nin this chapter or in applicable state codes, each parking space shall\nbe at least nine feet in width and 18 feet in depth, if unenclosed,\nand at least 10 feet in width and 18 feet in depth if bordered by\nwalls or columns on two or more sides, all exclusive of aisles and\ndriveways appurtenant thereto. Such spaces shall be known as standard\nparking spaces. Exceptions to this requirement may be permitted as\nfollows:"
																},
																{
																	"content": [
																		{
																			"number": "[1] ",
																			"content": [
																				{
																					"text": "Where standard parking spaces are defined by curbs providing\nspace for the overhang of vehicles, such spaces may, in the discretion\nof the Planning Board, be reduced in depth to 16 feet, provided that\nvehicles will not encroach upon sidewalks or other pedestrian areas,\nand further provided that at least three feet of separation is provided\nbetween the overhang space of adjacent parking bays."
																				}
																			]
																		},
																		{
																			"number": "[2] ",
																			"content": [
																				{
																					"text": "Parking spaces designated for use by employees may be permitted\nby the Planning Board, provided that such spaces are used on a nontransient\nbasis (car parked for at least three hours in the same space) and\nare reserved exclusively for employees, and further provided that\nat least 10% of the required number of spaces are standard parking\nspaces which shall be reserved for visitors. Employee parking spaces\nshall be at least eight feet six inches in width and 18 feet in depth."
																				}
																			]
																		},
																		{
																			"number": "[3] ",
																			"content": [
																				{
																					"text": "On sites containing nonresidential uses which require at least\n50 or more off-street parking spaces, the Planning Board may, in its\ndiscretion, permit up to 25% of the spaces provided to be compact\nspaces, provided that such spaces are grouped together on the lot\nin appropriate location and are clearly marked as being reserved for\ncompact cars only. Compact parking spaces shall be at least eight\nfeet in width and 16 feet in depth."
																				}
																			]
																		},
																		{
																			"number": "[4] ",
																			"content": [
																				{
																					"text": "Parking spaces designated for use by handicapped persons shall\nbe at least 13 feet in width and 18 feet in depth and shall include\na designated access aisle of at least five feet in width. Such spaces\nshall be located along the most direct circulation route to an accessible\nbuilding entrance and shall be sited so that it is not necessary for\na handicapped person to travel along any vehicular aisle enroute to\nan accessible walkway. Handicapped parking spaces shall be so designated\nwith appropriate signage."
																				}
																			]
																		}
																	]
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "Location of off-street parking facilities."
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "The required off-street parking facilities shall be provided\non the same lot or premises with the structure or land use they serve,\nexcept that off-street parking spaces required for structures or land\nuses on two adjoining lots may be provided in a single common facility\non one or both of said lots, and except that the Planning Board may\npermit all or part of the required spaces to be located on any lot\nentirely within 250 feet of the building or land use in the same zoning\ndistrict or another zoning district where such parking is a lawful\nuse, if the Planning Board determines that it is impractical to provide\nparking on the same lot with the building."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "Where the Planning Board approves the location of such parking\nspaces on a lot which is different from the lot occupied by the use\nserved by the parking spaces, the Planning Board shall require, as\na condition of its approval, a legal instrument, satisfactory to the\nTown Attorney, assuring the continued use of said parking spaces in\nconnection with the land uses and structures they serve."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "Operation and maintenance of off-street parking facilities. Required\noff-street parking facilities shall be maintained as long as the use\nor structure exists which the facilities are designed to serve. Required\nparking spaces developed for specific structures and uses shall be\nreserved at all times for those persons who are employed at or make\nuse of such structures and land uses, except when dedicated to and\naccepted by the Town as public parking areas."
												}
											]
										},
										{
											"number": "(6) ",
											"content": [
												{
													"text": "Off-street loading requirements. Off-street loading facilities shall\nbe located on the same lot with the use to be served and shall meet\nthe following requirements:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "For retail and service business establishments, restaurants\nand other places serving food and beverages: one space for the first\n10,000 square feet of floor area or portion thereof, provided that\nit is in excess of 1,500 square feet used for business purposes, and\none space for each additional 10,000 square feet or major portion\nthereof."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "For industry, wholesale businesses, storage warehouses and other\ncommercial establishments: one space for the first 5,000 square feet\nor portion thereof in excess of 1,500 square feet used for such purposes\nand one additional space for each 10,000 square feet or major portion\nthereof in excess of the first 5,000 square feet."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "For research laboratories and office buildings: one space for\nthe first 25,000 square feet or major portion thereof and one additional\nspace for each additional 150,000 square feet or major portion thereof.[Added 6-22-1983 by L.L. No. 5-1983[7]]"
																},
																{
																	"footnote": "[7]\nEditor's Note: This local law also redesignated former\n§ 60-426.6(c) and (d) as § 60-426.6(d) and (e).\n"
																}
															]
														},
														{
															"number": "(d) ",
															"content": [
																{
																	"text": "For nursery schools and/or day-care centers, the number, size\nand location of the loading area(s) required shall be determined by\nthe Planning Board, provided that not less than one such loading area\nshall be required for each nursery school/day-care center. Where a\nnursery school/day-care center shares common parking and/or circulation\nareas with another use, the nursery school/day-care center's\nloading requirement may be satisfied by such other use's required\nloading area, provided that the applicant demonstrates to the Planning\nBoard's satisfaction that joint use of such loading area will\nadequately meet the aggregate needs of both uses.[Added 7-12-1994 by L.L. No. 13-1994[8]]"
																},
																{
																	"footnote": "[8]\nEditor's Note: This local law also provided for the renumbering\nof former § 60-426.6(d) and (e) as § 60-426.6(e)\nand (f), respectively.\n"
																}
															]
														},
														{
															"number": "(e) ",
															"content": [
																{
																	"text": "Off-street loading requirements for structures and land uses\nwhich do not fall within the categories listed above shall be determined\nby the Town Board and adopted as an amendment to this chapter."
																}
															]
														},
														{
															"number": "(f) ",
															"content": [
																{
																	"text": "Where, because of the special nature of a particular business\nor industrial use, the Planning Board determines that the above amount\nof off-street loading space would exceed the actual need, at least\ninitially, the Board may permit the construction of a lesser number\nof such spaces, provided that the site plan indicates the location\nof potential additional loading spaces which the Planning Board determines\nmay be needed in the future and contains adequate notations to assure\nthe eventual construction of such spaces if and when the need for\nthem is determined by the Planning Board.[Amended 6-22-1983 by L.L. No. 5-1983]"
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(7) ",
											"content": [
												{
													"text": "Improvement of parking and loading facilities."
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "Improvement."
																},
																{
																	"content": [
																		{
																			"number": "[1] ",
																			"content": [
																				{
																					"text": "Required off-street parking and loading facilities may be enclosed\nin a structure or may be open, provided that all such facilities shall\nbe graded, surfaced, drained and suitably maintained to the satisfaction\nof the Town Engineer, to the extent necessary to avoid nuisances of\ndust, erosion or excessive water flow across public ways or adjacent\nlands. In appropriate situations, the Town Engineer may require that\nthe parking area be provided with suitable markings to indicate individual\nparking spaces, maneuvering area, entrances and exits."
																				}
																			]
																		},
																		{
																			"number": "[2] ",
																			"content": [
																				{
																					"text": "Where the Planning Board determines that the immediate use of\nany property may not require the full improvement of all off-street\nparking and loading facilities, the Planning Board may waive the improvement\nof no more than 1/3 of the required number of spaces, provided that\nthe total number of spaces is shown on the approved plan, provided\nthat the area not to be improved is reserved for future use (if and\nwhen needed) and further provided that satisfactory guaranties, approved\nby the Planning Board and the Town Attorney, are given for the eventual\nimprovement of any such spaces which may have been waived within six\nmonths of the date of the mailing to the property owner of a copy\nof the Planning Board resolution deeming that such spaces, in that\nBoard's opinion, have become necessary and must be constructed."
																				}
																			]
																		}
																	]
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "Internal landscaping."
																},
																{
																	"content": [
																		{
																			"number": "[1] ",
																			"content": [
																				{
																					"text": "In all off-street parking areas containing 25 or more parking\nspaces, at least 6% of the total parking area shall be curbed and\nlandscaped with appropriate trees, shrubs and other plant materials\nas determined necessary by the reviewing authority to assure the establishment\nof a safe, convenient and attractive parking facility. Whenever possible,\nraised planting islands at least eight feet in width shall be used\nto separate opposing rows of parking spaces so as to provide adequate\nspace for plant growth and for pedestrian circulation. Such raised\nplanting islands and the landscaping within them shall be designed\nand arranged in such a way as to provide vertical definition to major\ntraffic circulation aisles, entrances and exits; to channel internal\ntraffic flow and to prevent indiscriminate diagonal movement of vehicles;\nand to provide relief from the visual monotony and shadeless expanse\nof a large parking area."
																				}
																			]
																		},
																		{
																			"number": "[2] ",
																			"content": [
																				{
																					"text": "The selection, amount and location of all landscaping materials\nshall be subject to approval by the reviewing authority, based upon\nconsiderations of the adequacy of the proposed landscaping to serve\nits intended purpose with a minimum amount of maintenance problems,\nincluding plant care, snowplowing and leaf removal. At least one tree,\nof not less than three inches caliper at a height of three feet above\ngrade, shall be provided within such parking area for each 12 parking\nspaces."
																				}
																			]
																		},
																		{
																			"number": "[3] ",
																			"content": [
																				{
																					"text": "All landscaping shall continue to be maintained in a healthy\ngrowing condition throughout the duration of the structure or use\nwhich it is intended to serve."
																				}
																			]
																		}
																	]
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "Buffer screening. Except for one-family dwellings, suitable evergreen landscaping and screening shall be provided between parking areas and adjoining property in residence districts. [See § 60-420D(2) for requirements.]"
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(8) ",
											"content": [
												{
													"text": "Driveways.[Amended 6-24-1980 by L.L. No. 8-1980; 2-9-1993 by L.L. No.\n5-1993]"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "General. For reasons of traffic safety, both on- and off-street, as well as to provide for possible future road widening and/or other improvements, all new driveways entering onto any street shall comply with all requirements of this chapter and shall be subject to the approval of the Town Engineer, except where such are part of a use subject to special permit or site development plan approval under § 60-430 or § 60-440, respectively. The approving authority may require the applicant to furnish necessary topographic, design and other pertinent information to demonstrate to its satisfaction that driveways from the street to the building site can be constructed in accordance with the standards of this chapter and that such driveways are designed to provide adequate and convenient space for turning vehicles around on the subject property so as to avoid requiring such vehicles to be backed out onto a sidewalk or into a street right-of-way."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "Driveway grades."
																},
																{
																	"content": [
																		{
																			"number": "[1] ",
																			"content": [
																				{
																					"text": "The maximum grade for any new driveway appurtenant to one or\nmore one-family dwellings and connecting their required off-street\nparking areas to a street shall be 14%, except that where it can be\ndemonstrated to the satisfaction of the Town Engineer that, because\nof practical difficulty or unnecessary hardship affecting a particular\nproperty, the construction of a driveway with a grade of 14% or less\nis impractical, the Town Engineer may permit the construction of a\nsteeper driveway, provided that the increase in driveway grade is\nthe minimum increase required, and further provided that in no case\nshall such driveway grade be permitted to exceed 16%."
																				}
																			]
																		},
																		{
																			"number": "[2] ",
																			"content": [
																				{
																					"text": "The maximum grade for new driveways appurtenant to uses other than one-family dwellings and connecting the required off-street parking area to the street shall not exceed 10%, except that the Planning Board, with respect to site plans and special permits over which it has jurisdiction, or the Board of Appeals, with respect to special permits over which it has jurisdiction, as the case may be, shall have the same power to permit increased grades here as in Subsection F(8)(b)[1] above, provided that in no case shall such grades be permitted to exceed 12%."
																				}
																			]
																		},
																		{
																			"number": "[3] ",
																			"content": [
																				{
																					"text": "Notwithstanding the maximum permitted grades specified in Subsections (1) and (2) above, no driveway entering onto any street shall have a grade greater than 5% within 35 feet of the center line of the traveled way of the street or within 10 feet of the property line of the street, whichever distance is more restrictive. The Town Engineer, with respect to one-family dwellings, may permit the amount of this grade to be increased to 7% where it is demonstrated to his satisfaction that, because of practical difficulty or unnecessary hardship affecting a particular property, a lesser grade would be impractical and the driveway would still be adequate."
																				}
																			]
																		},
																		{
																			"number": "[4] ",
																			"content": [
																				{
																					"text": "Notwithstanding the maximum permitted grades specified in Subsections (1), (2) and (3) above, the maximum permissible change of driveway grade shall be 6%. If necessary to avoid a change of greater than 6%: (a) one or more transition sections of not less than 20 feet in length or (b) a vertical curve of not less than 100 feet in length shall be provided."
																				}
																			]
																		}
																	]
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "Driveway alignment and location. The platform portion of a driveway required, in accordance with § 60-420F(8)(b) above, to have a grade of 5% or less shall be aligned at approximately right angles to the street. The approving authority shall also require any other design modification which, in its opinion, is necessary to assure that any driveway entering onto a street shall be located and aligned in such a way as not to create any traffic hazard. Driveways shall be located at a minimum of 50 feet from the theoretical edge of all interconnecting streets extended, except where a lesser distance may be approved upon application to the Planning Board. Except as set forth below, no more than one curb cut providing driveway access to a lot containing a one-family dwelling shall be permitted. In the R-2A District, one additional curb cut providing access to a lot containing a one-family dwelling shall be permitted, provided that it is demonstrated to the satisfaction of the Planning Board that such lot could theoretically be subdivided in accordance with all applicable dimensional requirements of this chapter. Where a driveway loop is proposed on a lot containing a one-family dwelling, the nearest edge of such driveway loop shall not be located in a front yard unless it is set back from the front lot line a distance equal to that required for a principal building in the district in which such lot is located. Such driveway loop shall also be located wholly outside any wetlands or adjacent area, wetlands buffer as defined in Chapter 137, Wetlands, or Chapter 64, Environmental Protection Overlay Regulations, if the property is located within Environmental Protection Overlay District, of the Code of the Town of New Castle.[Amended 7-23-2002 by L.L. No. 5-2002]"
																}
															]
														},
														{
															"number": "(d) ",
															"content": [
																{
																	"text": "Visibility. Clear visibility shall be provided so that an automobile stopped on the platform portion of a driveway, as required by § 60-420F(8)(b)[3] above, shall, at the intersection of the driveway with the street, have adequate stopping sight distance in both directions and so that automobiles traveling on such street shall also have adequate stopping sight distance. Stopping sight distance requirements shall be as specified in the latest edition of \"A Policy on Geometric Design of Highways and Streets,\" published by the American Association of State Highway and Transportation Officials (AASHTO). Such minimum sight distance requirements may be increased, as determined necessary by the Town Engineer in the exercise of his professional judgment, based upon consideration of the particular driveway and street characteristics, including but not limited to the number of vehicles projected to use the driveway on a regular basis."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(9) ",
											"content": [
												{
													"text": "Alternative method of providing parking spaces. Where, because of\nlimitations of size, dimensions or topography of lot, an applicant\nfor a building permit in a business district finds it impracticable\nto provide all or a portion of the off-street parking spaces required\nin connection with a proposed building or addition, he may offer to\ngrant and convey to the Town or an existing parking district appropriately\nlocated and developed land for commercial parking in an equivalent\namount. If the Planning Board concurs in such finding and in the appropriateness\nof the proposed land for parking, the Town Board or such existing\nparking district, at its discretion, may accept such developed land,\nprovided that it is permanently dedicated."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "G. ",
							"content": [
								{
									"text": "Parkland or parkland fees with multifamily site plan approval.[Added 5-22-1990 by L.L. No. 26-1990; amended 9-12-1995 by L.L. No.\n9-1995]"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Legislative intent. Pursuant to the authority duly vested in it and\nupon a finding that a proper case exists in accordance with the provisions\nof Town Law § 274-a, it is the intention of the Town Board\nto require the provision of parkland and recreation land in conjunction\nwith developments in the following multifamily residential district\nand for the following uses: Multifamily Residence -- Chappaqua (MFR-C),\nMultifamily Residence -- Millwood (MFR-M), Multifamily Planning Development\n(MFPD) and Multifamily Designed Residential Development (MFDRD). The\nTown of New Castle finds that multifamily housing places an added\nburden on the Town in providing adequate park and recreation areas\nto serve the needs of multifamily housing residents. In the event\nthat it is not practical for a particular development to provide park\nand recreation areas, it is in the best interest of the Town and its\nresidents to require funds to be paid to the Town exclusively for\nneighborhood parks, playgrounds or recreational purposes, including\nthe acquisition of property. Such funds will be intended to benefit\nprimarily, but not exclusively, the residents of the development subject\nto the fee."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Recreation areas. Consistent with the requirements of § 60-420G(1) and except as provided in § 60-420G(3) below, each multifamily development shall include a park and/or recreation area (\"recreation area\") which is planned, designed and maintained for the exclusive use of the residents of such development and their nonpaying guests. The recreation area for a multifamily development in MFR-C, MFR-M and MFPD Districts shall constitute not less than 12% of the total site area, of which at least 75 square feet of lot area per dwelling unit or not less than 50 square feet per bedroom, whichever is greater, shall be improved with the recreational facilities as determined necessary by the Planning Board. The recreation area in an MFDRD shall constitute not less than 8%, 5% or 3% of the total site area in the R-1/2A, R-1A or R-2A District, respectively, of which at least 150 square feet of lot area per dwelling unit or not less than 100 square feet per bedroom, whichever is greater, shall be improved with the recreational facilities as determined necessary by the Planning Board. The plan for the recreational area shall be subject to Planning Board approval as to location, design and adequacy, taking into consideration the size of the development, the anticipated occupancy of the units and the anticipated recreational needs of the population to reside there."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Fee in lieu of setting aside recreation area."
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "Where the Planning Board determines that a proper case exists for requiring parklands to be shown on the site plan but that a suitable recreation area of adequate size for park and recreation purposes and improved with adequate recreational facilities cannot be properly located in any such development or as otherwise not practical, the Board may require, as a condition of approval of any site plan, a payment to the Town of the sum pursuant to Subsection G(3)(b) hereof or any part thereof in proportion to the amount of required land and/or facilities not provided which shall constitute a trust fund to be used by the Town exclusively for neighborhood park, playground and recreation purposes, including acquisition of property."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "Fee Schedule. In a MFR-C, MFR-M, MFPD and MFDRD District, there\nshall be a recreation fee for each dwelling unit as set forth by resolution\nof the Town Board in the Master Fee Schedule, which may be amended,\nbased on the following dwelling unit sizes: efficiency (studio apartment),\n1-bedroom apartment, 2-bedroom apartment, 3-bedroom apartment, and\n4-bedroom apartment or single-family detached dwelling.[Amended 9-10-2002 by L.L. No. 8-2002]"
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "Exemptions."
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "Property owners whose land is part of a previously approved\nsubdivision consisting of the same number of lots from which parkland\nor a fee in lieu thereof has been provided pursuant to the Town of\nNew Castle Subdivision Regulations[9] shall be exempt from the provisions of § 60-420G."
																},
																{
																	"footnote": "[9]\nEditor's Note: See Ch. 113, Subdivision of Land.\n"
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "Where a tract of land approved for development under § 60-420G(3), for which a fee in lieu of parkland has been received, is subsequently processed as a subdivision, credit against any fee normally arising from the subdivision will be given for any fee already paid under § 60-420G(3). A development will be exempt from further fees to the extent of the number of lots or bedrooms for which fees in lieu of parkland have already been paid, and payment of further fees shall be required only for the number of lots or bedrooms which exceed those previously approved."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "Accessory apartments shall be excluded from the application\nof this chapter."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "Waivers. The Town Board, in its discretion, after public hearing, may waive the payment of the recreation fee otherwise due under § 60-420G(3) upon finding that such waiver is necessary and appropriate to establish eligibility of entitlement to federal, state or county governmental grants in connection with, or to otherwise facilitate, a proposed residential development of property meeting the special needs of Town or school district employees, Town volunteer service workers, senior citizens or others for lower-cost housing.[Added 6-22-1993 by L.L. No. 9-1993]"
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "H. ",
							"content": [
								{
									"text": "Conservation development.[Added 2-8-1999 by L.L. No. 2-1999]"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Findings; purpose and intent."
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "The Town Board of the Town of New Castle hereby finds that a\nsubstantial proportion of the remaining vacant land in the Town is\nenvironmentally sensitive and topographically difficult. The Town\nBoard further finds that it is to the benefit of all, wherever practicable,\nto promote the conservation of remaining open space, preserve environmentally\nsensitive areas in their natural state and preserve the existing aesthetic\nqualities of the Town."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "The general purposes and intent of this section are to enable\nand encourage flexibility and diversity of design and development\nof land in such a manner as to promote the most appropriate use of\nland, to facilitate the adequate and economical provision of streets\nand utilities, to preserve the natural and scenic qualities of open\nlands, to protect areas of meaningful ecological, architectural, scenic\nand historic value and to reserve suitable lands for park and recreation\npurposes."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Authorization to approve conservation subdivisions."
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "The Planning Board is hereby authorized, simultaneously with the approval of a subdivision plat, to modify applicable provisions of this chapter, subject to the procedures, conditions and requirements set forth in this § 60-420H, set forth in § 113-23.1 of the land subdivision regulations and set forth in § 278 of the Town Law. This procedure may be followed:"
																},
																{
																	"content": [
																		{
																			"number": "[1] ",
																			"content": [
																				{
																					"text": "When applied for by the owner of the land to be subdivided if,\nin the judgment and discretion of the Planning Board, its application\nwould benefit the Town by satisfying one or more of the purposes set\nforth in § 60-42H(1); or"
																				}
																			]
																		},
																		{
																			"number": "[2] ",
																			"content": [
																				{
																					"text": "Where the Planning Board determines that its application would benefit the Town by satisfying one or more of the purposes set forth in § 60-420H(1) and where the Planning Board determines that one or more of the criteria for conservation development, as set forth in § 113-23.1 of the land subdivision regulations, would be met. In this case, the Planning Board may require the owner of the land to submit a preliminary subdivision plat application which reflects such modifications of applicable provisions of this chapter."
																				}
																			]
																		}
																	]
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "This authorization shall be applicable in all zoning districts\nwhich permit residential development in the Town."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "Except as specified in this section, all development standards\nand controls of this chapter, the land subdivision regulations and\nthe Town Code which are otherwise applicable in the district in which\nthe property is located shall also be applicable within any conservation\ndevelopment."
																}
															]
														},
														{
															"number": "(d) ",
															"content": [
																{
																	"text": "Except as otherwise provided in § 60-420H(2)(f) regarding the type of residential dwelling units permitted, the permitted principal and accessory uses within a conservation development shall be the same as those otherwise permitted in the zoning district in which the property is located."
																}
															]
														},
														{
															"number": "(e) ",
															"content": [
																{
																	"text": "The number of building lots or dwelling units permitted within\na conservation development shall in no case exceed the number which\ncould have been permitted, in the judgment of the Planning Board,\nif the land were subdivided into lots conforming to all normally applicable\nrequirements of this chapter, the land subdivision regulations, the\nTown Code, the Westchester County Department of Health regulations\nand all other applicable requirements. However, where the plat falls\nwithin two or more contiguous districts, the Planning Board may approve\na conservation development representing the cumulative density as\nderived from the summary of all units allowed in all such districts,\nand may authorize actual construction to take place in all or any\nportion of one or more of such districts. The basis for these density\ndeterminations by the Planning Board shall be a conventional preliminary\nsubdivision plat for the subject property, plus such other information\nas may be required by said Board."
																}
															]
														},
														{
															"number": "(f) ",
															"content": [
																{
																	"text": "The type of residential dwelling units permitted within a conservation\nsubdivision shall be, at the discretion of the Planning Board and\nsubject to the conditions set forth herein, in detached, semidetached\nand/or attached buildings."
																}
															]
														},
														{
															"number": "(g) ",
															"content": [
																{
																	"text": "The plat showing such conservation development may include areas\nwithin which structures may be located, the height and spacing of\nbuildings, open spaces and their landscaping, off-street and enclosed\nparking spaces, streets, driveways and any other features required\nby the Planning Board."
																}
															]
														},
														{
															"number": "(h) ",
															"content": [
																{
																	"text": "Within the framework of the limitations set forth in this section, § 113-23.1 of the land subdivision regulations and § 278 of the Town Law, the Planning Board shall establish, on a case-by-case basis, the appropriate modifications of lots, bulk and parking requirements which said Board has determined are necessary or appropriate to properly accomplish the purposes and intent set forth in § 60-420H(1), and, where applicable, one or more of the specified objectives set forth in § 113-23.1 of the land subdivision regulations, consistent with the protection of private property values and the preservation of the character of land and buildings on neighboring sites. In the event that the Planning Board that for a particular application the appropriate modifications will result in a reduction in minimum lot area or bulk requirements below the standards applicable to the next less restrictive zoning district of more than 20% of the lots in the proposed subdivision, the matter shall be referred to the Town Board for its review and authorization. The Town Board shall by resolution either approve, approve with conditions or disapprove the proposed modifications within 45 days of referral by the Planning Board. In the event that the Town Board does not act prior to the expiration of the forty-five-day period, unless such period is otherwise extended by resolution of the Town Board adopted prior to its expiration, the Planning Board shall be authorized to take the requested action."
																}
															]
														},
														{
															"number": "(i) ",
															"content": [
																{
																	"text": "Applications to further modify the lot, bulk and parking requirements established pursuant to § 60-420H(2)(h), shall be made to and determined by the Planning Board or Town Board as provided under § 60-420H(2)(h) for undeveloped lots. Applications to vary any of the categories of lot and bulk regulations specified in § 60-410A, Schedule of regulations for residence districts; lot and bulk regulations, for developed lots shall be made to the Zoning Board of Appeals in accordance with § 60-540. The Zoning Board of Appeals may refer any variance application made under this section to the Planning Board for a report and recommendation. For categories of lot or bulk requirements that did not exist at the time the conservation subdivision was originally approved by the Planning Board, the zoning district whose standards were applied to that lot on the original approval for the conservation subdivision shall be used to calculate the applicable requirement for the new category of regulation.[Added 9-14-2010 by L.L. No. 10-2010[10]]"
																},
																{
																	"footnote": "[10]\nEditor's Note: This local law also redesignated former\n§ 60-428.2I as § 60-428.2J.\n"
																}
															]
														},
														{
															"number": "(j) ",
															"content": [
																{
																	"text": "Conservation subdivisions shall result in the preservation of\nopen space areas having meaningful scenic, ecological, environmental\nand/or recreational characteristics, with such access, shape, size\nand location as determined appropriate by the Planning Board to satisfy\nthe intended purpose. The permanent preservation of such open space\nareas shall be legally assured to the satisfaction of the Planning\nBoard and the Town Attorney by filing of appropriate covenants, deed\nrestrictions, easements or other agreements."
																},
																{
																	"content": [
																		{
																			"number": "[1] ",
																			"content": [
																				{
																					"text": "The ownership of conserved land areas shall be divided equally\namong all owners of building lots within the conservation subdivision,\nexcept where all or an appropriate portion of the conserved land areas\nare deeded to a recognized conservation organization dedicated to\nthe preservation of open space and such dedication is acceptable to\nthe conservation organization and to the Town Planning Board, or offered\nfor dedication to the Town of New Castle and the Town Board has voted\nto accept such offer. Except in those cases where the ownership of\nthe conserved land areas is to be vested in the Town of New Castle\nor an approved conservation organization, the subdivider shall execute\nand file with the Planning Board such documents as, in the opinion\nof the Town Attorney, will be sufficient to create a property owners'\nassociation responsible for the continued ownership, use and maintenance\nof all conserved land areas in accordance with the following requirements:"
																				},
																				{
																					"content": [
																						{
																							"number": "[a] ",
																							"content": [
																								{
																									"text": "Membership in the association must be mandatory\nfor each property owner within the subdivision and for any successive\nproperty owners."
																								}
																							]
																						},
																						{
																							"number": "[b] ",
																							"content": [
																								{
																									"text": "All restrictions on the ownership, use and maintenance\nof conserved land areas must be permanent."
																								}
																							]
																						},
																						{
																							"number": "[c] ",
																							"content": [
																								{
																									"text": "The association must be responsible for liability\ninsurance, local taxes and the maintenance of the conserved land areas,\nincluding any active recreation areas and related facilities."
																								}
																							]
																						},
																						{
																							"number": "[d] ",
																							"content": [
																								{
																									"text": "Each lot owner within the subdivision shall be\nmade responsible for paying a proportionate share of the association's\ncosts, and the assessment levied by the association shall become a\nlien on the property if not paid."
																								}
																							]
																						},
																						{
																							"number": "[e] ",
																							"content": [
																								{
																									"text": "The association shall have the power to adjust\nassessments to meet changing needs."
																								}
																							]
																						},
																						{
																							"number": "[f] ",
																							"content": [
																								{
																									"text": "In the event that the maintenance, preservation\nand/or use of the conserved land area(s) ceases to be in compliance\nwith any of the above requirements or any other requirements specified\nby the Planning Board when approving the subdivision plat, the Town\nshall be granted the right to take all necessary action to assure\nsuch compliance and to assess against the association and/or each\nindividual property owner within the subdivision all costs incurred\nby the Town for such purposes."
																								}
																							]
																						},
																						{
																							"number": "[g] ",
																							"content": [
																								{
																									"text": "The establishment of such an association shall\nbe required prior to the final approval of the plat."
																								}
																							]
																						}
																					]
																				}
																			]
																		},
																		{
																			"number": "[2] ",
																			"content": [
																				{
																					"text": "Except where otherwise approved by the Planning Board, conserved\nland areas shall be preserved in their natural state and the use of\nsuch areas shall be limited to appropriate conservation, open space\nand recreation purposes as determined by the Planning Board."
																				}
																			]
																		}
																	]
																}
															]
														}
													]
												}
											]
										}
									]
								}
							]
						}
					]
				}
			]
		}
	]
}