{
	"url": "http://ecode360.com/10413761",
	"paras": [
		{
			"paragraph": "§ 255-11-10",
			"title": "Use Table and Dimensional Table for all districts.",
			"content": [
				{
					"text": "The Use Table and Dimensional Table (either\nof which may consist of one or more constituent tables) are included\nin this section, but, if necessary, may be located at the end of this\nchapter.[1] The tables taken together shall constitute the fundamental\nsystem of land use regulation for the Town of East Hampton, and, except\nas otherwise indicated in specific provisions of this chapter to the\ncontrary, such tables shall at all times be complied with by all buildings,\nstructures, lots and uses located in all districts. The following regulations apply in an A2 district:"
				},
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Lot area Minimum(square feet): 84,000"
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Building coverage maximum (percent): 10"
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Lot width minimum at the building line(feet): 200"
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "Height(stories): 2 1/2"
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "Height(feet flat roof/gabled roof): 25/32"
								}
							]
						},
						{
							"number": "F. ",
							"content": [
								{
									"text": "Setbacks, Principal building or structure, minimum yards (feet) Front: 50"
								}
							]
						},
						{
							"number": "G. ",
							"content": [
								{
									"text": "Setbacks, Principal building or structure, minimum yards (feet) Each side and rear: 30"
								}
							]
						},
						{
							"number": "H. ",
							"content": [
								{
									"text": "Setbacks Accessory building or structures, minimum yards (feet) Front: 60"
								}
							]
						},
						{
							"number": "I. ",
							"content": [
								{
									"text": "Setbacks Accessory building or structures, minimum yards (feet) Each side and rear: 20"
								}
							]
						},
						{
							"number": "J. ",
							"content": [
								{
									"text": "Gross floor area maximum(square feet): 10% of lot area plus 1,000 or 20,000, whichever is less"
								}
							]
						},
						{
							"number": "K. ",
							"content": [
								{
									"footnote": "[1]\nEditor's Note: Said tables are located as\nattachments to this chapter.\n"
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 255-11-20",
			"title": "Accessory buildings, structures and uses.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Separation. Accessory buildings, including garages,\nif detached from the main building, shall be not less than five feet\nfrom the main building."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Private garage. A private garage may be constructed\nas a structural part of a main building, provided that when so constructed\nthe garage walls shall be regarded as the walls of the main building\nin applying the front, rear and side yard regulations of this chapter."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Preexistence of a main building. No accessory building\nor structure shall be constructed upon a lot or plot unless a main\nbuilding or principal use already exists thereon. This restriction\nshall not be deemed to apply to agricultural buildings and structures.\nHowever, where a property owner owns two or more contiguous conforming\nresidential lots in common ownership, at least one of which is improved\nwith a single-family dwelling, an accessory building or structure\nmay be constructed on any vacant contiguous lot, provided that the\napplicant demonstrates the existence of sufficient buildable area\nto construct a principal structure on the lot upon which the accessory\nstructure is to be constructed. Should common ownership of the contiguous\nlots cease, either the accessory building or structure must be removed\nwithin nine months or the owner of the lot without a principal structure\nmust obtain a building permit for a principal building or structure\nwithin nine months. For purposes of this provision, common ownership\nshall be deemed to refer to:[Amended 9-17-1993 by L.L. No. 28-1993; 2-17-2005 by L.L. No. 7-2005; 12-2-2005 by L.L. No. 40-2005]"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Title to contiguous properties being held in\nthe same name(s);"
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Title to contiguous properties being held by\na married or registered domestic couple with any combination of one\nor both names on either deed; or"
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "A married or registered domestic couple holding\ntitle to one or both of the contiguous properties in the name of a\ncorporation, limited-liability company trust, family limited partnership\nor similar entity."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "Setbacks and height. All accessory buildings and structures\nshall meet all applicable height and setback requirements of the Dimensional\nTable of § 255-11-10 and the requirements of §§ 255-11-72\nthrough 255-11-74 hereof, unless the particular structure is exempted\nfrom one or more such limitation by specific language in this chapter."
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "Parking area. Accessory off-street parking or truck\nloading areas shall be improved in accordance with the procedural\nrequirements and design specifications of this chapter, and such areas\nshall not be encroached upon by buildings, open storage or any other\nuse."
								}
							]
						},
						{
							"number": "F. ",
							"content": [
								{
									"text": "Quartering of animals. Unless a greater distance is\nrequired by another specific provision hereof, the quartering of horses,\npigs, sheep or cattle in open areas or pens shall not be permitted\nwithin 10 feet of any lot line except one which adjoins a street or\na parcel of land whose use is restricted in perpetuity to agriculture.[Amended 9-17-1993 by L.L. No. 28-1993]"
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 255-11-23",
			"title": "Limitations on accessory buildings.",
			"content": [
				{
					"text": "The term \"accessory building\" may include a private garage,\ngarden shed, private greenhouse or other similar building conforming\nto the definition of \"accessory building,\" but no accessory building\non any residential property shall have a gross floor area equal to\nor greater than 600 square feet except an artist's studio meeting\nthe requirements of this chapter. No accessory building on any residential\nproperty, other than a pool house of less than 200 square feet in\ngross floor area or an artist's studio meeting the requirements\nof this chapter, shall contain any bath, shower or plumbing facilities."
				}
			]
		},
		{
			"paragraph": "§ 255-11-30",
			"title": "Berms, fences and walls.",
			"content": []
		},
		{
			"paragraph": "§ 255-11-31",
			"title": "Purpose.",
			"content": [
				{
					"text": "With the recent rapid growth of the Town has\ncome a proliferation of high berms, fences and walls, especially in\nresidential areas. While these structures often provide a means for\nthe property owner on which they are located to achieve privacy, the\nbenefits achieved are often outweighed by the public harm done:"
				},
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Setbacks. Siting of massive or opaque structures close\nto property lines and roads defeats the light-and-air bases for required\nyard setbacks imposed upon other structures."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Historic and rural character. The presence of such\nstructures diminishes the visual attributes of the Town by obscuring\nlong vistas and views of natural and man-made features basic to the\nTown's character, including historic buildings set close to roads,\nand by creating a walled-in urban look."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Safety. By destroying sight lines and eliminating\nopen areas alongside streets and highways, such structures can make\nin-tersections more dangerous, increase the hazard to pedestrians\nand animals and create blind driveways wherever they appear."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 255-11-34",
			"title": "Berms.",
			"content": [
				{
					"text": "The following regulations shall apply to all\nberms in all districts unless otherwise indicated:"
				},
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Building permits. The erection, enlargement, alteration\nor removal of the following types of berms shall require a building\npermit."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "A berm greater than four feet in height and\nlocated within the required front yard area of any lot in any district,\nother than a Central Business District; or"
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "A berm over six feet in height, in any location."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Architectural review. Architectural and design review\nshall be required for any berm for which a building permit is required."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Contents of applications. Building permit applications\nfor berms shall include the following:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "A detailed grading plan of the entire site indicating\nthe existing topography in contour intervals no greater than five\nfeet and the proposed topography in contour intervals no greater than\ntwo feet. The scale of such grading plan shall be no greater than\none inch equals 20 feet."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "A cross section of the berm indicating the type\nof materials to be used in constructing the same (i.e., fill, topsoil,\netc.) and the location of the landscaping. The scale of such cross\nsection shall be no greater than one inch equals four feet."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "A detailed landscaping plan indicating the location,\nsize and quantity of the species to be planted."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "Referral of applications. The Building Inspector shall refer all applications for a building permit for a berm to the Architectural Review Board for its approval with respect to the compatibility of the berm with the surrounding properties, streets and associated land uses, drainage and appearance. At the same time, if the building of such berm, or the activity or work of which such construction is a part, is itself subject to site plan review pursuant to Article VI hereof, the Inspector shall also refer the application to the Planning Board for its review. Nothing in this subsection shall be deemed to eliminate the need to obtain any other permit or local agency approval applicable to the building of the berm or to the activity or work of which it is a part."
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "Review. Unless its review is in conjunction with site\nplan review by the Planning Board, the Architectural Review Board\nshall, within 30 working days after receipt of a complete application,\napprove, approve with modifications or disapprove the application.\nIn making its determination, the Board shall consider, among other\nthings, the findings set forth in § 255-11-31 hereof. The\nBuilding Inspector shall not issue a building permit for a berm until\nArchitectural Review Board approval has been received. Failure of\nthe Board to act within 30 working days shall be deemed an approval."
								}
							]
						},
						{
							"number": "F. ",
							"content": [
								{
									"text": "General rules. The following regulations apply to\nall berms, whether or not a building permit is required therefor."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Berms shall be constructed only during the period\nfrom March 1 to October 15. Only clean fill, topsoil or an approved\nequivalent shall be used. Material shall be given sufficient time\nto settle before final shaping and topsoil are applied. After shaping,\na uniform layer at least six inches thick of approved horticultural\ntopsoil shall be placed and fine graded."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Berms shall be located only in the position\non a lot approved by the Architectural Review Board, if review by\nthe Board is required by this section. In no case shall all or part\nof any berm be placed upon street rights-of-way or other public property."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Berms shall not exceed eight feet in height,\nbut upon a written finding of exceptional circumstances related to\nhigh levels of ambient noise or light which cannot be abated and from\nwhich protection is needed or public interest considerations, berms\nof up to 10 feet in height may be authorized. Notwithstanding the\npreceding sentence, no berm located on a residential property in a\nyard fronting on a public street shall exceed six feet in height,\nand no berm, wherever located, shall violate the setback limitations\nof § 255-11-72D, Pyramid law, or § 255-11-74A\nor B, setbacks from scenic easements and setbacks on corner lots hereof.\nThe height of a berm shall be the vertical distance from any point\non the top of the berm (exclusive of plantings) to the existing natural\ngrade at the base of the berm at that point."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "No fence or wall shall be constructed on a berm,\nand no berm shall interfere with existing natural drainage patterns\nor cause ponding or flooding on any property."
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "Berms shall be properly vegetated and landscaped,\nin the manner approved by the Architectural Review Board, if applicable,\nbefore any erosion occurs in the topsoil on the berm, or, in the alternative,\nthe berm shall be covered with an approved ground cover until such\ntime as the berm can be properly landscaped."
												}
											]
										}
									]
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 255-11-36",
			"title": "(Reserved)\n                                                                                          [1]",
			"content": [
				{
					"footnote": "[1]\nEditor's Note: Former § 255-11-36,\nFences, was repealed 6-14-2001 by L.L. No. 11-2001. See now § 255-11-38,\nFences and Walls.\n"
				}
			]
		},
		{
			"paragraph": "§ 255-11-38",
			"title": "Fences and walls.",
			"content": [
				{
					"text": "The following regulations shall apply to all fences and walls\nin all districts unless otherwise indicated:"
				},
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Building permits. The erection, enlargement, alteration or removal\nof the following types of fences and walls shall require a building\npermit:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "A fence or wall greater than four feet in height and located\nwithin the required front yard area of any lot;"
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "A fence or wall over six feet in height, in any location;"
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Any fence or wall for which site plan approval is required."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Architectural review. Architectural and design review shall be required\nfor any fence or wall for which a building permit is required by this\nsection, except that Architectural Review Board review and approval\nshall not be required for fences that are in compliance with all other\nrequirements of this chapter and meet all of the following criteria:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "The fence is constructed of either two-inch square black wire\nfield fencing between six feet and eight feet in height or black wire\nfarm and field agricultural fencing; and"
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "The fence posts are made of two-inch black metal poles; and"
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "The area enclosed by the fence is less than 50% of the area\nof the parcel; and"
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "The fence will be installed along only two property lines and\nis more than 20 feet away from running along the remaining property\nlines; and"
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "The installation of the fence is not subject to site plan review."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Height limits."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "The height of a fence or wall shall be the vertical distance\nfrom any point on the top of the fence or wall (exclusive of plantings)\nto the existing natural grade at the base of the fence or wall at\nthat point. A fence located on the top of a wall shall for all purposes\nbe deemed to be part of the wall."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Fences and walls shall not exceed eight feet in height; but\nupon a written finding by the Architectural Review Board of exceptional\ncircumstances related to high levels of ambient noise, light, or property\ndamage from animals which cannot be abated by the landowner and from\nwhich protection is needed, or of public interest considerations,\nfences and walls of up to 10 feet in height may be authorized. Notwithstanding\nthe preceding sentence, no fence or wall located on a residential\nproperty in a yard fronting on a public street shall exceed six feet\nin height."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "Setbacks for fences and walls. No wall or fence for which a building\npermit is required by this section, wherever located, shall violate\nthe setback limitations of § 255-11-74A and B (setbacks\nfrom scenic easements and setbacks on corner lots), but fences and\nwalls need not comply with § 255-11-72D, Pyramid law."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 255-11-39",
			"title": "Site plan review unaffected.",
			"content": [
				{
					"text": "Nothing in § 255-11-34, 255-11-36 or 255-11-38 hereof shall be deemed to interfere with or abridge any provision of Article VI of this chapter requiring site plan approval for certain structures, lots or uses, including any such provision which may require site plan approval for every structure on a particular lot or site."
				}
			]
		},
		{
			"paragraph": "§ 255-11-40",
			"title": "Parking requirements.",
			"content": [
				{
					"text": "In order to minimize traffic congestion, air\npollution and the risk of motor vehicle and pedestrian accidents,\nas well as to promote other elements of sound community planning,\noff-street parking and truck loading spaces shall be provided and\nkept available as an accessory use to all permitted and special permit\nuses of buildings, structures and lots in numbers not less than those\nset forth in the following sections."
				}
			]
		},
		{
			"paragraph": "§ 255-11-42",
			"title": "Method of determining requirements.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Single use. The requirement for a single use (e.g.,\na single-family residence or a retail store) shall be determined directly\nfrom the Schedule of Parking Requirements in § 255-11-45."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Combination use. The requirement for a combination\nuse made up of two or more component uses (e.g., a bowling alley combined\nwith an auditorium, a restaurant with a bar or a retail store with\nan office building) shall be determined by establishing the requirement\nfor each component use from the schedule and adding them together."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Fractions. When the required number of spaces is determined\nto result in a fraction, the number shall be increased to the next\nhigher whole number."
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "Unlisted use. If the use in question is not specifically\nlisted in the schedule, the requirement shall be that of the most\nsimilar listed use."
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "Number of employees. When the schedule requires the\nnumber of spaces to be calculated per employee, and employees are\non the site in shifts, the number to be used is the number of employees\npresent during the largest shift."
								}
							]
						},
						{
							"number": "F. ",
							"content": [
								{
									"text": "Garages and carports. Garages and carports and, only\nin the case of residences, driveways, may be used to meet parking\nrequirements of these sections, but no garage or other parking area\nshall be located under a motel, multiple residence (other than a two-family\ndwelling) or resort without the explicit written permission of the\nFire Prevention Inspector, as well as of every other local agency\nhaving jurisdiction to review and approve such a plan."
								}
							]
						},
						{
							"number": "G. ",
							"content": [
								{
									"text": "Adjacent property. Parking requirements of these sections\nmay be satisfied for a single or combination use on an adjacent or\nneighboring property within 500 feet of the use in question; provided,\nhowever, that any approval of such a configuration by a local agency\nshall be conditioned on the grant of a permanent parking easement\nover the subordinate property and in favor of the dominant property,\nwith such assurances (including title reports) as the local agency\nmay find necessary to ensure the continued availability of parking\non the subordinate property.[Amended 7-2-1999 by L.L. No. 16-1999]"
								}
							]
						},
						{
							"number": "H. ",
							"content": [
								{
									"text": "Special permit uses. Uses requiring a special permit pursuant to Article V of this chapter may be required by the local agency having jurisdiction to create up to 150% of the minimum parking required in these sections if it is found, either because of the nature of the use, the nature of the site or for some other reason, that such additional parking would be necessary for the use to comply with any of the standards or safeguards of Article V applicable to it."
								}
							]
						},
						{
							"number": "I. ",
							"content": [
								{
									"text": "Storage buildings. The amount and type of parking\nrequired for storage buildings may be determined by the local agency\nhaving jurisdiction on a case-by-case basis according to the nature\nof the entire use of which the building is a part.[Amended 8-16-1985 by L.L. No. 8-1985]"
								}
							]
						},
						{
							"number": "J. ",
							"content": [
								{
									"text": "Limited Business Overlay uses. The Planning Board\nmust approve a plan illustrating the number of spaces required by\n§ 255-11-45 but may permit the construction of less than\nthe number of parking spaces required for any use proposed within\nthe Limited Business Overlay District upon a finding that the circumstances\nof the immediately proposed use does not require the maximum number\nof spaces required by § 255-11-45. Any future change in\nthe parking on that particular site may be constructed with a building\npermit pursuant to the approved plan without additional Planning Board\napproval.[Added 10-6-2006 by L.L. No. 24-2006]"
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 255-11-43",
			"title": "Design requirements of off-street accessory parking and truck loading areas.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Site plan approval required. For all properties and uses subject to site plan review pursuant to Article VI, new accessory off-street parking and truck loading areas shall be located and established only as the same are indicated on a site plan duly approved by the Planning Board."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Physical improvements. The physical improvements of\noff-street parking and truck loading areas shall include:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Curbs, paving, sidewalks and drainage facilities\ncomplying with the standards established in this Code or the regulations\nof the Planning Board."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Lighting of public parking areas adequate to\nassure general safety and convenience, while at the same time of such\ndesign as to avoid having light sources be visible from the street\nor across property lines."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Screening appropriate to the protection of adjacent\nproperties from automotive noise, fumes and visual impact."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Aisles. Unless a different configuration shall be\napproved by the Planning Board during site plan review for reasons\nof sound planning and proper site layout, all aisles within parking\nareas shall have a minimum width of 24 feet when the parking spaces\nare at a ninety-degree angle with the aisle, 18 feet when the parking\nspaces are at a sixty-degree angle in a one-way direction with the\naisle and 12 feet when the parking spaces are at a forty-five degree\nangle in a on-way direction with the aisle.[Amended 3-15-1991 by L.L. No. 4-1991]"
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "Circulation. Aisles and turning areas shall provide\ngood internal circulation with adequate radii to assure ease of mobility,\nample clearance and convenient access and egress."
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "Gradients. Center-line gradients of aisles shall not\nexceed 8%."
								}
							]
						},
						{
							"number": "F. ",
							"content": [
								{
									"text": "Size of parking spaces. Parking spaces shall be marked\noff with a minimum width of 10 feet and a minimum length of 18 feet,\nor a minimum width of nine feet and a minimum length of 20 feet. In\nthe case of parking spaces for trucks or special equipment, parking\nspaces shall be of a minimum size to be determined by the Planning\nBoard based upon the nature of the parked vehicles."
								}
							]
						},
						{
							"number": "G. ",
							"content": [
								{
									"text": "Size of truck loading spaces. Truck loading spaces\nshall have a minimum width of 12 feet, a minimum length of 40 feet\nand a minimum clear height of 14 feet. The related aisles or driveways\nshall have the same minimum width and clear height."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 255-11-44",
			"title": "Design requirements for access driveways.",
			"content": [
				{
					"text": "Every access driveway on nonresidential properties\nshall have a minimum unobstructed width of 20 feet, and the design\nand construction of all such driveways and related improvements shall\nmeet all Planning Board requirements and be located and established\nonly as the same are indicated on a site plan duly approved by the\nPlanning Board."
				}
			]
		},
		{
			"paragraph": "§ 255-11-45",
			"title": "Schedule of off-street parking requirements.",
			"content": [
				{
					"footnote": "[1]\nEditor's Note: This local law also repealed\nformer Subsection (2) pertaining to automobile laundries.\n[2]\nEditor's Note: This local law also provided\nfor the renumbering of former Subsections (25) through (28) as Subsections\n(26) through (29), respectively.\n"
				}
			]
		},
		{
			"paragraph": "§ 255-11-46",
			"title": "Waivers.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Seasonal use. The Planning Board, in the case of a\nuse which traditionally exhibits extended periods of low parking demand,\nmay allow up to 75% of the required parking for horse farms or, for\nall other uses, up to 50% of the required parking to be located on\nprepared, well-drained, dust free grassed areas, so as to lessen the\namount of improved parking required. In determining whether to allow\nthe use of such grass parking, the Planning Board shall consider the\navailability of on-street public parking in the vicinity of the project\nsite, historic use patterns of the site, and the character of the\nsurrounding area.[Amended 5-3-2002 by L.L. No. 10-2002; 6-3-2005 by L.L. No. 14-2005]"
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Central business districts. The Planning Board, in\nthe case of uses located on lots in a Central Business District, may\nrequire or permit, in lieu of some or all of the ordinary off-street\nparking requirements for the use, payment of a parking fee to be added\nto a fund used to create municipal parking for the district. However,\nno such fees shall be collected until the Planning Board shall have\nadopted regulations governing computation of the fee and use of the\nsame."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Historic Districts. The Planning Board, in the case\nof a use located on lots within Town-designated Historic Districts,\nmay waive all or a portion of the parking required by the Table of\nOff-Street Parking Requirements pursuant to a written finding made\nby Planning Board resolution that:[Added 6-4-2004 by L.L. No. 11-2004]"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "The lot proposed for an alternative use requiring\nsite plan and/or special permit approval is suitable for such alternative\nuse and/or development; and"
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "The proposed use of the property is consistent\nwith preserving the historical attributes of the site; and"
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Existing on-site and or nearby on-street or\nmunicipal parking can accommodate the projected demand from the proposed\nuse; and"
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "The provision of some or all of the required\noff-street parking on the parcel would have a detrimental impact on\nthe historical attributes of the subject property, including its historical\ncontext, setting and historical value."
												}
											]
										}
									]
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 255-11-50",
			"title": "Signs.",
			"content": [
				{
					"text": "In order to perpetuate the open character and\nrural appearance of the Town and to promote good community planning\ngenerally, while at the same time recognizing the economic importance\nand attractiveness of a reasonable number of well-sited and tastefully\ndesigned signs of various kinds, it is hereby required that signs\nbe erected, established, altered and maintained only in accordance\nwith the requirements of the following sections."
				}
			]
		},
		{
			"paragraph": "§ 255-11-52",
			"title": "General standards.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Certain signs prohibited. The following types of signs\nshall be prohibited in the Town of East Hampton:[Amended 12-15-1989 by L.L. No. 16-1989; 6-7-1991 by L.L. No. 11-1991; 10-6-2006 by L.L. No. 27-2006; 12-5-2008 by L.L. No. 22-2008]"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Billboards, including sandwich board and other\nsidewalk signs."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Flashing, blinking, tracing, flickering or neon\nsigns.[Amended 7-3-2014 by L.L. No. 21-2014]"
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Any sign more than three feet higher than the\naverage ceiling height of the building on which the sign is located."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "Any sign more than 10 feet higher than the natural\ngrade of the land on which it is located."
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "Illuminated vending machines."
												}
											]
										},
										{
											"number": "(6) ",
											"content": [
												{
													"text": "Exterior internally illuminated signs."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Nonconforming signs. Only signs as are described and\npermitted by specific provisions of these sections shall be deemed\nto conform thereto. Any other sign shall be deemed nonconforming.\nA nonconforming sign may not be replaced by another nonconforming\nsign. All signs rendered nonconforming by prior enactments of these\nprovisions, by the enactment of these sections or by any future amendment\nthereof, shall, at the expiration of the following time periods following\nsuch enactment or amendment, become prohibited and unlawful structures\nand shall be removed:[Amended 12-15-1989 by L.L. No. 16-1989]"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Sandwich boards, banners, pennants, sidewalk\nsigns, merchandise, parked automobiles and the like: 15 days."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Signs consisting entirely or primarily of paint\nor other nonstructural decoration to the exterior facing of a building\nor structure: one year."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Public property. Nothing herein shall be deemed to\nlimit the authority of the Town Board to erect, alter or maintain\nany sign deemed necessary or reasonable for the public safety or convenience\non any right-of-way or other property owned or leased by the Town,\nnor the authority of the Town Board to allow, permit or license private\npersons or parties to do the same, subject to all applicable provisions\nof law."
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "Legal notices. These regulations shall not apply to\nsigns placed on any property to provide legal notice to the public\nwhere such notice and such sign are required by the terms of any law,\nordinance, governmental regulation, court decree or administrative\norder. However, in the case of gasoline price signs and other similar\nexternal signs required by law to be posted by certain businesses\nor special permit uses, any characteristic of the sign, such as maximum\nsize, color, exact onsite location, etc., not specifically determined\nby the law requiring the sign, shall be subject to site plan and/or\narchitectural and design approval in the same manner as any other\nsign on the property."
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "Lighting of signs. Lighting shall be mounted on the\ntop of or above the sign, directed downward, and positioned or shielded\nso that the light source is not visible beyond the boundary of the\nproperty on which the sign is located.[Added 10-6-2006 by L.L. No. 27-2006]"
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 255-11-55",
			"title": "Regulations for signs in various zoning districts.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Nonresidential zoning districts:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Each business establishment located in a nonresidential\nzone shall be permitted signage as follows:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "All signs for any one business shall not exceed\n20 square feet in aggregate area, except that both sides of a two-sided\nfreestanding sign may have an aggregate area of 32 square feet."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "Freestanding signs shall not extend more than\n10 feet above the grade of the land on which the sign is located.\nHowever, in no event shall any sign extend beyond the height of the\nstructure to which it is attached, or located adjacent thereto."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "The aggregate area of all signs located on any\none wall of any building shall not exceed one foot times the length\nof the particular wall on which the signs are located."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Where a structure or group of structures containing\nmore than one business exists on one lot, a freestanding directory\nsign conforming to the following requirements shall be permitted in\naddition to the signage permitted herein for each business:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "The complex name sign shall not exceed four\n(4) square feet in area on each side;"
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "Each business may have a sign on the directory\nnot to exceed six inches tall by 36 inches wide."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "All such signs shall be located upon the premises\nupon which the business is located."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "No sign shall be installed so that any portion\nof the sign extends beyond the height to the building upon which it\nis attached."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Residential zoning districts:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Signs located in residential districts shall\nnot exceed 12 square feet in area, or 20 square feet in the case of\nthe aggregate area of both sides of a two-sided freestanding sign.\nSuch signs shall be located entirely upon the property and not within\nany public rights-of-way or upon the property of another party."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Signs identifying realty subdivisions: No more\nthan one such sign shall be located at each intersection of a subdivision\nroad with a public street or highway from which vehicular access to\nthe subdivision is taken, up to a maximum total of three signs."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "All districts:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Directional signs. The following shall apply to any directional sign as the same is defined in Article I:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "Signs may be located on public or private property."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "Signs shall be white with black lettering, six\ninches by 36 inches in size."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "Signs shall not be erected, located, removed\nor altered on public or private property without a resolution of approval\nby the Town Board. Signs located on public property without such approval\nmay be removed by the Town Police, Town Building Department, Ordinance\nEnforcement Department or Town Highway Department."
																}
															]
														},
														{
															"number": "(d) ",
															"content": [
																{
																	"text": "Signs shall be erected on signposts maintained\nby the Town or on trees designated by the Town Board wherever possible."
																}
															]
														},
														{
															"number": "(e) ",
															"content": [
																{
																	"text": "Signs shall not be illuminated."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Informational signs. The following shall apply to any informational sign as the same is defined in Article I:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "Signs shall be located only on lots being legally\nused for business or commercial purposes or on a residential district\nlot containing a legal special permit use."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "Signs shall not be illuminated."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "Signs shall be subject to site plan and/or architectural\nand design review and shall conform in design and location to approval\nobtained."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Professional or announcement signs. The following shall apply to any professional or announcement sign as the same is defined in Article I:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "Signs shall be located only on private property\ncontaining an occupied residence. Signs located on public property\nor rights-of-way may be removed by the Town Police, Town Building\nDepartment, Ordinance Enforcement Department or Town Highway Department."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "No permit shall be required."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "Only one sign may be located on each eligible\nproperty."
																}
															]
														},
														{
															"number": "(d) ",
															"content": [
																{
																	"text": "Signs shall not exceed two square feet."
																}
															]
														},
														{
															"number": "(e) ",
															"content": [
																{
																	"text": "Signs shall not be illuminated."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "Temporary signs. The following shall apply to any temporary sign as the same is defined in Article I:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "Real estate and construction signs."
																},
																{
																	"content": [
																		{
																			"number": "(i) ",
																			"content": [
																				{
																					"text": "Signs may be located on any private\nproperty in any district. Signs shall not be located on public property\nor rights-of-way, and such signs so located may be peremptorily removed\nby the Town Police, Town Building Department, Ordinance Enforcement\nDepartment or Town Highway Department."
																				}
																			]
																		},
																		{
																			"number": "(ii) ",
																			"content": [
																				{
																					"text": "No permit shall be required."
																				}
																			]
																		},
																		{
																			"number": "(iii) ",
																			"content": [
																				{
																					"text": "One sign shall be permitted for\neach road frontage property line (lot) or each road entrance (subdivision)."
																				}
																			]
																		},
																		{
																			"number": "(iv) ",
																			"content": [
																				{
																					"text": "Signs shall not exceed six square\nfeet in area."
																				}
																			]
																		},
																		{
																			"number": "(v) ",
																			"content": [
																				{
																					"text": "Signs shall not be illuminated."
																				}
																			]
																		},
																		{
																			"number": "(vi) ",
																			"content": [
																				{
																					"text": "Sign height shall not exceed four\nfeet above the finished grade of the property or the grade of the\nstreet immediately adjacent to the location of the sign, whichever\nis higher, except in the case of post-and-arm signs, which shall not\nexceed six feet in height from the finished grade of the property\nor the street immediately adjacent thereto, whichever is higher."
																				}
																			]
																		},
																		{
																			"number": "(vii) ",
																			"content": [
																				{
																					"text": "Signs shall be set back a minimum\nof eight feet from the edge of the improved roadway or edge of the\nsidewalk and shall not interfere with pedestrian or vehicular traffic.\nIn the event this is not possible due to physical constraints on the\nproperty, then such sign shall be located so as to be situated as\nclose to the minimum setback as reasonably possible."
																				}
																			]
																		},
																		{
																			"number": "(viii) ",
																			"content": [
																				{
																					"text": "Signs shall be perpendicular\nto the property line."
																				}
																			]
																		},
																		{
																			"number": "(ix) ",
																			"content": [
																				{
																					"text": "Signs shall be installed on a\nsturdy support, including post-and-arm or other similar arrangement,\nto assure that the sign remains supported and in place and does not\ncome loose and become litter or interfere with vehicular or pedestrian\ntraffic."
																				}
																			]
																		},
																		{
																			"number": "(x) ",
																			"content": [
																				{
																					"text": "Signs shall be temporary and shall\nnot remain in place beyond such time as the premises are sold or rented\nor, in the event of a construction sign, until a certificate of occupancy\nis issued for the work being undertaken at the premises, but in no\nevent shall any such sign remain in place for more than one year from\nthe date of its installation."
																				}
																			]
																		}
																	]
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "Other temporary signs on premises."
																},
																{
																	"content": [
																		{
																			"number": "(i) ",
																			"content": [
																				{
																					"text": "Signs may be located on any lot\nin any district not displaying other signs permitted by this chapter.\nSigns shall not be located on any public property or rights-of-way,\nand such signs so located may be removed by the Town Police, Town\nBuilding Department, Ordinance Enforcement Department or Town Highway\nDepartment."
																				}
																			]
																		},
																		{
																			"number": "(ii) ",
																			"content": [
																				{
																					"text": "There shall be no more than one\nsuch sign on any lot."
																				}
																			]
																		},
																		{
																			"number": "(iii) ",
																			"content": [
																				{
																					"text": "No permit shall be required."
																				}
																			]
																		},
																		{
																			"number": "(iv) ",
																			"content": [
																				{
																					"text": "No such sign be more than 16 square\nfeet in area, except that both sides of a two-sided freestanding sign\nmay have an aggregate area of 24 square feet."
																				}
																			]
																		},
																		{
																			"number": "(v) ",
																			"content": [
																				{
																					"text": "One sign shall be permitted for\neach road frontage property line."
																				}
																			]
																		},
																		{
																			"number": "(vi) ",
																			"content": [
																				{
																					"text": "The sign shall not be illuminated."
																				}
																			]
																		}
																	]
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "Temporary business signs: Businesses which otherwise\ndo not require site plan approval shall be entitled to erect one temporary\nbusiness sign pending the issuance of an approval of a permanent sign\nfrom the Architectural Review Board, which temporary sign shall comply\nin all respects to the physical and dimensional requirements set forth\nin this chapter. Such temporary business signs may remain in place\nno more than three weeks unless an extension of time is granted by\nthe Architectural Review Board."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "Off-premises signs: Off-premises signs, except\nas may be specifically permitted herein, are prohibited in the Town\nof East Hampton."
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "Off-premises temporary signs:"
																},
																{
																	"content": [
																		{
																			"number": "(i) ",
																			"content": [
																				{
																					"text": "Off-premises temporary signs which\ndo not exceed six square feet in area are permitted, provided that\nthey are installed on private property with the permission of the\nproperty owner or upon public property, provided such signs do not\ninterfere with the use of such property and do not cause a traffic\nhazard as determined by the Town Superintendent of Highways or the\nTown Police Department. Such signs may be erected for no more than\nseven days and shall be removed by the persons responsible for their\ninstallation. In the event such signs are not removed within seven\ndays of their placement, they shall be deemed litter and may be removed\nby the Town, and in addition, appropriate penalties for littering\nmay be imposed."
																				}
																			]
																		},
																		{
																			"number": "(ii) ",
																			"content": [
																				{
																					"text": "No permit shall be required for\noff-premises temporary signs as provided for herein."
																				}
																			]
																		},
																		{
																			"number": "(iii) ",
																			"content": [
																				{
																					"text": "No more than six events of any\nnature for which an off-premises sign is erected shall be permitted\nfor any property within a twelve-month period. This provision shall\nnot be construed to allow any activity upon a property which is not\notherwise permitted under the provisions of this chapter."
																				}
																			]
																		}
																	]
																}
															]
														}
													]
												}
											]
										}
									]
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 255-11-57",
			"title": "Architectural Review Board approval.",
			"content": [
				{
					"text": "Wherever this chapter requires approval of the\nArchitectural Review Board for the erection, enlargement or alteration\nof a sign, such sign shall, in addition to complying with these sections,\nbe approved by such Board as being of suitable size, design and location,\npursuant to all applicable standards in this chapter, and the Board\nshall not be compelled to approve any such sign solely because of\ncompliance herewith."
				}
			]
		},
		{
			"paragraph": "§ 255-11-59",
			"title": "Site plan review unaffected.",
			"content": [
				{
					"text": "Nothing in §§ 255-11-50 through 255-11-58 hereof shall be deemed to interfere with or abridge any provision in Article VI of this chapter requiring site plan approval for certain structures, lots and uses, including any such provision which may require site plan approval for every structure on a particular lot or site."
				}
			]
		},
		{
			"paragraph": "§ 255-11-60",
			"title": "Single-family residence regulations.",
			"content": []
		},
		{
			"paragraph": "§ 255-11-61",
			"title": "Purpose.",
			"content": [
				{
					"text": "An important function of local land use regulation\nis the establishment and protection of single-family residential districts\nin which tranquil, healthy and safe neighborhood environments are\nmaintained for the quiet enjoyment of resident homeowners and their\nfamilies and in which the children of such families may be properly\nraised. Such residential areas provide a setting suitable primarily\nfor the Town's permanent and seasonal residents who are living, working,\ngoing to school, paying taxes, etc., in East Hampton. The needs of\ntransients, on the other hand, are best accommodated in other districts.\nNearly any business enterprise conducted for the purpose of making\na profit may sacrifice other values critical to residential neighborhoods.\nThus, the courts have long recognized the right of municipalities\nto entirely segregate business uses from such districts and to otherwise\nprevent unwarranted commercialization from encroaching therein, including\nthat commercialization caused by the misuse of single-family residences.\nIn particular, the purely commercial use of such structures by absentee\nowners poses problems for adjacent properties and residents, as well\nas to legitimate businesses located in commercial district paying\nbusiness taxes, and must be strictly limited. The regulations in these\nsections and throughout this chapter recognize these principals and\nare designed to further the same, while at the same time permitting\ncertain compatible activities in single-family residences which can\nserve to supplement an owner's income without risking harm to surrounding\nresidences or entire residential neighborhoods."
				}
			]
		},
		{
			"paragraph": "§ 255-11-62",
			"title": "Uses permitted in single-family residences.",
			"content": [
				{
					"text": "The following are the only uses permitted in\nsingle-family residences in the Town of East Hampton:"
				},
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Principal residence. Permanent, seasonal or intermittent\noccupation by the owner's family as principal residence."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Nonprincipal residence. Temporary, seasonal or intermittent\noccupancy by the owner's family as nonprincipal residence, vacation\nresidence or second home."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Supplemental uses when owner or owner's family in\nresidence. During periods of actual occupancy by one or more members\nof the owner's family:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Use of one home office."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Engaging in home occupations."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Rental of one or two guest rooms."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "Rental of an affordable accessory apartment\npursuant to § 255-11-63."
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "Operation of a residential museum as defined in this chapter.[Added 7-1-2010 by L.L. No. 6-2010]"
												}
											]
										},
										{
											"number": "(6) ",
											"content": [
												{
													"text": "Use of a small taxi office (office use, nondispatch). A small taxi office (office use, nondispatch) shall be limited to a business owned and operated by the owner of a parcel of real property that operates either one of two taxicabs or vehicles for hire under a single business license issued pursuant to Chapter 226 of this Code, provided that there is:[Added 5-15-2014 by L.L. No. 11-2014]"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "No dispatching of taxicabs from the premises where the small\ntaxi office is located; and"
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "No on-site maintenance, repair, or upkeep, including but not\nlimited to car washing, oil changes, engine repair or maintenance,\nbody work, of any taxi cab or vehicle for hire, on the premises where\nthe small taxi office is located; and"
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "Sufficient, delineated parking areas on the subject parcel to\nprovide for parking of four motor vehicles. Street parking of taxi\ncabs or vehicles for hire at or near the small taxi office location\nis prohibited."
																}
															]
														},
														{
															"number": "(d) ",
															"content": [
																{
																	"text": "Only one small taxi office (office use, nondispatch) per parcel\nof real property."
																}
															]
														}
													]
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "Supplemental use when owner and owner's family not in residence. During periods of nonoccupancy by all persons in the owner's family, and subject to the provisions of § 255-11-64 hereof, occupancy of the entire residence by one family as guest of owner or as tenant. In the case of such occupancy, the supplemental uses set forth in Subsection C(1), (2) and (5) of this section may be engaged in by a resident tenant, but the uses in Subsection C(3) and (4) thereof shall be prohibited. Where there is occupancy of the entire residence by one family as guest or tenant of the owner, the supplemental uses provided for in Subsection C(6) may be engaged in by a resident tenant or guest only where such resident or guest can provide proof of leasing a premises in the Town of East Hampton for at least one year prior to application for the supplemental use and that he or she is the owner and operator of the business that operates out of the small taxi office.[Amended 7-1-2010 by L.L. No. 6-2010; 5-15-2014 by L.L. No.\n11-2014]"
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 255-11-63",
			"title": "Affordable accessory apartments.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "General requirements."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "The lot to which the affordable accessory apartment\nis to be added shall possess a certificate of occupancy for a single-family\nresidence, be entitled to the issuance of a certificate of occupancy\nby virtue of preexisting status or have a valid building permit to\nconstruct a single-family residence, unless the owner of the property\nintends to obtain permits pursuant to this section to maintain an\napartment constructed without approvals as an affordable accessory\napartment."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "No more than one affordable accessory apartment\nshall be permitted on any lot."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Apartments may not be constructed in accessory\nstructures."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "An affordable accessory apartment shall not\nbe permitted on a lot on which there exists an artist studio, rooming\nhouse or borders, home occupation, home professional office, pre-existing\naccessory apartment, two-family detached dwelling or multiple-family\ndwelling. The owner of a single-family residence with an affordable\naccessory apartment may not also rent guest rooms pursuant to § 255-11-62C(3)."
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "No affordable accessory apartment shall be permitted\nif the result would be a residential density of more than two dwelling\nunits per lot."
												}
											]
										},
										{
											"number": "(6) ",
											"content": [
												{
													"text": "In residence districts authorized by this chapter,\nan affordable accessory apartment may be maintained as a conditional\naccessory use only upon compliance with the requirements of this local\nlaw, the Code of the Town of East Hampton, the New York State Uniform\nFire Prevention and Building Code and the conditions, rules and/or\nregulations of any other agency having jurisdiction."
												}
											]
										},
										{
											"number": "(7) ",
											"content": [
												{
													"text": "The rent charged for an affordable accessory\napartment may not exceed the standards set forth in § 255-1-20,\n\"affordable housing unit.\""
												}
											]
										},
										{
											"number": "(8) ",
											"content": [
												{
													"text": "No more than 20 affordable accessory apartment\npermits or building permits for affordable accessory apartments shall\nbe issued in each school district located within the Town of East\nHampton. The total number of permits issued for affordable accessory\napartments in the Town of East Hampton shall not exceed 100. The permits\nwill be issued on a first-come first-serve basis."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Site requirements."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "No violations of the Town Code shall exist at\nthe time of application for an affordable accessory apartment; excepting\nthose that may exist as part of an apartment constructed without approvals\nthat is the subject of the application for an affordable accessory\napartment. The Building Inspector shall inspect the premises upon\nreceipt of a completed application, and the application shall not\nbe processed until all outstanding violations are corrected."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "No affordable accessory apartment shall be constructed\non a lot with a total lot area less than 15,000 square feet."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "No affordable accessory apartment shall be permitted\non any lot located wholly or partially within a Harbor Protection\nOverlay District or Affordable Housing Overlay District."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Permits required; conditional use."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "In order to construct an affordable accessory\napartment, the owner shall apply for a building permit and obtain\na temporary certificate of occupancy for the apartment from the Building\nInspector. The apartment may not be occupied until an affordable accessory\napartment permit from the Town Office of Housing and Community Development\nis obtained pursuant to § 255-11-63E herein. A permanent\ncertificate of occupancy conditioned upon use of the apartment as\nan affordable accessory apartment as defined herein may not be issued\nby the Building Inspector until an affordable accessory apartment\npermit is issued."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Building permit application. The owner of a\nsingle-family detached dwelling, when authorized by this chapter,\nmay apply to the Building Department for a permit to construct an\naffordable accessory apartment. The application shall be in writing\nand in a form prescribed by the Building Inspector and acknowledged\nby the applicant in the form of an affidavit verified under oath.\nThe application must contain:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "The name, address and contact information of\nthe owner;"
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "The name, address and contact information of\na person designated by the owner who is responsible for the property\nin the absence of the owner;"
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "The street and address of the premises at which\nan affordable accessory apartment is contemplated, together with its\nSuffolk County Tax Map description;"
																}
															]
														},
														{
															"number": "(d) ",
															"content": [
																{
																	"text": "A survey of the premises at which the affordable\naccessory apartment is contemplated, at a scale and size suitable\nfor filing;"
																}
															]
														},
														{
															"number": "(e) ",
															"content": [
																{
																	"text": "A floor plan of the existing residence or proposed\nresidence and one photograph of each of the front, rear and each side\nof the existing dwelling on the premises which is the subject of the\napplication, as well as photographs depicting the location of any\nexisting driveways, and if not included on the survey drawn to scale,\nshowing all buildings, structures, walks, drives, other physical features\nof the premises and the location of and access to existing and proposed\noff-street parking;"
																}
															]
														},
														{
															"number": "(f) ",
															"content": [
																{
																	"text": "A floor plan of the proposed dwelling as same\nshall exist after any alterations or modifications are made for such\naffordable accessory apartment;"
																}
															]
														},
														{
															"number": "(g) ",
															"content": [
																{
																	"text": "Proof of residency of the owner(s);"
																}
															]
														},
														{
															"number": "(h) ",
															"content": [
																{
																	"text": "Photo identification of the owner(s); and"
																}
															]
														},
														{
															"number": "(i) ",
															"content": [
																{
																	"text": "A duly executed and acknowledged written consent\nof the applicant authorizing an inspection of the premises as set\nforth in § 255-11-63C(3)(a)(7)."
																}
															]
														},
														{
															"number": "(j) ",
															"content": [
																{
																	"text": "A duly executed and acknowledged written intention\nto construct an affordable accessory apartment in accordance with\nthe provisions of § 255-11-63 of the Town Code."
																}
															]
														},
														{
															"number": "(k) ",
															"content": [
																{
																	"text": "Any other information deemed necessary by the\nBuilding Inspector to assure the completeness of the application."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Certificate of occupancy for an affordable accessory\napartment will not be issued until:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "The property owner has such contracts, easements,\ncovenants, deed restrictions, or other legal instruments running in\nfavor of the Town which will ensure that:"
																},
																{
																	"content": [
																		{
																			"number": "[1] ",
																			"content": [
																				{
																					"text": "The principal dwelling is owner-occupied;"
																				}
																			]
																		},
																		{
																			"number": "[2] ",
																			"content": [
																				{
																					"text": "The apartment or any proprietary\nor other interest therein will not be sold to the tenant or any other\nparty, except as part of a sale of the entire residence in which the\napartment is located;"
																				}
																			]
																		},
																		{
																			"number": "[3] ",
																			"content": [
																				{
																					"text": "The affordable accessory apartment\nwill be used only for the year-round occupancy of an East Hampton\nTown resident;"
																				}
																			]
																		},
																		{
																			"number": "[4] ",
																			"content": [
																				{
																					"text": "The affordable accessory apartment\nis the legal domicile of all tenants therein;"
																				}
																			]
																		},
																		{
																			"number": "[5] ",
																			"content": [
																				{
																					"text": "Rent charged to the tenant of the\napartment must be stated in the lease and is not to exceed that set\nforth for an affordable housing unit pursuant to § 255-1-20\nof the East Hampton Town Code;"
																				}
																			]
																		},
																		{
																			"number": "[6] ",
																			"content": [
																				{
																					"text": "All leases of the rental apartment\nshall be in writing, comply with § 255-11-63F and made available\nto the Office of Housing and Community Development and shall be for\na minimum of a one-year term;"
																				}
																			]
																		},
																		{
																			"number": "[7] ",
																			"content": [
																				{
																					"text": "The Building Inspector, or his/her\ndesignee, has the right to inspect the entire property, upon reasonable\nnotice, for the purpose of determining whether the apartment and all\nother structures on the property are in compliance with the Code of\nthe Town of East Hampton, the New York State Uniform Fire Prevention\nand Building Code and/or the rules and regulations of any other agency\nhaving jurisdiction. The failure to schedule an inspection after due\nnotice from the Town or resisting, obstructing and/or impeding the\nagents, servants, officers and/or employees of the Town of East Hampton\nduring an inspection of the premises shall be a violation of this\nlocal law and subject to the fines and penalties provided in the East\nHampton Town Code;"
																				}
																			]
																		},
																		{
																			"number": "[8] ",
																			"content": [
																				{
																					"text": "The Building Inspector, or his/her\ndesignee, has the right and the obligation in the event of an emergency\nas determined by the Building Inspector and upon notice to the property\nowner, to enter upon any portion of the premises to protect the health,\nsafety and welfare of residents or perform any duty required of him/her\nunder the Code of the Town of East Hampton, the New York State Uniform\nFire Prevention and Building Code and/or the rules and regulations\nof any other agency having jurisdiction;"
																				}
																			]
																		},
																		{
																			"number": "[9] ",
																			"content": [
																				{
																					"text": "No more than two persons are permitted\nto reside in the apartment;"
																				}
																			]
																		},
																		{
																			"number": "[10] ",
																			"content": [
																				{
																					"text": "The apartment is properly constructed,\nmaintained and used, and unapproved uses are excluded therefrom; and"
																				}
																			]
																		},
																		{
																			"number": "[11] ",
																			"content": [
																				{
																					"text": "Any other conditions deemed reasonable\nand necessary to ensure the immediate and long-term success of the\napartment in helping to meet affordable housing needs in the community\nis met;"
																				}
																			]
																		},
																		{
																			"number": "[12] ",
																			"content": [
																				{
																					"text": "An affordable accessory apartment\nmay not be occupied until an affordable accessory apartment permit\nhas been obtained from the Office of Housing and Community Development\npursuant to § 255-11-63E of the East Hampton Town Code;\nand"
																				}
																			]
																		}
																	]
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "The Building Inspector has notified the Fire\nDistrict in which the apartment is located, that an affordable accessory\napartment has been constructed at that location."
																}
															]
														}
													]
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "Violations; presumptions."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "It shall be unlawful to use, establish, maintain,\noperate, occupy, rent or lease an apartment located within a single-family\nresidence unless legally pre-existing in the Town of East Hampton\nwithout first having obtained an affordable accessory apartment permit.\nFailure or refusal to procure an affordable accessory apartment permit\nshall be deemed a violation of this local law."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "In the absence of a valid affordable accessory\napartment permit, there shall be a rebuttable presumption that a residence\nfor a single family contains an illegal apartment which is being established,\noperated, used, occupied, rented, leased and/or maintained as a multiple-family\nresidence in violation of law if any two or more of the following\nfeatures are found to exist by any person authorized to enforce or\ninvestigate violations of the Code of the Town of East Hampton:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "More than one mailbox, mail slot or post office\naddress;"
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "More than one doorbell or doorway on the same\nside of the building or dwelling unit;"
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "More than one gas meter;"
																}
															]
														},
														{
															"number": "(d) ",
															"content": [
																{
																	"text": "More than one electric meter;"
																}
															]
														},
														{
															"number": "(e) ",
															"content": [
																{
																	"text": "More than one connecting line for utility services;"
																}
															]
														},
														{
															"number": "(f) ",
															"content": [
																{
																	"text": "More than one satellite dish;"
																}
															]
														},
														{
															"number": "(g) ",
															"content": [
																{
																	"text": "Multiple bills for utility/cable television\nservice;"
																}
															]
														},
														{
															"number": "(h) ",
															"content": [
																{
																	"text": "Separate entrances for segregated parts of the\ndwelling, including but not limited to bedrooms;"
																}
															]
														},
														{
															"number": "(i) ",
															"content": [
																{
																	"text": "Permanent partitions or internal doors which\nmay serve to bar access between segregated portions of the dwelling,\nincluding but not limited to the bedroom;"
																}
															]
														},
														{
															"number": "(j) ",
															"content": [
																{
																	"text": "A separate written or oral lease or rental arrangement,\npayment or agreement for portions of the dwelling among its owner(s)\nand/or occupants and/or persons in possession thereof;"
																}
															]
														},
														{
															"number": "(k) ",
															"content": [
																{
																	"text": "The inability of any occupant or person in possession\nthereof to have unimpeded and/or lawful access to all parts of the\ndwelling unit; or"
																}
															]
														},
														{
															"number": "(l) ",
															"content": [
																{
																	"text": "Two or more kitchens each containing one or\nmore of the following: a range, oven, hotplate, microwave or other\nsimilar device customarily used for cooking or preparation of food\nand/or a refrigerator."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "If a property, building or dwelling is found to contain two or more of the features enumerated in Subsection D(2) herein, the Town may request that the owner of that property, building or dwelling unit submit to the Town a verified statement affirming that the property, building or dwelling unit meets all applicable zoning or building codes, ordinances and regulations of the Town of East Hampton. Failure to submit the requested statement as required by the Town shall be deemed a violation subject to the penalties contained in § 255-10-50. This section shall not prohibit the Town's enforcement agencies from taking any other action authorized by this Code in lieu of a request for a verified statement pursuant to this section."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "Issuance of an affordable accessory apartment permit;\nconditions; lease; fees."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Application. The owner of a single-family dwelling,\nwhere a certificate of occupancy has been issued for an affordable\naccessory apartment must apply to the Office of Housing and Community\nDevelopment to maintain that affordable accessory apartment. The application\nshall be in writing and in a form to be prescribed by the Office of\nHousing and Community Development and acknowledged by the applicant\nin the form of an affidavit verified under oath. The application must\ncontain:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "Proof of residency of the owner(s);"
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "Proof of residency of the tenant(s);"
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "Photo identification of the owner and tenant(s);"
																}
															]
														},
														{
															"number": "(d) ",
															"content": [
																{
																	"text": "A copy of the fully completed application to\nthe Building Department for all necessary building permits;"
																}
															]
														},
														{
															"number": "(e) ",
															"content": [
																{
																	"text": "A copy of the certificate of occupancy for the\nlot;"
																}
															]
														},
														{
															"number": "(f) ",
															"content": [
																{
																	"text": "A copy of the lease between the owner and the\ntenant that complies with § 255-11-63F;"
																}
															]
														},
														{
															"number": "(g) ",
															"content": [
																{
																	"text": "The name, address and contact information of\na person designated by the owner who is responsible for the property\nin the absence of the owner;"
																}
															]
														},
														{
															"number": "(h) ",
															"content": [
																{
																	"text": "Any other information that the Office of Housing\nand Community Development deems necessary to facilitate the rental\nof an affordable accessory apartment."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Change in occupancy. Any change in the occupancy\nof the affordable accessory apartment must be reported to the Office\nof Housing and Community Development within 30 days of such change.\nAny changes in occupancy during the term of the lease must comply\nwith all provisions of this local law."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Permit fees. The fee for the initial permit\napplication for an affordable accessory apartment permit shall be\n$50, unless such application is made to legalize an otherwise illegal\napartment, in which case the fee shall be $500, which shall be nonrefundable\nand paid at the time of filing the application, in addition to any\nother fees required by the Building Department for a building permit."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "Permit renewal."
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "Any permit issued under this local law may be renewed for an additional term of one year. A complete application pursuant to Subsection E(1) herein must be filed for a permit renewal. The filing fee for the renewal of an affordable accessory apartment shall be $25."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "All fees for renewal of an existing permit shall be paid within 30 days of the expiration of the existing permit. All fees paid after 30 days of the expiration of the existing permit shall be subject to a late filing fee of $50 in addition to the filing fee in Subsection E(4)(a) herein."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "Failure to renew an affordable accessory permit\nresults in the presumption that an affordable accessory apartment\nis being operated, used, rented, leased and/or maintained by the new\nowner(s) in violation of law."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "Transfer of permits."
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "An affordable accessory apartment permit may be transferred to a subsequent property owner by application as in the event of an original application and in accordance with Subsection E(1) herein."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "The application for a transfer of the affordable\naccessory apartment must occur within 90 days of the closing of title,\nand the main dwelling will be or is the principal residence of the\nnew owner upon sale. Such transfer of the permit will not take effect\nuntil the new owner(s) submits a complete application and such application\nis approved by the Office of Housing and Community Development. In\nthe event an application for a transfer of an accessory permit has\nnot been filed by the new owner(s) in violation of this article, there\nshall be a presumption that an affordable accessory apartment is being\noperated, used, rented, leased and/or maintained by the new owner(s)\nin violation of law."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "Said transfer application shall be subject to Subsection E(1) and (4) herein and payment of the applicable fee."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(6) ",
											"content": [
												{
													"text": "Term of permit. All permits issued hereunder\nshall be valid for a period of one year unless:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "A court of competent jurisdiction finds that\nthe owners or tenants of the dwelling unit(s) located within the residence\nbuilding are guilty of a violation of any provision of this local\nlaw;"
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "The permit is terminated by operation of law\nor order of the court;"
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "The permit is voluntarily surrendered by the\nproperty owner. Voluntary surrender of the permit must be done in\nwriting to both the Building Inspector, the Office of Housing and\nCommunity Development and the East Hampton Town Board; or"
																}
															]
														},
														{
															"number": "(d) ",
															"content": [
																{
																	"text": "The certificate of occupancy is revoked pursuant to § 102-15B of the Code."
																}
															]
														}
													]
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "F. ",
							"content": [
								{
									"text": "Lease. The lease between the owner and the tenant\nmust be in writing and contain the following provisions:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "A minimum term of one year;"
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "No more than two persons are permitted to reside\nin the apartment;"
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "The apartment must serve as the year-round legal\nresidence of the tenant;"
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "The tenant consents to an inspection upon reasonable\nnotice by the Building Inspector, or his/her designee, for the purpose\nof determining whether the apartment and all other structures on the\nproperty are in compliance with the Code of the Town of East Hampton,\nthe New York State Uniform Fire Prevention and Building Code and/or\nthe rules and regulations of any other agency having jurisdiction.\nThe failure to schedule an inspection after due notice from the Town\nor resisting, obstructing and/or impeding the agents, servants, officers\nand/or employees of the Town of East Hampton during an inspection\nof the premises is a violation of the East Hampton Town Code and subject\nto the fines and penalties provided herein;"
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "The right of the Building Inspector, or his/her\ndesignee, in the event of an emergency as determined by the Building\nInspector and upon notice to the property owner, to enter upon any\nportion of the premises to protect the health, safety and welfare\nof residents or perform any duty required of him/her under the Code\nof the Town of East Hampton, the New York State Uniform Fire Prevention\nand Building Code and/or the rules and regulations of any other agency\nhaving jurisdiction; and"
												}
											]
										},
										{
											"number": "(6) ",
											"content": [
												{
													"text": "The rent charged to the tenant is stated in\nthe lease and is not to exceed the standards set forth in the definition\nof \"affordable housing unit\" contained in the East Hampton Town Code."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "G. ",
							"content": [
								{
									"text": "Occupancy requirements."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "One or more owners of the lot upon which the\naffordable accessory apartment is located shall reside within the\nprincipal dwelling as a year-round resident. The owner or owners in\nresidence shall have no other primary residence and must demonstrate\nlegal residency in the Town of East Hampton.[Amended 5-6-2008 by L.L. No. 9-2008]"
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "(Reserved)[1]"
												},
												{
													"footnote": "[1]\nEditor's Note: Former Subsection G(2), regarding\nthe owner-occupant maintaining an interest of 100% in the property,\nwas repealed 5-6-2008 by L.L. No. 9-2008.\n"
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "No more than two persons are permitted to reside\nin an affordable accessory apartment."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "The tenant must have established legal residency\nin the Town of East Hampton prior to occupying an affordable accessory\napartment."
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "Documents that may be requested to establish\nlegal residency may include but are not limited to:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "Government-issued photo identification;"
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "New York State income tax forms;"
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "A voter registration card;"
																}
															]
														},
														{
															"number": "(d) ",
															"content": [
																{
																	"text": "A year-round lease for a residence in the Town\nof East Hampton with rent receipts; and"
																}
															]
														},
														{
															"number": "(e) ",
															"content": [
																{
																	"text": "Any other information the Office of Housing\nand Community Development deems necessary to the determination of\nresidency."
																}
															]
														}
													]
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "H. ",
							"content": [
								{
									"text": "Design requirements."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "The affordable accessory apartment shall be\na minimum of 300 square feet and shall not exceed 600 square feet."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "The affordable accessory apartment shall not\ncontain more than one conventional bedroom."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "No portion of a single-family dwelling structure\nor affordable accessory apartment shall utilize a cellar, attic or\nany portion thereof as habitable living space unless a variance is\nissued by the New York State Uniform Fire Prevention and Building\nCode Review Board or other agency having jurisdiction."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "At least two off-street parking spaces shall\nbe provided for in a driveway on the lot for the affordable accessory\napartment in addition to that parking already utilized by the property\nowner."
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "All exterior entrance doors shall be located\nat the sides or rear of the dwelling. No exterior changes shall be\nmade so as to alter the single-family appearance of the dwelling."
												}
											]
										}
									]
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 255-11-64",
			"title": "Uses prohibited in single-family residences.",
			"content": [
				{
					"text": "No person, including the owner, shall use or permit to be used\nany single-family residence for any of the following:"
				},
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Two-family residence: creation, use or maintenance of a two-family residence, as defined herein, except as may be authorized in certain cases by special permit pursuant to the Use Table and Article V."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Multifamily occupancy: occupancy at any time by more than one family,\nexcept as permitted by § 255-11-62C(3) and (4) hereof."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Partial occupancy or rental: rentals to, or use or occupancy by,\nany person or persons of less than the entire residence, except as\npermitted in § 255-11-62C(3) and (4) hereof."
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "Excessive turnover: except in the case of the rental of guest rooms\npursuant to § 255-11-62C(3) hereof, rentals, tenancies or\noccupancies constituting motel use as defined in § 255-1-20\n(\"motel\") hereof."
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "Shares: the selling of shares or the establishing of other ownership,\ntenancy or use arrangements in which individuals obtain rights of\noccupancy in individual bedrooms, whether or not specifically identified,\nor rights to occupy all or part of the residence on particular days\nof the week, specified weekends or other similar occasions or terms."
								}
							]
						},
						{
							"number": "F. ",
							"content": [
								{
									"text": "Fractionalized ownership interests: the creation of cooperative-style\nownership, less-than-fee-simple ownership or other similar arrangements\nresulting in proprietary tenancies for one or more persons in the\nresidence, the establishment of interval or time-sharing ownership\nfor any person in all or any part of the residence, or the like. However,\nthis subsection shall not be deemed to preclude the creation of mortgages,\nliens, easements or other similar interests encumbering the residential\nproperty as a whole to secure a loan or for any other legitimate purposes."
								}
							]
						},
						{
							"number": "G. ",
							"content": [
								{
									"text": "Parking: when in use pursuant to § 255-11-62D hereof, parking\nof vehicles of occupants and their visitors on the street or on any\nproperty other than the lot on which the residence is located or parking\novernight of more than four vehicles on said lot shall be prohibited."
								}
							]
						},
						{
							"number": "H. ",
							"content": [
								{
									"text": "Overcrowding: occupancy of any bedroom by more occupants than permitted\nby the minimum area requirements set forth in § 255-11-67A(9).\nThis occupancy limitation applies to all bedrooms in single-family\nresidences, including guest rooms in single-family residences as provided\nin § 255-11-62C(3), immediately upon the effective date\nof this subsection regardless of whether such residences were constructed\nbefore the effective date of this subsection and regardless of the\nnumber of occupants before said effective date."
								}
							]
						},
						{
							"number": "I. ",
							"content": [
								{
									"text": "Other: establishment or carrying on of any new business, trade, commercial\noperation or other nonresidential activity or use, which activity\nor use is not specifically authorized by this Code. For the purposes\nof this subsection, hosting or granting of permission to host for\na fee (whether termed rental or otherwise) of more than one social\nevent or reception per calendar year at any single-family residence\nlocated within the boundaries of the Town of East Hampton shall be\ndeemed to be a nonresidential activity or use. This section shall\nnot be deemed to prevent:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "The parking on a residential lot of commercially registered\n(including livery) cars or light trucks if the same are used by an\noccupant of the residence on the lot on which the vehicle is parked,\nwith the exception of vehicles designed for or utilized for the storage\nand/or transportation of fuel products (gasoline, oil, propane, kerosene\nproducts or any other similar combustible compound) or other combustible\ncompounds, which shall not be parked on any residential lot. This\nprovision shall not be deemed to prevent the temporary parking of\nsuch a vehicle on a residential lot, provided that said vehicle is\nactively engaged in the delivery of product to the premises on the\nresidential lot on which it is parked."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "The outdoor storage on a residential lot of up to two boats or any number of such boats used in connection with a home occupation as defined in Article I."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Any home occupation or home office use, as the same are defined\nand permitted herein."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "J. ",
							"content": [
								{
									"text": "Penalties. Any person found guilty of a violation of any provision\nof this section shall be punishable by a fine of not less than $500\nnor more than $2,500 or by imprisonment not to exceed six months,\nor both. For a second offense in less than two years, any person found\nguilty of a violation of any provision of this section shall be punishable\nby a fine of not less than $1,500 nor more than $5,000 or by imprisonment\nnot to exceed six months, or both. For a third offense in less than\nfive years, any person found guilty of a violation of any provision\nof this section shall be punishable by a fine of not less than $2,500\nnor more than $10,000 or by imprisonment not to exceed six months,\nor both."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 255-11-65",
			"title": "Responsibility of owner; presumption of existence of use.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Responsibility. Subleasing of a residence or part\nthereof by any person other than the owner shall make such sublessor\njointly responsible with the owner and tenant for compliance with\nthis section and with all other applicable provisions of this Code,\nincluding, but not limited to, regulations concerning allowable light\nand noise, but subleasing or any other tenancy or occupancy arrangement\nshall not be deemed in any way to relieve the owner of the residence\nfrom continuing primary responsibility for such compliance."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Presumption of existence of prohibited use. Where\nthe owner, the owner's family, its agent or any other person having\ncontrol over the occupancy or use of a single-family residence does\nplace, or cause to be placed or broadcast, an announcement in any\nprinted or electronic medium advertising that shares in such residence\nare available for purchase, or that daily or weekly rentals are available\nor that any other use identified as prohibited in § 255-11-64\nhereof is available or exists in the residence, there shall arise\na rebuttable presumption that the activities, conditions or uses advertised\nexist and are being maintained in such residence.[Amended 7-18-2002 by L.L. No. 21-2002]"
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 255-11-67",
			"title": "Additional regulations.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Design requirements. In addition to the use rules\nfor single-family residences contained in the preceding sections,\nevery such residence constructed, reconstructed or substantially expanded\nafter the effective date of this section (or the effective date of\nany amendment of this section with respect to the application of such\namendment) shall comply with the following design requirements:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "The interior and exterior of the residence shall be designed for use by a single family, and, except in cases where an accessory apartment is created pursuant to § 255-11-63 or/and Article V hereof, there shall be no facilities providing for the independent occupancy of a second family. A violation of the provisions of this subsection shall be punishable by a fine of not less than $500 nor more than $1,000 or by imprisonment not to exceed six months, or both."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "There shall be no more than one area designed\nor used for food preparation, whether or not the same is a separate\nkitchen. Additional facilities, including, but not limited to, second\nkitchens, groupings of plug-in appliances or other areas suitable\nor likely to be employed for cooking and preparation of meals shall\nbe prohibited. The interior and exterior of the residence shall be\ndesigned for use by a single family, and, except in cases where an\naffordable accessory apartment is created pursuant to § 255-11-63,\nthere shall be no facilities providing for the independent occupancy\nof a second family. A violation of the provisions of this subsection\nshall be punishable by a fine of not less than $500 nor more than\n$1,000 or by imprisonment not to exceed six months, or both."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "There shall be at least one common entrance\non the ground floor, through which every room, other than a utility\nroom, shall be readily accessible by passage through the interior\nof the residence. This subsection shall not apply to an affordable\naccessory apartment approved pursuant to § 255-11-63 of\nthis chapter."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "There shall be no more than one conventional bedroom for every 300 square feet of habitable floor area, except that two bedrooms shall always be permitted, and no bedroom shall be located in any garage or cellar. The interior and exterior of the residence shall be designed for use by a single family, and, except in cases where an accessory apartment is created pursuant to § 255-11-63 or Article V hereof, there shall be no facilities providing for the independent occupancy of a second family. A violation of the provisions of this subsection shall be punishable by a fine of not less than $500 nor more than $1,000 or by imprisonment not to exceed six months, or both."
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "There shall be at least one room which is not\ndesigned as a conventional bedroom, kitchen, bathroom, foyer, storage\narea or closet. The interior and exterior of the residence shall be\ndesigned for use by a single family, and, except in cases where an\naffordable accessory apartment is created pursuant to § 255-11-63\nhereof, there shall be no facilities providing for the independent\noccupancy of a second family. A violation of the provisions of this\nsubsection shall be punishable by a fine of not less than $500 nor\nmore than $1,000 or by imprisonment not to exceed six months, or both."
												}
											]
										},
										{
											"number": "(6) ",
											"content": [
												{
													"text": "No accessory structure having living quarters shall be permitted. An accessory structure (other than a pool house of no more than 200 square feet in gross floor area) which includes kitchen facilities of any type described in Subsection A(2) or which contains a bathroom, shower or plumbing facilities (with the exception of an approved artist's studio having only a sink) shall be deemed to be in violation of this section. The interior and exterior of the residence shall be designed for use by a single family, and, except in cases where an affordable accessory apartment is created pursuant to § 255-11-63 and Article V hereof, there shall be no facilities providing for the independent occupancy of a second family. A violation of the provisions of this subsection shall be punishable by a fine of not less than $500 nor more than $1,000 or by imprisonment not to exceed six months, or both."
												}
											]
										},
										{
											"number": "(7) ",
											"content": [
												{
													"text": "There shall be no more than one electric meter\nservicing the residence except during the period of existence in the\nresidence of an approved affordable accessory apartment or of a home\noffice or home occupation requiring a second such meter."
												}
											]
										},
										{
											"number": "(8) ",
											"content": [
												{
													"text": "The width of an enclosed hallway, breezeway or other design\nthat functionally separates living space in a single-family dwelling\nmust be equal to or greater than 1/2 its length.[Amended 10-19-2015 by L.L. No. 35-2015]"
												}
											]
										},
										{
											"number": "(9) ",
											"content": [
												{
													"text": "Area for sleeping purposes. Every bedroom occupied\nby one person shall contain at least 70 square feet (6.5 m2) of floor area, and every bedroom occupied by more\nthan one person shall contain at least 50 square feet (4.6 m2) of floor area for each occupancy thereof. Bedrooms\nhaving a sloped ceiling over all or part of the room shall have a\nclear ceiling height of at least seven feet over not less than 1/2\nof the required minimum floor area and only those portions of the\nfloor area with a clear ceiling height of five feet or more shall\nbe included in calculating the floor area of such bedroom. A violation\nof the provisions of this subsection shall be punishable by a fine\nof not less than $500 nor more than $1,000 or by imprisonment not\nto exceed six months, or both."
												}
											]
										},
										{
											"number": "(10) ",
											"content": [
												{
													"text": "The gross floor area of a single-family residence may not exceed 12% of the lot area plus 1,600 square feet. See § 255-11-10, III Residence Districts- Table of Residential Regulations, Parts I and II. Lots created pursuant to Chapter 193. Open Space Preservation are not subject to the foregoing provisions upon submission of sufficient proof verifying that the lot was created pursuant to Chapter 193 but must meet the requirements of § 255-11-10, Table III, (Building Coverage). Notwithstanding any prior provision to the contrary, no single-family residence may exceed 20,000 square feet.[Added 7-8-2008 by L.L. No. 12-2008]"
												}
											]
										}
									]
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 255-11-68",
			"title": "Termination of certain nonconforming uses in single-family residences.",
			"content": [
				{
					"text": "Notwithstanding any other provision of this\nchapter, no later than six months after the effective date of this\nsection, any existing use of or in a single-family residence, which\nuse is identified as a prohibited use in § 255-11-64A through\nG hereof, shall be discontinued and terminated, and such use shall\nnot thereafter be further continued or resumed."
				}
			]
		},
		{
			"paragraph": "§ 255-11-70",
			"title": "Supplemental dimensional regulations.",
			"content": [
				{
					"text": "The following sections contain dimensional regulations\nnot contained in the Dimensional Table of § 255-11-10."
				}
			]
		},
		{
			"paragraph": "§ 255-11-71",
			"title": "Interpretation of setbacks.",
			"content": [
				{
					"text": "In order to avoid undue crowding and the loss\nof open space, vegetated areas, rural community character and privacy,\nthe Dimensional Table of § 255-11-10 establishes required\nsetbacks for all buildings and structures on lots. However, no provision\nof this chapter shall be construed to prohibit in required yard (setback)\nareas of any lot such paved driveways or walkways as may be necessary\nto connect on-site parking areas, garages or building entrances to\nthe street. Further, no such provision shall be deemed to prohibit\nthe location in required yards of otherwise lawful berms, fences,\nwalls, signs, landscaping, plantings, turf or sod or to prohibit the\notherwise lawful parking or storage of cars and boats in required\nyards."
				}
			]
		},
		{
			"paragraph": "§ 255-11-72",
			"title": "Height.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Determination of height. The height of any point on\na building or structure shall be the vertical distance from such point\nto the natural ground elevation directly beneath the point whose height\nis being measured. The height of a building or structure shall be\nthe height of the highest point thereof."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Limitation on maximum height. Except as provided for in Subsections C and E of this section, no part of any building or structure shall exceed the maximum height permitted for the same by the Dimensional Table."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Gabled roof. Where such Dimensional Table lists a\nheight for a gabled roof greater than the figure listed as the otherwise\npermitted maximum height of the building, the peak of such gabled\nroof may have a height up to, but no greater than, the higher figure\nlisted. Only such gabled roof, and those parts of the building covered\nor directly overlain by it, shall be at levels higher than the applicable\nmaximum height listed in the table, and no other point on the building\nshall exceed such ordinary maximum height. Further, the highest plate\nor bearing point for rafters at the eaves shall not exceed such listed\nmaximum height."
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "Pyramid law.[1] Except on lots in any Central Business District, all buildings and structures on any lot in any district must be set back from all property lines so that the height of any point of the building or structure is not greater than the horizontal distance of the point from an imaginary vertical line (the \"measurement line\") drawn upwards from the nearest property line to the building at that location. The height of each point shall be measured from the elevation of the natural grade at the measurement line. Notwithstanding any language in this subsection, the maximum height limitation for a building or structure in § 255-11-10 hereof shall not be exceeded at any point unless the structure is one exempted from such maximum height limit by Subsection E hereof.[Amended 6-14-2001 by L.L. No. 11-2001]"
								},
								{
									"footnote": "[1]\nEditor's Note: See illustration for § 255-11-72D,\nTypical Elevation View Showing Control of Height of Building included\nat the end of this chapter.\n"
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "Exceptions.[Amended 8-16-1985 by L.L. No. 8-1985, 7-1-1988 by L.L. No.\n4-1988]"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "The height limitations for buildings and structures listed in the Dimensional Table of § 255-11-10 shall not be deemed to apply to a wind energy conversion structure approved by the Town Board pursuant to Chapter 249 of this Code nor to church spires, chimneys, flagpoles, radio or television transmission towers and antennas, telephone poles, radio and television aerials or their supports; provided, however, that in residential districts any such structure, with the exception of chimneys, shall be set back from any property line in relation to its height so as to comply with Subsection D hereof. A chimney, as the same is defined herein, may be greater in height than its setback from any property line; provided, however, that the portion of the chimney which so exceeds in height the distance between the base of the chimney and the property line shall not have dimensions greater than 30 inches in depth and 60 inches in width.[Amended 11-16-1990 by L.L. No. 17-1990]"
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Notwithstanding any other provision in this\nchapter to the contrary, for residences lawfully existing on January\n1, 1985, and having a height in excess of the height limits specified\nin the Dimensional Table for nongabled roofs, the height limit for\nany addition or improvement made thereto shall be a height equal to\nthe highest point of the roof of such building at that date; provided,\nhowever, that in no case shall the applicable gabled roof height shown\nin the Dimensional Table be exceeded."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "A residential building or structure with a gabled\nroof having a maximum height at the peak of up to 35 feet may be permitted\nby the approval of the Architectural Review Board only if:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "The proposed residence having such a height\nat the peak fully meets the standards and criteria set forth in § 255-7-60\nof this chapter and is consonant with the purposes set forth in § 255-7-10."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "The building lot or parcel upon which the proposed\nresidence is to be constructed has a minimum lot area of 60,000 square\nfeet."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "The horizontal setback from all property lines called for in Subsection D hereof (Pyramid law) is doubled so that the height of any point of the building or structure is not greater than 1/2 the horizontal distance measured from that point to an imaginary vertical line drawn upwards from the property line closest to the building at that location."
																}
															]
														},
														{
															"number": "(d) ",
															"content": [
																{
																	"text": "The owner covenants that the parcel upon which the building or structure utilizing the greater height allowance of this subsection is built will not be the subject of any future subdivision or lot line modification which would defeat the lot area or setback requirements of Subsection E(3)(b) and (c) above."
																}
															]
														}
													]
												}
											]
										}
									]
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 255-11-74",
			"title": "Other setbacks and height restrictions.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Scenic or conservation easements. Where the erection\nof structures is forbidden on any part of any lot by a recorded scenic\nor conservation easement running in favor of the Town, all buildings\nand structures, except for fences, shall be set back at least 10 feet\nfrom the boundary of any such scenic or conservation easement area.[Amended 11-15-1996 by L.L. No. 19-1996]"
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Height restrictions on corner lots. In order to preserve\nsight lines for traffic, on corner lots in residential use districts\nall hedges and other plantings, as well as berms, walls and other\nstructures, shall be kept below a height of 2 1/2 feet above\nthe average street level within an isosceles triangle having thirty-foot\nsides along each street frontage.[Amended 11-15-1996 by L.L. No. 19-1996]"
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Rear lots on streets. When a rear lot line is also\na street right-of-way line, the required rear yard setback for an\naccessory building or structure shall be double the required rear\nyard setback in the applicable district."
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "Setback in Central Business Districts.[Added 7-16-2015 by L.L.\nNo. 26-2015]"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "As part of a site plan application, pursuant to Article VI herein, the Planning Board may require new or reconstructed buildings located in the Central Business District to have a setback of up to 20 feet where the Board finds any of the following:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "The location of adjoining and nearby buildings is set back farther\nthan 10 feet from the front yard property line."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "A larger setback is consistent with the existing streetscape."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "A ten-foot front yard setback would allow the building to appear\nmassive as to overwhelm or stand out from the existing streetscape."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "A 3D photo simulation of the proposed building with the adjoining\nproperties may be required, at the discretion of the Planning Board,\nto be submitted with an applicant's site plan application to\nassist the Planning Board in the analysis required pursuant to § 255-11-74D(1)\nherein."
												}
											]
										}
									]
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 255-11-76",
			"title": "Frontage.",
			"content": [
				{
					"text": "The minimum frontage of any lot on a public\nstreet and the minimum access width of any lot shall be 20 feet. If\nfrontage is provided by means of a flag strip, access width shall\nbe measured perpendicular to the sides of the flag strip. Notwithstanding\nthis requirement, the Planning Board may approve the creation of a\nnew lot not having such frontage, by subdivision waiver or by open\nspace subdivision after the effective date hereof, if the new lot\nwill have access to a public street by means of a common driveway\neasement or access easement which is 20 feet or more in width at all\npoints and which easement is the subject of a duly recorded legal\ninstrument which cannot be revoked or terminated without Planning\nBoard approval. To the extent that § 280-a of the New York\nTown Law requires that a lot directly abut a street and have a minimum\nfrontage of 15 feet thereon, § 280-a is superseded in order\nto allow access by easement as just described, pursuant to the Town's\npowers under Article 9, § 2(b)(3) of the New York State\nConstitution; § 10, Subdivision 6 of the Statute of Local\nGovernments; and § 10, Subdivision 1(ii)a(3), (11) and (14),\nof the Municipal Home Rule Law."
				}
			]
		},
		{
			"paragraph": "§ 255-11-80",
			"title": "Supplemental use regulations.",
			"content": [
				{
					"text": "The following sections contain use regulations\nnot contained in the Use Table of § 255-11-10 or elsewhere\nin this chapter."
				}
			]
		},
		{
			"paragraph": "§ 255-11-84",
			"title": "Interior accessory uses.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Floor area of certain uses limited. No more than 1/3\nof the aggregate floor area of any resort, transient motel, semipublic\nfacility or club shall be used for incidental service, such as restaurants,\nbars, retail shops, etc. Gasoline sales and motor vehicle repair are\nprohibited."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "(Reserved)"
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 255-11-85",
			"title": "Interior designs.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Mezzanines prohibited in certain buildings. Because\nof the extreme danger posed to occupants in case of fire, the construction\nor creation of mezzanines, balconies, storage lofts and other similar\nareas located between the ceiling of the second story of a building\nand the roof thereof shall be prohibited after the effective date\nof this section in all multiple residences, resorts and transient\nmotels. Where such features already exist, they shall not be further\noccupied or used as habitable or living space after December 31, 1984,\nand furnishings and other amenities or facilities currently located\nin such areas which allow their use as living quarters shall be removed\ntherefrom. Thereafter, such areas shall be used only for storage.\nThe Fire Prevention Inspector shall have authority to enforce this\nsection."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "(Reserved)"
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 255-11-86",
			"title": "Parking.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Parking prohibited in or under certain buildings.\nNo parking of vehicles shall be permitted in or under any multiple\nresidence, resort or transient motel except with the express written\napproval of the Town Fire Prevention Inspector, as well as site plan\napproval for such parking from the Planning Board. The Fire Prevention\nInspector shall have authority to enforce this section."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "(Reserved)"
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 255-11-88",
			"title": "Additional rules for particular principal and accessory uses.",
			"content": [
				{
					"footnote": "[1]\nEditor’s Note: Swimming pool, as amended, which immediately\nfollowed this use, was repealed 7-7-2016 by L.L. No. 21-2016.\n[2]\nEditor's Note: The subsection which immediately\nfollowed this subsection, Uses Listed in § 255-5-50, was\nrepealed 1-16-1997 by L.L. No. 2-1997.\n"
				}
			]
		},
		{
			"paragraph": "§ 255-11-89",
			"title": "Additional requirements for accessory structures and uses of swimming pools.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "For the purposes of this section, the following definitions shall\napply:"
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "No swimming pool shall be constructed until a building permit shall\nhave been issued therefor. No swimming pool shall be filled with water\nuntil the pool structure shall have been completely enclosed in accordance\nwith the provisions of this subsection, which fencing shall have been\ninspected and approved by the Building Inspector as being in compliance\nherewith. Pumps shall be enclosed on all four sides (top may be unenclosed)\nin order to prevent noise, sound or vibration caused by the heater\nand/or pump from crossing property lines."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Pool fencing. Every swimming pool shall be completely and securely\nenclosed with a fence or wall (which may include the wall of a building),\nevery part of which enclosure meets the requirements of the Uniform\nStates Fire Prevention and Building Code and in particular satisfies\nthe following requisites:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "The enclosure shall be no less than four feet in height at any\npoint;"
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "It shall be completely covered from its top to within three\ninches of the ground with a material having no openings wider than\nthree inches;"
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "It shall be of sufficient strength to support a weight of at\nleast 250 pounds; and"
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "Any gates with which such enclosure is provided shall satisfy\nthe foregoing requirements and shall be equipped with spring locks\nwhich open only from the inside of the enclosure and which are capable\nof being locked with a padlock or key lock."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "Dry wells and discharge of pool water. Every swimming pool shall\nbe equipped with one or more dry wells into which any water discharged\nfrom the pool is directed. In no case shall water from a swimming\npool be drained, decanted or discharged directly or indirectly into\nany wetlands, onto the face of any bluff, or into any street."
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "Pool setbacks. Every swimming pool, together with any pool decks\n(including pool patios or slabs of any type) and pool equipment, shall\nbe set back from any side or rear property line a distance which is\ntwice that required by the provisions of § 255-11-10 for\nan accessory building or structure on the subject lot."
								}
							]
						},
						{
							"number": "F. ",
							"content": [
								{
									"text": "Survey and staking. No swimming pool or pool deck may be constructed and no building permit may be issued for construction of such pool or pool deck, until and unless the location of the pool and pool deck on the lot has been staked by a licensed surveyor and this location has been certified by the surveyor to conform to the locations of these structures shown on the guaranteed survey required by Subsection G hereof. These requirements shall not apply to a portable swimming pool, as defined herein,[1] but shall apply to any deck or patio constructed in connection\nwith a portable swimming pool."
								},
								{
									"footnote": "[1]\nEditor's Note: See § 255-1-20 for the definition\nof \"portable swimming pool.\"\n"
								}
							]
						},
						{
							"number": "G. ",
							"content": [
								{
									"text": "Guaranteed survey, certification and plans. Prior to the issuance\nof a building permit for the construction of a swimming pool or pool\ndeck, but not a portable swimming pool, the applicant for the permit\nshall supply the Building Inspector with:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "A guaranteed survey showing the dimensions of the property and\nsetting forth the locations of the proposed swimming pool and pool\ndeck, the dimensions thereof and the distance of the proposed swimming\npool and pool deck from all property boundaries, easements (if any)\nand other structures."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "A certification from a licensed surveyor indicating that the\nlocations of the proposed swimming pool and pool deck have been staked\non the lot in accordance with the proposed locations of these structures\nset forth on the guaranteed survey just described."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Construction plans for the swimming pool which demonstrate that it will meet the fencing and dry well requirements of Subsections C and D above."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "H. ",
							"content": [
								{
									"text": "Energy conservation construction standards."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "All pools constructed or reconstructed after September 1, 2016,\nwith more than 500 square feet of surface area or an auxiliary pool\nload shall be constructed with piping of at least two inches in diameter."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "All pools constructed or reconstructed after September 1, 2016,\nwith less than or equal to 500 square feet of surface area or an auxiliary\npool load shall be constructed with piping of at least 1 1/2\ninches in diameter."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "All pools constructed or reconstructed after September 1, 2016,\nshall have a length of pipe without bends or turns that is greater\nthan or equal to at least four pipe diameters installed before the\ninflow to the pump."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "For all pumps installed after September 1, 2016, all multiport\nvalves must be sized to equal the diameter of the pressure side of\nthe pump."
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "Directional inlets (hydrostream fittings) shall be a size of\n1/2 inch in diameter or greater."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "I. ",
							"content": [
								{
									"text": "Pumps and controls."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "All pumps and controls installed after September 1, 2016, shall\nhave a time switch or similar control mechanism installed as part\nof the pool water circulation control system that automatically operates\nthe system for the time necessary to maintain proper sanitary conditions\nand then automatically turns the system off."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Shall be set or programmed to run only during off-peak electric\ndemand periods for regular filtration purposes except where the pumps\nare used for circulating water through a heat exchanger or solar heater."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "All pumps installed after September 1, 2016, shall be of the\nfollowing type based on pool size:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "For pools with a surface area of less than 500 square feet,\na single-speed or two-speed pump of less than or equal to one horsepower\nor variable-speed pump shall be installed. In the event that a pump\nis installed on a pool of less than 500 square feet and said pool\nhas an auxiliary load, the pump installed must be a two-speed or variable\nspeed pump."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "For pools with a surface area of 500 to 799 square feet, a multispeed\npump shall be installed."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "For pools with a surface area greater than or equal to 800 square\nfeet, a variable-speed pump shall be installed."
																}
															]
														},
														{
															"number": "(d) ",
															"content": [
																{
																	"text": "A single-speed pump of less than one horsepower shall be allowed\nto be installed for the sole purpose of operating auxiliary load(s),\nprovided that the same pump is installed in addition to the properly\nsized pump and the single-speed pump shall not be used for filtration."
																}
															]
														}
													]
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "J. ",
							"content": [
								{
									"text": "Filters."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "All pool filters installed after September 1, 2016, shall be\nsized using NSF/ANSI 50 standards based on the maximum flow rate through\nthe filter:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "Cartridge 1.0 gallons per minute per square foot of cartridge;"
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "Sand, 20 gallons per minute per square foot of sandbed;"
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "Diatomaceous earth, two gallons per minute per square foot of\nelement area."
																}
															]
														}
													]
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "K. ",
							"content": [
								{
									"text": "Pool heaters."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "All pool heaters installed after September 1, 2016, shall meet\nthe minimum energy efficiency requirements as established by the United\nStates Department of Energy."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Continuously burning pilot lights shall be prohibited for all\npool heaters installed after September 1, 2016."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Effective September 1, 2016, all heated outdoor pools shall\nhave a pool cover that covers the surface of the pool when not in\nuse."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "The Building Inspector shall waive the building permit fee for\nthe replacement or installation of a pool heater when the pool heater\nbeing installed is a solar heating system."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "L. ",
							"content": [
								{
									"text": "Adherence to Property Maintenance Code."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "All swimming pools must be constructed and maintained in accordance\nwith the appropriate and relevant sections of the New York State Property\nMaintenance Code."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "M. ",
							"content": [
								{
									"text": "Penalties for offenses."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "A violation of any of the provisions of this section shall be\npunishable by a fine of not less than $250 nor more than $1,000 or\nby imprisonment not to exceed six months, or both."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Each week, or any portion thereof, shall constitute a separate\nand distinct violation which shall be subject to the penalties set\nforth in the preceding subsection."
												}
											]
										}
									]
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 255-11-90",
			"title": "Violations.",
			"content": [
				{
					"text": "Failure to comply with the restrictions, regulations, rules and other provisions of this article shall constitute a violation of this chapter subject to the provisions of Article X hereof."
				}
			]
		}
	]
}