{
	"url": "http://ecode360.com/6439798",
	"paras": [
		{
			"paragraph": "§ 310-7",
			"title": "Residence A Districts.",
			"content": [
				{
					"text": "In any Residence A District, no building or\npremises shall be used or maintained for any except the following\npurposes, and no building shall hereafter be erected, enlarged or\naltered if, as so erected or as a result of such enlargement or alteration,\nsuch building or any part thereof is arranged, designed or intended\nto be used for any except the following purposes:"
				},
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "A detached building used as a dwelling for not more\nthan one family on one lot. Nothing herein shall prevent the taking\nof nontransient boarders or roomers, provided that there is no display\nor advertising on the premises in connection with such use and provided\nthat there are not more than three boarders or roomers in any one\ndwelling unit."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Home occupations: See Article XI."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Buildings, structures, parks, athletic fields, playgrounds, public parking places and other proprietary or governmental uses of the Town and Village of Scarsdale, subject to the provisions of § 310-70 of this chapter."
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "A church or other place of worship, including adjacent living quarters for persons engaged in carrying on the activities of such place of worship or of an adjacent school affiliated therewith, a parish house or a Sunday school building, all subject to the provisions of § 310-70 of this chapter."
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "A public or parochial grade, junior high or high school, all subject to the provisions of § 310-70 of this chapter."
								}
							]
						},
						{
							"number": "F. ",
							"content": [
								{
									"text": "Private schools, clubs, hospitals."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "A private school, including a parochial grade school,\nmiddle school or high school, or a college, academy or seminary, except\nsuch institution may not be used for a children's day camp."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "A club, lodge or community center building, except\none whose chief activity is a service customarily carried on as a\ngainful business."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "A hospital, sanatorium or nursing home, not including,\nhowever, an institution for the care or treatment of animals."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "In each of the above cases, the provisions of § 310-89A(1) of this chapter must be complied with, and such use shall be subject to approval by the Planning Board."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "G. ",
							"content": [
								{
									"text": "A legal, preexisting, nonconforming use, subject to the provisions of § 310-67 of this chapter."
								}
							]
						},
						{
							"number": "H. ",
							"content": [
								{
									"text": "One real estate sign not larger than three feet high\nby four feet long on one lot, advertising the sale or letting of only\nthe premises on which it is maintained and set back not less than\n15 feet from any street line and not less than 10 feet from each side\nlot line which is not a street line; except that where acreage, available\nfor or in the process of subdivision, is advertised for sale or letting,\none real estate sign not larger than three feet high by four feet\nlong will be permitted on each 500 feet, or major fraction thereof,\nof street frontage or, in lieu thereof, one sign not larger than three\nfeet high by eight feet long on a whole frontage of 750 feet or more\nin length, provided that said signs are set back not less than 30\nfeet from any street line. The top of any sign provided for in this\nsection shall not be more than eight feet above the ground or curb\nlevel, whichever is higher."
								}
							]
						},
						{
							"number": "I. ",
							"content": [
								{
									"text": "Uses or buildings customarily incidental or accessory to the uses herein specifically permitted and as permitted in Article XI; such uses shall not include any billboard or advertising sign. This provision shall not be deemed to permit any swimming pool nor to permit any driveway or walk giving access to premises used for public purposes or used for purposes not permitted in a Residence A District. No part of any accessory building shall be used for sleeping or living quarters except by members of the family occupying the principal building on the lot or full-time employees of such family and members of the immediate families of such employees. No part of any accessory building shall be used for the preparation of meals. No part of any lot shall be used for the parking or storage of a commercial vehicle, except when necessary to make deliveries or render services to the occupant of the lot and except as permitted by Subsection K of this section."
								}
							]
						},
						{
							"number": "J. ",
							"content": [
								{
									"text": "A noncommercial greenhouse as an accessory building,\nprovided that any greenhouse heating plant is at least 50 feet distant\nfrom all boundary lines of said lot and that no fertilizer is stored\nwithin 100 feet of any such boundary line unless kept in airtight\nstorage."
								}
							]
						},
						{
							"number": "K. ",
							"content": [
								{
									"text": "A private garage as an accessory building or as part\nof the principal building. If the principal building on the lot is\na dwelling or is any other building used principally for residence\npurposes, any private garage on such lot shall be for the sole use\nof those living in such building and of their guests, except that\nspace for not more than one motor vehicle may be leased, provided\nthat such vehicle is a noncommercial one, and not more than one motor\nvehicle so garaged on any one lot shall be a commercial vehicle and\nthen of not more capacity than 1 1/2 tons."
								}
							]
						},
						{
							"number": "L. ",
							"content": [
								{
									"text": "A private stable for not more than four horses as\nan accessory building, provided that such horses are for the sole\nuse of those living in a dwelling on the same lot and of their guests\nand provided that all parts of such stable are at least 100 feet distant\nfrom all boundary lines of said lot."
								}
							]
						},
						{
							"number": "M. ",
							"content": [
								{
									"text": "Playgrounds of a public, private or parochial grade school, middle school or high school on a lot or lots other than the lot on which the principal building is located, but only if the provisions of § 310-89A(4) of this chapter are complied with and such use is determined by the Planning Board to be consistent with the public health, safety, morals and general welfare of the community."
								}
							]
						},
						{
							"number": "N. ",
							"content": [
								{
									"text": "A power transformer station on public property leased\nfor such purpose from the Village."
								}
							]
						},
						{
							"number": "O. ",
							"content": [
								{
									"text": "A swimming pool as an accessory structure to a principal\nbuilding that is used for residence purposes, for the exclusive use\nof the occupant of said principal building and his guests, provided\nthat such use is determined by the Board of Appeals to be consistent\nwith the public health, safety, morals and general welfare of the\ncommunity."
								}
							]
						},
						{
							"number": "P. ",
							"content": [
								{
									"text": "Offices for physicians or dentists, irrespective of the residence of the personnel of such offices, provided that there is no display or advertising on the premises in connection with such use except for one nonilluminated professional nameplate not over three square feet in area and not over three feet in any dimension and provided that such use is permitted by the Planning Board pursuant to § 310-89A(6) of this chapter."
								}
							]
						},
						{
							"number": "Q. ",
							"content": [
								{
									"text": "A tennis court, platform tennis court, lawn tennis\ncourt or other racket sport facility as a use customarily incidental\nor accessory to the residential use of a principal building, such\nincidental use being for the exclusive use of the occupants of said\nprincipal building and their guests, provided that such use is determined\nby the Board of Appeals to be consistent with the public health, safety,\nmorals and general welfare of the community and provided, further,\nthat a special permit for such use has been duly issued by the Board\nof Appeals."
								}
							]
						},
						{
							"number": "R. ",
							"content": [
								{
									"text": "A receive-only satellite dish antenna as a use customarily\nincidental or accessory to the residential use of the principal building,\nsuch incidental use being for the exclusive use of the occupants of\nthe principal building and their guests, provided that if the antenna\nhas a diameter of more than one meter:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Such use is determined by the Board of Appeals to\nbe consistent with the public health, safety, morals and general welfare\nof the community."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "A special use permit for such use has been duly issued\nby the Board of Appeals."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "S. ",
							"content": [
								{
									"text": "Permits residents to install and maintain permanent standby generators in a safe manner and in compliance with all applicable rules, regulations, codes and laws. The installation of permanent standby generators shall be incidental to the residential use and shall be for the exclusive use of the occupants of such principal or accessory building and their guests. This Subsection S does not regulate or authorize the use of portable generators. Permanent standby generators are subject to all of the following: [Amended 1-22-2013 by L.L. No. 1-2013]"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "All\nproperty owners seeking to install a permanent standby generator must\nfile an application with the Building Department prior to installation.\nPermanent standby generators shall not exceed 70 decibels on the A\nscale as measured 23 feet from the unit, in maintenance operation\nas stated in the manufacturer’s specifications, which shall\nbe submitted with the building permit application "
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Permanent\nstandby generators must be placed in the principal or accessory building\nor in an underground facility constructed purposely to house a generator\nor in the rear or side yard of any property, except that permanent\nstandby generators placed in the side yard in the A3, A4 and A5 zoning\ndistricts shall not exceed 66 decibels on the A scale as measured\n23 feet from the unit, in maintenance operation as stated in the manufacturer’s\nspecifications, which shall be submitted with the building permit\napplication. "
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Permanent\nstandby generators shall be set back from the rear lot line at least:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "In a Residence AA-1 District: 15 feet."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "In a Residence A-1 District: 10 feet."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "In a Residence A-2, A-2a or A-3 District: five feet."
																}
															]
														},
														{
															"number": "(d) ",
															"content": [
																{
																	"text": "In a Residence A-4 or A-5 District: three feet."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "Permanent\nstandby generators shall be set back from the side lot line at least:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "In a Residence AA-1 District: 20 feet."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "In a Residence A-1, A-2 or A-2a District: 10 feet."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "In a Residence A-3 District: five feet. "
																}
															]
														},
														{
															"number": "(d) ",
															"content": [
																{
																	"text": "In a Residence A-4 or A-5 District: three feet."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "The\npermanent standby generator shall be used only during electrical power\noutages and as required by the manufacturer for maintenance purposes.\nMaintenance operation shall only take place Monday through Friday\nbetween the hours of 8:00 a.m. and 9:00 p.m., and on Saturday, Sunday\nand holidays from 10:00 a.m. to 5:00 p.m., not to exceed once a week."
												}
											]
										},
										{
											"number": "(6) ",
											"content": [
												{
													"text": "All\npermanent standby generators must have an electrically operated automatic\ntransfer switch that can be mechanically held pursuant to Article\n700.5 of the National Electric Code."
												}
											]
										},
										{
											"number": "(7) ",
											"content": [
												{
													"text": "Applicants\nfor a permanent standby generator shall obtain all permits as required\nunder federal, state and local laws, including the New York State\nUniform Fire Prevention and Building Code and the Scarsdale Village\nCode, as amended from time to time. "
												}
											]
										},
										{
											"number": "(8) ",
											"content": [
												{
													"text": "All\npermanent standby generators shall be installed and maintained in\ncompliance with all federal, state and local laws, including the New\nYork State Uniform Fire Prevention and Building Code (including all\nreferenced codes and standards), as amended from time to time. "
												}
											]
										},
										{
											"number": "(9) ",
											"content": [
												{
													"text": "The Village Board of Trustees may, by resolution, impose a fee for the filing of the application as required under Subsection S(1)."
												}
											]
										}
									]
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 310-8",
			"title": "(Reserved)\n[1]",
			"content": [
				{
					"footnote": "[1]\nEditor's Note: Former § 310-8, Residence\nB Districts, as amended, was repealed 4-8-1997 by L.L. No. 3-1997.\n"
				}
			]
		},
		{
			"paragraph": "§ 310-9",
			"title": "Residence C Districts.",
			"content": [
				{
					"text": "In any Residence C District, no building or\npremises shall be used or maintained for any except the following\npurposes, and no building shall hereafter be erected, enlarged or\naltered if, as so erected or as a result of such enlargement or alteration,\nsuch building or any part thereof is arranged, designed or intended\nto be used for any except the following purposes:"
				},
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Any use permitted in a Residence A District.[Amended 3-23-1999 by L.L. No. 3-1999]"
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "(Reserved)[1]"
								},
								{
									"footnote": "[1]\nEditor's Note: Former Subsection B, regarding home occupations, was repealed 3-26-1996 by L.L. No. 2-1996. See now Art. XI, of this chapter.\n"
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "A hotel or lodging house, subject to the provisions of § 310-70 of this chapter and provided that there is no display or advertising except for one nonilluminated announcement sign not over 10 square feet in area in the case of a hotel and two square feet in area in the case of a lodging house.[Amended 3-14-1989 by L.L. No. 6-1989]"
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "In the case of an apartment house or hotel, the office\nof a physician, surgeon or dentist in the lowest story thereof used\nor designed to be used for residence or office purposes, even though\nsuch physician, surgeon or dentist does not reside on the premises,\nprovided that there is no display or advertising on the premises in\nconnection with such use except for one nonilluminated professional\nnameplate not over one square foot in area, with letters not exceeding\n1 1/2 inches in height.[Amended 3-14-1989 by L.L. No. 6-1989]"
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "Uses or buildings customarily incidental or accessory\nto the uses herein specifically permitted in said district and located\non the same lot. Except as specifically permitted herein, such uses\nshall not include any uses customarily carried on as a business nor\nany billboard or advertising sign. This provision shall not be deemed\nto permit any driveway or walk giving access to premises used for\nbusiness purposes or used for purposes not permitted in a Residence\nC District. No part of any accessory building shall be used for sleeping\nor living quarters except by members of the family occupying the principal\nbuilding on the lot or full-time employees of such family and members\nof the immediate families of such employees. No part of any accessory\nbuilding shall be used for the preparation of meals.[Amended 3-14-1989 by L.L. No. 6-1989]"
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 310-10",
			"title": "Buffer Parking Districts.",
			"content": [
				{
					"text": "Outdoor off-street parking lots are permitted for use in connection with existing or proposed business buildings on adjacent property zoned for business, provided that such use is permitted by the Planning Board pursuant to § 310-89A(7) of this chapter and provided, further, that the Planning Board shall approve a site plan showing the layout of such parking lot, which site plan shows no display or advertising on the parking lot and provides for such landscaping and screening as the Planning Board shall require for maintenance of good visual appearance of the neighborhood and the parking lot. In considering any such parking lot, the Planning Board shall hold a public hearing and shall take into consideration existing parking and traffic conditions in the surrounding area, the public health, safety and general welfare, the comfort and convenience of the public and the general purposes and intent of this chapter. In approving any such parking lot, the Planning Board may impose such conditions and safeguards with respect to traffic access, circulation, disposition of usable open space, screening, landscaping, surfacing, illumination, maintenance and the general layout as it may deem appropriate."
				}
			]
		},
		{
			"paragraph": "§ 310-11",
			"title": "Business A Districts.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "In any Business A District, no building or premises\nshall be used or maintained for any except the following purposes,\nand no building shall hereafter be erected, enlarged or altered if,\nas so erected or as a result of such enlargement or alteration, such\nbuilding or any part thereof is arranged, designed or intended to\nbe used for any except the following purposes:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Stores and shops for the sale at retail of merchandise,\nand fabrication and repairs normally incidental thereto, except gasoline,\noil, junk and live animals or pets, provided that merchandise offered\nfor sale shall be stored and displayed in fully enclosed structures."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Banks."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Railroad stations."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "Restaurants or other places serving food or beverages,\nexcept lunch wagons and fast-food restaurants and other eating places\nof a similar type.[Amended 2-20-1979 by L.L. No. 4-1979]"
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "Personal service establishments of the following types\nonly:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "Barbershop."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "Beauty parlor."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "Tailoring shop."
																}
															]
														},
														{
															"number": "(d) ",
															"content": [
																{
																	"text": "Laundry establishments which conform to the\nfollowing restrictions:"
																},
																{
																	"content": [
																		{
																			"number": "[1] ",
																			"content": [
																				{
																					"text": "Not more than two automatic washers and two\nautomatic extractor units shall be installed, and each unit shall\nhave a dry-load capacity of not more than 25 pounds."
																				}
																			]
																		},
																		{
																			"number": "[2] ",
																			"content": [
																				{
																					"text": "Finishing equipment shall be restricted to one\nbody form presser, one sleever, one collar and cuff presser, one bosom\npresser and one folding table."
																				}
																			]
																		}
																	]
																}
															]
														},
														{
															"number": "(e) ",
															"content": [
																{
																	"text": "Rental library."
																}
															]
														},
														{
															"number": "(f) ",
															"content": [
																{
																	"text": "Employment agency."
																}
															]
														},
														{
															"number": "(g) ",
															"content": [
																{
																	"text": "Undertaking parlor."
																}
															]
														},
														{
															"number": "(h) ",
															"content": [
																{
																	"text": "Photographer's studio."
																}
															]
														},
														{
															"number": "(i) ",
															"content": [
																{
																	"text": "Travel agency."
																}
															]
														},
														{
															"number": "(j) ",
															"content": [
																{
																	"text": "Shoe repair shop."
																}
															]
														},
														{
															"number": "(k) ",
															"content": [
																{
																	"text": "Interior decorating shop."
																}
															]
														},
														{
															"number": "(l) ",
															"content": [
																{
																	"text": "Home furnishing and equipment repair shop."
																}
															]
														},
														{
															"number": "(m) ",
															"content": [
																{
																	"text": "Music and dance instruction."
																}
															]
														},
														{
															"number": "(n) ",
															"content": [
																{
																	"text": "Watch repair shop."
																}
															]
														},
														{
															"number": "(o) ",
															"content": [
																{
																	"text": "Dry-cleaning establishments which are Type IV\ndry-cleaning plants as described in the most current version of Chapter\n4 of the National Fire Protection Association (NFPA) 32.[Amended 3-24-1998 by L.L. No. 2-1998]"
																}
															]
														},
														{
															"number": "(p) ",
															"content": [
																{
																	"text": "Commercial art display studio.[Added 9-13-1960]"
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(6) ",
											"content": [
												{
													"text": "Offices for the rendering of professional services\nor for the transaction of business not involving manufacture or the\nstorage of merchandise on the premises."
												}
											]
										},
										{
											"number": "(7) ",
											"content": [
												{
													"text": "A public or private garage or parking lot which:[Amended 3-24-1998 by L.L. No. 2-1998]"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "Is an integral part of, or is arranged or designed\nto be used exclusively in connection with, a building used principally\nfor other business or living purposes."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "Has not over 10,000 gallons of fuel storage\ncapacity, all in underground tanks located outside of any building\nand not nearer than 20 feet to any street line."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "Has no oil pump or greasing mechanism or other\nservice appliance outside of any building and no canopy larger than\nnecessary to cover the fuel dispensers."
																}
															]
														},
														{
															"number": "(d) ",
															"content": [
																{
																	"text": "Has no more than 50 square feet devoted to the\nsale of prepackaged merchandise unrelated to servicing motor vehicles."
																}
															]
														},
														{
															"number": "(e) ",
															"content": [
																{
																	"text": "Confines repair work to the inside of a garage."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(8) ",
											"content": [
												{
													"text": "A telephone exchange, provided that such use is permitted by the Planning Board pursuant to § 310-89A(10).[Added 5-23-1995 by L.L. No. 7-1995;\namended 3-23-1999 by L.L. No. 3-1999]"
												}
											]
										},
										{
											"number": "(9) ",
											"content": [
												{
													"text": "Receive-only satellite dish antennas of a diameter\nof two meters or less.[Added 4-9-1996 by L.L. No. 4-1996;\namended 2-8-2000 by L.L. No. 1-2000]"
												}
											]
										},
										{
											"number": "(10) ",
											"content": [
												{
													"text": "Residences above the ground floor.[Added 4-8-1997 by L.L. No. 3-1997]"
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Notwithstanding the provisions of § 310-11A, no building or premises in any Business A District shall be used for the care or treatment of animals; for incineration, reduction or dumping of offal, garbage or refuse, except the incineration on private premises of garbage or refuse produced on such premises by a device approved by the Building Inspector; for the killing of animals or poultry; or for any trade, business or purpose which is or may reasonably be expected to be noxious or offensive by reason of causing or emitting odor, smoke, vapor, gas, dust, garbage, refuse matter, noise or vibration or that is dangerous or harmful to the comfort, peace, health or safety of the community, that tends to disturb or annoy residents of the Village or that involves any explosion menace or any serious fire hazard.[Amended 9-27-1994 by L.L. No. 9-1994]"
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 310-12",
			"title": "Village Center Area Districts.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Purposes and objectives. To guide future growth of\nthe Scarsdale Village Center in a manner consistent with historical\npatterns of building development and land use; and to establish a\ncarefully designed and orderly development plan that will protect\nthe public health, safety, morals and general welfare; and to promote\nand implement the comprehensive planning policies and objectives of\nthe Village Board of Trustees, the Village Center Area District, as\nshown on a map entitled \"Scarsdale Village Center Zoning Map,\" dated\nMarch 28, 1988, revised November 1, 1988, including the more specific\nzones for each block or portion thereof as shown thereon, is hereby\nofficially established and adopted as the Comprehensive Plan and Zoning\nMap for the Scarsdale Village Center Area."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "The underlying long-range planning policies and objectives\nfor the Village Center Area are as follows:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "To maintain the present character of the Village\nCenter."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "To improve traffic and parking conditions."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "To help meet the needs of the community for\nalternate housing opportunities, including senior citizen housing,\nand for commercial uses related to community needs."
																}
															]
														},
														{
															"number": "(d) ",
															"content": [
																{
																	"text": "To maintain a downtown that is functional and\nattractive to residents and serves as a community focal point."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "It is the intent of this section that development\nfor the foregoing purposes does not have to produce a net tax revenue\nbenefit, and neither should it impose a financial tax burden upon\nthe Village."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Village Center Area Zones. The following separate\nzones applying to specific areas are hereby established within the\nframework of the Village Center Area District for the purposes specified\nand in accordance with the regulations as set forth for each:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Village Center Retail - 2.0 (VCR - 2.0)."
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "It is the purpose of this zone to preserve the\nexisting architectural character while reflecting the present nature\nand intensity of land use in the heart of the Scarsdale Village Center\nArea and at the same time strengthening its pedestrian shopping pattern.\nIt is recognized that the historical development pattern in this zone\nis such that the only available parking for existing developed properties\nis, and will continue to be, that provided in Village parking facilities.\nHowever, any proposals for additional building development or for\nconversion from residential to commercial use should be permitted\nonly if all off-street parking requirements which would result from\nsuch an approval can be satisfied on private property by the applicant.\nThe permitted uses within this zone are intended to balance its land\nuse function with its parking limitations."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "In the Village Center Retail - 2.0 Zone, no\nbuilding or premises shall be used or maintained and no building shall\nhereafter be erected, enlarged or altered if, as so erected or as\na result of such enlargement or alteration, such building or any part\nthereof is arranged, designed or intended to be used for any except\nthe following principal purposes:"
																},
																{
																	"content": [
																		{
																			"number": "[1] ",
																			"content": [
																				{
																					"text": "Ground floor: retail stores, personal service\nestablishments, restaurants and other places serving food or beverages\n(except fast-food restaurants), and public and semipublic uses, excluding\nany type of drive-up commercial facility."
																				}
																			]
																		},
																		{
																			"number": "[2] ",
																			"content": [
																				{
																					"text": "Upper floors: ground-floor uses, plus professional,\nmedical and dental, business and administrative offices and residences."
																				}
																			]
																		},
																		{
																			"number": "[3] ",
																			"content": [
																				{
																					"text": "Receive-only satellite dish antennas of a diameter\nof one meter or less when mounted on the roof.[Added 4-9-1996 by L.L. No. 4-1996]"
																				}
																			]
																		}
																	]
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Village Center Retail - 1.0 (VCR - 1.0)."
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "It is the purpose of this zone to encourage\nthe continuation of the present pattern of land use and development\nin a portion of the Scarsdale Village Center Area which forms an extension\nof a business district primarily located in the adjacent area of the\nTown of Eastchester. It is recognized that the historical pattern\nof building development in this area precludes any substantial provision\nof on-site parking and that the primary responsibility for meeting\nthose needs will continue to rest with the Village. Any proposal for\nadditional building development or for conversion from residential\nto commercial use should be permitted only if all off-street parking\nrequirements which would result from such an approval can be satisfied\non private property by the applicant."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "In the Village Center Retail - 1.0 Zone, no\nbuilding or premises shall be used or maintained and no building shall\nhereafter be erected, enlarged or altered if, as so erected or as\na result of such enlargement or alteration, such building or any part\nthereof is arranged, designed or intended to be used for any except\nthe following principal purposes:"
																},
																{
																	"content": [
																		{
																			"number": "[1] ",
																			"content": [
																				{
																					"text": "Ground floor: retail stores, personal service\nestablishments, restaurants and other places serving food or beverages\n(except fast-food restaurants), and public and semipublic uses, excluding\nany type of drive-up commercial facility."
																				}
																			]
																		},
																		{
																			"number": "[2] ",
																			"content": [
																				{
																					"text": "Upper floors: ground-floor uses, plus professional,\nmedical and dental, business and administrative offices and residences."
																				}
																			]
																		},
																		{
																			"number": "[3] ",
																			"content": [
																				{
																					"text": "Receive-only satellite dish antennas of a diameter\nof one meter or less when mounted on the roof.[Added 4-9-1996 by L.L. No. 4-1996]"
																				}
																			]
																		}
																	]
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Village Center Retail - 0.8 (VCR - 0.8)."
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "It is the purpose of this zone to recognize\nthe existing character of land use and building development in retail\nblocks located adjacent to the heart of the Village Center Area and\nto encourage their continued function as an important element of the\ncentral pedestrian shopping pattern. Although, for the most part,\nthe properties within these blocks will need to continue to rely upon\nthe Village to satisfy their off-street parking requirements, any\nexisting off-street parking must be continued, or at least replaced\nin kind, in connection with the approval of any future changes, unless\nsuch parking exceeds the requirements of this chapter, in which case\nit shall not be reduced below such requirements."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "In the Village Center Retail - 0.8 Zone, no\nbuilding or premises shall be used or maintained and no building shall\nhereafter be erected, enlarged or altered if, as so erected or as\na result of such enlargement or alteration, such building or any part\nthereof is arranged, designed or intended to be used for any except\nthe following principal purposes:"
																},
																{
																	"content": [
																		{
																			"number": "[1] ",
																			"content": [
																				{
																					"text": "Retail stores, personal service establishments,\nrestaurants and other places serving food or beverages (except fast-food\nrestaurants), and public and semipublic uses, excluding any type of\ndrive-up commercial facility."
																				}
																			]
																		},
																		{
																			"number": "[2] ",
																			"content": [
																				{
																					"text": "Receive-only satellite dish antennas of a diameter\nof one meter or less when mounted on the roof.[Added 4-9-1996 by L.L. No. 4-1996]"
																				}
																			]
																		}
																	]
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "Village Center Office - 2.0 (VCO - 2.0)."
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "It is the purpose of this zone to recognize\nthe existence of an office building development within the Village\nCenter Area and to establish standards and requirements in relation\nto it which will allow its continued use, but not its intensification,\nin a reasonable manner consistent with the achievement of the Village's\nlong-range planning policies. Any existing off-street parking must\nbe continued in connection with the approval of any future changes,\nunless such parking exceeds the requirements of this chapter, in which\ncase it shall not be reduced below such requirements."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "In the Village Center Office - 2.0 Zone, no\nbuilding or premises shall be used or maintained and no building shall\nhereafter be erected, enlarged or altered if, as so erected or as\na result of such enlargement or alteration, such building or any part\nthereof is arranged, designed or intended to be used for any except\nthe following principal purposes:"
																},
																{
																	"content": [
																		{
																			"number": "[1] ",
																			"content": [
																				{
																					"text": "Professional, medical and dental, administrative and business offices, public and semipublic uses, real estate offices, travel agencies, residences and telephone exchanges if permitted by the Planning Board pursuant to § 310-89A(10).[Amended 5-23-1995 by L.L. No. 7-1995; 3-23-1999 by L.L. No.\n3-1999]"
																				}
																			]
																		},
																		{
																			"number": "[2] ",
																			"content": [
																				{
																					"text": "Receive-only satellite dish antennas of a diameter\nof one meter or less when mounted on the roof.[Added 4-9-1996 by L.L. No. 4-1996]"
																				}
																			]
																		}
																	]
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "Village Center Office - 0.8 (VCO - 0.8)."
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "It is the purpose of this zone to allow the\ncontinued use and development of a portion of the Village Center Area\nfor retail and service business purposes, including some which may\nnot be functionally appropriate within the heart of the Village Center\nArea but which are nevertheless recognized as being necessary to serve\nthe commercial needs of Village residents. Standards governing the\nheight of buildings and the type and intensity of land use in this\ndistrict are designed to recognize the existing lot size and development\npattern in this area, as well as the nature of neighboring land uses,\nand to allow for all future parking needs to be met on site."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "In the Village Center Office - 0.8 Zone, no\nbuilding or premises shall be used or maintained and no building shall\nhereafter be erected, enlarged or altered if, as so erected or as\na result of such enlargement or alteration, such building or any part\nthereof is arranged, designed or intended to be used for any except\nthe following principal purposes:"
																},
																{
																	"content": [
																		{
																			"number": "[1] ",
																			"content": [
																				{
																					"text": "Retail stores, personal service establishments, restaurants and other places serving food or beverages (except fast-food restaurants), banks, professional offices, medical and dental offices, service stations, public and semipublic uses, real estate offices, travel agencies and telephone exchanges if permitted by the Planning Board pursuant to § 310-89A(10). For service stations, there shall be no canopy larger than necessary to cover the fuel dispensers and no more than 50 square feet devoted to the sale of prepackaged merchandise unrelated to servicing motor vehicles.[Amended 5-23-1995 by L.L. No. 7-1995; 3-24-1998 by L.L. No.\n2-1998; 3-23-1999 by L.L. No. 3-1999]"
																				}
																			]
																		},
																		{
																			"number": "[2] ",
																			"content": [
																				{
																					"text": "Receive-only satellite dish antennas of a diameter\nof one meter or less when mounted on the roof.[Added 4-9-1996 by L.L. No. 4-1996]"
																				}
																			]
																		}
																	]
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "Accessory drive-up facilities to permitted principal\nuses shall be allowed in this zone, but only when it is determined\nby the Planning Board that such facilities can be safely and properly\nlocated on a site, as demonstrated on a plan reviewed and approved\nby said Board."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(6) ",
											"content": [
												{
													"text": "Planned Unit Development - 0.8 to 1.4 (PUD - 0.8 to\n1.4)."
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "It is the purpose of this zone to allow for\nthe redevelopment of a significant site in a transitional location\non the periphery of the Village Center in a manner intended to achieve\nthe accomplishment of the Village's long-range planning policies and\nobjectives, including, in particular, the provision of alternate housing\nopportunities and short-term public parking, and to do so in character\nwith the surrounding land use and development pattern."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "In the Planned Unit Development - 0.8 to 1.4\nZone, no building or premises shall be used or maintained and no building\nshall hereafter be erected, enlarged or altered if, as so erected\nor as a result of such enlargement or alteration, such building or\nany part thereof is arranged, designed or intended to be used for\nany except the following principal purposes:"
																},
																{
																	"content": [
																		{
																			"number": "[1] ",
																			"content": [
																				{
																					"text": "Ground floor: subject to special permit by the Village Board in accordance with the standards and requirements of § 310-28.1B hereof, retail stores, restaurants (except fast-food restaurants), banks, personal service establishments and public and semipublic uses, excluding any type of drive-up commercial facility. Notwithstanding any other provision or requirements of this chapter, the parking requirement for such uses shall be the same as that for retail stores.[Amended 5-23-2006 by L.L. No. 2-2006]"
																				}
																			]
																		},
																		{
																			"number": "[2] ",
																			"content": [
																				{
																					"text": "All floors: residences, provided that no less than 10% of the residential floor area ratio is devoted to senior citizen housing with priority for Scarsdale residents and, in addition, public parking subject to special permit by the Village Board in accordance with the standards and requirements of Subsection C(3)(a)[6] and § 310-28.1B hereof, and telephone exchanges if permitted by the Planning Board pursuant to § 310-89A(10).[Amended 5-23-1995 by L.L. No. 7-1995; 3-23-1999 by L.L. No.\n3-1999]"
																				}
																			]
																		},
																		{
																			"number": "[3] ",
																			"content": [
																				{
																					"text": "Receive-only satellite dish antennas of a diameter\nof one meter or less when mounted on the roof.[Added 4-9-1996 by L.L. No. 4-1996]"
																				}
																			]
																		}
																	]
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(7) ",
											"content": [
												{
													"text": "Planned Unit Development - 1.0 (PUD - 1.0).[Amended 4-9-1996 by L.L. No. 4-1996; 3-24-1998 by L.L. No.\n2-1998; 12-11-2001 by L.L. No. 15-2001]"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "It is the purpose of this zone to allow for\nthe redevelopment of major sites in the Village Center Area in a manner\nwhich will best help to achieve the accomplishment of the Village's\nlong-range planning policies and objectives, including, in particular,\nthe provision of alternate housing opportunities, including senior\ncitizen housing, and to do so in character with the surrounding land\nuse and development pattern. It is the further purpose of this zone\nto encourage improved pedestrian and traffic linkages across the railroad."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "In the Planned Unit Development - 1.0 Zone,\nno building or premises shall be used or maintained and no building\nshall hereafter be erected, enlarged or altered if, as so erected\nor as a result of such enlargement or alteration, such building or\nany part thereof is arranged, designed and intended to be used for\nany except the following principal purposes:"
																},
																{
																	"content": [
																		{
																			"number": "[1] ",
																			"content": [
																				{
																					"text": "Retail stores, personal service establishments,\nrestaurants and other places serving food or beverages (except fast-food\nrestaurants), banks, medical, dental, and professional offices, public\nand semipublic uses, excluding real estate offices and any type of\ndrive-up commercial facility. If located in a building containing\nresidences, these uses shall be limited to ground floor levels.[Amended 4-22-2003 by L.L. No. 9-2003]"
																				}
																			]
																		},
																		{
																			"number": "[2] ",
																			"content": [
																				{
																					"text": "Residences, provided that no less than 10% of\nthe residential floor area ratio is devoted to senior citizen housing\nwith priority for Scarsdale residents. A \"senior citizen household\"\nis a household in which at least one resident member has attained\nthe age of 65 years or more on the date that such household initially\noccupies the dwelling unit."
																				}
																			]
																		},
																		{
																			"number": "[3] ",
																			"content": [
																				{
																					"text": "Parking subject to special permit by the Village Board in accordance with the standards and requirements of Subsection C(3)(a)[6] and § 310-28.1B hereof."
																				}
																			]
																		},
																		{
																			"number": "[4] ",
																			"content": [
																				{
																					"text": "Receive-only satellite dish antennas of a diameter\nof one meter or less when mounted on the roof."
																				}
																			]
																		}
																	]
																}
															]
														}
													]
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Design review. The Village Center Area, because of\nits distinctive architectural style, its historical pattern and character\nof building development, its open spaces and vistas and its role as\nan important community focal point, is hereby designated as a special\ndesign district. The purpose of this designation shall be to assure\nthat the construction, reconstruction, modification, alteration, enlargement\nor other change in the design of buildings and uses on properties\nwithin the Village Center Area is in harmony with the established\ndesign character of such area, is consistent with the preservation\nof the economic value of other properties situated therein and is\notherwise consistent with the purposes of this Comprehensive Zoning\nPlan."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Procedure. The Planning Board, as a part of the site plan review process, shall refer any application within the Village Center Area District involving the construction, reconstruction, modification, alteration, enlargement or other change of any structure or site layout to the Village Board of Architectural Review for its report and recommendations. The Board of Architectural Review, upon its receipt of such referral, shall, within 45 days of the date thereof, review the application, inspect the subject property and its relationship to surrounding areas, consider the proposed development in relation to the design guidelines as set forth in Subsection C(3) below in this section, meet with the applicant and prepare and submit an advisory report and recommendations, as appropriate, to the Planning Board."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Professional advice. In addition to the recommendations\nof the Board of Architectural Review as described above, the Planning\nBoard shall obtain such other professional advice and assistance in\nconnection with the review of the design aspects of applications for\nsite plan approval in the Village Center Area as it determines to\nbe necessary or appropriate, the reasonable cost of which, if any,\nshall be reimbursed to the Village by the applicant."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Design guidelines. It is the objective of the guidelines hereinbelow set forth to establish a general design framework which will maintain and respect the present architectural character and scale of buildings in the Village Center Area, ensure that the area continues to develop as an attractive, convenient and secure center which functions as a focal point for local residents, provides a blending of landscaped open space and structures which relate harmoniously to their immediate neighborhood and to the Village as a whole and provides visual interest and variety in the treatment of facades, roofs, sidewalks and landscaped areas. In reviewing applications for site plan approval for properties in the Village Center Area, the Planning Board may attach more or less weight to any guideline in relation to other guidelines, as may be appropriate under the particular circumstances presented by a specific application, including without limitation the character of existing or proposed uses adjacent to the property which is the subject of the application. The guidelines are set forth in Subsection C(3)(a), (b), (c) and (d) below:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "Architectural character. New building development\nin the Village Center Area shall be designed in such a way as to respect\nthe scale and architectural character of existing structures and enhance\nthe pedestrian experience at grade level. In applying such standard,\nthe Planning Board shall consider the manner and extent to which an\napplication for site plan approval contains architectural features\nconsistent with such standards and with the purposes and objectives\nset forth above in this section, including, without limitation, the\nfollowing architectural features:"
																},
																{
																	"content": [
																		{
																			"number": "[1] ",
																			"content": [
																				{
																					"text": "The design of buildings as an integrated part\nof an overall site design related to other surrounding development\nand topographical conditions."
																				}
																			]
																		},
																		{
																			"number": "[2] ",
																			"content": [
																				{
																					"text": "Treatment of the sides and the rear of proposed\nbuildings in a manner substantially consistent in appearance, amenity\nand quality of materials to the treatment given to their street frontage,\nas may be appropriate in view of the degree of visibility of the sides\nand rear of such buildings from nearby properties or from vantage\npoints of higher elevation."
																				}
																			]
																		},
																		{
																			"number": "[3] ",
																			"content": [
																				{
																					"text": "Unity and compatibility of a building with adjacent\nstructures, as affected by the following exterior design elements:"
																				},
																				{
																					"content": [
																						{
																							"number": "[a] ",
																							"content": [
																								{
																									"text": "The nature and use of surfacing materials."
																								}
																							]
																						},
																						{
																							"number": "[b] ",
																							"content": [
																								{
																									"text": "The height of cornices, lintel and sill levels,\narticulated floor levels and other horizontal building features."
																								}
																							]
																						},
																						{
																							"number": "[c] ",
																							"content": [
																								{
																									"text": "The spacing and proportion of columns, piers\nand other elements of the basic structural grid."
																								}
																							]
																						},
																						{
																							"number": "[d] ",
																							"content": [
																								{
																									"text": "The spacing and proportion of window and door\nopenings, bays or other aspects of building fenestration."
																								}
																							]
																						},
																						{
																							"number": "[e] ",
																							"content": [
																								{
																									"text": "Colors, textures and the general nature of exterior\nmaterials and treatment, including building ornament and trim."
																								}
																							]
																						},
																						{
																							"number": "[f] ",
																							"content": [
																								{
																									"text": "Treatment, screening or enclosure of all utility,\nmechanical or elevator installations."
																								}
																							]
																						}
																					]
																				}
																			]
																		},
																		{
																			"number": "[4] ",
																			"content": [
																				{
																					"text": "The design of building facades in retail districts\nto present a varied appearance at street level and to give individual\nidentity to each store or building unit; limit blank wall exposures;\nencourage window shopping; provide opportunities for modulated pedestrian\nfrontage with planters, recesses for planting or other such architectural\ntreatments; and provide for weather protection, such as awnings and\ncanopies or other projections or the use of covered arcades set behind\nthe building facade."
																				}
																			]
																		},
																		{
																			"number": "[5] ",
																			"content": [
																				{
																					"text": "The design of building facades to reflect the\nscale of existing building development through modulation of vertical\nand horizontal elements, by features such as:"
																				},
																				{
																					"content": [
																						{
																							"number": "[a] ",
																							"content": [
																								{
																									"text": "Variation in roof heights in order to create\nan interesting skyline in scale with existing surrounding buildings."
																								}
																							]
																						},
																						{
																							"number": "[b] ",
																							"content": [
																								{
																									"text": "Changes in the predominant wall plane and in\nfacade elements such as window openings, balconies or other facade\ntreatments."
																								}
																							]
																						},
																						{
																							"number": "[c] ",
																							"content": [
																								{
																									"text": "Use of horizontal projections or recesses such\nas bay windows, cornices, balustrades, etc."
																								}
																							]
																						},
																						{
																							"number": "[d] ",
																							"content": [
																								{
																									"text": "Use of pitched roofs and other roof elements\nsuch as cross gables, dormer windows and turrets to provide visual\ncontinuity with neighboring uses, reduce the scale of continuous roofs\nand break the line where the building meets the sky."
																								}
																							]
																						}
																					]
																				}
																			]
																		},
																		{
																			"number": "[6] ",
																			"content": [
																				{
																					"text": "The location of off-street parking completely\nbelow ground or otherwise screened from public view, preferably by\nanother building or use. No parking shall be permitted on any visible\nbuilding roof."
																				}
																			]
																		},
																		{
																			"number": "[7] ",
																			"content": [
																				{
																					"text": "Avoidance of more than one level of parking\nlocated at or above the ground-floor level along the building frontage\nin any VCR or VCO District."
																				}
																			]
																		},
																		{
																			"number": "[8] ",
																			"content": [
																				{
																					"text": "The use of exterior walls of parking levels\nas visual screens and architectural integration of such walls with\nthe remainder of the building."
																				}
																			]
																		},
																		{
																			"number": "[9] ",
																			"content": [
																				{
																					"text": "Avoidance of building materials which would\nresult in jarring and incongruous contrasts, both within new development\nand when seen against existing buildings."
																				}
																			]
																		}
																	]
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "Landscaping. Encouragement of a coordinated\nlandscape design incorporating the landscape treatment for all open\nspaces, walks, access roads and parking areas in the Village Center\nArea into a continuous and integrated design is a primary objective\nof these guidelines. All open spaces, pedestrian walks, parking areas\nand interior drives shall be designed as an integral part of an overall\nsite design, properly related to existing and proposed buildings.\nWherever possible, attractively landscaped open spaces shall be provided\nwhich will offer maximum usability to users of buildings as well as\nfor the general public. Such open spaces shall be located so as to\ntake into consideration existing views and the creation and preservation\nof centrally located landscaped areas and plazas. In applying such\nstandards, the Planning Board shall consider the manner and extent\nto which an application for site plan approval contains landscaping\nfeatures consistent with such standards and with the purposes set\nforth above in this subsection, including without limitation, the\nfollowing landscaping features:"
																},
																{
																	"content": [
																		{
																			"number": "[1] ",
																			"content": [
																				{
																					"text": "Landscape treatment of plazas, pedestrian areas,\ncourtyards and similar areas, including a mix of shade trees and other\nplant material such as ground cover and shrubs, with proper regard\nfor factors such as micro-climate, function of area, existing plantings\nand required maintenance, in determining the species, scale and planting\npattern."
																				}
																			]
																		},
																		{
																			"number": "[2] ",
																			"content": [
																				{
																					"text": "Softening of the visual impact of parking areas\nby screening of all parking areas from street view, by interrupting\ncontinuous rows of parking spaces with planting and by creating planted\ncanopies over parking areas."
																				}
																			]
																		},
																		{
																			"number": "[3] ",
																			"content": [
																				{
																					"text": "Internal landscaping covering at least 10% of\nthe area of any open parking lot of 15 or more spaces and dispersal\nof landscaped areas throughout the parking lot and the use of salt-tolerant\nshade trees as primary landscaping materials, with salt-tolerant shrubs\nand ground cover used to complement the tree landscaping."
																				}
																			]
																		},
																		{
																			"number": "[4] ",
																			"content": [
																				{
																					"text": "The use in grade level parking areas, walks\nand other surface areas of paving materials which offer some variety\nof pigments and textures which are in harmony with nearby buildings\nand paved areas and are safe for pedestrian traffic, including the\nhandicapped."
																				}
																			]
																		},
																		{
																			"number": "[5] ",
																			"content": [
																				{
																					"text": "The use of covered and trellised outdoor spaces,\nsuch as loggias, arcades and colonnades in order to provide shade,\ntransition between indoors and outdoors and to add visual interest,\nshadow and depth to building elevations."
																				}
																			]
																		},
																		{
																			"number": "[6] ",
																			"content": [
																				{
																					"text": "Planting of sidewalks with regularly spaced,\nsalt-tolerant shade trees, selected with regard to the following factors:"
																				},
																				{
																					"content": [
																						{
																							"number": "[a] ",
																							"content": [
																								{
																									"text": "The quality and character of existing plantings\non the street."
																								}
																							]
																						},
																						{
																							"number": "[b] ",
																							"content": [
																								{
																									"text": "The scale of the roadway and width of sidewalk\nareas as well as the type of traffic use."
																								}
																							]
																						},
																						{
																							"number": "[c] ",
																							"content": [
																								{
																									"text": "The need to provide for or maintain visibility\nof storefront displays and shop signs."
																								}
																							]
																						},
																						{
																							"number": "[d] ",
																							"content": [
																								{
																									"text": "The height and spacing of existing lighting."
																								}
																							]
																						}
																					]
																				}
																			]
																		}
																	]
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "Streetscape."
																},
																{
																	"content": [
																		{
																			"number": "[1] ",
																			"content": [
																				{
																					"text": "All streets, sidewalks, curbs and other sidewalk\nelements within public rights-of-way shall be designed to the standards\nof the Village of Scarsdale and shall be consistent with all design\ncriteria."
																				}
																			]
																		},
																		{
																			"number": "[2] ",
																			"content": [
																				{
																					"text": "Signage shall be designed so that it is visible\nand informative at the pedestrian scale and consistent within the\nVillage Center Area District. The following design controls shall\napply:"
																				},
																				{
																					"content": [
																						{
																							"number": "[a] ",
																							"content": [
																								{
																									"text": "Street-oriented signs shall be limited to facia\nbands above the store window, on the vertical facia of any sunscreen\nor awning or on the window of the store."
																								}
																							]
																						},
																						{
																							"number": "[b] ",
																							"content": [
																								{
																									"text": "Signage design shall be carefully integrated\nwith other design elements."
																								}
																							]
																						},
																						{
																							"number": "[c] ",
																							"content": [
																								{
																									"text": "All signs shall be stationary and contain no\nvisible or moving parts, nor shall they contain neon or flashing illumination\nor exposed gas-type illumination. If illuminated, the source of illumination\nmust be shielded from streets, walkways and adjoining properties."
																								}
																							]
																						},
																						{
																							"number": "[d] ",
																							"content": [
																								{
																									"text": "Prohibited items shall include product advertisement\noutside of any retail space, signs mounted above the eave line of\nany structure, internally illuminated plastic signage and signs placed\nin or attached to windows."
																								}
																							]
																						}
																					]
																				}
																			]
																		}
																	]
																}
															]
														},
														{
															"number": "(d) ",
															"content": [
																{
																	"text": "Lighting. Lighting standards of clean, compatible,\nconservative contemporary design and adequate illumination shall be\nprovided as necessary. Exterior lighting may be used to light doors,\nsteps, gardens and drives but shall be located and shielded to prevent\nglare on other properties and shall be limited in hours of operation,\nas appropriate. Floodlighting, other than as required for safety and\nsecurity purposes, shall not be permitted. Proposed streetlighting\nshall be coordinated with street tree planting plans."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "Decision. Based upon the Comprehensive Plan and design\nguidelines as set forth herein for the Village Center Area District,\nand taking into consideration, among other things, the report and\nrecommendations of the Board of Architectural Review and the Planning\nBoard's professional design advisor(s), the Planning Board shall,\nas a condition of site plan approval, require such modification to\nthe proposed architectural and/or site design, including building\nheight, bulk, setback, facade treatment, materials, color, roof shape,\nsite lighting, signage, landscaping, paving and other such features,\nas the Planning Board may determine necessary or appropriate to achieve\nthe purposes as set forth herein."
												}
											]
										}
									]
								}
							]
						}
					]
				},
				{
					"footnote": "[1]\nEditor's Note: This local law also provided\nfor the repeal of former § 310-12, Business B Districts,\nas amended.\n"
				}
			]
		},
		{
			"paragraph": "§ 310-13",
			"title": "Business C Districts.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "In any Business C District, no building or premises\nshall be used or maintained for any purpose except the following purposes,\nand no building shall hereafter be erected, enlarged or altered if,\nas so erected or as a result of such enlargement or alteration, such\nbuilding or any part thereof is arranged, designed or intended to\nbe used for any except the following purposes:[Amended 1-22-1985 by L.L. No. 4-1985; 4-9-1996 by L.L. No. 4-1996; 4-8-1997 by L.L. No. 3-1997]"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Any use permitted in a Residence A District, except\nresidences and satellite dish antennas of a diameter of more than\none meter. Receive-only satellite dish antennas of a diameter of one\nmeter or less are permitted when mounted on the roof."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Any use permitted in a Business A District, except\nresidences."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Notwithstanding the provisions of § 310-13A of this chapter, no building or premises in any Business C District shall be used for the care or treatment of animals; for incineration, reduction or dumping of offal, garbage or refuse, except the incineration on private premises of garbage or refuse produced on such premises by a device approved by the Building Inspector; for the killing of animals or poultry; or for any trade, business or purpose which is or may reasonably be expected to be noxious or offensive by reason of causing or emitting odor, smoke, vapor, gas, dust, garbage, refuse matter, noise or vibration or that is dangerous or harmful to the comfort, peace, health or safety of the community, that tends to disturb or annoy residents of the Village or that involves any explosion menace or any serious fire hazard.[Amended 3-22-1960; 9-27-1994 by L.L. No. 9-1994]"
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 310-14",
			"title": "Area of lots.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Subject to the exceptions specified in § 310-67 of this chapter, no building shall hereafter be erected in any residence district, except on a lot which, for each principal building, together with its accessory buildings, has an area of at least:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "In a Residence AA-1 District: two acres (87,120 square feet)."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "In a Residence A-1 District: one acre (43,560 square feet)."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "In a Residence A-2 District: 20,000 square feet."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "In a Residence A-2a District: 15,000 square feet."
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "In a Residence A-3 District: 10,000 square feet."
												}
											]
										},
										{
											"number": "(6) ",
											"content": [
												{
													"text": "In a Residence A-4 District: 7,500 square feet."
												}
											]
										},
										{
											"number": "(7) ",
											"content": [
												{
													"text": "In a Residence A-5 or C District: 5,000 square feet."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "No part of a lot shall be included in calculating the required lot\narea except such part as falls within either an inscribed quadrilateral,\nno part of which has less than 1/3 of the minimum required lot width,\nor an inscribed circle."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "In calculating lot area, no more than 10% of the lot area shall consist\nof any body of water or portion thereof, floodplain property or property\ndesigned as a retention basin for drainage control. \"Floodplain property\"\nshall mean property within the special flood hazard areas subject\nto inundation by the one-percent (one-hundred-year) annual chance\nflood as shown on the Flood Insurance Rate Maps or other such document\nfor the Village of Scarsdale, as issued by the Federal Emergency Management\nAgency, or such other agency of legal jurisdiction."
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "Each lot must have a measurable front yard, rear yard and two side\nyards that conforms to the requirements of this chapter. The creation\nby subdivision of a triangular shaped lot(s) in which two yards merge\nto eliminate a fourth yard is prohibited."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 310-15",
			"title": "Width and length of frontage.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Subject to the exceptions specified in § 310-67 of this chapter, no building shall hereafter be erected in any residence district except on a lot which, for each principal building, together with its accessory buildings, has both a lot width and a length of street line frontage of at least:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "In\na Residence AA-1 District: 250 feet."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "In\na Residence A-1 District: 150 feet."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "In\na Residence A-2 or A-2a District: 100 feet."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "In\na Residence A-3 District: 70 feet."
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "In\na Residence A-4 District: 60 feet."
												}
											]
										},
										{
											"number": "(6) ",
											"content": [
												{
													"text": "In\na Residence A-5 or C District: 50 feet."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "These requirements\nare in addition to and complement § 7-736 of New York State’s\nVillage Law."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 310-16",
			"title": "(Reserved)\n[1]",
			"content": [
				{
					"footnote": "[1]\nEditor's Note: Former § 310-16, Buildings on existing nonconforming lots, as amended, and former § 310-17, Construction on existing nonconforming, unimproved lots, as amended, were repealed 1-23-2001 by L.L. No. 4-2001. For current provisions, see § 310-67.\n"
				}
			]
		},
		{
			"paragraph": "§ 310-17",
			"title": "(Reserved)",
			"content": []
		},
		{
			"paragraph": "§ 310-18",
			"title": "Special setback provisions for nonconforming lots.",
			"content": [
				{
					"text": "The special setback provisions referred to in § 310-67 of this chapter are as follows:"
				},
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "The distance that any such building is required by\nthe other provisions of this chapter to set back from a front line\nshall be reduced one foot for each foot that the depth of the lot\nis less than 150 feet in a Residence AA-1 District, 120 feet in a\nResidence A-1 District and 110 feet in a Residence A-2 or A-2a District,\nbut in no event in any district to less than 30 feet."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "The distance that any principal building is required\nby the other provisions of this chapter to set back from a side lot\nline shall be reduced three inches for each foot that the width of\nthe lot, if it is located in a Residence AA-1 or A-1 District, is\nless than 100 feet and two inches (or four inches if such side lot\nline is a street line) for each foot that the width of the lot, if\nit is located in a Residence A-2 or A-2a District, is less than 90\nfeet, but in no event in any district to less than 10 feet or to less\nthan 15 feet if such lot line is a street line."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "If such lot is located in a Residence AA-1, A-1, A-2\nor A-2a District and is less than 130 feet in depth, the minimum distance\nwhich an accessory building shall be required to set back from any\nstreet line, in order that its setback from a side line other than\na street line need be only 10 feet, shall be 60 feet.[1]"
								},
								{
									"footnote": "[1]\nEditor's Note: Original Section 12-10-7 of\nthe 1957 Scarsdale Village Code, as amended 5-26-1959; 3-22-1983 by\nL.L. No. 2-1983; 7-19-1983 by L.L. No. 5-1983, which immediately followed\nthis section, was repealed 1-12-1988 by L.L. No. 1-1988, which local\nlaw was readopted 5-10-1988 as L.L. No. 5-1988.\n"
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 310-19",
			"title": "Lots at a distance from a street.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "The creation of lots at a distance from a street is\nprohibited. Such interior lots, commonly called “flag lots,”\nprovide access to a street over a narrow strip of land running from\nthe main portion of the lot."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Legal nonconforming interior lots approved under former\nSection 12-10-7 and interior lots permitted by variance are subject\nto site plan review by the Planning Board. Any proposed erection,\nenlargement or alteration of a building or buildings on such lot,\nincluding swimming pools and tennis courts, must be approved by the\nPlanning Board."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Applications for approval of a site plan under this section shall comply with all requirements imposed by the rules and regulations of the Planning Board. The Planning Board shall consider whether there is adequate provision for ingress, egress and maneuverability of waste collection trucks, fire-fighting equipment and other traffic, taking into account any existing or potential uses of the same access for other lots; whether there is adequate provision and access for a separate sewer connection and a separate water service line to each principal building complying with the requirements of Chapter 132, Building Construction and Fire Prevention, and Chapter A320, Water, of this Code; whether in other respects the lot is of such a character and location that it can be used safely for the purpose and in the manner proposed without danger to health or peril from fire, flood or other menace; whether there is any reasonable basis for assuming that a street will later be opened adjacent to any part of such lot, and if so, whether the proposed use might interfere with any such street or result in any noncompliance with the provisions of this chapter in the event that any such street will be in harmony with the general purpose and intent of this chapter and consistent with public health, safety and the general welfare. In approving a site plan, the Planning Board shall hold a public hearing and may impose such conditions and safeguards as it may deem appropriate to assure compliance with the purposes of this section."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 310-20",
			"title": "Findings and purpose.",
			"content": [
				{
					"text": "Excessive coverage of lots with structures and\nimpervious surfaces can limit adequate light and air; cause overcrowding\nof land; lead to drainage and flooding problems as a result of reduction\nin the land's water absorption ability; affect the character of the\ncommunity; and have an adverse impact on neighborhood aesthetics.\nThe following lot area coverage restrictions are designed to limit\nthe above adverse effects in Residence A Districts and to promote\nthe health, safety and the general welfare of the community."
				}
			]
		},
		{
			"paragraph": "§ 310-21",
			"title": "Definitions.",
			"content": [
				{
					"text": "The words and phrases indicated below have the\nfollowing meanings when used in this article:"
				}
			]
		},
		{
			"paragraph": "§ 310-22",
			"title": "Permitted coverages.",
			"content": [
				{
					"text": "The permitted coverage ratios for residential\nuses in any Residence A Districts shall be as follows:"
				},
				{
					"content": [
						{
							"number": "5. ",
							"content": [
								{
									"text": "Lot Size (square feet): Up to 5,000  Lot Coverage: 30%"
								}
							]
						},
						{
							"number": "6. ",
							"content": [
								{
									"text": "Lot Size (square feet): 6,000  Lot Coverage (square feet): 1740"
								}
							]
						},
						{
							"number": "7. ",
							"content": [
								{
									"text": "Lot Size (square feet): 7,000  Lot Coverage (square feet): 1980"
								}
							]
						},
						{
							"number": "8. ",
							"content": [
								{
									"text": "Lot Size (square feet): 8,000  Lot Coverage (square feet): 2180"
								}
							]
						},
						{
							"number": "9. ",
							"content": [
								{
									"text": "Lot Size (square feet): 9,000  Lot Coverage (square feet): 2340"
								}
							]
						},
						{
							"number": "10. ",
							"content": [
								{
									"text": "Lot Size (square feet): 10,000  Lot Coverage (square feet): 2500"
								}
							]
						},
						{
							"number": "11. ",
							"content": [
								{
									"text": "Lot Size (square feet): 11,000  Lot Coverage (square feet): 2620"
								}
							]
						},
						{
							"number": "12. ",
							"content": [
								{
									"text": "Lot Size (square feet): 12,000  Lot Coverage (square feet): 2740"
								}
							]
						},
						{
							"number": "13. ",
							"content": [
								{
									"text": "Lot Size (square feet): 13,000  Lot Coverage (square feet): 2860"
								}
							]
						},
						{
							"number": "14. ",
							"content": [
								{
									"text": "Lot Size (square feet): 14,000  Lot Coverage (square feet): 2980"
								}
							]
						},
						{
							"number": "15. ",
							"content": [
								{
									"text": "Lot Size (square feet): 15,000  Lot Coverage (square feet): 3100"
								}
							]
						},
						{
							"number": "16. ",
							"content": [
								{
									"text": "Lot Size (square feet): 16,000  Lot Coverage (square feet): 3220"
								}
							]
						},
						{
							"number": "17. ",
							"content": [
								{
									"text": "Lot Size (square feet): 17,000 Lot Coverage (square feet): 3340"
								}
							]
						},
						{
							"number": "18. ",
							"content": [
								{
									"text": "Lot Size (square feet): 18,000 Lot Coverage (square feet): 3460"
								}
							]
						},
						{
							"number": "19. ",
							"content": [
								{
									"text": "Lot Size (square feet): 19,000 Lot Coverage (square feet): 3580"
								}
							]
						},
						{
							"number": "20. ",
							"content": [
								{
									"text": "Lot Size (square feet): 20,000 Lot Coverage (square feet): 3700"
								}
							]
						},
						{
							"number": "21. ",
							"content": [
								{
									"text": "Lot Size (square feet): 21,000 Lot Coverage (square feet): 3740"
								}
							]
						},
						{
							"number": "22. ",
							"content": [
								{
									"text": "Lot Size (square feet): 22,000 Lot Coverage (square feet): 3780"
								}
							]
						},
						{
							"number": "23. ",
							"content": [
								{
									"text": "Lot Size (square feet): 23,000 Lot Coverage (square feet): 3820"
								}
							]
						},
						{
							"number": "24. ",
							"content": [
								{
									"text": "Lot Size (square feet): 24,000 Lot Coverage (square feet): 3860"
								}
							]
						},
						{
							"number": "25. ",
							"content": [
								{
									"text": "Lot Size (square feet): 25,000 Lot Coverage (square feet): 3900"
								}
							]
						},
						{
							"number": "26. ",
							"content": [
								{
									"text": "Lot Size (square feet): 26,000 Lot Coverage (square feet): 3940"
								}
							]
						},
						{
							"number": "27. ",
							"content": [
								{
									"text": "Lot Size (square feet): 27,000 Lot Coverage (square feet): 3980"
								}
							]
						},
						{
							"number": "28. ",
							"content": [
								{
									"text": "Lot Size (square feet): 28,000 Lot Coverage (square feet): 4020"
								}
							]
						},
						{
							"number": "29. ",
							"content": [
								{
									"text": "Lot Size (square feet): 29,000 Lot Coverage (square feet): 4060"
								}
							]
						},
						{
							"number": "30. ",
							"content": [
								{
									"text": "Lot Size (square feet): 30,000 Lot Coverage (square feet): 4100"
								}
							]
						},
						{
							"number": "31. ",
							"content": [
								{
									"text": "Lot Size (square feet): 31,000 Lot Coverage (square feet): 4140"
								}
							]
						},
						{
							"number": "32. ",
							"content": [
								{
									"text": "Lot Size (square feet): 32,000 Lot Coverage (square feet): 4180"
								}
							]
						},
						{
							"number": "33. ",
							"content": [
								{
									"text": "Lot Size (square feet): 33,000 Lot Coverage (square feet): 4220"
								}
							]
						},
						{
							"number": "34. ",
							"content": [
								{
									"text": "Lot Size (square feet): 34,000 Lot Coverage (square feet): 4260"
								}
							]
						},
						{
							"number": "35. ",
							"content": [
								{
									"text": "Lot Size (square feet): 35,000 Lot Coverage (square feet): 4300"
								}
							]
						},
						{
							"number": "36. ",
							"content": [
								{
									"text": "Lot Size (square feet): 36,000 Lot Coverage (square feet): 4340"
								}
							]
						},
						{
							"number": "37. ",
							"content": [
								{
									"text": "Lot Size (square feet): 37,000 Lot Coverage (square feet): 4380"
								}
							]
						},
						{
							"number": "38. ",
							"content": [
								{
									"text": "Lot Size (square feet): 38,000 Lot Coverage (square feet): 4420"
								}
							]
						},
						{
							"number": "39. ",
							"content": [
								{
									"text": "Lot Size (square feet): 39,000 Lot Coverage (square feet): 4460"
								}
							]
						},
						{
							"number": "40. ",
							"content": [
								{
									"text": "Lot Size (square feet): 40,000 Lot Coverage (square feet): 4500"
								}
							]
						},
						{
							"number": "41. ",
							"content": [
								{
									"text": "Lot Size (square feet): 41,000 Lot Coverage (square feet): 4540"
								}
							]
						},
						{
							"number": "42. ",
							"content": [
								{
									"text": "Lot Size (square feet): 42,000 Lot Coverage (square feet): 4580"
								}
							]
						},
						{
							"number": "43. ",
							"content": [
								{
									"text": "Lot Size (square feet): 43,000 Lot Coverage (square feet): 4620"
								}
							]
						},
						{
							"number": "44. ",
							"content": [
								{
									"text": "Lot Size (square feet): 44,000 Lot Coverage (square feet): 4659.60"
								}
							]
						},
						{
							"number": "45. ",
							"content": [
								{
									"text": "Lot Size (square feet): 45,000 Lot Coverage (square feet): 4699.60"
								}
							]
						},
						{
							"number": "46. ",
							"content": [
								{
									"text": "Lot Size (square feet): 46,000 Lot Coverage (square feet): 4739.60"
								}
							]
						},
						{
							"number": "47. ",
							"content": [
								{
									"text": "Lot Size (square feet): 47,000 Lot Coverage (square feet): 4779.60"
								}
							]
						},
						{
							"number": "48. ",
							"content": [
								{
									"text": "Lot Size (square feet): 48,000 Lot Coverage (square feet): 4819.60"
								}
							]
						},
						{
							"number": "49. ",
							"content": [
								{
									"text": "Lot Size (square feet): 49,000 Lot Coverage (square feet): 4859.60"
								}
							]
						},
						{
							"number": "50. ",
							"content": [
								{
									"text": "Lot Size (square feet): 50,000 Lot Coverage (square feet): 4899.60"
								}
							]
						},
						{
							"number": "51. ",
							"content": [
								{
									"text": "Lot Size (square feet): 51,000 Lot Coverage (square feet): 4939.60"
								}
							]
						},
						{
							"number": "52. ",
							"content": [
								{
									"text": "Lot Size (square feet): 52,000 Lot Coverage (square feet): 4979.60"
								}
							]
						},
						{
							"number": "53. ",
							"content": [
								{
									"text": "Lot Size (square feet): 53,000 Lot Coverage (square feet): 5019.60"
								}
							]
						},
						{
							"number": "54. ",
							"content": [
								{
									"text": "Lot Size (square feet): 54,000 Lot Coverage (square feet): 5059.60"
								}
							]
						},
						{
							"number": "55. ",
							"content": [
								{
									"text": "Lot Size (square feet): 55,000 Lot Coverage (square feet): 5099.60"
								}
							]
						},
						{
							"number": "56. ",
							"content": [
								{
									"text": "Lot Size (square feet): 56,000 Lot Coverage (square feet): 5139.60"
								}
							]
						},
						{
							"number": "57. ",
							"content": [
								{
									"text": "Lot Size (square feet): 57,000 Lot Coverage (square feet): 5179.60"
								}
							]
						},
						{
							"number": "58. ",
							"content": [
								{
									"text": "Lot Size (square feet): 58,000 Lot Coverage (square feet): 5219.60"
								}
							]
						},
						{
							"number": "59. ",
							"content": [
								{
									"text": "Lot Size (square feet): 59,000 Lot Coverage (square feet): 5259.60"
								}
							]
						},
						{
							"number": "60. ",
							"content": [
								{
									"text": "Lot Size (square feet): 60,000 Lot Coverage (square feet): 5299.60"
								}
							]
						},
						{
							"number": "61. ",
							"content": [
								{
									"text": "Lot Size (square feet): 61,000 Lot Coverage (square feet): 5339.60"
								}
							]
						},
						{
							"number": "62. ",
							"content": [
								{
									"text": "Lot Size (square feet): 62,000 Lot Coverage (square feet): 5379.60"
								}
							]
						},
						{
							"number": "63. ",
							"content": [
								{
									"text": "Lot Size (square feet): 63,000 Lot Coverage (square feet): 5419.60"
								}
							]
						},
						{
							"number": "64. ",
							"content": [
								{
									"text": "Lot Size (square feet): 64,000 Lot Coverage (square feet): 5459.60"
								}
							]
						},
						{
							"number": "65. ",
							"content": [
								{
									"text": "Lot Size (square feet): 65,000 Lot Coverage (square feet): 5499.60"
								}
							]
						},
						{
							"number": "66. ",
							"content": [
								{
									"text": "Lot Size (square feet): 66,000 Lot Coverage (square feet): 5539.60"
								}
							]
						},
						{
							"number": "67. ",
							"content": [
								{
									"text": "Lot Size (square feet): 67,000 Lot Coverage (square feet): 5579.60"
								}
							]
						},
						{
							"number": "68. ",
							"content": [
								{
									"text": "Lot Size (square feet): 68,000 Lot Coverage (square feet): 5619.60"
								}
							]
						},
						{
							"number": "69. ",
							"content": [
								{
									"text": "Lot Size (square feet): 69,000 Lot Coverage (square feet): 5659.60"
								}
							]
						},
						{
							"number": "70. ",
							"content": [
								{
									"text": "Lot Size (square feet): 70,000 Lot Coverage (square feet): 5699.60"
								}
							]
						},
						{
							"number": "71. ",
							"content": [
								{
									"text": "Lot Size (square feet): 71,000 Lot Coverage (square feet): 5739.60"
								}
							]
						},
						{
							"number": "72. ",
							"content": [
								{
									"text": "Lot Size (square feet): 72,000 Lot Coverage (square feet): 5779.60"
								}
							]
						},
						{
							"number": "73. ",
							"content": [
								{
									"text": "Lot Size (square feet): 73,000 Lot Coverage (square feet): 5819.60"
								}
							]
						},
						{
							"number": "74. ",
							"content": [
								{
									"text": "Lot Size (square feet): 74,000 Lot Coverage (square feet): 5859.60"
								}
							]
						},
						{
							"number": "75. ",
							"content": [
								{
									"text": "Lot Size (square feet): 75,000 Lot Coverage (square feet): 5899.60"
								}
							]
						},
						{
							"number": "76. ",
							"content": [
								{
									"text": "Lot Size (square feet): 76,000 Lot Coverage (square feet): 5939.60"
								}
							]
						},
						{
							"number": "77. ",
							"content": [
								{
									"text": "Lot Size (square feet): 77,000 Lot Coverage (square feet): 5979.60"
								}
							]
						},
						{
							"number": "78. ",
							"content": [
								{
									"text": "Lot Size (square feet): 78,000 Lot Coverage (square feet): 6019.60"
								}
							]
						},
						{
							"number": "79. ",
							"content": [
								{
									"text": "Lot Size (square feet): 79,000 Lot Coverage (square feet): 6059.60"
								}
							]
						},
						{
							"number": "80. ",
							"content": [
								{
									"text": "Lot Size (square feet): 80,000 Lot Coverage (square feet): 6099.60"
								}
							]
						},
						{
							"number": "81. ",
							"content": [
								{
									"text": "Lot Size (square feet): 81,000 Lot Coverage (square feet): 6139.60"
								}
							]
						},
						{
							"number": "82. ",
							"content": [
								{
									"text": "Lot Size (square feet): 82,000 Lot Coverage (square feet): 6179.60"
								}
							]
						},
						{
							"number": "83. ",
							"content": [
								{
									"text": "Lot Size (square feet): 83,000 Lot Coverage (square feet): 6219.60"
								}
							]
						},
						{
							"number": "84. ",
							"content": [
								{
									"text": "Lot Size (square feet): 84,000 Lot Coverage (square feet): 6259.60"
								}
							]
						},
						{
							"number": "85. ",
							"content": [
								{
									"text": "Lot Size (square feet): 85,000 Lot Coverage (square feet): 6299.60"
								}
							]
						},
						{
							"number": "86. ",
							"content": [
								{
									"text": "Lot Size (square feet): 86,000 Lot Coverage (square feet): 6339.60"
								}
							]
						},
						{
							"number": "87. ",
							"content": [
								{
									"text": "Lot Size (square feet): 87,000 Lot Coverage (square feet): 6379.60"
								}
							]
						},
						{
							"number": "88. ",
							"content": [
								{
									"text": "Lot Size (square feet): 87,120 Lot Coverage (square feet): 6384.40"
								}
							]
						},
						{
							"number": "89. ",
							"content": [
								{
									"text": "Lot Size (square feet): 43,560 Lot Coverage (square feet): 4642"
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 310-23",
			"title": "Permitted coverages in freshwater wetlands and freshwater wetlands controlled areas.",
			"content": [
				{
					"text": "On any lot in a freshwater wetlands controlled area, as defined in Chapter 171, Freshwater Wetlands, of the Code of the Village of Scarsdale, the maximum coverage ratio permitted for residential purposes in any Residence A Districts shall be as follows:"
				},
				{
					"footnote": "[1]\nEditor's Note: Section 14 of this local law\nprovided as follows: \n\"This local law shall not prevent the issuance\nof a permit for any new building, building addition or alteration\nin compliance with the laws in effect prior to the effective date\nhereof for which a complete application was submitted prior to such\ndate.\" (This local law became effective April 4, 1991.)\n"
				}
			]
		},
		{
			"paragraph": "§ 310-24",
			"title": "Conformity required.",
			"content": [
				{
					"text": "No building shall hereafter be erected, enlarged\nor altered to a height in excess of the maximum height provided therefor\nin this article or so that such building, together with any other\nbuildings, occupies more of the area of a lot than permitted by this\narticle."
				}
			]
		},
		{
			"paragraph": "§ 310-25",
			"title": "Residence A Districts.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "No residential building shall exceed 35 feet in height. No nonresidential building shall exceed the height as may be prescribed by the Planning Board pursuant to Chapter 251, Site Plan Review, of this Code, and in no case shall a story of any building be less than nine feet in height.[Amended 3-23-1999 by L.L. No. 3-1999]"
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "The area of any lot occupied by nonresidential buildings, structures and impervious surfaces shall not exceed such percentage of the gross area of such lot as may be prescribed by the Planning Board pursuant to Chapter 251, Site Plan Review, of this Code."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "No individual nonresidential building on any lot shall exceed such length or width as may be prescribed by the Planning Board pursuant to Chapter 251, Site Plan Review, of this Code."
								}
							]
						}
					]
				},
				{
					"footnote": "[1]\nEditor's Note: Section 14 of this local law\nprovided as follows: \n\"This local law shall not prevent the issuance\nof a permit for any new building, building addition or alteration\nin compliance with the laws in effect prior to the effective date\nhereof for which a complete application was submitted prior to such\ndate.\" (This local law became effective April 4, 1991.)\n"
				}
			]
		},
		{
			"paragraph": "§ 310-26",
			"title": "(Reserved)\n[1]",
			"content": [
				{
					"footnote": "[1]\nEditor's Note: Former § 310-26,\nResidence B Districts, was repealed 4-8-1997 by L.L. No. 3-1997.\n"
				}
			]
		},
		{
			"paragraph": "§ 310-27",
			"title": "Residence C Districts.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "No building shall exceed four stories, and no building\nshall exceed 46 feet in height In no case shall a story of any such\nbuilding be less than nine feet in height."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "The building or buildings on any lot shall occupy\nonly such portion of the lot as will leave at least one square foot\nof open space on such lot for each two square feet of gross floor\narea, which shall be deemed to be the sum of the areas of horizontal\nsections through each story of all parts of such building or buildings\nused for residence purposes, measured from the outside faces of all\nexterior walls."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 310-28",
			"title": "Business A Districts.",
			"content": [
				{
					"text": "In any Business A District, no building shall\nexceed four stories, and no building shall exceed 46 feet in height."
				}
			]
		},
		{
			"paragraph": "§ 310-28.1",
			"title": "Village Center Area Districts.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "The maximum permitted building height and floor area\nratio (FAR) in any zone within a Village Center Area District shall\nbe as follows:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Village Center Retail - 2.0:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "Maximum building height: four stories and 46\nfeet."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "Maximum FAR: 2.0."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Village Center Retail - 1.0:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "Maximum building height: two stories and 35\nfeet."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "Maximum FAR: 1.0."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Village Center Retail - 0.8:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "Maximum building height: one story and 20 feet."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "Maximum FAR: 0.8."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "Village Center Office - 2.0:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "Maximum building height: four stories and 46\nfeet."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "Maximum FAR: 2.0."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "Village Center Office - 0.8:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "Maximum building height: two stories and 35\nfeet."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "Maximum FAR: 0.8."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(6) ",
											"content": [
												{
													"text": "Planned Unit Development - 0.8 to 1.4:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "Maximum building height: four stories and 46 feet. Alternatively, the permitted building height may be increased to allow the highest point on a roof to extend to a height not to exceed a maximum elevation of 218 feet above sea level, provided that an incentive density increase is permitted pursuant to the standards and requirements of Subsection B hereof."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "Maximum FAR: 0.8, limited entirely to residential use. The permitted FAR may be increased up to a maximum of 1.4, no more than 14% of which may be used for nonresidential purposes, subject to the approval of an incentive density increase in accordance with the standards and requirements of Subsection B hereof.[Amended 5-23-2006 by L.L. No. 3-2006]"
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(7) ",
											"content": [
												{
													"text": "Planned Unit Development - 1.0:[Amended 12-11-2001 by L.L. No. 15-2001]"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "Maximum building height: The highest point of\nany roof may extend to a height not to exceed a maximum elevation\nof 184 feet above sea level, except that such elevation may be permitted\nto be increased to a maximum of 204 feet above sea level for buildings\nlocated to the south of the Popham Road Bridge."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "Maximum FAR: 1.0 for the entire development\nsite. For development located south of the Popham Road Bridge, no\nmore than 10% of the FAR shall be permitted to be used for nonresidential\npurposes."
																}
															]
														}
													]
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Incentive density. It is recognized that the PUD zones established within the Village Center Area are unique because they, encompass the largest sites and the major portion of the areas future development potential. As such, they represent the most significant opportunity for the achievement of the basic public benefit purposes and objectives of the Village Center Area. Therefore, to provide an incentive which will further encourage the most appropriate use and development of those sites in a manner designed to achieve the Village's adopted planning objectives, the Village Board of Trustees may allow, by special permit and following a public hearing held on notice duly given in the same manner as is required by law for zoning amendments, an increased FAR and/or building height or special uses, within the limits as set forth in Subsection A hereof and subject to the provision of specific public benefit features. It may also choose not to allow any such change or increase. Village Board action on such an application shall be taken only after review of the proposed plan by the Planning Board and the submission of a report and recommendation by said Board to the Trustees. Final site plan approval by the Planning Board shall not occur until after the special permit determination by the Village Board. The incentive features, and the guidelines for Village Board action, are as described below:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "The specific public benefit features for which\nincentive density increases may be granted in the PUD -- 1.0 to 2.0\nZone are as follows:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "The provision of street improvements and parking\nspaces for short-term use beyond that which is required to serve the\nspecific development proposed and designed to mitigate the problems\nof traffic and parking congestion in the Village Center Area."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "The provision of housing units specifically\ndesigned for, and limited in occupancy to, senior citizens, with priority\nfor Scarsdale residents."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "The provision of special design amenities available\nfor public use and enjoyment which would enhance the function and/or\nappearance of the Village Center Area, including but not limited to\npedestrian linkages, plazas, fountains, artworks, sitting and other\npassive recreation areas, special landscape design features and other\nsuch similar improvements; conversely, the removal of existing features\nwhich detract from the function and/or appearance of said area, including\nbut not limited to overhead utility lines, unattractive structures\nand other such features."
																}
															]
														},
														{
															"number": "(d) ",
															"content": [
																{
																	"text": "The provision of commercial uses designed specifically\nto serve convenience shopping needs, including but not limited to\nsuch establishments as food markets, bakeries, butcher shops, pharmacies,\ndry cleaners, card shops, variety goods stores, hardware stores, beauty\nsalons, barbershops, shoe repair shops and other businesses of a similar\nnature as determined by the Village Board."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Due to the significant shortage of short-term\nparking in the PUD -- 0.8 to 1.4 portion of the Village Center Area,\nany density incentive increase granted within that zone shall be only\nfor the provision of publicly available short-term parking spaces."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "In determining the specific amount of density\nincentive increase that may be granted, if any, the Village Board,\nin each case, shall take into consideration the following:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "The number, extent and combination of incentive\nfeatures to be provided."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "The need for such specific features in the Village\nat that time."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "The degree of compatibility of such incentive\nfeatures with the neighborhood in which they are located, taking into\nconsideration the potential effects of noise, traffic, fumes, vibrations\nor other such characteristics on surrounding streets and properties,\nthe visual impact of the resultant density increase and/or incentive\nfeature applied for and the impact of the proposed development upon\naccess to light, air and vistas known to be important to the community."
																}
															]
														},
														{
															"number": "(d) ",
															"content": [
																{
																	"text": "The consistency of such incentive features with\nthe Village's comprehensive planning and capital improvement program\nobjectives as set forth in this chapter and in related studies and\nplans prepared for the Village or as otherwise promulgated and declared\nby the Village Board of Trustees."
																}
															]
														},
														{
															"number": "(e) ",
															"content": [
																{
																	"text": "The quality of design of the proposed development as determined by the Planning Board in accordance with its review under § 310-12C hereof."
																}
															]
														},
														{
															"number": "(f) ",
															"content": [
																{
																	"text": "The amount of incentive density increase necessary\nto more than offset the cost of providing the incentive feature(s),\nthereby creating the incentive for providing such feature(s)."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "No incentive density increase will be granted\nfor the construction of any improvement which, in the Village Board's\nopinion, would otherwise be required by this chapter or other applicable\nregulation."
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "To assist the Village Board in determining the\nappropriate amount of density increase, if any, to grant as an incentive\nfor the applicant's provision of the proposed public benefit feature(s),\nthe applicant shall submit an estimate of the cost of providing the\nproposed feature(s) and the value of the density increase requested.\nThe Village Board may also engage its own independent experts to either\nseparately prepare such analyses or to review those prepared by the\napplicant. The reasonable cost of such expert assistance shall be\nreimbursed to the Village by the applicant."
												}
											]
										},
										{
											"number": "(6) ",
											"content": [
												{
													"text": "In determining the specific amount of density\nincrease to be granted, if any, the following additional factors,\nspecific to certain benefit features to be provided, will guide the\nVillage Board:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "Short-term parking. All off-street parking spaces\nproposed as an incentive feature shall be designed to serve short-term\nneeds, shall be available for public use and shall be permanently\nrestricted by covenant, deed restriction or other appropriate legal\ndevice, so as to assure their continued use for the purpose for which\nthey were originally designed, intended and approved. In addition,\nthe Village Board will take into consideration the following specific\nfactors related to the design of the applicant's proposal:"
																},
																{
																	"content": [
																		{
																			"number": "[1] ",
																			"content": [
																				{
																					"text": "The safety and convenience of vehicular access."
																				}
																			]
																		},
																		{
																			"number": "[2] ",
																			"content": [
																				{
																					"text": "The distance, ease and safety of pedestrian\naccess to businesses in neighboring VCR Zones."
																				}
																			]
																		},
																		{
																			"number": "[3] ",
																			"content": [
																				{
																					"text": "The type of parking spaces proposed, i.e., self-park\nor valet."
																				}
																			]
																		},
																		{
																			"number": "[4] ",
																			"content": [
																				{
																					"text": "The proposed hours of availability of the parking\nspaces for public use."
																				}
																			]
																		},
																		{
																			"number": "[5] ",
																			"content": [
																				{
																					"text": "The attractiveness of the proposed parking space/facility\ndesign, including lighting, landscaping, signage, drainage and other\nsuch similar features."
																				}
																			]
																		},
																		{
																			"number": "[6] ",
																			"content": [
																				{
																					"text": "Plans for the mitigation of any potential visual\nimpact of the incentive parking spaces and the facility in which they\nare to be located, preferably by construction of such facilities below\ngrade wherever practicable and functionally appropriate."
																				}
																			]
																		},
																		{
																			"number": "[7] ",
																			"content": [
																				{
																					"text": "The fee, if any, proposed to be charged for\nthe use of such parking spaces."
																				}
																			]
																		},
																		{
																			"number": "[8] ",
																			"content": [
																				{
																					"text": "The provisions for the future ownership, management,\nmaintenance and security of such parking spaces."
																				}
																			]
																		}
																	]
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "Senior citizen housing."
																},
																{
																	"content": [
																		{
																			"number": "[1] ",
																			"content": [
																				{
																					"text": "For the purposes of this section, a \"senior\ncitizen household\" shall be defined as a household in which at least\none resident member has attained the age of 65 years or more on the\ndate that such household initially occupies the dwelling unit."
																				}
																			]
																		},
																		{
																			"number": "[2] ",
																			"content": [
																				{
																					"text": "The following additional factors will also be\ntaken into consideration by the Village Board in connection with the\ngrant of any density incentive increase for the provision of senior\ncitizen housing:"
																				},
																				{
																					"content": [
																						{
																							"number": "[a] ",
																							"content": [
																								{
																									"text": "The variety of size and design\nof the proposed senior citizen units."
																								}
																							]
																						},
																						{
																							"number": "[b] ",
																							"content": [
																								{
																									"text": "The nature and extent of special\nfeatures provided for senior citizen use both within the individual\nunits and in the development as a whole."
																								}
																							]
																						},
																						{
																							"number": "[c] ",
																							"content": [
																								{
																									"text": "The location of the proposed senior\ncitizen units within the overall development and in relation to their\nease of access to neighboring convenience shopping and personal service\nestablishments."
																								}
																							]
																						},
																						{
																							"number": "[d] ",
																							"content": [
																								{
																									"text": "The effectiveness and fairness\nof the proposed priority arrangement for Scarsdale residents and the\nconsistency of the proposed pricing of the senior citizen units with\nthe special nature and restrictions applicable to such units and the\nneeds of the Scarsdale senior citizen market which they are intended\nto serve."
																								}
																							]
																						}
																					]
																				}
																			]
																		}
																	]
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "Design amenities. In determining the amount\nof density increase, if any, to be granted as an incentive for the\nprovision of special design amenities, the Village Board will take\ninto consideration, in addition to all other factors, the degree to\nwhich the design of such amenities invites and encourages their public\nuse and enjoyment."
																}
															]
														},
														{
															"number": "(d) ",
															"content": [
																{
																	"text": "Convenience commercial uses. In determining\nthe amount of density increase, if any, to be granted as an incentive\nfor the provision of commercial uses designed to serve convenience\nshopping needs, the Village Board will take into consideration the\ncategories of use to which the floor space is to be restricted, the\npermanency of those restrictions, the location of the proposed restricted\nfloor space and other such similar factors related to the achievement\nof the Village's policy objectives."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(7) ",
											"content": [
												{
													"text": "In addition to the foregoing guidelines, the\nVillage Board may take into account other considerations bearing upon\nthe purposes and objectives of this subsection in determining the\namount of any density increase."
												}
											]
										}
									]
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 310-29",
			"title": "Business C Districts.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "No building shall exceed one story, and no building\nshall exceed 20 feet in height."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "No single store in any building shall have a floor\nin excess of 12,000 square feet."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 310-30",
			"title": "Accessory buildings.",
			"content": [
				{
					"text": "In all districts, no accessory building shall\nexceed two stories in height or, in any case, exceed the height of\nthe principal building. Accessory buildings, including private garages,\nmay occupy in the aggregate not over 15% in any Residence C District\nof the area of the lot."
				},
				{
					"footnote": "[1]\nEditor's Note: Section 14 of this local law\nprovided as follows: \n\"This local law shall not prevent the issuance\nof a permit for any new building, building addition or alteration\nin compliance with the laws in effect prior to the effective date\nhereof for which a complete application was submitted prior to such\ndate.\" (This local law became effective April 4, 1991.)\n"
				}
			]
		},
		{
			"paragraph": "§ 310-31",
			"title": "Exceptions.",
			"content": [
				{
					"text": "In all districts, the provisions of this chapter\nwith regard to height shall not apply to spires on churches nor to\ncupolas, belfries, chimneys, flagpoles or water towers, nor shall\nthese provisions apply to bulkheads, hose towers, elevator enclosures,\nwater tanks or scenery lofts which occupy an aggregate area of not\nover 25% of the ground area of the building."
				}
			]
		},
		{
			"paragraph": "§ 310-32",
			"title": "Multifamily dwellings in business and Residence C Districts.",
			"content": [
				{
					"text": "In any business or Residence C District, no\nmultifamily dwelling or group of dwellings hereafter erected or enlarged\nshall be designed or used to accommodate more than one family for\neach 2,000 square feet of the area of the property occupied or designed\nto be occupied by the building or buildings in which such dwelling\nunits are provided, including such yards or open spaces as are arranged\nor designed to be used exclusively in connection with such buildings."
				}
			]
		},
		{
			"paragraph": "§ 310-33",
			"title": "(Reserved)\n [1]",
			"content": [
				{
					"footnote": "[1]\nEditor's Note: Former § 310-33,\nMultifamily dwellings in Residence B Districts, was repealed 4-8-1997\nby L.L. No. 3-1997.\n"
				}
			]
		},
		{
			"paragraph": "§ 310-34",
			"title": "Compliance required.",
			"content": [
				{
					"text": "No building shall hereafter be erected, enlarged\nor altered unless, as so erected, enlarged or altered, it shall comply\nwith the setback provisions of this article and unless the lot on\nwhich such building stands shall have a front yard, the location,\narea and use of which shall comply with the setback and other provisions\nof this chapter."
				}
			]
		},
		{
			"paragraph": "§ 310-35",
			"title": "Residence districts.",
			"content": [
				{
					"text": "Except as provided in §§ 310-2 \"nearest to lot line,\" 310-36, 310-48, 310-59 and 310-67, every building on a lot in any residence district shall set back from the front lot line at least the following amounts:"
				},
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "In a Residence AA-1 District: 75 feet."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "In a Residence A-1 District: 50 feet."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "In a Residence A-2 or A-2a District: 40 feet."
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "In a Residence C, A-3, A-4 or A-5 District: 30 feet."
								}
							]
						}
					]
				},
				{
					"footnote": "[1]\nEditor's Note: Section 14 of this local law\nprovided as follows: \n\"This local law shall not prevent the issuance\nof a permit for any new building, building addition or alteration\nin compliance with the laws in effect prior to the effective date\nhereof for which a complete application was submitted prior to such\ndate.\" (This local law became effective April 4, 1991.)\n"
				}
			]
		},
		{
			"paragraph": "§ 310-36",
			"title": "Exceptions.",
			"content": [
				{
					"text": "Whenever a building is hereafter erected, altered\nor maintained in a Residence A District and there are existing buildings\non both sides of the lot on which the new building or alteration is\nerected, which existing buildings are within 200 feet of such lot,\non the same side of the street within the same block and within the\nsame Residence AA-1, A-1, A-2, A-2a, A-3, A-4 or A-5 District or,\nif there are no such existing buildings, but there are existing buildings\nwithin 200 feet in both directions on the opposite side of the street\nand within the same such district, the setback from the front lot\nline of any story of such new building or alteration need not exceed\nthe average setback of the corresponding stories of such existing\nbuildings. However, for this purpose, such existing buildings shall\nnot be deemed to include a building on a corner lot, if the setback\nof such corner lot building from the street line of the street on\nwhich the new building or alteration is erected is less than both:"
				},
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "The setback distance specified in § 310-35 of this chapter for the distance in question; and"
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "The setback of such corner lot building from the street\nline of the intersecting street."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 310-37",
			"title": "Business A Districts.",
			"content": [
				{
					"text": "Every building in any Business A District shall set back from the front lot line at least 10 feet on any street which is less than 60 feet in width and at least five feet on any street from 60 feet to less than 70 feet in width; and, on any street 70 feet or more in width, no setback shall be required. If a building in any such business district is used wholly or partly for residence purposes, such building shall set back from the front lot line, at and above the level of the lowest story used for residence purposes, at least as much as the setback required in § 310-35 of this chapter for a building in a Residence C District, except that, if the owner elects to set back the business part of such building more than the required setback for business buildings, then the required setback for the part of the building used for residence purposes, above the first floor shall be reduced by the additional amount that the business part of the building is so set back beyond the requirements for a building used solely for business purposes. In the event that residential dwelling units are established in an existing building, the setback requirements provided above shall not apply. In the event of an addition to an existing building that has or is planned to have residential dwelling units, the above setback requirements for the new construction shall apply."
				}
			]
		},
		{
			"paragraph": "§ 310-37.1",
			"title": "Village Center Area Districts.",
			"content": [
				{
					"text": "No specific minimum required front yard setbacks\nare established within the Village Center Area District. The Planning\nBoard, in connection with its review of site plans, shall establish\nsuch setbacks as it may determine necessary or appropriate for purposes\nof proper and attractive site design, safety of pedestrian and traffic\ncirculation and the maintenance of adequate separation between commercial\nuses and neighboring properties in residence districts. Within any\nsetback areas established by the Planning Board, said Board may require\nlandscaping of such type and extent as it shall determine appropriate\nto provide adequate screening from neighboring properties and streets\nand to further the design guidelines as set forth herein."
				}
			]
		},
		{
			"paragraph": "§ 310-38",
			"title": "Business C Districts.",
			"content": [
				{
					"text": "Every building in any Business C District shall\nset back from the front lot line at least 50 feet, of which not less\nthan the first 20 feet contiguous to the street line shall be landscaped."
				}
			]
		},
		{
			"paragraph": "§ 310-39",
			"title": "Buildings running through blocks in business districts.",
			"content": [
				{
					"text": "In the case of a building which runs through\na block in any business district, such building and each story thereof\nshall set back from each street line at least as much as it would\nbe required by this chapter to set back therefrom if such street line\nwere the front lot line of such building."
				}
			]
		},
		{
			"paragraph": "§ 310-40",
			"title": "Fronting on county or state highway.",
			"content": [
				{
					"text": "Every building hereafter erected on a lot in\nany district which fronts on a county or state highway shall set back\nfrom the front lot line at least 10 feet in addition to the number\nof feet otherwise required by this article."
				}
			]
		},
		{
			"paragraph": "§ 310-41",
			"title": "Nonresidential buildings in Residence A Districts.",
			"content": [
				{
					"text": "Every nonresidential building hereafter erected or enlarged on a lot in any Residence A District shall set back from the front lot line at least such distance as may be prescribed by the Planning Board pursuant to Chapter 251, Site Plan Review, of this Code."
				}
			]
		},
		{
			"paragraph": "§ 310-42",
			"title": "Compliance required.",
			"content": [
				{
					"text": "No building shall hereafter be erected, enlarged\nor altered unless, as so erected, enlarged or altered, it shall comply\nwith the setback provisions of this article and unless the lot on\nwhich such building stands shall have a rear yard, the location, area\nand use of which shall comply with the setback and other provisions\nof this chapter."
				}
			]
		},
		{
			"paragraph": "§ 310-43",
			"title": "Residence A Districts.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Except as provided in §§ 310-2 \"nearest to lot line,\" 310-43B and 310-59, every principal building on a lot in any Residence A District shall set back from the rear lot line at least the following amounts:[Amended 3-23-1999 by L.L. No. 3-1999]"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "If two or more stories in height: 30 feet."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "If one story in height: 25 feet."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "In the case of a lot which has been less than 100\nfeet in depth at all times since November 8, 1922, the required setback\nshall be reduced by six inches for each foot that the depth of such\nlot has, throughout that period, been less than 100 feet, provided\nthat no such setback shall be less than 20 feet."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 310-44",
			"title": "Residence C Districts.",
			"content": [
				{
					"text": "Every principal building on a lot in any Residence\nC District shall set back from the rear lot line at least 20 feet,\nif three stories in height, and at least 15 feet, if less than three\nstories in height, except that, in the case of a lot which has been\nless than 100 feet in depth at all times since November 8, 1922, the\nrequired setback shall be reduced by six inches for each foot that\nthe depth of such lot has, throughout that period, been less than\n100 feet, provided that no such setback shall be less than 15 feet."
				}
			]
		},
		{
			"paragraph": "§ 310-45",
			"title": "Business districts.",
			"content": [
				{
					"text": "Except in Village Center Area Districts, every building in any business district shall set back at least 10 feet from the rear lot line of the lot on which it stands, except that the part of such building nearest the rear lot line may be at least 50 feet from the front lot line, and no setback from the rear lot line shall be required if such rear lot line adjoins the right-of-way of an operating railroad, all subject to the condition that, if any part of such building is used for residence purposes, such building shall be set back from the rear lot line at and above the level of the lowest story used for residence purposes, at least as much as the setback required in § 310-44 of this Code for a building of the same height in a Residence C District. No specific minimum required rear yard setbacks are established within the Village Center Area Districts except that where the rear yard of a lot adjoins a lot in any Residence A or C District which is in residential use, every building shall be set back at least one foot for each one foot that the building exceeds the height of existing grade at the closest point of the rear line. Other than as set forth above, the Planning Board, in connection with its review of site plans, shall establish such setbacks as it may determine necessary for purposes of appropriate site design, safety of pedestrian and traffic circulation, the maintenance of adequate separation between commercial uses and neighboring properties in residence districts and in consideration of any special setbacks which may have been previously established by the Village to protect adjacent residential areas. Within any setback area established by the Planning Board, said Board may require landscaping of such type and extent as it shall determine appropriate to provide adequate screening from neighboring properties and streets and to further the design guidelines as set forth herein."
				}
			]
		},
		{
			"paragraph": "§ 310-46",
			"title": "Business C Districts.",
			"content": [
				{
					"text": "Every building in a Business C District shall\nset back from any rear lot line which is also a residence district\nboundary line at least 50 feet, of which not less than the first 20\nfeet contiguous to the residence district boundary line shall be landscaped."
				}
			]
		},
		{
			"paragraph": "§ 310-47",
			"title": "Accessory buildings.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Any accessory building, other than a private garage,\nshall set back from the rear lot line at least:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "In a Residence AA-1 District: 15 feet."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "In a Residence A-1 District: 10 feet."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "In a Residence A-2, A-2a or A-3 District: five feet.[Amended 4-8-1997 by L.L. No. 3-1997]"
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "In a Residence A-4, A-5 or C District: three feet,\nbut not less than four feet for a new or altered structure if the\nwalls of the building have a combustible surface.[Amended 3-24-1998 by L.L. No. 2-1998]"
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "In the case of a corner lot, any accessory building\nwholly or partly within the limits of a rear yard, other than a private\ngarage, shall set back from the side street line at least:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "In a Residence AA-1 District: 60 feet."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "In a Residence A-1 District: 50 feet."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "In a Residence A-2 or A-2a District: 40 feet."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "In a Residence A-3 or A-4 District: 30 feet.[Amended 4-8-1997 by L.L. No. 3-1997]"
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "In a Residence A-5 District: 25 feet."
												}
											]
										},
										{
											"number": "(6) ",
											"content": [
												{
													"text": "In a Residence C District: 20 feet."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "All tennis courts and swimming pools shall be subject to the requirements in Subsection B of this section, but in no case shall a tennis court or a swimming pool in a Residence A District be set back less than 30 feet from a property line nor located anywhere within a front yard as defined by this chapter. In the case of a swimming pool, the setback shall be measured to the edge of the water. In the case of a tennis court, the setback shall be measured to its perimeter fence."
								}
							]
						}
					]
				},
				{
					"footnote": "[1]\nEditor's Note: Section 14 of this local law\nprovided as follows: \n\"This local law shall not prevent the issuance\nof a permit for any new building, building addition or alteration\nin compliance with the laws in effect prior to the effective date\nhereof for which a complete application was submitted prior to such\ndate.\" (This local law became effective April 4, 1991.)\n"
				}
			]
		},
		{
			"paragraph": "§ 310-48",
			"title": "Private garages.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "A private garage not a part of a principal building\non a lot less than 100 feet in depth shall be no more than 30 feet\ndistant from the rear lot line."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "In the case of a corner lot in any Residence A District,\nany private garage not a part of a principal building shall be located\nin the inside corner of the lot but set back as much as required by\nthe other provisions of this chapter from the rear lot line and from\nthe side lot line which is not a street line. No part of such garage\nwhich is on a lot 100 feet or less in width shall be more than 30\nfeet distant from the side lot line which is not a street line."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "A private garage not a part of a principal building\nin a Residence A-4 or A-5 District need have no setback from a side\nlot line, other than a street line, provided that such garage is for\nnot more than two motor vehicles and is built across a common lot\nline in any Residence A-4 or A-5 District by mutual agreement between\nthe owners of the adjoining lots."
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "Other than as set forth above, a private garage not a part of a principal building shall meet all applicable setback requirements as set forth in § 310-51."
								}
							]
						}
					]
				},
				{
					"footnote": "[1]\nEditor's Note: Section 14 of this local law\nprovided as follows: \n\"This local law shall not prevent the issuance\nof a permit for any new building, building addition or alteration\nin compliance with the laws in effect prior to the effective date\nhereof for which a complete application was submitted prior to such\ndate.\" (This local law became effective April 4, 1991.)\n"
				}
			]
		},
		{
			"paragraph": "§ 310-49",
			"title": "Nonresidential buildings in Residence A Districts.",
			"content": [
				{
					"text": "Every nonresidential building hereafter erected or enlarged on a lot in any Residence A District shall set back from the rear lot line at least such distance as may be prescribed by the Planning Board pursuant to Chapter 251, Site Plan Review, of this Code."
				}
			]
		},
		{
			"paragraph": "§ 310-50",
			"title": "Compliance required.",
			"content": [
				{
					"text": "No building shall hereafter be erected, enlarged\nor altered unless, as so erected, enlarged or altered, it shall comply\nwith the setback provisions of this article and unless the lot on\nwhich such building stands shall have side yards and other open spaces,\nthe location, area and use of which shall comply with the setback\nand other provisions of this chapter."
				}
			]
		},
		{
			"paragraph": "§ 310-51",
			"title": "Residence A Districts.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Except as provided in §§ 310-48, 310-53, 310-59 and 310-67, every building, other than a building on a corner lot, in a Residence A District shall set back from each side lot line at least:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "In a Residence AA-1 District: 30 feet."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "In a Residence A-1 District: 20 feet."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "In a Residence A-2 or A-2a District: 15 feet."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "In a Residence A-3, A-4 or A-5 or B District: 10 feet."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Other than as provided in §§ 310-48, 310-53 and 310-67, every accessory building shall conform to the setbacks as set forth in Subsection A above, except that an accessory building shall be set back not less than the following distances from a side lot line other than a street line:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Any accessory building in a Residence AA-1, A-1 or\nA-2 District, all parts of which are over 100 feet from any street\nline:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "In the Residence AA-1 District: 20 feet."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "In the Residence A-1 or A-2 District: 10 feet."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Any accessory building in a Residence A-2a District,\nall parts of which are over 80 feet from any street line: 10 feet."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Any accessory building in a Residence A-3, A-4 or\nA-5 District, all parts of which are over 60 feet from any street\nline:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "In a Residence A-3 District: five feet."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "In a Residence A-4 or A-5 District: three feet,\nbut not less than four feet for a new or altered structure if the\nwalls of the building have a combustible surface."
																}
															]
														}
													]
												}
											]
										}
									]
								}
							]
						}
					]
				},
				{
					"footnote": "[1]\nEditor's Note: Section 14 of this local law\nprovided as follows: \n\"This local law shall not prevent the issuance\nof a permit for any new building, building addition or alteration\nin compliance with the laws in effect prior to the effective date\nhereof for which a complete application was submitted prior to such\ndate. (This local law became effective April 4, 1991.)\n"
				}
			]
		},
		{
			"paragraph": "§ 310-52",
			"title": "Residence C Districts.",
			"content": [
				{
					"text": "Every building, other than a building on a corner\nlot, in a Residence C District shall set back from each side lot line\nat least 15 feet, if an apartment house or hotel, and at least 10\nfeet, if a one-family dwelling, two-family dwelling or other permitted\nuse, except that, any accessory building, all part of which are over\n60 feet from any street line, may set back not less than three feet\nfrom a side lot line other than a street line."
				}
			]
		},
		{
			"paragraph": "§ 310-53",
			"title": "Buildings on corner lots.",
			"content": [
				{
					"text": "Except as provided in §§ 310-47, 310-48 and 310-67, every building on a corner lot shall set back from the side lot line, which is not a street line, not less than the respective distances specified in § 310-51 of this chapter, in the case of a building in a Residence A or B District, and not less than the respective distances specified in § 310-52 in this chapter, in the case of a building in a Residence C District. Every such building shall set back from the side street line at least:"
				},
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "In a Residence AA-1 District: 65 feet."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "In a Residence A-1 District: 40 feet."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "In a Residence A-2 or A-2a District: 30 feet."
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "In a Residence A-3 District: 20 feet."
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "In a Residence A-4 or A-5 District: 15 feet."
								}
							]
						},
						{
							"number": "F. ",
							"content": [
								{
									"text": "In a Residence C District: 10 feet."
								}
							]
						}
					]
				},
				{
					"footnote": "[1]\nEditor's Note: Section 14 of this local law\nprovided as follows: \n\"This local law shall not prevent the issuance\nof a permit for any new building, building addition or alteration\nin compliance with the laws in effect prior to the effective date\nhereof for which a complete application was submitted prior to such\ndate.\" (This local law became effective April 4, 1991.)\n"
				}
			]
		},
		{
			"paragraph": "§ 310-54",
			"title": "Width of intervening spaces between buildings.",
			"content": [
				{
					"text": "Wherever intervening open space between parts\nof different buildings on the same lot in any Residence C or business\ndistrict are the principal means of bringing daylight and air to the\nwindows of living or sleeping rooms opening thereon, such open spaces\nshall be not less than 20 feet in width if the lower of any two such\nbuildings involved is 2 1/2 stories or less in height, not less\nthan 25 feet if such lower building is three stories in height and\nnot less than 30 feet if such lower building is more than three stories\nin height."
				}
			]
		},
		{
			"paragraph": "§ 310-55",
			"title": "Business districts.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Except in Village Center Area Districts, no building\nin any business district need set back any distance from a side lot\nline, except that, if such side lot line is also a street line, such\nbuilding shall set back therefrom at least as much as it would be\nrequired by this chapter to set back therefrom if such street line\nwere the front lot line of such building and except that, if such\nbuilding is an apartment house or hotel, or if more than two stories\nof such building are used wholly or partly for residence purposes,\nsuch building shall set back from a side lot line which is not a street\nline at least 15 feet and except that every building in any Business\nA District shall set back at least 10 feet from the boundary line\nof any residence district and except that every building in any Business\nC District shall set back from the boundary line of any residence\ndistrict at least 50 feet, of which not less than the first 20 feet\ncontiguous to the residence district boundary line shall be landscaped."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "No specific minimum required side yard setbacks are\nestablished within the Village Center Area, except that where the\nside yard of a lot adjoins a lot in any Residence A or C District\nwhich is in residential use, every building shall be set back at least\none foot for each one foot that the building exceeds the height of\nexisting grade at the closest point of the side lot line. Other than\nas set forth above, the Planning Board, in connection with its review\nof site plans, shall establish such setbacks as it may determine necessary\nfor purposes of appropriate site design, safety of pedestrian and\ntraffic circulation and the maintenance of adequate separation between\ncommercial uses and neighboring properties in residence districts\nand in consideration of any special setbacks which may have been previously\nestablished by the Village to protect adjacent residential areas.\nWithin any setback areas established by the Planning Board, said Board\nmay require landscaping of such type and extent as it shall determine\nappropriate to provide adequate screening from neighboring properties\nand streets and to further the design guidelines as set forth herein.[Amended 4-8-1997 by L.L. No. 3-1997]"
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 310-56",
			"title": "Corner lots fronting on county or state highways.",
			"content": [
				{
					"text": "Every building hereafter erected on a corner\nlot in any district, the side street line of which is the boundary\nof a county or state highway, shall set back from the side street\nline at least 10 feet in addition to the number of feet otherwise\nrequired by this article."
				}
			]
		},
		{
			"paragraph": "§ 310-57",
			"title": "Nonresidential buildings in Residence A Districts.",
			"content": [
				{
					"text": "Every nonresidential building hereafter erected or enlarged on a lot in any Residence A District shall set back from each side lot line at least such distance as may be prescribed by the Planning Board pursuant to Chapter 251, Site Plan Review, of this Code."
				}
			]
		},
		{
			"paragraph": "§ 310-58",
			"title": "(Reserved)",
			"content": []
		},
		{
			"paragraph": "§ 310-59",
			"title": "Setbacks for existing houses in new subdivisions.",
			"content": [
				{
					"text": "In order to provide a suitable lot for any existing\nhouse in a new subdivision, each proposed lot line shall be located\naway from the building a distance equal to the normal minimum yard\nsetback dimension or a distance equal to 1/2 the sum of the length\nand height of the building facade parallel or substantially parallel\nto the proposed lot line, whichever is greater. The measurements shall\nbe of the principal facade, exclusive of bays, balconies and other\nsimilar projections."
				}
			]
		},
		{
			"paragraph": "§ 310-100",
			"title": "Purpose and applicability.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "The unique character of residential neighborhoods\nin Scarsdale rests on the diversity in the style and design of houses\nas well as the general uniformity in the scale of houses located on\nsimilarly sized lots in neighborhoods throughout the community. The\nrecent trend of tearing down existing houses and replacing them with\nlarger houses or building large additions to existing houses threatens\nthe appearance and impacts upon the health, safety, welfare, and quality\nof life of Scarsdale."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "This article establishes a maximum floor area ratio\n(FAR) for all single-family and two-family residences in the Residence\nA Zones. It responds both to the desire of residents to enlarge their\nhomes to meet the needs of their families and to preserve neighborhood\ncharacter by requiring houses to appear to be of the same or similar\nscale to others in the neighborhood. It is the intent of this article\nto encourage both new houses and expansions or alterations to existing\nhouses to have a consistent scale with the nearby residences on both\nsides of the street. The FAR provisions are intended to be applied\ntogether with other provisions of the Village Code, including the\nprovisions for lot coverage."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 310-101",
			"title": "Definitions.",
			"content": [
				{
					"text": "Words used in this article shall have the meanings indicated in Chapter 310, Zoning, § 310-2, and, in addition thereto, the following terms shall have the meanings indicated:"
				}
			]
		},
		{
			"paragraph": "§ 310-102",
			"title": "Maximum floor area ratio.",
			"content": [
				{
					"text": "As illustrated herein as Table XVI-1, the maximum\npermitted floor area ratio (FAR) for houses shall be as follows:"
				},
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Lots of 4,999 square feet or less shall have a maximum\nFAR of 0.43 (maximum floor area ratio = 0.43)."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Lots between 5,000 square feet and 9,999 square feet\nshall have a maximum FAR of 0.43, minus 0.016 for every 1,000 square\nfeet or part thereof in excess of 5,000 square feet [maximum floor\narea ratio = 0.43 - ((lot size - 5,000) ./. 1,000) x 0.016]."
								},
								{
                                	"content": [
                                		{
                                			"number": "(1) ",
                                			"content": [
                                				{
                                					"text": "Lot Size(feet square): 5,000  Maximum FAR: 0.4300  Maximum Floor Area(feet square): 2,150"
                                				}
                                			]
                                		},
                                		{
                                			"number": "(2) ",
                                			"content": [
                                				{
                                					"text": "Lot Size(feet square): 6,000  Maximum FAR: 0.4140  Maximum Floor Area(feet square): 2,484"
                                				}
                                			]
                                		},
                                		{
                                			"number": "(3) ",
                                			"content": [
                                				{
                                					"text": "Lot Size(feet square): 7,000  Maximum FAR: 0.3980  Maximum Floor Area(feet square): 2,786"
                                				}
                                			]
                                		},
                                		{
                                			"number": "(4) ",
                                			"content": [
                                				{
                                					"text": "Lot Size(feet square): 8,000  Maximum FAR: 0.3820  Maximum Floor Area(feet square): 3,056"
                                				}
                                			]
                                		},
                                		{
                                			"number": "(5) ",
                                			"content": [
                                				{
                                					"text": "Lot Size(feet square): 9,000  Maximum FAR: 0.3660  Maximum Floor Area(feet square): 3,294"
                                				}
                                			]
                                		}
                                	]
                                }
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Lots between 10,000 square feet and 14,999 square\nfeet shall have a maximum FAR of 0.35, minus 0.012 for every 1,000\nsquare feet or part thereof in excess of 10,000 square feet [maximum\nfloor area ratio = 0.35 - ((lot size - 10,000) ./. 1,000) x 0.012]."
								},
								{
                                	"content": [
                                		{
                                			"number": "(1) ",
                                			"content": [
                                				{
                                					"text": "Lot Size(feet square): 10,000  Maximum FAR: 0.3500  Maximum Floor Area(feet square): 3,500"
                                				}
                                			]
                                		},
                                		{
                                			"number": "(2) ",
                                			"content": [
                                				{
                                					"text": "Lot Size(feet square): 11,000  Maximum FAR: 0.3380  Maximum Floor Area(feet square): 3,718"
                                				}
                                			]
                                		},
                                		{
                                			"number": "(3) ",
                                			"content": [
                                				{
                                					"text": "Lot Size(feet square): 12,000  Maximum FAR: 0.3260  Maximum Floor Area(feet square): 3,912"
                                				}
                                			]
                                		},
                                		{
                                			"number": "(4) ",
                                			"content": [
                                				{
                                					"text": "Lot Size(feet square): 13,000  Maximum FAR: 0.3140  Maximum Floor Area(feet square): 4,082"
                                				}
                                			]
                                		},
                                		{
                                			"number": "(5) ",
                                			"content": [
                                				{
                                					"text": "Lot Size(feet square): 14,000  Maximum FAR: 0.3020  Maximum Floor Area(feet square): 4,228"
                                				}
                                			]
                                		}
                                	]
                                }
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "Lots between 15,000 square feet and 29,999 square\nfeet shall have a maximum FAR of 0.29, minus 0.006 for every 1,000\nsquare feet or part thereof in excess of 15,000 square feet [maximum\nfloor area ratio = 0.29 - ((lot size - 15,000) ./. 1,000) x 0.006]."
								},
								{
                                	"content": [
                                		{
                                			"number": "(1) ",
                                			"content": [
                                				{
                                					"text": "Lot Size(feet square): 15,000  Maximum FAR: 0.2900  Maximum Floor Area(feet square): 4,350"
                                				}
                                			]
                                		},
                                		{
                                			"number": "(2) ",
                                			"content": [
                                				{
                                					"text": "Lot Size(feet square): 16,000  Maximum FAR: 0.2840  Maximum Floor Area(feet square): 4,544"
                                				}
                                			]
                                		},
                                		{
                                			"number": "(3) ",
                                			"content": [
                                				{
                                					"text": "Lot Size(feet square): 17,000  Maximum FAR: 0.2780  Maximum Floor Area(feet square): 4,726"
                                				}
                                			]
                                		},
                                		{
                                			"number": "(4) ",
                                			"content": [
                                				{
                                					"text": "Lot Size(feet square): 18,000  Maximum FAR: 0.2720  Maximum Floor Area(feet square): 4,896"
                                				}
                                			]
                                		},
                                		{
                                			"number": "(5) ",
                                			"content": [
                                				{
                                					"text": "Lot Size(feet square): 19,000  Maximum FAR: 0.2660  Maximum Floor Area(feet square): 5,054"
                                				}
                                			]
                                		},
                                		{
                                			"number": "(6) ",
                                			"content": [
                                				{
                                					"text": "Lot Size(feet square): 20,000  Maximum FAR: 0.2600  Maximum Floor Area(feet square): 5,200"
                                				}
                                			]
                                		},
                                		{
                                			"number": "(7) ",
                                			"content": [
                                				{
                                					"text": "Lot Size(feet square): 21,000  Maximum FAR: 0.2540  Maximum Floor Area(feet square): 5,334"
                                				}
                                			]
                                		},
                                		{
                                			"number": "(8) ",
                                			"content": [
                                				{
                                					"text": "Lot Size(feet square): 22,000  Maximum FAR: 0.2480  Maximum Floor Area(feet square): 5,456"
                                				}
                                			]
                                		},
                                		{
                                			"number": "(9) ",
                                			"content": [
                                				{
                                					"text": "Lot Size(feet square): 23,000  Maximum FAR: 0.2420  Maximum Floor Area(feet square): 5,566"
                                				}
                                			]
                                		},
                                		{
                                			"number": "(10) ",
                                			"content": [
                                				{
                                					"text": "Lot Size(feet square): 24,000  Maximum FAR: 0.2360  Maximum Floor Area(feet square): 5,664"
                                				}
                                			]
                                		},
                                		{
                                			"number": "(11) ",
                                			"content": [
                                				{
                                					"text": "Lot Size(feet square): 25,000  Maximum FAR: 0.2300  Maximum Floor Area(feet square): 5,750"
                                				}
                                			]
                                		},
                                		{
                                			"number": "(12) ",
                                			"content": [
                                				{
                                					"text": "Lot Size(feet square): 26,000  Maximum FAR: 0.2240  Maximum Floor Area(feet square): 5,824"
                                				}
                                			]
                                		},
                                		{
                                			"number": "(13) ",
                                			"content": [
                                				{
                                					"text": "Lot Size(feet square): 27,000  Maximum FAR: 0.2180  Maximum Floor Area(feet square): 5,886"
                                				}
                                			]
                                		},
                                		{
                                			"number": "(14) ",
                                			"content": [
                                				{
                                					"text": "Lot Size(feet square): 28,000  Maximum FAR: 0.2120  Maximum Floor Area(feet square): 5,936"
                                				}
                                			]
                                		},
                                		{
                                			"number": "(15) ",
                                			"content": [
                                				{
                                					"text": "Lot Size(feet square): 29,000  Maximum FAR: 0.2060  Maximum Floor Area(feet square): 5,974"
                                				}
                                			]
                                		}
                                	]
                                }
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "Lots between 30,000 square feet and 34,999 square\nfeet shall have a maximum FAR of 0.20, minus 0.0045 for every 1,000\nsquare feet or part thereof in excess of 30,000 square feet [maximum\nfloor area ratio = 0.20 - ((lot size - 30,000) ./. 1,000) x .0045]."
								},
								{
                                	"content": [
                                		{
                                			"number": "(1) ",
                                			"content": [
                                				{
                                					"text": "Lot Size(feet square): 30,000  Maximum FAR: 0.2000  Maximum Floor Area(feet square): 6,000"
                                				}
                                			]
                                		},
                                		{
                                			"number": "(2) ",
                                			"content": [
                                				{
                                					"text": "Lot Size(feet square): 31,000  Maximum FAR: 0.1955  Maximum Floor Area(feet square): 6,061"
                                				}
                                			]
                                		},
                                		{
                                			"number": "(3) ",
                                			"content": [
                                				{
                                					"text": "Lot Size(feet square): 32,000  Maximum FAR: 0.1910  Maximum Floor Area(feet square): 6,112"
                                				}
                                			]
                                		},
                                		{
                                			"number": "(4) ",
                                			"content": [
                                				{
                                					"text": "Lot Size(feet square): 33,000  Maximum FAR: 0.1865  Maximum Floor Area(feet square): 6,155"
                                				}
                                			]
                                		},
                                		{
                                			"number": "(5) ",
                                			"content": [
                                				{
                                					"text": "Lot Size(feet square): 34,000  Maximum FAR: 0.1820  Maximum Floor Area(feet square): 6,188"
                                				}
                                			]
                                		}
                                	]
                                }
							]
						},
						{
							"number": "F. ",
							"content": [
								{
									"text": "Lots between 35,000 square feet and 39,999 square\nfeet shall have a maximum FAR of 0.1775, minus 0.003 for every 1,000\nsquare feet or part thereof in excess of 35,000 square feet [maximum\nfloor area ratio = 0.1775 - ((lot size - 35,000) ./. 1,000) x .003]."
								},
								{
                                	"content": [
                                		{
                                			"number": "(1) ",
                                			"content": [
                                				{
                                					"text": "Lot Size(feet square): 35,000  Maximum FAR: 0.1775  Maximum Floor Area(feet square): 6,213"
                                				}
                                			]
                                		},
                                		{
                                			"number": "(2) ",
                                			"content": [
                                				{
                                					"text": "Lot Size(feet square): 36,000  Maximum FAR: 0.1745  Maximum Floor Area(feet square): 6,282"
                                				}
                                			]
                                		},
                                		{
                                			"number": "(3) ",
                                			"content": [
                                				{
                                					"text": "Lot Size(feet square): 37,000  Maximum FAR: 0.1715  Maximum Floor Area(feet square): 6,346"
                                				}
                                			]
                                		},
                                		{
                                			"number": "(4) ",
                                			"content": [
                                				{
                                					"text": "Lot Size(feet square): 38,000  Maximum FAR: 0.1685  Maximum Floor Area(feet square): 6,403"
                                				}
                                			]
                                		},
                                		{
                                			"number": "(5) ",
                                			"content": [
                                				{
                                					"text": "Lot Size(feet square): 39,000  Maximum FAR: 0.1655  Maximum Floor Area(feet square): 6,455"
                                				}
                                			]
                                		}
                                	]
                                }
							]
						},
						{
							"number": "G. ",
							"content": [
								{
									"text": "Lots between 40,000 square feet and 44,999 square\nfeet shall have a maximum FAR of 0.1625, minus 0.002 for every 1,000\nsquare feet or part thereof in excess of 40,000 square feet [maximum\nfloor area ratio = 0.1625 - ((lot size - 40,000) ./. 1,000) x .002]."
								},
								{
                                	"content": [
                                		{
                                			"number": "(1) ",
                                			"content": [
                                				{
                                					"text": "Lot Size(feet square): 40,000  Maximum FAR: 0.1625  Maximum Floor Area(feet square): 6,500"
                                				}
                                			]
                                		},
                                		{
                                			"number": "(2) ",
                                			"content": [
                                				{
                                					"text": "Lot Size(feet square): 41,000  Maximum FAR: 0.1605  Maximum Floor Area(feet square): 6,581"
                                				}
                                			]
                                		},
                                		{
                                			"number": "(3) ",
                                			"content": [
                                				{
                                					"text": "Lot Size(feet square): 42,000  Maximum FAR: 0.1585  Maximum Floor Area(feet square): 6,657"
                                				}
                                			]
                                		},
                                		{
                                			"number": "(4) ",
                                			"content": [
                                				{
                                					"text": "Lot Size(feet square): 43,000  Maximum FAR: 0.1565  Maximum Floor Area(feet square): 6,730"
                                				}
                                			]
                                		},
                                		{
                                			"number": "(5) ",
                                			"content": [
                                				{
                                					"text": "Lot Size(feet square): 44,000  Maximum FAR: 0.1545  Maximum Floor Area(feet square): 6,798"
                                				}
                                			]
                                		}
                                	]
                                }
							]
						},
						{
							"number": "H. ",
							"content": [
								{
									"text": "Lots between 45,000 square feet and 49,999 square\nfeet shall have a maximum FAR of 0.1525, minus 0.0015 or part thereof\nfor every 1,000 square feet or part thereof in excess of 45,000 square\nfeet [maximum floor area ratio = 0.1525 - ((lot size - 45,000) ./.\n1,000) x .0015]."
								},
								{
                                	"content": [
                                		{
                                			"number": "(1) ",
                                			"content": [
                                				{
                                					"text": "Lot Size(feet square): 45,000  Maximum FAR: 0.1525  Maximum Floor Area(feet square): 6,863"
                                				}
                                			]
                                		},
                                		{
                                			"number": "(2) ",
                                			"content": [
                                				{
                                					"text": "Lot Size(feet square): 46,000  Maximum FAR: 0.1510  Maximum Floor Area(feet square): 6,946"
                                				}
                                			]
                                		},
                                		{
                                			"number": "(3) ",
                                			"content": [
                                				{
                                					"text": "Lot Size(feet square): 47,000  Maximum FAR: 0.1495  Maximum Floor Area(feet square): 7,027"
                                				}
                                			]
                                		},
                                		{
                                			"number": "(4) ",
                                			"content": [
                                				{
                                					"text": "Lot Size(feet square): 48,000  Maximum FAR: 0.1480  Maximum Floor Area(feet square): 7,104"
                                				}
                                			]
                                		},
                                		{
                                			"number": "(5) ",
                                			"content": [
                                				{
                                					"text": "Lot Size(feet square): 49,000  Maximum FAR: 0.1465  Maximum Floor Area(feet square): 7,179"
                                				}
                                			]
                                		}
                                	]
                                }
							]
						},
						{
							"number": "I. ",
							"content": [
								{
									"text": "Lots between 50,000 square feet and 76,230 square\nfeet shall have a maximum FAR of 0.1450 (maximum floor area ratio\n= 0.1450]."
								},
								{
                                	"content": [
                                		{
                                			"number": "(1) ",
                                			"content": [
                                				{
                                					"text": "Lot Size(feet square): 50,000  Maximum FAR: 0.1450  Maximum Floor Area(feet square): 7,250"
                                				}
                                			]
                                		},
                                		{
                                			"number": "(2) ",
                                			"content": [
                                				{
                                					"text": "Lot Size(feet square): 51,000  Maximum FAR: 0.1450  Maximum Floor Area(feet square): 7,395"
                                				}
                                			]
                                		},
                                		{
                                			"number": "(3) ",
                                			"content": [
                                				{
                                					"text": "Lot Size(feet square): 52,000  Maximum FAR: 0.1450  Maximum Floor Area(feet square): 7,540"
                                				}
                                			]
                                		},
                                		{
                                			"number": "(4) ",
                                			"content": [
                                				{
                                					"text": "Lot Size(feet square): 53,000  Maximum FAR: 0.1450  Maximum Floor Area(feet square): 7,685"
                                				}
                                			]
                                		},
                                		{
                                			"number": "(5) ",
                                			"content": [
                                				{
                                					"text": "Lot Size(feet square): 54,000  Maximum FAR: 0.1450  Maximum Floor Area(feet square): 7,830"
                                				}
                                			]
                                		},
                                		{
                                			"number": "(6) ",
                                			"content": [
                                				{
                                					"text": "Lot Size(feet square): 55,000  Maximum FAR: 0.1450  Maximum Floor Area(feet square): 7,975"
                                				}
                                			]
                                		},
                                		{
                                			"number": "(7) ",
                                			"content": [
                                				{
                                					"text": "Lot Size(feet square): 56,000  Maximum FAR: 0.1450  Maximum Floor Area(feet square): 8,120"
                                				}
                                			]
                                		},
                                		{
                                			"number": "(8) ",
                                			"content": [
                                				{
                                					"text": "Lot Size(feet square): 57,000  Maximum FAR: 0.1450  Maximum Floor Area(feet square): 8,265"
                                				}
                                			]
                                		},
                                		{
                                			"number": "(9) ",
                                			"content": [
                                				{
                                					"text": "Lot Size(feet square): 58,000  Maximum FAR: 0.1450  Maximum Floor Area(feet square): 8,410"
                                				}
                                			]
                                		},
                                		{
                                			"number": "(10) ",
                                			"content": [
                                				{
                                					"text": "Lot Size(feet square): 59,000  Maximum FAR: 0.1450  Maximum Floor Area(feet square): 8,555"
                                				}
                                			]
                                		},
                                		{
                                			"number": "(11) ",
                                			"content": [
                                				{
                                					"text": "Lot Size(feet square): 60,000  Maximum FAR: 0.1450  Maximum Floor Area(feet square): 8,700"
                                				}
                                			]
                                		},
                                		{
                                			"number": "(12) ",
                                			"content": [
                                				{
                                					"text": "Lot Size(feet square): 61,000  Maximum FAR: 0.1450  Maximum Floor Area(feet square): 8,845"
                                				}
                                			]
                                		},
                                		{
                                			"number": "(13) ",
                                			"content": [
                                				{
                                					"text": "Lot Size(feet square): 62,000  Maximum FAR: 0.1450  Maximum Floor Area(feet square): 8,990"
                                				}
                                			]
                                		},
                                		{
                                			"number": "(14) ",
                                			"content": [
                                				{
                                					"text": "Lot Size(feet square): 63,000  Maximum FAR: 0.1450  Maximum Floor Area(feet square): 9,135"
                                				}
                                			]
                                		},
                                		{
                                			"number": "(15) ",
                                			"content": [
                                				{
                                					"text": "Lot Size(feet square): 64,000  Maximum FAR: 0.1450  Maximum Floor Area(feet square): 9,280"
                                				}
                                			]
                                		},
                                		{
                                			"number": "(16) ",
                                			"content": [
                                				{
                                					"text": "Lot Size(feet square): 65,000  Maximum FAR: 0.1450  Maximum Floor Area(feet square): 9,425"
                                				}
                                			]
                                		},
                                		{
                                			"number": "(17) ",
                                			"content": [
                                				{
                                					"text": "Lot Size(feet square): 66,000  Maximum FAR: 0.1450  Maximum Floor Area(feet square): 9,570"
                                				}
                                			]
                                		},
                                		{
                                			"number": "(18) ",
                                			"content": [
                                				{
                                					"text": "Lot Size(feet square): 67,000  Maximum FAR: 0.1450  Maximum Floor Area(feet square): 9,715"
                                				}
                                			]
                                		},
                                		{
                                			"number": "(19) ",
                                			"content": [
                                				{
                                					"text": "Lot Size(feet square): 68,000  Maximum FAR: 0.1450  Maximum Floor Area(feet square): 9,860"
                                				}
                                			]
                                		},
                                		{
                                			"number": "(20) ",
                                			"content": [
                                				{
                                					"text": "Lot Size(feet square): 69,000  Maximum FAR: 0.1450  Maximum Floor Area(feet square): 10,005"
                                				}
                                			]
                                		},
                                		{
                                			"number": "(21) ",
                                			"content": [
                                				{
                                					"text": "Lot Size(feet square): 70,000  Maximum FAR: 0.1450  Maximum Floor Area(feet square): 10,150"
                                				}
                                			]
                                		},
                                		{
                                			"number": "(22) ",
                                			"content": [
                                				{
                                					"text": "Lot Size(feet square): 71,000  Maximum FAR: 0.1450  Maximum Floor Area(feet square): 10,295"
                                				}
                                			]
                                		},
                                		{
                                			"number": "(23) ",
                                			"content": [
                                				{
                                					"text": "Lot Size(feet square): 72,000  Maximum FAR: 0.1450  Maximum Floor Area(feet square): 10,440"
                                				}
                                			]
                                		},
                                		{
                                			"number": "(24) ",
                                			"content": [
                                				{
                                					"text": "Lot Size(feet square): 73,000  Maximum FAR: 0.1450  Maximum Floor Area(feet square): 10,585"
                                				}
                                			]
                                		},
                                		{
                                			"number": "(25) ",
                                			"content": [
                                				{
                                					"text": "Lot Size(feet square): 74,000  Maximum FAR: 0.1450  Maximum Floor Area(feet square): 10,730"
                                				}
                                			]
                                		},
                                		{
                                			"number": "(26) ",
                                			"content": [
                                				{
                                					"text": "Lot Size(feet square): 75,000  Maximum FAR: 0.1450  Maximum Floor Area(feet square): 10,875"
                                				}
                                			]
                                		},
                                		{
                                			"number": "(27) ",
                                			"content": [
                                				{
                                					"text": "Lot Size(feet square): 76,000  Maximum FAR: 0.1450  Maximum Floor Area(feet square): 11,020"
                                				}
                                			]
                                		},
                                		{
                                			"number": "(28) ",
                                			"content": [
                                				{
                                					"text": "Lot Size(feet square): 76,230  Maximum FAR: 0.1450  Maximum Floor Area(feet square): 11,053"
                                				}
                                			]
                                		},
                                		{
                                			"number": "(29) ",
                                			"content": [
                                				{
                                					"text": "Lot Size(feet square): 76,230+  Maximum FAR: ----  Maximum Floor Area(feet square): 15,000"
                                				}
                                			]
                                		}
                                	]
                                }
							]
						},
						{
							"number": "J. ",
							"content": [
								{
									"text": "Any house which exceeds 15,000 square feet of gross\nresidential floor area shall be required to obtain a special permit\nfrom the Zoning Board of Appeals."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 310-103",
			"title": "Exemptions from the calculation of floor area ratio in Residence A Zones.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Decks, patios, unenclosed porches and porticoes."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "All space in unroofed structures such as decks and\npatios shall be excluded from the calculation of FAR."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "All space in unenclosed porches and porticoes shall be excluded from the calculation of FAR. For the purpose of FAR calculation, \"unenclosed\" shall mean those porches or porticoes that are open and not permanently, seasonally or temporarily enclosed as defined in § 310-101."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Basements, cellars and basement garages. That portion\nof the floor area of the basement, cellar or basement garage where\nthe exposed exterior wall or walls facing the front yard is less than\nthree feet as measured from the existing or proposed grade, whichever\nis lower, shall be excluded from the calculation of FAR. All the remaining\nportions of the floor area of basements, cellars or basement garages,\nwhere the height of the exterior exposed wall or walls facing the\nfront yard is three feet or more as measured from the existing or\nproposed grade, whichever is lower, shall be included in the FAR."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Attics or space under a sloping roof."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "All unfinished or finished space in an attic or under\na sloping roof which has no dormers facing the front, side, or rear\nyards, or which has dormers or dormered porticoes that do not exceed\nthe following dimensions, shall be excluded from the calculation of\nFAR:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "For dormers facing the front or side yards,\nwhere the exterior width of such dormers does not exceed 30% of the\nexterior linear width of the roof upon which they are situated. The\nexterior linear width of the roof shall be measured from end to end\nat the widest point of the roof."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "For each of those dormers which face the rear\nyard, where the distance between the side walls of the underlying\nstory and the side wall of the dormer is greater than five feet."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Where the dimensions of one or more dormers exceed one or both of the standards under § 310-103C above, the total area in the attic or under the sloping roof shall be included in calculation of FAR, except as provided for in § 310-103C(3) below."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "That portion of unfinished or finished space in an\nattic or under a sloping roof where the distance between the floor\nand ceiling is less than four feet shall be excluded from the calculation\nof FAR."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "Garages."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "On lots measuring 9,999 square feet or less, the lesser\nof 250 square feet or the total floor area contained within one-story\ngarages, either detached or attached to the principal structure, shall\nbe excluded from the calculation of the FAR. "
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "On lots measuring 10,000 square feet or more, the\nlesser of 400 square feet or the total floor area contained within\none-story garages, either detached or attached to the principal structure,\nshall be excluded from the calculation of the FAR."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "In those instances where an additional story is provided above a garage, whether detached or attached, such floor area or garage floor area, up to the limits set forth herein as defined by lot size, shall be excluded from the calculation of FAR. For purposes of Subsection D, attic space or area under a sloped roof shall not be construed to be an additional story unless it meets the criteria of § 310-103C(1) above."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "Notwithstanding the above, Subsection D shall not apply to basement garages."
												}
											]
										}
									]
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 310-104",
			"title": "Side yard setback FAR bonus.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "In all Residence A Zones, except the AA-1 Zone, for each additional foot that a house is set back beyond the minimum required side yard setback, an additional 100 square feet of floor area above the maximum permitted FAR on that lot as per § 310-102 shall be permitted, provided that:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "In the case of additions to existing homes, the additional\nor bonus floor area is added to the rear of the existing house; and"
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Such an addition complies with the maximum height,\nmaximum lot coverage, and minimum setback requirements of the Scarsdale\nZoning Code."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "The maximum bonus shall be 400 square feet for lots\nlocated in the A-4 and A-5 Residential Zones, 700 square feet for\nlots located in the A-2, A-2a, and A-3 Residential Zones and twelve\nhundred (1200) square feet for lots located in the A-1 Residential\nZone."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 310-105",
			"title": "Procedures for floor area ratio review of houses in Residence A Zones.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Building permit review. Upon receipt of a building permit application for a house in a Residence A Zone, the Building Department shall determine whether granting the building permit would result in a building FAR in excess of the maximum FAR prescribed under § 310-102."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Houses at or below the maximum FAR. If a house's gross\nresidential floor area does not exceed the maximum FAR, the Building\nDepartment shall proceed with the building permit application, with\nno further FAR review."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Residences above the maximum FAR. Applications for building permits for residences whose total floor area exceeds the maximum permitted FAR shall be required to seek an area variance from the Zoning Board of Appeals in accordance with § 310-87 of the Scarsdale Zoning Code. The Zoning Board of Appeals may also, at its discretion, refer the application to the Board of Architectural Review for an advisory opinion. Any application for an area variance for FAR for a residence shall require the submission of the following additional materials, if available, in addition to those required for the building permit: "
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Elevations of the houses on both sides of the subject\nhouse;"
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Photographs of neighboring houses, structures, and\nyards within 200 feet on either side of the subject house; and"
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Floor area ratios of neighboring houses on similarly\nsized lots within 200 feet on either side of the subject house."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "The applicant shall also provide written or verbal\ntestimony addressing the proofs required for area variances."
												}
											]
										}
									]
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 310-106",
			"title": "Effective date; effect on current applications.",
			"content": [
				{
					"text": "Notwithstanding the effective date of this article,\nany application that has obtained site plan approval, a wetlands permit,\nor cluster subdivision approval from the Planning Board, an area variance\nfrom the Zoning Board of Appeals, and/or final approval from the Board\nof Architectural Review as of March 26, 2002, shall not be subject\nto this article."
				}
			]
		}
	]
}