{
	"url": "http://ecode360.com/7998931",
	"paras": [
		{
			"paragraph": "§ 138-701",
			"title": "Permitted uses.",
			"content": [
				{
					"text": "No structure shall be erected or used and no\npremises shall be used except for one of the permitted uses for which\nproperty may be used in the Residence A District, subject to such\nsite plan and special permit approval as may be provided for therein."
				}
			]
		},
		{
			"paragraph": "§ 138-702",
			"title": "Procedure for special permit.",
			"content": [
				{
					"text": "Any person desiring to use premises for one\nof the foregoing uses permitted by special permit shall petition the\nZoning Board of Appeals for such permit.[1]"
				},
				{
					"footnote": "[1]\nEditor's Note: See Art. XIV, Special Permits.\n"
				}
			]
		},
		{
			"paragraph": "§ 138-703",
			"title": "Mixed or combined uses prohibited.",
			"content": [
				{
					"text": "There shall be only one permitted use on each lot meeting the minimum lot size requirements of § 138-704 of this chapter. The mixing or combining of uses within a single building is specifically prohibited."
				}
			]
		},
		{
			"paragraph": "§ 138-704",
			"title": "Minimum lot size requirements.",
			"content": [
				{
					"text": "No building shall be erected on a lot containing\nless than 20,000 square feet, nor shall more than one principal building\nbe erected on each 20,000 square feet of such lot."
				}
			]
		},
		{
			"paragraph": "§ 138-705",
			"title": "Maximum lot coverage.",
			"content": [
				{
					"text": "Not more than 30% of the area of any lot shall\nbe built upon, including accessory buildings."
				}
			]
		},
		{
			"paragraph": "§ 138-706",
			"title": "Minimum front property line requirements.",
			"content": [
				{
					"text": "No building shall be erected on any lot having\na front property line of less than 125 feet."
				}
			]
		},
		{
			"paragraph": "§ 138-707",
			"title": "Minimum lot width requirements.",
			"content": [
				{
					"text": "No building shall be erected on any lot which\nhas a width at any point less than 90% of the length of the front\nproperty line, unless the area of such lot meets the minimum lot size\nrequirements of this article. In computing such area, no part of the\nlot which falls within the boundaries of the substandard width shall\nbe included."
				}
			]
		},
		{
			"paragraph": "§ 138-708",
			"title": "Minimum setback requirements.",
			"content": [
				{
					"text": "Every part of a principal building shall be\nset back from the front property line of the lot upon which it is\nsituated at least 40 feet."
				}
			]
		},
		{
			"paragraph": "§ 138-709",
			"title": "Minimum lot width at setback line requirements.",
			"content": [
				{
					"text": "No building shall be erected on any lot having a width at the setback line which is less than the minimum front property line required by § 138-706 of this chapter."
				}
			]
		},
		{
			"paragraph": "§ 138-710",
			"title": "Corner lots.",
			"content": [
				{
					"text": "Buildings erected on corner lots shall comply\nwith the minimum front property line and front property line setback\nrequirements for each street upon which the lot abuts."
				}
			]
		},
		{
			"paragraph": "§ 138-711",
			"title": "Minimum side yard requirements.",
			"content": [
				{
					"text": "No building shall be erected on any lot containing\na side yard less than 25 feet in width."
				}
			]
		},
		{
			"paragraph": "§ 138-712",
			"title": "Minimum rear yard requirements.",
			"content": [
				{
					"text": "No principal building shall be erected on any lot containing a rear yard less than 50 feet in depth. Nothing contained herein or in § 138-711 relating to minimum side yard requirements shall be construed to prevent construction, erection, installation, modification, alteration, demolition or change of a swimming pool in such a side or rear yard as long as all provisions of the Swimming Pool Law of the Incorporated Village of Sea Cliff are met with respect thereto.[1]"
				},
				{
					"footnote": "[1]\nEditor's Note: See Ch. 115, Swimming Pools.\n"
				}
			]
		},
		{
			"paragraph": "§ 138-713",
			"title": "Height restrictions.",
			"content": [
				{
					"text": "No building, or any addition to a building,\nhereafter erected shall exceed the lesser of two stories in height\nor a height to the ridge line as follows:"
				},
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Flat, shed and mansard roofs: 28 feet."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Gable, hip and gambrel roofs: 30 feet."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 138-713.1",
			"title": "Height/setback ratio restrictions.",
			"content": [
				{
					"text": "No part of the principal building, other than\nchimneys, turrets, cupolas, spires, belfries and other minor architectural\nfeatures, including but not limited to minor domes, skylights, dormer\nwindows and other ornamental features, shall extend above the height/setback\nratio plane."
				}
			]
		},
		{
			"paragraph": "§ 138-714",
			"title": "Minimum gross floor area requirements.",
			"content": [
				{
					"text": "No principal building shall be erected unless\nit has a minimum gross floor area on the first floor of 2,000 square\nfeet, except that a principal building consisting of more than one\nstory in height may have a minimum gross floor area on the first floor\nof not less than 1,200 square feet if the second floor has access\nfrom the first floor by a permanent interior stairway. For purposes\nof this section, in computing minimum gross floor area, attics, cellars,\nbasements, garages and rooms for heating equipment shall not be included."
				}
			]
		},
		{
			"paragraph": "§ 138-714.1",
			"title": "Maximum floor area ratio restrictions.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "No building shall be hereafter erected or altered\nwhere the floor area ratio (the total proposed floor area of all buildings\non the lot divided by the actual square foot area of the lot) will\nexceed the following maximums:[Amended 3-24-2008 by L.L. No. 5-2008]"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Lot Area(square feet): Up to 2,400 Maximum FAR: 0.50"
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Lot Area(square feet): 2,401 to 3,600 Maximum FAR: 0.44"
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Lot Area(square feet): 3,601 to 4,800 Maximum FAR: 0.38"
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "Lot Area(square feet): 4,801 to 7,200 Maximum FAR: 0.33"
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "Lot Area(square feet): 7,201 to 9,600 Maximum FAR: 0.31"
												}
											]
										},
										{
											"number": "(6) ",
											"content": [
												{
													"text": "Lot Area(square feet): 9,601 to 12,500 Maximum FAR: 0.27"
												}
											]
										},
										{
											"number": "(7) ",
											"content": [
												{
													"text": "Lot Area(square feet): 12,501 to 15,000 Maximum FAR: 0.25"
												}
											]
										},
										{
											"number": "(8) ",
											"content": [
												{
													"text": "Lot Area(square feet): 15,001 to 17,500 Maximum FAR: 0.23"
												}
											]
										},
										{
											"number": "(9) ",
											"content": [
												{
													"text": "Lot Area(square feet): 17,501 to 20,000 Maximum FAR: 0.21"
												}
											]
										},
										{
											"number": "(10) ",
											"content": [
												{
													"text": "Lot Area(square feet): 20,001 to 25,000 Maximum FAR: 0.19"
												}
											]
										},
										{
											"number": "(11) ",
											"content": [
												{
													"text": "Lot Area(square feet): 25,001 to 30,000 Maximum FAR: 0.17"
												}
											]
										},
										{
											"number": "(12) ",
											"content": [
												{
													"text": "Lot Area(square feet): 30,001 to 40,000 Maximum FAR: 0.15"
												}
											]
										},
										{
											"number": "(13) ",
											"content": [
												{
													"text": "Lot Area(square feet): 40,001 and upward Maximum FAR: 0.13"
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Notwithstanding the maximum floor area ratio permitted by each category of lot area, a building may be hereafter erected or altered which exceeds the maximum floor area ratio permitted, provided the floor areas of all buildings on the lot do not exceed the maximum total floor area permitted for the preceding (smaller) category. [Example: on a parcel that is 3,700 square feet parcel, the total floor areas of all buildings on the lot is limited to 1,406 square feet (3,700 X 38%) using the chart in Subsection A. Pursuant to Subsection B, buildings having a total floor area of 1,500 square feet would be permitted, because, even though the FAR exceeds 38% (1,500 ÷ 3,700 = 41%), the total floor area of all buildings on the lot do not exceed 1,584 square feet, the maximum total floor area permitted in the preceding (smaller) category of 2,401 to 3,600 (3,600 X 44% = 1,584). Subsection B only applies when the maximum floor area ratio permitted by a category is exceeded; if the FAR is not exceeded, the total floor area of all buildings on a lot in the 3,601 to 4,800 category could exceed 1,584 square feet (4,800 X 38% = 1,824). In addition, the exception permitted by Subsection B is limited to the maximum total floor area permitted in the preceding (smaller) category.]"
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "The floor area restrictions contained in Local Law\nNo. 5-2008 shall apply to any applications for building permits submitted\non or after April 17, 2008.[Added 11-10-2008 by L.L. No. 11-2008]"
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 138-715",
			"title": "Dwelling unit limitations.",
			"content": [
				{
					"text": "No building hereafter erected in the Residence\nD District shall contain more than one dwelling unit."
				}
			]
		},
		{
			"paragraph": "§ 138-716",
			"title": "Accessory buildings.",
			"content": [
				{
					"text": "In addition to the requirements heretofore imposed,\nthe following additional restrictions are placed on the erection of\naccessory buildings:"
				},
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "No accessory building shall be erected in any front yard. A porch constructed or existing in the front yard and connected to the front wall of the principal building shall be excluded from this Subsection A unless such porch is heated or air conditioned by mechanical means.[Amended 3-9-2009 by L.L. No. 3-2009]"
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "An accessory building erected in a side yard shall\nbe located at least 25 feet from the side property line of the lot."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "An accessory building erected in a rear yard shall\nbe located at least 10 feet from the rear property line and at least\n15 feet from the side property line of the lot."
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "The maximum gross floor area of an accessory building\nshall be 500 square feet."
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "An accessory building shall not exceed a height of\n15 feet."
								}
							]
						},
						{
							"number": "F. ",
							"content": [
								{
									"text": "Only one accessory building having a gross floor area in excess of 120 square feet and a height of eight feet shall be permitted on a lot. Construction or replacement of three or more accessory buildings on a lot shall be permitted only upon application to and issuance of a variance by the Zoning Board of Appeals. For purposes of this Subsection F, air conditioner condenser units shall not be deemed accessory buildings.[Added 6-21-1982 by L.L. No. 2-1982,\neffective 6-24-1982; amended 3-9-2009 by L.L. No. 3-2009]"
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 138-716.1",
			"title": "Ancillary structures.",
			"content": [
				{
					"text": "All ancillary structures shall be subject to and regulated by the provisions of § 138-1205 of this chapter."
				}
			]
		},
		{
			"paragraph": "§ 138-717",
			"title": "Permitted encroachments.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "The following encroachments shall be permitted into\nfront yards:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Cornices, eaves, gutters, chimneys or bay windows\nprojecting not more than 24 inches into such yard."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Steps projecting not more than four feet into such\nfront yard."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "The above encroachments shall also be permitted into\nrear yards, and in addition thereto the following encroachments shall\nbe permitted:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Air-conditioner compressors projecting not more than\nfour feet into such rear yard."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "The above encroachments shall also be permitted into\nside yards; provided, however, that an encroaching air-conditioner\ncompressor shall be screened from view by appropriate fencing or shrubbery."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 138-718",
			"title": "Parking requirements.",
			"content": [
				{
					"text": "Parking requirements are contained in Article X."
				}
			]
		}
	]
}