{
	"url": "http://ecode360.com/13790180",
	"paras": [
		{
			"paragraph": "ยง 470-5",
			"title": "Schedule of Area, Yard and Building Requirements.",
			"content": [
				{
					"text": "The schedule titled \"Schedule of Area, Yard and Building Requirements\"\nwhich accompanies this chapter shall set forth the minimum and/or\nmaximum area, yard, height, building and lot coverage dimensions and\nfloor area ratio for all lots and buildings in the Village of Roslyn,\nexcept as noted below.[1]"
				},
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Corner lots. All detached single-family residential structures on\ncorner lots shall be required to comply with the front yard restriction\nonly on the narrower street front. The depth of yard from the other\nstreet line shall be 25% of the width of the lot but need not be more\nthan 25 feet in the R-1 District, not more than 20 feet in the R-2\nDistrict and the R-C District, and not more than 10 feet in the R-3\nDistrict and the R-WD District. All other uses in all residential\ndistricts located on corner lots shall be required to comply with\nthe front yard requirements on all street frontages."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Landscaped buffers. Any commercial property that, in addition to\nfrontage on a public street, has a property line on a park, waterway,\nor public easement that is utilized or can be seen by the public,\nor adjoins a residential zone, shall maintain landscaping, fencing,\nscreening and walls or a combination thereof that screens outdoor\nstorage, garbage collection, parking, loading, or any other unsightly\nelements or activities."
								}
							]
						}
					]
				},
				{
					"footnote": "[1]\nEditor's Note: The Schedule of Area, Yard and Building Requirements\nis included at the end of this chapter.\n"
				}
			]
		},
		{
			"paragraph": "ยง 470-6",
			"title": "R-1 Low-Density Single-Family Residential District.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Purpose. The R-1 Low-Density Single-Family Residential District is\ndesigned primarily for detached single-family residential dwelling\nunits but in addition provides for residentially supportive institutional\nfacilities which both serve and are compatible with such uses."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Permitted principal uses:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Single-family detached dwellings."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Home occupations may be permitted within a single-family detached\ndwelling subject to the same area, yard and building requirements\nas single-family detached dwellings and the following additional conditions\nand others deemed to be necessary to protect the health, safety and\nwelfare:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "The home occupation shall be consistent with the definition set forth in Article I of this chapter."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "The home occupation shall be carried on only by a member of\nthe family that resides on the premises."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "There shall be no display that will indicate from the exterior\nthat the building is being utilized in whole or part for any other\npurpose than that of a dwelling."
																}
															]
														},
														{
															"number": "(d) ",
															"content": [
																{
																	"text": "No mechanical equipment shall be used other than that which\nis customary for purely domestic and household purposes."
																}
															]
														}
													]
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Special uses. A building may be erected, altered or used for any\npurpose set forth in this subsection only when authorized by the Board\nof Trustees as a special use after a public hearing and for no other:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Church or other place of worship."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Parish house, rectory or Sunday school."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Public library, fire station, park, playground, or public or private\nschool."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "Resident association swimming pools, subject to the following regulations\nand others deemed by the Board of Trustees necessary to protect the\nhealth, safety and welfare:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "At least 60% of the members of the association or membership\ncorporation shall be residents of the Village."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "The association or membership corporation shall not be conducted\nfor profit or gain."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "The Board of Trustees shall determine that the public health,\nmorals, safety, comfort and general welfare of the neighborhood will\nbe secure and that such use will not be detrimental to the general\ncharacter of the neighborhood or to the orderly development of the\nVillage."
																}
															]
														},
														{
															"number": "(d) ",
															"content": [
																{
																	"text": "No permit shall be issued for any such use nor shall any such use of said land be permitted or carried on until the location and size of the plot, site plans and detailed building plans of such pool and any accessory buildings showing dimensions, design, elevations, location and uses of all structures, drainage, sewerage and sanitary facilities, parking areas, entrances, driveways, walks, screening, planting and such other information, including the manner of operation, use and maintenance of such swimming pool, as may be required by the Board have been submitted to and approved by said Board. Such permit may prescribe reasonable rules and regulations for the operation, maintenance and use of such swimming pool and accessory structures. Any violation of this subsection or of any rule or regulation prescribed by the Board of Trustees in the permit or otherwise shall be subject to the remedies and penalties prescribed in ยง 470-116 of this chapter, and in addition thereto any permit issued hereunder may be revoked and canceled forthwith in the event of any such violation."
																}
															]
														},
														{
															"number": "(e) ",
															"content": [
																{
																	"text": "Such permit, when granted, shall not be assigned by the person,\nassociation or membership corporation to which it has been granted."
																}
															]
														}
													]
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "Accessory uses. The following accessory uses on the same lot as the principal use shall be permitted in accordance with Article III:[Amended 9-21-2010 by L.L. No. 1-2010]"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Uses which are customarily incidental to the above permitted uses."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Private residential swimming pools."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Private garages."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "Residential maintenance or tool sheds."
												}
											]
										}
									]
								}
							]
						}
					]
				}
			]
		}
	]
}	