{
	"url": "http://ecode360.com/13790062",
	"paras": [
		{
			"paragraph": "§ 470-5",
			"title": "Schedule of Area, Yard and Building Requirements.",
			"content": [
				{
					"text": "The schedule titled \"Schedule of Area, Yard and Building Requirements\"\nwhich accompanies this chapter shall set forth the minimum and/or\nmaximum area, yard, height, building and lot coverage dimensions and\nfloor area ratio for all lots and buildings in the Village of Roslyn,\nexcept as noted below.[1]"
				},
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Corner lots. All detached single-family residential structures on\ncorner lots shall be required to comply with the front yard restriction\nonly on the narrower street front. The depth of yard from the other\nstreet line shall be 25% of the width of the lot but need not be more\nthan 25 feet in the R-1 District, not more than 20 feet in the R-2\nDistrict and the R-C District, and not more than 10 feet in the R-3\nDistrict and the R-WD District. All other uses in all residential\ndistricts located on corner lots shall be required to comply with\nthe front yard requirements on all street frontages."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Landscaped buffers. Any commercial property that, in addition to\nfrontage on a public street, has a property line on a park, waterway,\nor public easement that is utilized or can be seen by the public,\nor adjoins a residential zone, shall maintain landscaping, fencing,\nscreening and walls or a combination thereof that screens outdoor\nstorage, garbage collection, parking, loading, or any other unsightly\nelements or activities."
								}
							]
						}
					]
				},
				{
					"footnote": "[1]\nEditor's Note: The Schedule of Area, Yard and Building Requirements\nis included at the end of this chapter.\n"
				}
			]
		},
		{
			"paragraph": "§ 470-9",
			"title": "R-4 Low-Density Single-Family Residential - Special Character District.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Purpose. The R-4 District is intended to maintain the character and\nscale of the single-family residential Roslyn Pines and Marchant Park\nneighborhoods and to allow for the appropriate development and redevelopment\nof lots in those areas. The areas included within the zoning designation\nare characterized by single-family detached residences of one to 1 1/2\nstories on lots of 10,000 square feet or more."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Permitted principal uses:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Any principal use permitted in the R-1 District (Low-Density Single-Family\nResidential)."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Special uses. A building may be erected, altered or used for a special\nuse only when authorized by the Board of Trustees as a special use\nafter a public hearing conducted by the Board of Trustees and for\nno other:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Uses permitted as special uses in the R-1 District (Low-Density Single-Family\nResidential)."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "Accessory uses. The following accessory uses on the same lot as the\nprincipal use shall be permitted:[Amended 9-21-2010 by L.L. No. 1-2010]"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Uses permitted as accessory uses in the R-1 District (Low-Density\nSingle-Family Residential)."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "Development standards."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Purpose. The intent of this Subsection E is to provide standards that address the mass and scale of buildings in the R-4 District to ensure that new development and redevelopment are consistent with the existing neighborhood opportunities."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Schedule of regulations. All development in the R-4 District shall be consistent with the standards for the R-1 District shown in the Schedule of Area, Yard and Building Requirements which accompanies this chapter, except as specifically modified by Subsection E(3) through (7) below.[1]"
												},
												{
													"footnote": "[1]\nEditor's Note: The Schedule of Area, Yard and Building Requirements\nis included at the end of this chapter.\n"
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Building height. The maximum height for principal buildings in the R-4 District shall be 24 feet consisting of not more than 1 1/2 stories, except as modified in Subsection E(7) below. In no case shall a principal building exceed 32 feet or two stories. Two-and-one-half-story buildings are not permitted."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "Building coverage. The maximum building coverage for properties in\nthe R-4 District shall not exceed 25%."
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "Maximum floor area ratio. The maximum floor area ratio in the R-4 District shall be 0.275, except as modified in Subsection E(6) below. In no case shall the floor area ratio exceed 0.30."
												}
											]
										},
										{
											"number": "(6) ",
											"content": [
												{
													"text": "Exemptions from the calculation of floor area ratio. For properties\nlocated in the R-4 District, the following areas shall not be included\nin any calculation of floor area ratio:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "Unenclosed ground floor porches, decks, patios and porticos."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "A cellar."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "A basement, if:"
																},
																{
																	"content": [
																		{
																			"number": "[1] ",
																			"content": [
																				{
																					"text": "It does not extend beyond the first-story footprint; and"
																				}
																			]
																		},
																		{
																			"number": "[2] ",
																			"content": [
																				{
																					"text": "All exposed walls facing public streets are less than five feet\nin height as measured from the existing or proposed grade, whichever\nis lower."
																				}
																			]
																		}
																	]
																}
															]
														},
														{
															"number": "(d) ",
															"content": [
																{
																	"text": "A habitable portion of an attic or half story, if:"
																},
																{
																	"content": [
																		{
																			"number": "[1] ",
																			"content": [
																				{
																					"text": "The roof above it is not a flat or mansard roof and has a slope\nof 3° to 12° or steeper;"
																				}
																			]
																		},
																		{
																			"number": "[2] ",
																			"content": [
																				{
																					"text": "It has only one floor;"
																				}
																			]
																		},
																		{
																			"number": "[3] ",
																			"content": [
																				{
																					"text": "It does not extend beyond the footprint of the floors below;"
																				}
																			]
																		},
																		{
																			"number": "[4] ",
																			"content": [
																				{
																					"text": "It is the highest habitable portion of the building, except for a two-story portion as permitted by Subsection E(7) below; and"
																				}
																			]
																		},
																		{
																			"number": "[5] ",
																			"content": [
																				{
																					"text": "Fifty percent or more of the floor area has a ceiling height\nof seven feet or less."
																				}
																			]
																		}
																	]
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(7) ",
											"content": [
												{
													"text": "Exceptions for additional building height and floor area ratio. A\nsecond-story portion of a building with a maximum height of 32 feet\nmay be provided consistent with the following additional standards:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "Additional setback required. No second-story portion of a building\nshall be located less than 20 feet from a side property line."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "Maximum floor area. The floor area for the second-story portion\nof the building shall not exceed the lesser of the following:"
																},
																{
																	"content": [
																		{
																			"number": "[1] ",
																			"content": [
																				{
																					"text": "One-half of the ground floor area; or"
																				}
																			]
																		},
																		{
																			"number": "[2] ",
																			"content": [
																				{
																					"text": "Floor area ratio of 0.125."
																				}
																			]
																		}
																	]
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "Two-story front porches prohibited. No second-story porches\nshall be located on any street-facing facade of the building."
																}
															]
														},
														{
															"number": "(d) ",
															"content": [
																{
																	"text": "Consistent roof form. The roof form used on the second-story\nportion of a building must be consistent with roof forms used on other\nportions of the building."
																}
															]
														},
														{
															"number": "(e) ",
															"content": [
																{
																	"text": "Vertical wall articulation. In order to minimize the impact\nof taller building elements, two-story volumes should be designed\nto include a clearly identifiable base, middle, and top, with horizontal\nelements separating these components. Techniques that can be used\nto achieve this standard include, but are not limited to, belt courses,\nmaterial changes, upper-story setbacks, and varied roof forms."
																}
															]
														},
														{
															"number": "(f) ",
															"content": [
																{
																	"text": "Horizontal wall articulation. A side wall of a building that\nis more than 15 feet high should not extend in an unbroken plane for\nmore than 32 feet along a side lot line. To break the plane, a perpendicular\nwall articulation of not less than four feet, for a distance along\nthe side property line of not less than 10 feet, is required."
																}
															]
														}
													]
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "F. ",
							"content": [
								{
									"text": "Architectural Design Review Board."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Purpose; findings of fact."
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "The R-4 Low-Density Single-Family Residential - Special Character\nDistrict is intended to preserve and promote the character, appearances\nand aesthetics of the Roslyn Pines and Marchant Park neighborhoods\nand to conserve the property values of those neighborhoods by providing\nprocedures for an architectural review of all land developed and all\nstructures henceforth erected, reconstructed, altered or remodeled\nin the R-4 District and by so doing to:[2]"
																},
																{
																	"content": [
																		{
																			"number": "[1] ",
																			"content": [
																				{
																					"text": "Encourage good qualities of exterior building design and good\nappearances and to relate such design and appearances to the sites\nand surroundings of structures."
																				}
																			]
																		},
																		{
																			"number": "[2] ",
																			"content": [
																				{
																					"text": "Preserve the prevailing aesthetic character of the neighborhood\nand geographic area and to enhance the same by means of complementary\nstructures."
																				}
																			]
																		},
																		{
																			"number": "[3] ",
																			"content": [
																				{
																					"text": "Permit originality and resourcefulness in building design and\nappearances which are appropriate to the sites and surroundings."
																				}
																			]
																		},
																		{
																			"number": "[4] ",
																			"content": [
																				{
																					"text": "Promote and encourage good qualities of architectural design\nand utilization of land in the erection and construction of new structures\nand the exterior refurbishing, reconstruction or alteration of existing\nstructures."
																				}
																			]
																		},
																		{
																			"number": "[5] ",
																			"content": [
																				{
																					"text": "Assure that the design and location of any proposed structure\nor the addition, alteration or reconstruction of any existing structure\nis in harmony with the existing topography of its site and/or the\nexisting structure as well as the neighboring geographic area and\nexisting property."
																				}
																			]
																		},
																		{
																			"number": "[6] ",
																			"content": [
																				{
																					"text": "Discourage and prevent such design that would adversely affect\nor cause the diminution in value of neighboring property, whether\nimproved or unimproved."
																				}
																			]
																		},
																		{
																			"number": "[7] ",
																			"content": [
																				{
																					"text": "Prevent such design and appearances as are unnecessarily offensive\nto visual sensibilities, which impair the use, enjoyment, value or\ndesirability of neighboring properties and the health, safety and\ngeneral welfare of the community at large."
																				}
																			]
																		}
																	]
																},
																{
																	"footnote": "[2]\nEditor's Note: Amended at time of adoption of Code (see Ch. 1, General Provisions, Art. II).\n"
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "The Board of Trustees hereby finds it necessary to create a\nmechanism for architectural review since:"
																},
																{
																	"content": [
																		{
																			"number": "[1] ",
																			"content": [
																				{
																					"text": "Structures which are visually offensive or inappropriate by\nreason of poor exterior design, poor site layout, monotonous similarity\nor striking visual discord or dissimilarity in relation to their site\nor surroundings would mar the appearance of and adversely affect the\ndesirability of the immediate area and neighboring areas."
																				}
																			]
																		},
																		{
																			"number": "[2] ",
																			"content": [
																				{
																					"text": "Such structures would discourage and prevent the most appropriate\ndevelopment and utilization of land throughout the R-4 District."
																				}
																			]
																		},
																		{
																			"number": "[3] ",
																			"content": [
																				{
																					"text": "Such structures would impair the use, enjoyment and desirability\nand stability of both improved and unimproved property and are detrimental\nto the character of neighborhoods, produce degeneration of the values\nof real property with attendant deterioration of conditions affecting\nthe functioning, economic stability, prosperity, health and safety\nof the inhabitants of the Village and destroy a proper relationship\nbetween the taxable value of real property and the cost of municipal\nservices provided therefor."
																				}
																			]
																		}
																	]
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "It is the purpose of this Subsection F to prevent these and other harmful effects and thus to promote the health, safety and general welfare of the community."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Delegation of authority. There is hereby created an Architectural\nDesign Review Board consisting of five members who shall serve without\ncompensation. Members of the Board shall be residents of the Village\nof Roslyn and reside in the R-4 District, and all members of said\nBoard shall be persons qualified by reason of training or experience\nin architecture, land development, community planning, real estate,\nlandscape architecture or other relevant business or profession or\nby reason of civic interest and sound judgment to determine the effects\nof a proposed building or structure (including additions or exterior\nalterations thereto), a group of buildings or structures or plan of\nbuilding development on the desirability, property values and development\nof surrounding areas and the development of the Village as a whole.\nThe members of the Board shall be appointed by the Mayor, subject\nto the approval of the Board of Trustees. The Mayor shall, upon the\nenactment of this section and thereafter at the annual organizational\nmeeting, designate the Chairperson and Vice Chairperson of the Board,\nsubject to the approval of the Board of Trustees, and the persons\nso designated shall serve as Chairperson and Vice Chairperson at the\npleasure of the Mayor and Board of Trustees. From and after the effective\ndate of this section, the respective terms of appointed members of\nthe Board, in the order of their appointment, shall be one, two, three,\nfour, and five years. Thereafter, appointments shall be for a term\nof five years. The Board of Trustees shall have the power to remove\nany such member for cause. Vacancies shall be filled by the Mayor,\nsubject to the approval of the Board of Trustees, for the unexpired\nterm of any member whose place has become vacant. The Superintendent\nof Buildings shall act in an advisory capacity without voting power."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Meetings of Board. Meetings of the Board shall be held at such times\nas the Board may determine and otherwise at the call of the Chairperson\nor, in his absence, the Vice Chairperson. A majority of the members\nof the Board shall constitute a quorum for the transaction of business.\nAll actions taken by the Board shall be by a majority of the members\nthereof. The Board shall keep minutes of its proceedings, showing\nthe vote of each member on each question, or, if absent or failing\nto vote, indicating such fact, and shall also keep records of its\nexaminations and other official actions."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "Powers of Board. The Board shall have the power, from time to time, to adopt, amend and repeal rules and regulations, not inconsistent with law or the provisions of this section, governing its procedure and the transaction of its business and for the purpose of carrying into effect the standards outlined in Subsection F(1) hereof, which rules and regulations or amendments thereto shall become effective upon ratification by the Board of Trustees."
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "Referral procedures."
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "The Board shall review and advise on all of the following:"
																},
																{
																	"content": [
																		{
																			"number": "[1] ",
																			"content": [
																				{
																					"text": "All applications for the construction of any new building or\nstructure within the R-4 District."
																				}
																			]
																		},
																		{
																			"number": "[2] ",
																			"content": [
																				{
																					"text": "All applications for alterations, additions or reconstruction\nof any building or structure within the R-4 District which will increase\nthe building lot coverage in excess of 25% thereof."
																				}
																			]
																		}
																	]
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "If any building in the R-4 District for which a building permit\nis sought is one of a group of six or more buildings proposed to be\nconstructed in the same vicinity, none of which buildings is to be\nsituated at a distance of more than 250 feet from some other building\nof the group, whether or not such buildings are to be constructed\non contiguous plots, and whether or not the permits for the other\nbuildings of the group are applied for by the same applicant, said\napplication shall be accompanied by a plan of building development\nfor the entire group, clearly setting forth the entire site layout\nand the designs of the exterior appearance of all the proposed buildings\nin the group."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "A preliminary conference may be held between the Board and the\napplicant prior to the preparation and submission of a formal submission.\nThe intended purpose of such a conference is to enable the applicant\nto inform the Board of the proposal prior to the preparation of a\ndetailed submission and to provide the Board with an opportunity to\nreview the basic design concept, to advise the applicant as to potential\nproblems and concerns and to generally determine the information to\nbe required on the formal submission."
																}
															]
														},
														{
															"number": "(d) ",
															"content": [
																{
																	"text": "The Board shall require an application which shall include,\nbut not be limited to, the following:"
																},
																{
																	"content": [
																		{
																			"number": "[1] ",
																			"content": [
																				{
																					"text": "A plan or plans drawn at a scale of 1/4 inch which clearly indicate\nthe following:"
																				},
																				{
																					"content": [
																						{
																							"number": "[a] ",
																							"content": [
																								{
																									"text": "The dimensions, orientation and area of the building plot with\nsetback dimensions clearly indicated."
																								}
																							]
																						},
																						{
																							"number": "[b] ",
																							"content": [
																								{
																									"text": "The size, shape and location of existing and proposed construction\nand relationship to adjacent properties, buildings and structures."
																								}
																							]
																						},
																						{
																							"number": "[c] ",
																							"content": [
																								{
																									"text": "A summary of areas of existing or proposed buildings and an\nindication of their proposed uses."
																								}
																							]
																						},
																						{
																							"number": "[d] ",
																							"content": [
																								{
																									"text": "Locations of existing streets, points of entry and egress for\nmotor vehicles and locations and layout of all paved areas, including\noff-street parking."
																								}
																							]
																						},
																						{
																							"number": "[e] ",
																							"content": [
																								{
																									"text": "Location of existing and proposed plantings and screening devices,\nwalls, fences and railings and their height and the materials of their\nconstruction."
																								}
																							]
																						},
																						{
																							"number": "[f] ",
																							"content": [
																								{
																									"text": "Indication of exterior lighting adequate to determine its character\nand to enable review of possible hazards and disturbances to the public\nand adjacent properties."
																								}
																							]
																						},
																						{
																							"number": "[g] ",
																							"content": [
																								{
																									"text": "Indication of other potential disturbances to the public and\nadjacent properties."
																								}
																							]
																						}
																					]
																				}
																			]
																		},
																		{
																			"number": "[2] ",
																			"content": [
																				{
																					"text": "Photographs of the site and adjacent areas and structures sufficient\nto provide adequate representation thereof."
																				}
																			]
																		},
																		{
																			"number": "[3] ",
																			"content": [
																				{
																					"text": "Detailed drawings of decorative elements."
																				}
																			]
																		},
																		{
																			"number": "[4] ",
																			"content": [
																				{
																					"text": "Sectional drawings to explain the character of the design."
																				}
																			]
																		},
																		{
																			"number": "[5] ",
																			"content": [
																				{
																					"text": "All site plan applications, if any, submitted to the Village\nBoard of Trustees.[Amended 6-17-2014 by L.L. No. 8-2014]"
																				}
																			]
																		},
																		{
																			"number": "[6] ",
																			"content": [
																				{
																					"text": "Complete and accurate exterior elevations of all facades, drawn\nat a scale adequate to show clearly the appearance of all proposed\nbuildings and structures."
																				}
																			]
																		}
																	]
																}
															]
														},
														{
															"number": "(e) ",
															"content": [
																{
																	"text": "The Board may waive any of the requirements of Subsection F(5)(c) and (d) above where, due to character, size, location or special circumstances, any particular information, or the preliminary conference, is not required in order for the Board to properly perform its review."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(6) ",
											"content": [
												{
													"text": "Reasons for disapproval of application; approval of application."
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "The Board shall disapprove any application referred to it if\nthe Board finds that the application, if granted, would be detrimental\nto the character, property values or development of the R-4 District,\nthe surrounding area or of the Village as a whole by reason of any\nof the following:"
																},
																{
																	"content": [
																		{
																			"number": "[1] ",
																			"content": [
																				{
																					"text": "Excessive similarity of design in relation to any other structure\nexisting or for which a permit has been issued, or to any other structure\nincluded in the same permit application, in respect to one or more\nof the following features, such as, but not limited to, doors, windows,\nporticos or other openings or breaks in the facade facing the street,\nincluding reverse arrangement, or other significant identical features,\nsuch as, but not limited to, construction material, roofline and height\nor other design elements, provided that a finding of excessive similarity\nof design shall include not only that such similarity exists but also\nthat it is of such a nature as to produce undesirable effects."
																				}
																			]
																		},
																		{
																			"number": "[2] ",
																			"content": [
																				{
																					"text": "Excessive dissimilarity of design or inappropriateness of design\nor of the site plan in relation to any other building or structure\nexisting or for which a permit has been issued, or to any other building\nor structure included in the same permit application, or inappropriateness\nor excessive dissimilarity of design in relation to the characteristics\nof building design generally prevailing in the R-4 District of the\nVillage, in respect to one or more of the following features: cubical\ncontents; gross floor area; height of building or height of roof;\nother significant design features, such as, but not limited to, construction\nmaterial or quality or architectural design; or yard dimensions, provided\nthat a finding of excessive dissimilarity or inappropriateness of\ndesign shall include not only that such dissimilarity or inappropriateness\nexists but also visual offensiveness, inappropriateness, inconsistency\nof design or other poor qualities of exterior design, including considerations\nof the harmony or discord of colors or materials or incompatibility\nof the proposed building or structure with the terrain on which it\nis to be located, including but not limited to excessive divergences\nof the height or levels of any part of the building or structure from\nthe grade of the terrain that are of such a nature as to produce undesirable\neffects."
																				}
																			]
																		},
																		{
																			"number": "[3] ",
																			"content": [
																				{
																					"text": "A finding that the building or structure for which the permit was requested, if erected or altered in accordance with the submitted plan, would not be in harmony with the purpose of this Subsection F; would be visually offensive or inappropriate by reason of poor quality of exterior design or inappropriateness of design in relation to any other building or structure; would mar the appearance of the area; would impair the use, enjoyment and desirability or reduce the values of properties in the area; would be detrimental to the character of the neighborhood; would prevent the most appropriate development and utilization of the site or of adjacent lands; or would adversely affect the functioning, economic stability, prosperity, health, safety and general welfare of the entire community."
																				}
																			]
																		}
																	]
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "In disapproving any application, the Board may specify modifications in the design of the buildings or structures or any of them or in requirements as to yard or other dimensions that will be adequate to render the same acceptable under the provisions of this Subsection F."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "In approving any application, the Board may impose appropriate\nconditions and safeguards designed to prevent undesirable effects."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(7) ",
											"content": [
												{
													"text": "Issuance of building permit. The Superintendent of Buildings shall\nonly issue a building permit for which the application has been approved\nby the Board. If, within 90 days after the date on which an application\nhas been duly filed, or within such longer period as may have been\nconsented to by the applicant, the Board has not disapproved the same,\nthe application shall be deemed denied.[Amended 9-21-2010 by L.L. No. 1-2010]"
												}
											]
										},
										{
											"number": "(8) ",
											"content": [
												{
													"text": "Referral of subdivision plats to Board. Every subdivision plat filed\nwith the Board of Trustees relating to the R-4 District shall be referred\nto the Board within 30 days after the date on which the same was fully\nfiled, and the Board shall, within 120 days after said date of filing,\nreport its recommendations thereon, if any, to the Board of Trustees.\nIn considering any such plat, the Board may require the proposed developer\nof the land covered by the plat to submit a plan of proposed building\ndevelopment, including drawings showing the design of the exterior\nappearance of all proposed buildings and structures.[Amended 9-21-2010 by L.L. No. 1-2010]"
												}
											]
										},
										{
											"number": "(9) ",
											"content": [
												{
													"text": "Appeals. Any person aggrieved by any action of the Board may appeal\ntherefrom to the Zoning Board of Appeals of the Village. The Zoning\nBoard of Appeals may reverse, modify or affirm the action of the Board."
												}
											]
										},
										{
											"number": "(10) ",
											"content": [
												{
													"text": "Fees. Every application hereunder shall be accompanied by a\nfee payable to the Village Clerk/Treasurer in such amount as determined\nfrom time to time by resolution of the Board of Trustees."
												}
											]
										},
										{
											"number": "(11) ",
											"content": [
												{
													"text": "Independent consultant; reimbursable expenses. The Board shall\nbe permitted to hire an independent architectural consultant to advise\nit on any application it deems appropriate. The applicant shall be\nresponsible for all consultant fees. No building permit shall be issued\nto the applicant until all expenses incurred by the Architectural\nDesign Review Board for consultation fees (including but not limited\nto architectural and legal expenses) or other extraordinary expenses\nin connection with the review of an application are reimbursed to\nthe Village by the applicant. At the time of application, the applicant\nshall deposit with the Village Clerk/Treasurer such amount to cover\nconsultation fees and extraordinary expenses. In instances where such\nexpenses are minimal, the requirement for reimbursement of expenses\nmay be waived by resolution of the Architectural Design Review Board."
												}
											]
										}
									]
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 470-21",
			"title": "Off-street parking.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "General regulations. In any district the following regulations with\nrespect to off-street parking shall apply. No application shall be\nmade for a building permit for the construction, alteration or use\nof any building, structure or premises for any purposes, and no building\npermit for such purposes shall be issued, unless the parking spaces\nshall be provided as follows:"
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Alternate parking relief; Parking Trust Fund."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Legislative intent. The Board of Trustees hereby finds that a shortage of municipal and private off-street parking exists within the Village, thus creating congestion and also causing a negative impact upon the viability of the Village's business community. The Board also finds that an alternate method of obtaining a parking variance other than that set forth in § 470-114B(2)(b) will be in the best interests of the Village and will promote the health, safety and welfare of the community. Accordingly, in order to further the goal of creating future municipal and private off-street parking in the Village, the Board hereby seeks to establish a Parking Trust Fund."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Creation of Parking Trust Fund. There is hereby created a Parking\nTrust Fund in the Incorporated Village of Roslyn for the purpose of\nreceiving funds upon the granting of alternate parking variances and\nfor the further purpose of providing a source of funds for the provision\nof future municipal off-street parking, including the acquisition\nof land for said purpose."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Alternate parking variance procedure. In addition to the granting of parking variances pursuant to § 470-114B(2)(b) of this chapter, the Zoning Board of Appeals shall be authorized to grant an alternate form of variance as set forth herein. The Zoning Board of Appeals may vary the parking requirements established in this section by reducing the number of parking spaces required for a specific use or structure at the property under consideration, provided that any such variance shall only be granted subject to a condition requiring a payment to the Village of the sum of $2,000 per parking space so waived, varied or modified for deposit by the Village into the Parking Trust Fund."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "Dedicated trust fund. Any moneys deposited into the Parking Trust\nFund shall constitute a trust fund to be used by the Board of Trustees\nexclusively for municipal off-street parking, including the acquisition,\nimprovement and maintenance of land, facilities or parking equipment\nfor said purpose."
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "Payment required. Payment of the required fee to the Parking Trust\nFund pursuant to an alternate parking variance grant of the Zoning\nBoard of Appeals shall be a prerequisite to the issuance of a building\npermit or other municipal certificate."
												}
											]
										}
									]
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 470-22",
			"title": "Off-street parking areas, loading areas and driveways.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Residential use."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "All driveways and parking areas serving one-family and two-family\ndwellings shall be paved or graveled to handle adequately the vehicles\nfor which provision is made. All driveways and parking areas serving\nmultifamily developments shall be paved in accordance with the specifications\nof the Village Department of Public Works."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "The off-street parking facilities required for one-family, two-family\nand multifamily developments shall be on the same lot or parcel of\nland as the building they are intended to serve.[Amended 9-21-2010 by L.L. No. 1-2010]"
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "No parking of vehicles shall be permitted in landscaped, lawn or\nsidewalk areas nor, as to multifamily developments, in fire lanes,\nbuffer areas or within five feet of any property line."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "On state highways or other arterial roads, only one access road to\nparking areas shall be permitted. On all other roads, access points\nfrom any one lot crossing the street line shall be limited to a maximum\nof two along the frontage of any single street. The center lines of\nany separate access points shall be spaced at least 45 feet apart,\nshall handle no more than two lanes of traffic, shall be at least\n10 feet from any property side lines, and shall be set back from the\nstreet line of any intersecting street at least 50 feet. Continuous\nopen driveways in excess of 16 feet at the street line shall be prohibited,\nexcept that two-way driveways serving multifamily developments shall\nbe at least 22 feet wide. In all instances, due consideration shall\nbe given to the proposed width, curbing, direction of traffic flow,\nradii of curves and method of dividing traffic lanes. Curbing shall\nbe depressed at the driveway or may be rounded at the corners and\nthe driveway connected with the street in the same manner as another\nstreet."
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "All parking areas serving multifamily developments shall be designed\nto permit each vehicle to proceed to and from the parking space provided\nfor it without the moving of any other vehicle, except in the case\nof a space in front of an enclosed garage. Aisles providing access\nto parking spaces shall have the following minimum dimensions:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "Where the angle of the parking is different on both sides of\nthe aisle, the larger aisle width shall prevail."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "All parking stalls shall have a minimum width of nine feet and\na minimum depth of 18 feet, except that all handicapped spaces shall\nbe in compliance with ICC/ANSI A117.1 as adopted by the New York State\nBuilding Code.[Amended 12-15-2009 by L.L. No. 5-2009]"
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(6) ",
											"content": [
												{
													"text": "No part of the parking area shall be used for the storage or abandonment\nof any article or material."
												}
											]
										},
										{
											"number": "(7) ",
											"content": [
												{
													"text": "No commercial vehicle shall be parked or stored outdoors overnight\nin any residential zone, and only one such vehicle per lot may be\nhoused in such districts, provided that it is housed within a garage\nat all times.[1]"
												},
												{
													"footnote": "[1]\nEditor's Note: Amended at time of adoption of Code (see Ch. 1, General Provisions, Art. II).\n"
												}
											]
										},
										{
											"number": "(8) ",
											"content": [
												{
													"text": "Access driveways shall be marked with arrows indicating proper flow\nof traffic, and individual parking spaces shall be shown."
												}
											]
										},
										{
											"number": "(9) ",
											"content": [
												{
													"text": "Parking areas serving multifamily developments shall be illuminated\nat night. Such illumination, lighting and screening shall be subject\nto the prior written approval of detailed plans submitted to the Building\nInspector and shall be so constructed, arranged and shielded that\nno direct light rays from any light or fixture used in such illumination\nshall constitute a nuisance to the occupants of any neighboring residences\nor buildings. Any lighting or illumination constituting such a nuisance\nis hereby strictly prohibited."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Nonresidential uses."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Landscaping. To the maximum extent possible, each off-street parking\narea shall have a minimum landscaped area equivalent to one parking\nspace per every 10 parking spaces, with 1/2 said area having shrubs\nno higher than three feet and the other half having trees with branches\nno lower than seven feet. Such landscaped areas shall be distributed\nthroughout the parking area in order to break the view of long rows\nof parked cars in a manner not impairing visibility and shall be provided\nseparate and apart from the requirements for buffers as specified\nelsewhere in this chapter."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Surfacing and curbing. All driveways and parking areas serving nonresidential\nuses shall be paved and curbed in accordance with the specifications\nof the Village Department of Public Works."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Access driveways shall be marked with arrows indicating proper flow\nof traffic, and individual parking spaces shall be striped."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "Parking areas shall be illuminated at night during the business hours\nof the building which they serve. Such illumination, lighting and\nscreening shall be subject to the prior written approval of detailed\nplans submitted to the Building Inspector and shall be so constructed,\narranged and shielded that no direct light rays from any light or\nfixture used in such illumination shall constitute a nuisance to the\noccupants of any neighboring residences or buildings. Any lighting\nor illumination constituting such a nuisance is hereby strictly prohibited."
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "Access. On state highways or other arterial roads, only one access\nroad to parking areas shall be permitted. On all other roads, access\npoints from any one lot crossing the street line shall be limited\nto a maximum of two along the frontage of any single street. The center\nlines of any separate access points shall be spaced at least 45 feet\napart, shall handle no more than two lanes of traffic, shall be at\nleast 10 feet from any property side lines, and shall be set back\nfrom the street line of any intersecting street at least 50 feet.\nContinuous open driveways in excess of 16 feet at the street line\nshall be prohibited, except that two-way driveways serving multifamily\ndevelopments shall be at least 22 feet wide. In all instances, due\nconsideration shall be given to the proposed width, curbing, direction\nof traffic flow, radii of curves and method of dividing traffic lanes.\nCurbing shall be depressed at the driveway or may be rounded at the\ncorners and the driveway connected with the street in the same manner\nas another street."
												}
											]
										},
										{
											"number": "(6) ",
											"content": [
												{
													"text": "Location of parking and loading."
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "No parking of vehicles shall be permitted in fire lanes, driveways,\nlandscaped areas, aisles, buffer areas, sidewalks or turning areas\nor within five feet of any property line."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "Except where permitted in the HS-O Historic/Scenic Overlay District\nas part of a shared parking arrangement, off-street parking facilities\nrequired for nonresidential uses shall be provided within 400 feet\nof the building they are intended to serve, measured between the nearest\npoint of the off-street parking facilities and the nearest point of\nthe building. All such parking spaces shall be owned, leased or otherwise\nunder the control of the user of the nonresidential use."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "No parking space or aisle shall be provided within a ten-foot\nsetback from the public street right-of-way."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(7) ",
											"content": [
												{
													"text": "Type of facility. The provision of parking spaces shall also include\nadequate driveway and necessary turning areas for handling the vehicles\nfor which provision is made. Parking areas shall be designed to permit\neach motor vehicle to proceed to and from the parking space provided\nfor it without requiring the moving of any other motor vehicles."
												}
											]
										}
									]
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 470-23",
			"title": "Garages.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "In the residential districts, a private detached or attached garage\naccessory to a dwelling on the same lot or parcel shall be erected\nin a rear yard or side yard."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "In any residential district where residential use is permitted, a\nprivate detached or attached garage shall be permitted as an accessory\nuse to a multiple-family dwelling as part of the site plan approval\nprocess."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "In any R-1 or R-2 District, no accessory garage shall be erected\nto house more than two passenger vehicles, unless a special permit\ntherefor shall have been granted by the Board of Trustees.[1]"
								},
								{
									"footnote": "[1]\nEditor's Note: Original § 15.303D, which immediately followed this subsection and dealt with commercial vehicles, was deleted at time of adoption of Code (see Ch. 1, General Provisions, Art. II). See § 470-22A(7).\n"
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "No garage shall exceed 17 feet in height."
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "No garage shall have less than a three-foot side yard setback and\na three-foot rear yard setback."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 470-24",
			"title": "Open storage.",
			"content": [
				{
					"text": "No property shall be used for the open storage of any article,\nmerchandise, material, machinery, vehicles or other related items."
				}
			]
		},
		{
			"paragraph": "§ 470-25",
			"title": "Accessory buildings and structures.",
			"content": [
				{
					"text": "Except for outdoor pools, decks and garages, the following regulations\nshall apply to accessory buildings and structures in any residence\ndistrict:"
				},
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "A detached accessory building or structure may be located in and\nmay occupy not more than 30% of the area of any rear yard and shall\nbe located a distance of at least:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Eight feet from any dwelling or main building."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "One foot from any lot line, with no cornice overhanging such building\nmore than six inches."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Forty-five feet from any street line, except that on a corner lot\nthe distance shall be at least 45 feet from the line of the street\nof narrower frontage and 15 feet from the line of the street of greater\nfrontage."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "No accessory building or structure shall have a dimension in excess\nof 100 square feet in area, nor shall such building or structure exceed\n10 feet in height."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "No accessory building may be used for habitable space."
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "Mechanicals and other equipment, including, but not limited to, generators,\ncentral-air-conditioning units, pool pumps and any noise- or vibration-producing\nequipment shall require a permit and shall be installed and located\nas follows:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Equipment may only be installed in the rear yard in conformance with\nthe setback requirements for the zoning district in which it is located."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Distances to other structures and equipment shall comply with the\nNew York State Building Code in effect at the time and the manufacturer's\ninstallation requirements."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Equipment shall be screened to minimize the visual and acoustical\nimpacts to surrounding properties. Screening will comply with the\nrequirements of the Village of Roslyn Historic District Board when\nthe installation is within the Roslyn Historic District."
												}
											]
										}
									]
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 470-26",
			"title": "Unlicensed or inoperative motor vehicles; motor vehicle repairs.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "No lot or parcel shall be used for the outside storage of an inoperative\nor unlicensed motor vehicle or vehicles except as otherwise permitted\nin this chapter. No repairs shall be made to such vehicle or vehicles\noutside of enclosed buildings. Nothing herein shall be construed to\nprohibit the storage of such vehicle or vehicles inside a garage or\nother building located on the premises, provided that such vehicle\nor vehicles are owned by the owner or occupant of the principal residence."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Motor vehicle repairs."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "The following uses shall not be permitted in any residential district:\nmotor vehicle repairs of a major nature, including but not limited\nto auto painting, body work or extensive mechanical repairs. Nothing\ncontained herein shall be deemed to prohibit either emergency repairs\nor preventive maintenance of a minor nature, such as an oil change\nor tune-up; provided, however, that such preventive maintenance is\nperformed upon the premises by an individual who is an occupant of\nsaid premises and that the motor vehicle upon which the emergency\nrepairs and/or preventive maintenance is being performed is registered\nin the name of the occupant of said premises."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "The following uses shall not be permitted in all other zoning districts:\nall motor vehicle repairs are hereby prohibited, except for emergency\nrepairs, on all public streets in all zoning districts other than\nresidential, throughout the Village of Roslyn."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "The following uses shall not be permitted in municipal parking fields:\nall motor vehicle repairs are hereby prohibited in all municipal parking\nfields."
												}
											]
										}
									]
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 470-27",
			"title": "Satellite dish antennas.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Purpose. The Board of Trustees hereby determines that in a community\nsuch as the Village of Roslyn, comprised principally of one-family\nhomes, many of which are of historic significance, the aesthetic impact\nof large parabolic or hemispheric discs or other similar antennas\nor devices measuring several feet in diameter can be offensive to\nthe residential community and be inconsistent with the character of\nthe neighborhood. If unregulated, such devices can be disruptive to\nthe appearance of the skyline and disrupt the pleasant nature and\ncharacter of the community. Also, the interests of public safety require\nthat such devices be installed in accordance with well-defined engineering\nstandards, and other safety measures, such as fencing around the base,\nmay be necessary. These aesthetic and safety concerns do not arise\nin connection with dipole antennas, which blend into the skyline.\nThe Board also finds that a regulatory scheme such as is set forth\nherein allows a reasonable balancing of the needs of the community\nand the rights of persons to reasonable access to television or radio\nstations that they desire and to allow such antennas to fit into the\ncharacter of the community."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Compliance required. No person shall cause, suffer or permit the\nerection, construction, installation, relocation and/or maintenance\nof any parabolic or hemispheric disc or satellite receive-only antenna\nor other similar antenna or device, the purpose of which is to receive\ntelevision, radio and/or microwave or other electrical or similar\nsignals from satellites or from ground facilities which transmit such\nsignals, except as provided herein."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Permit required."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "In any commercial or industrial district, a satellite receive-only\nantenna two meters or less in diameter is permitted without permit."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "In any district other than a commercial or industrial district, a\nsatellite receive-only antenna one meter or less in diameter is permitted\nwithout permit."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "In all other instances, no erection, construction, installation and/or\nmaintenance of any satellite dish antenna shall be permitted or continued\nexcept when permitted by special use permit by the Zoning Board of\nAppeals after public hearing. The first permit granted to any applicant\nunder this section shall be conditional and shall be for a period\nof not more than two years. Any application for renewal of such conditional\npermit shall be acted upon in the same manner as an initial application.[1]"
												},
												{
													"footnote": "[1]\nEditor's Note: Amended at time of adoption of Code (see Ch. 1, General Provisions, Art. II).\n"
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "Requirements for special use permits."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "In evaluating whether a special use permit should be issued, the\nZoning Board of Appeals shall consider the purposes set forth in this\nsection.[2]"
												},
												{
													"footnote": "[2]\nEditor's Note: Amended at time of adoption of Code (see Ch. 1, General Provisions, Art. II).\n"
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "The antenna or other device shall be located only in the rear yard\nof the lot unless the applicant establishes that other placement is\nnecessary to obtain reasonable reception."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "No permit shall be issued if the Zoning Board of Appeals finds that\neither the type of antenna or disc or the method of its placement\nwill endanger the safety of residents, neighbors or pedestrians or\nthreaten property on the applicant's lot or adjoining lots.[3]"
												},
												{
													"footnote": "[3]\nEditor's Note: Amended at time of adoption of Code (see Ch. 1, General Provisions, Art. II).\n"
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "Use of any illumination for the disc or antenna is strictly prohibited."
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "All connections shall be made so that wiring and supporting cables\nshall not be visible from the street or sidewalk."
												}
											]
										},
										{
											"number": "(6) ",
											"content": [
												{
													"text": "No more than one parabolic, hemispheric, satellite receive-only,\nor similar antenna shall be erected, constructed, installed or maintained\non a single lot or premises."
												}
											]
										},
										{
											"number": "(7) ",
											"content": [
												{
													"text": "The Board of Appeals shall impose such screening requirements that\nare reasonable to effectuate the purposes set forth in this section\nand that will not substantially limit reception."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "Application for permit. All applications for special use permits\nshall be filed with the Zoning Board of Appeals. The application shall\ndescribe the subject premises by street address and by section, block\nand lot number and shall describe the present use of the premises.\nIn addition, the application shall be accompanied by the following:[4]"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "A location survey showing existing structures upon the premises,\ntheir location and distance from the proposed disc or antenna, the\ndimensions of the parabolic disc or antenna, the setbacks of the parabolic\ndisc or antenna from each property line and all properties and structures\nwithin a two-hundred-foot radius of the premises, showing the names\nand street addresses of the record owner of such property."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "A detailed plan showing the material from which the parabolic disc\nor antenna is to be constructed and the proposed color of the parabolic\ndisc or antenna and details illustrating the structural support system."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "A landscape plan illustrating adequate screening of the parabolic\ndisc or antenna which will be provided to screen the parabolic disc\nor antenna from the roadway and adjoining property owners. Unless\ndemonstrated to be impracticable, all screening required shall be\nby coniferous trees and shall be of sufficient height and density\nto screen 100% of the parabolic disc or antenna from sight at ground\nlevel from the roadway and from properties located within a two-hundred-foot\nradius of the premises during the entire year."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "An application fee which shall be as set forth in § 470-115."
												}
											]
										}
									]
								},
								{
									"footnote": "[4]\nEditor's Note: Amended at time of adoption of Code (see Ch. 1, General Provisions, Art. II).\n"
								}
							]
						},
						{
							"number": "F. ",
							"content": [
								{
									"text": "Notice required. Prior to the public hearing held by the Zoning Board\nof Appeals, the applicant shall file a certification of notice showing\nthat all property owners within 200 feet of the applicant's property\nwere notified, in writing, by the applicant of the application, by\ncertified mail, return receipt requested, at least 10 days and no\nmore than 21 days before the date scheduled for the public hearing.[5]"
								},
								{
									"footnote": "[5]\nEditor's Note: Amended at time of adoption of Code (see Ch. 1, General Provisions, Art. II).\n"
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 470-28",
			"title": "Retaining walls.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "No retaining wall may be built within the Village unless the Building\nInspector issues a permit for its construction. Application for a\npermit shall be made on a form promulgated by the Building Inspector."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Permit application."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "No permit will be issued for a retaining wall unless:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "The application is accompanied by plans for the development of the\nland that the retaining wall is intended to support and of any other\nland on the same tax lot or lots; or"
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "The application demonstrates a serious erosion or flooding problem\nor a serious threat to public health and safety which can be solved\nby a retaining wall or walls."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "The Building Inspector may require additional information to evaluate\napplications presented under this subsection."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "In a residential zoning district, or within 50 feet of a residential\nzoning district, no retaining wall may exceed five feet in height.\nIn other districts, no retaining wall may exceed eight feet in height.\nHeight shall be measured from the lowest point on the adjoining grade.\nThis subsection shall not prohibit applications for a series of retaining\nwalls in a parallel step design."
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "A minimum of five horizontal feet is required between retaining walls\nin parallel step design. The area between such retaining walls must\nbe landscaped with natural material and must be maintained."
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "No retaining wall may exceed the height of the adjoining grade that\nit supports or retains."
								}
							]
						},
						{
							"number": "F. ",
							"content": [
								{
									"text": "Provision must be made to accommodate stormwater on a property during\nconstruction and after completion of a retaining wall."
								}
							]
						},
						{
							"number": "G. ",
							"content": [
								{
									"text": "The height restrictions of this section do not apply to retaining\nwalls whose construction was completed and which were backfilled prior\nto the effective date of this chapter. If such walls are determined\nto be unsafe by the Building Inspector or by a licensed engineer or\narchitect, they may be repaired, subject to approval by the Building\nInspector, provided that the repaired structure is of the same, or\nsmaller, size and type. If such walls are demolished or abandoned,\nhowever, any replacement retaining wall must conform to this article."
								}
							]
						},
						{
							"number": "H. ",
							"content": [
								{
									"text": "If the property is in the Historic/Scenic Overlay District, permission\nmust first be received by the Historic District Board prior to construction\nof a retaining wall."
								}
							]
						},
						{
							"number": "I. ",
							"content": [
								{
									"text": "Timber cribbing, timber walls of any type, prefabricated pipe and\nconcrete cesspool sections shall not be permitted to be used in the\nconstruction of retaining walls.[Added 7-17-2001 by L.L. No. 3-2001]"
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 470-29",
			"title": "Swimming pools.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Residential swimming pools accessory to single-family dwellings."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "In general. Such provisions of this section as may be deemed applicable\nby the Superintendent of Buildings and the Board of Trustees shall\napply to the installation, construction, maintenance and use of residential\nswimming pools accessory to single-family dwellings."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Definitions. For the purpose of this section, certain words, terms\nand phrases shall be interpreted or defined as follows:"
												},
												{
													"footnote": "[1]\nEditor's Note: This local law also deleted the definitions\nof \"swimming pool (above-ground),\" \"swimming pool (below-ground)\"\nand \"swimming pool (semi in-ground)\" which immediately followed this\ndefinition.\n"
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Permit and certificate required. It shall be unlawful to construct,\nerect, install, modify, alter or change any below-ground, semi in-ground\nor aboveground residential swimming pool accessory to a single-family\ndwelling or to permit any of such acts without first obtaining a building\npermit, and it shall be unlawful to use such pool without obtaining\na certificate of occupancy."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "Fees. The fee for a building permit, certificate of occupancy and\ncertificate of completion shall be as established by resolution of\nthe Board of Trustees. Such fee shall accompany each application,\nwhich shall be in writing and shall be filed in duplicate with the\nSuperintendent of Buildings. The form for such application shall be\nas prescribed by the Superintendent of Buildings."
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "Building permits; additional requirements. In addition to the requirements\nfor the issuance of a building permit set forth in this chapter and\nthe Uniform Code, no building permit for a swimming pool shall be\nissued by the Superintendent of Buildings unless and until:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "There have been submitted to the Superintendent of Buildings\ndetailed plans and drawings for the swimming pool, duly certified\nby a licensed professional engineer, that the swimming pool to be\nconstructed, erected, installed, modified, altered or changed pursuant\nto said plans and drawings includes adequate facilities for the maintenance\nof the water to be contained therein in a safe and sanitary condition\nand that the overflow and drainage systems to be provided are adequate\nto dispose of such water without interfering with adjoining properties,\nany public water supply system, existing sanitary facilities and the\nstreets, roads and highways of the Village."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "All of the provisions of the Uniform Code, this chapter, this\nsection and any other laws and regulations applicable to the proposed\nconstruction, erection, installation, modification, alteration or\nchange have been complied with."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "A written statement has been submitted to the Superintendent\nof Buildings certifying that the applicant will properly guard and\nprotect a pool under construction as provided in this section and\nuntil the fencing provisions of this section have been complied with."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(6) ",
											"content": [
												{
													"text": "Drawings and plans. All drawings and plans for the construction,\nerection, installation, modification, alteration or change of any\nswimming pool shall show all lot lines of the property where the pool\nis to be located and shall include, in detail, all information pertinent\nto said swimming pool, fence construction, water supply systems, drainage\nsystems, water disposal systems, electrical systems and all appurtenances\nthereto."
												}
											]
										},
										{
											"number": "(7) ",
											"content": [
												{
													"text": "Safeguards during construction. During the time that a pool is under\nconstruction and until such time as the fencing provisions of this\nsection have been complied with, such pool under construction shall\nbe completely enclosed by a substantial fence not less than four feet\nin height."
												}
											]
										},
										{
											"number": "(8) ",
											"content": [
												{
													"text": "Water supply, disposal and drainage."
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "All swimming pools shall have an acceptable drainage system\nor systems self-contained upon the premises and adequate to dispose\nof the water therein. No water shall be permitted to drain or run\noff into an adjoining property or into any street, road or highway\nin the Village, with the exception, however, that in an emergency\nwater may be discharged directly to an existing Village storm sewer,\nprovided that prior permission therefor has been obtained from the\nSuperintendent of Public Works or the Administrator of the Village.\nIf leaching pools are used to dispose of the pool water, the minimum\nvolume of the leaching pool shall be equal to at least 1/10 of the\ntotal volume of the pool as measured to the skimmer. No wastewater\nother than from the pool shall discharge into the dry well."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "No wastewater from any pool shall discharge into a septic tank,\ncesspool or other sewage disposal system."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(9) ",
											"content": [
												{
													"text": "Health, cleanliness and safety."
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "There shall be no cross-connection with any public water supply\nsystem. If the water is supplied from a public water system, an approved\ntype backflow device shall be installed and the inlet shall be above\nthe overflow level of the swimming pool. The water in the swimming\npool shall be chemically treated so as to maintain bacterial standards\nwhich shall meet the same standards established for public swimming\npools by the New York State Sanitary Code and the Nassau County Department\nof Health. All swimming pools shall have an efficiently operating\nfiltering system which shall be maintained in good working order at\nall times. All swimming pools shall be maintained in a clean and healthful\ncondition, and no such pool shall be permitted to accumulate foul,\nstagnant or dirty water. The owner of every swimming pool shall at\nall times maintain the same and the fence and gates surrounding said\npool, as hereinafter prescribed, in a clean, safe and sanitary condition."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "The main drain covers in all swimming pools shall be installed\nin accordance with recognized safety standards and practices."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(10) ",
											"content": [
												{
													"text": "Public, institutional or recreational swimming pools. In addition\nto this section, all public, institutional or recreational swimming\npools shall be in compliance with the Uniform Code Reference Standard\nto the State Sanitary Code 10 NYCRR Part 6, Subpart 6-1."
												}
											]
										},
										{
											"number": "(11) ",
											"content": [
												{
													"text": "Fences and enclosures."
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "All outdoor swimming pools shall be provided with an approved\nenclosure which shall be at least four feet in height and have a maximum\nvertical clearance to grade of two inches. Where a picket-type fence\nis provided, horizontal openings between pickets shall not exceed\nfour inches. Where a chain-link fence is provided, the openings between\nlinks shall not exceed 2 3/8 inches. Enclosures shall be constructed\nso as not to provide footholds. Pickets and chain link twists shall\nextend above the upper horizontal bar. Such enclosure shall have railings\nand posts within the enclosure which shall be capable of resisting\na minimum lateral load of 150 pounds applied midway between posts\nand at top of posts, respectively."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "Gates provided in the enclosure shall be self-closing and self-latching\nwith the latch handle located within the enclosure and at least 40\ninches above grade, and there shall not be more than two openings\nfor ingress and egress."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "All gates shall be kept securely closed at all times, whether\nor not the swimming pool is occupied, and shall be locked whenever\nthe swimming pool is unattended."
																}
															]
														},
														{
															"number": "(d) ",
															"content": [
																{
																	"text": "A wall of a building is permitted to serve as part of a swimming\npool enclosure, provided that there is no direct access from the dwelling\nto the pool, that windows in the wall shall have a latching device\nat least 40 inches above the floor, that a swinging door in the wall\nshall be self-closing and self-latching and that a sliding door in\nthe wall shall have a self-latching device."
																}
															]
														},
														{
															"number": "(e) ",
															"content": [
																{
																	"text": "A fence which runs along the property line or on any part thereof\nmay form part of the swimming pool enclosure, except that no gates\nin such fence shall be used as common ingress and egress to the property."
																}
															]
														},
														{
															"number": "(f) ",
															"content": [
																{
																	"text": "No part of a yard in which a pool is located or which is capable\nof being used for any other activity shall be permitted to be included\nwithin the perimeter of the swimming pool enclosure."
																}
															]
														},
														{
															"number": "(g) ",
															"content": [
																{
																	"text": "Exemptions. Aboveground pools with at least 48 inches between pool decking or pool top and the adjoining grade are exempt from the requirements of this Subsection A(11), provided that their access ladder or steps are blocked by an enclosure with a self-closing, self-latching gate. An aboveground pool less than 24 inches deep is exempt from the requirements of this Subsection A(11)."
																}
															]
														},
														{
															"number": "(h) ",
															"content": [
																{
																	"text": "A manually, electrically or mechanically operated pool cover\ndoes not meet the requirements for enclosure of a pool."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(12) ",
											"content": [
												{
													"text": "Size and location."
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "An in-ground or semi in-ground swimming pool shall be located\nonly in the rear yard of the premises and shall be set back at least\n20 feet from any property line and at least 20 feet from any building\nor structure."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "An aboveground swimming pool shall not be placed closer than\n20 feet to any property line and shall be 20 feet from any residential\nbuilding.[2]"
																},
																{
																	"footnote": "[2]\nEditor's Note: Amended at time of adoption of Code (see Ch. 1, General Provisions, Art. II).\n"
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "No swimming pool shall occupy more than 10% of the total lot\narea of the premises upon which the swimming pool shall be located,\nnor shall such swimming pool exceed a height of 72 inches above the\nground level for the overall structure."
																}
															]
														},
														{
															"number": "(d) ",
															"content": [
																{
																	"text": "No aboveground swimming pool shall have a water capacity in\nexcess of 10,000 gallons as measured to the top of the skimmer."
																}
															]
														},
														{
															"number": "(e) ",
															"content": [
																{
																	"text": "All swimming pools shall comply with the requirements of the\nUniform Code and all provisions of this chapter relating to accessory\nstructures, except that the lot area occupied by said swimming pools\nshall not be included in computing the percentage of the lot area\nwhich may be built upon."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(13) ",
											"content": [
												{
													"text": "Electrical alarm devices. In-ground and semi in-ground pools\nshall be equipped with an electrical device to sound alarm on entry\nto the pool area or pool."
												}
											]
										},
										{
											"number": "(14) ",
											"content": [
												{
													"text": "Proximity to electrical installations. No swimming pool shall\nbe constructed, erected, installed, placed or otherwise situated within\na twenty-five-foot radius, as measured on a horizontal plane, of any\naboveground electrical power wires, cables or lines."
												}
											]
										},
										{
											"number": "(15) ",
											"content": [
												{
													"text": "Lights. All lights used to illuminate a swimming pool or swimming\npool area shall be shielded so as to prevent their shining upon the\nproperty of any adjacent property owner."
												}
											]
										},
										{
											"number": "(16) ",
											"content": [
												{
													"text": "Noise. No loudspeaker device, radio, phonograph, tape or compact\ndisc player or amplifier system shall be used or maintained in connection\nwith any swimming pool which would cause a public disturbance or create\na public nuisance."
												}
											]
										},
										{
											"number": "(17) ",
											"content": [
												{
													"text": "Existing pools. All swimming pools in existence at the time\nof passage of this section shall be maintained and operated in accordance\nwith the provisions set forth in this section."
												}
											]
										},
										{
											"number": "(18) ",
											"content": [
												{
													"text": "Abandonment."
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "Should an owner abandon a below-ground or semi in-ground pool,\nhe shall remove the pool or cut openings into the bottom of the pool,\nfill the depression and return the surface of the ground to its original\ngrade and to approximately the same condition as before the pool was\nconstructed. He shall notify the Superintendent of Buildings so that\nan inspection of the depression and of the finished work may be made\nand the permit records marked accordingly."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "Should the owner abandon an aboveground pool, he shall drain\nand dismantle it and ensure its proper storage or disposal so as not\nto become a blight on the neighborhood. He shall thereupon notify\nthe Superintendent of Buildings so that an inspection of the site\nmay be made and the permit records marked accordingly."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(19) ",
											"content": [
												{
													"text": "Enforcement. In addition to the penalties provided for violation\nof any of the provisions of this chapter, the Superintendent of Buildings\nis hereby empowered to drain any swimming pool and compel the removal\nof any pool that fails to meet the requirements of this section as\nto construction, maintenance, fencing, water disposal, lighting, noise\ncontrol and appurtenances. The cost of such drainage or removal shall\nbe assessed against the real property on which the pool is located.\nThe costs so assessed shall constitute a lien and charge upon such\nreal property until paid or otherwise satisfied or discharged and\nshall be collected in the same manner and at the same time as other\ncharges, taxes and assessments of the Village."
												}
											]
										},
										{
											"number": "(20) ",
											"content": [
												{
													"text": "Appeals. Any resident aggrieved by a decision of the Superintendent\nof Buildings under this section may appeal same to the Zoning Board\nof Appeals."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "All swimming pools other than residential swimming pools accessory to single-family dwellings. It shall be unlawful to construct, erect, install, modify, alter or change any below-ground, semi in-ground or aboveground swimming pool, other than a residential swimming pool accessory to a single-family dwelling, or to permit any of such acts without first obtaining the approval of the Zoning Board of Appeals after a public hearing held upon such notice and pursuant to such procedures set forth by § 470-114C and only upon issuance of a permit, and it shall be unlawful to use such pool without obtaining a certificate of occupancy in the manner prescribed in this chapter, the Uniform Code and this section."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 470-30",
			"title": "Fences.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Definitions. For the purpose of this section, certain words, terms\nand phrases shall be interpreted or defined as follows:"
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Permit required. No fence of any kind may be erected without a building\npermit issued by the Superintendent of Buildings."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Constructed fences. No person shall be permitted to erect or maintain\nor cause to be erected or maintained any constructed fence except\nas follows:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Constructed fences shall not exceed a height of more than four feet,\nwith the exception of an open-wire constructed fence of an approved\ntype, which shall not exceed six feet in height."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Constructed fences shall not be erected closer than six inches to\na property line."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "No constructed fences shall be erected in a front yard except on\nproperties located in the historic district."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "The decorative side of all constructed fences shall face away from\nthe lot or parcel enclosed."
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "Constructed fences shall be erected and maintained so as to permit\naccess from the front yard to the rear yard for emergency personnel."
												}
											]
										},
										{
											"number": "(6) ",
											"content": [
												{
													"text": "No constructed fences shall be erected or maintained in such a way\nso as to interfere with the sight lines of traffic."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "Living fences. No person shall be permitted to erect or maintain\nor cause to be erected or maintained any living fence except as follows:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Living fences in a front yard shall not exceed three feet in height."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Living fences shall not be maintained closer than 1 1/2 feet\nto a property line."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Living fences shall be planted and maintained so as to permit access\nfrom the front yard to the rear yard for emergency personnel."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "Living fences shall not encroach beyond the property line so as to\ninterfere with public walkways."
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "No living fences shall be erected or maintained in such a way so\nas to interfere with the sight lines of traffic."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "Prohibited fence materials. No person shall be permitted to erect\nor cause to be erected any barbwire, razor, chain link except with\nclosed loop at the top, electrically charged, short pointed metal,\npoultry, turkey wire, or any similar type fence."
								}
							]
						},
						{
							"number": "F. ",
							"content": [
								{
									"text": "Nonconforming fences. Any fence legally in existence on the effective\ndate of this section shall be permitted to remain, provided that such\nfence is maintained and repaired."
								}
							]
						},
						{
							"number": "G. ",
							"content": [
								{
									"text": "Appeals. Any person seeking review of the action of the Superintendent\nof Buildings may appeal to the Historic District Board if the proposed\nlocation of the fence is within the Historic/Scenic Overlay District\nand to the Zoning Board of Appeals if the proposed location of the\nfence is outside of the Historic/Scenic Overlay District. The Historic\nDistrict Board or the Zoning Board of Appeals may modify or waive\nthe requirements of this section only upon a showing that to do so\nwould not be detrimental to the neighborhood or to the residents thereof."
								}
							]
						}
					]
				}
			]
		}
	]
}	