{
	"url": "http://ecode360.com/13790229",
	"paras": [
		{
			"paragraph": "ยง 470-5",
			"title": "Schedule of Area, Yard and Building Requirements.",
			"content": [
				{
					"text": "The schedule titled \"Schedule of Area, Yard and Building Requirements\"\nwhich accompanies this chapter shall set forth the minimum and/or\nmaximum area, yard, height, building and lot coverage dimensions and\nfloor area ratio for all lots and buildings in the Village of Roslyn,\nexcept as noted below.[1]"
				},
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Corner lots. All detached single-family residential structures on\ncorner lots shall be required to comply with the front yard restriction\nonly on the narrower street front. The depth of yard from the other\nstreet line shall be 25% of the width of the lot but need not be more\nthan 25 feet in the R-1 District, not more than 20 feet in the R-2\nDistrict and the R-C District, and not more than 10 feet in the R-3\nDistrict and the R-WD District. All other uses in all residential\ndistricts located on corner lots shall be required to comply with\nthe front yard requirements on all street frontages."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Landscaped buffers. Any commercial property that, in addition to\nfrontage on a public street, has a property line on a park, waterway,\nor public easement that is utilized or can be seen by the public,\nor adjoins a residential zone, shall maintain landscaping, fencing,\nscreening and walls or a combination thereof that screens outdoor\nstorage, garbage collection, parking, loading, or any other unsightly\nelements or activities."
								}
							]
						}
					]
				},
				{
					"footnote": "[1]\nEditor's Note: The Schedule of Area, Yard and Building Requirements\nis included at the end of this chapter.\n"
				}
			]
		},
		{
			"paragraph": "ยง 470-10",
			"title": "R-MF Multifamily Residential District.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Purpose. The R-MF Multifamily Residential District is designed primarily\nfor low-rise multifamily residential developments at moderate densities."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Permitted principal uses:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Multiple dwellings or apartment houses, in accordance with the following\nrequirements:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "The maximum gross density shall be 12 units per acre."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "No principal building shall exceed 80 feet in any single plane\nor 160 feet in any one dimension."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "Between any two buildings there shall be a distance equal to\nthe average height of such buildings at the points where such buildings\nare nearest to each other; in all cases a minimum distance of 20 feet\nbetween all buildings, whether principal or accessory, shall be maintained."
																}
															]
														},
														{
															"number": "(d) ",
															"content": [
																{
																	"text": "Outdoor play areas shall be provided at a minimum of 25 square\nfeet per unit with no aggregate of such space less then 300 square\nfeet."
																}
															]
														}
													]
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Accessory uses. The following accessory uses on the same lot as the principal use shall be permitted in accordance with Article III:[1]"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Uses which are customarily incidental to the above permitted uses."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Swimming pools for the exclusive use of the residents of the principal\npermitted use."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Private off-street parking and loading, including private garages."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "Maintenance or tool sheds."
												}
											]
										}
									]
								},
								{
									"footnote": "[1]\nEditor's Note: Amended at time of adoption of Code (see Ch. 1, General Provisions, Art. II).\n"
								}
							]
						}
					]
				}
			]
		}
	]
}	
		