{
	"url": "http://ecode360.com/13790062",
	"paras": [
		{
			"paragraph": "§ 470-5",
			"title": "Schedule of Area, Yard and Building Requirements.",
			"content": [
				{
					"text": "The schedule titled \"Schedule of Area, Yard and Building Requirements\"\nwhich accompanies this chapter shall set forth the minimum and/or\nmaximum area, yard, height, building and lot coverage dimensions and\nfloor area ratio for all lots and buildings in the Village of Roslyn,\nexcept as noted below.[1]"
				},
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Corner lots. All detached single-family residential structures on\ncorner lots shall be required to comply with the front yard restriction\nonly on the narrower street front. The depth of yard from the other\nstreet line shall be 25% of the width of the lot but need not be more\nthan 25 feet in the R-1 District, not more than 20 feet in the R-2\nDistrict and the R-C District, and not more than 10 feet in the R-3\nDistrict and the R-WD District. All other uses in all residential\ndistricts located on corner lots shall be required to comply with\nthe front yard requirements on all street frontages."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Landscaped buffers. Any commercial property that, in addition to\nfrontage on a public street, has a property line on a park, waterway,\nor public easement that is utilized or can be seen by the public,\nor adjoins a residential zone, shall maintain landscaping, fencing,\nscreening and walls or a combination thereof that screens outdoor\nstorage, garbage collection, parking, loading, or any other unsightly\nelements or activities."
								}
							]
						}
					]
				},
				{
					"footnote": "[1]\nEditor's Note: The Schedule of Area, Yard and Building Requirements\nis included at the end of this chapter.\n"
				}
			]
		},
		{
			"paragraph": "§ 470-6",
			"title": "R-1 Low-Density Single-Family Residential District.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Purpose. The R-1 Low-Density Single-Family Residential District is\ndesigned primarily for detached single-family residential dwelling\nunits but in addition provides for residentially supportive institutional\nfacilities which both serve and are compatible with such uses."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Permitted principal uses:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Single-family detached dwellings."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Home occupations may be permitted within a single-family detached\ndwelling subject to the same area, yard and building requirements\nas single-family detached dwellings and the following additional conditions\nand others deemed to be necessary to protect the health, safety and\nwelfare:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "The home occupation shall be consistent with the definition set forth in Article I of this chapter."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "The home occupation shall be carried on only by a member of\nthe family that resides on the premises."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "There shall be no display that will indicate from the exterior\nthat the building is being utilized in whole or part for any other\npurpose than that of a dwelling."
																}
															]
														},
														{
															"number": "(d) ",
															"content": [
																{
																	"text": "No mechanical equipment shall be used other than that which\nis customary for purely domestic and household purposes."
																}
															]
														}
													]
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Special uses. A building may be erected, altered or used for any\npurpose set forth in this subsection only when authorized by the Board\nof Trustees as a special use after a public hearing and for no other:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Church or other place of worship."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Parish house, rectory or Sunday school."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Public library, fire station, park, playground, or public or private\nschool."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "Resident association swimming pools, subject to the following regulations\nand others deemed by the Board of Trustees necessary to protect the\nhealth, safety and welfare:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "At least 60% of the members of the association or membership\ncorporation shall be residents of the Village."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "The association or membership corporation shall not be conducted\nfor profit or gain."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "The Board of Trustees shall determine that the public health,\nmorals, safety, comfort and general welfare of the neighborhood will\nbe secure and that such use will not be detrimental to the general\ncharacter of the neighborhood or to the orderly development of the\nVillage."
																}
															]
														},
														{
															"number": "(d) ",
															"content": [
																{
																	"text": "No permit shall be issued for any such use nor shall any such use of said land be permitted or carried on until the location and size of the plot, site plans and detailed building plans of such pool and any accessory buildings showing dimensions, design, elevations, location and uses of all structures, drainage, sewerage and sanitary facilities, parking areas, entrances, driveways, walks, screening, planting and such other information, including the manner of operation, use and maintenance of such swimming pool, as may be required by the Board have been submitted to and approved by said Board. Such permit may prescribe reasonable rules and regulations for the operation, maintenance and use of such swimming pool and accessory structures. Any violation of this subsection or of any rule or regulation prescribed by the Board of Trustees in the permit or otherwise shall be subject to the remedies and penalties prescribed in § 470-116 of this chapter, and in addition thereto any permit issued hereunder may be revoked and canceled forthwith in the event of any such violation."
																}
															]
														},
														{
															"number": "(e) ",
															"content": [
																{
																	"text": "Such permit, when granted, shall not be assigned by the person,\nassociation or membership corporation to which it has been granted."
																}
															]
														}
													]
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "Accessory uses. The following accessory uses on the same lot as the principal use shall be permitted in accordance with Article III:[Amended 9-21-2010 by L.L. No. 1-2010]"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Uses which are customarily incidental to the above permitted uses."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Private residential swimming pools."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Private garages."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "Residential maintenance or tool sheds."
												}
											]
										}
									]
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 470-21",
			"title": "Off-street parking.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "General regulations. In any district the following regulations with\nrespect to off-street parking shall apply. No application shall be\nmade for a building permit for the construction, alteration or use\nof any building, structure or premises for any purposes, and no building\npermit for such purposes shall be issued, unless the parking spaces\nshall be provided as follows:"
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Alternate parking relief; Parking Trust Fund."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Legislative intent. The Board of Trustees hereby finds that a shortage of municipal and private off-street parking exists within the Village, thus creating congestion and also causing a negative impact upon the viability of the Village's business community. The Board also finds that an alternate method of obtaining a parking variance other than that set forth in § 470-114B(2)(b) will be in the best interests of the Village and will promote the health, safety and welfare of the community. Accordingly, in order to further the goal of creating future municipal and private off-street parking in the Village, the Board hereby seeks to establish a Parking Trust Fund."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Creation of Parking Trust Fund. There is hereby created a Parking\nTrust Fund in the Incorporated Village of Roslyn for the purpose of\nreceiving funds upon the granting of alternate parking variances and\nfor the further purpose of providing a source of funds for the provision\nof future municipal off-street parking, including the acquisition\nof land for said purpose."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Alternate parking variance procedure. In addition to the granting of parking variances pursuant to § 470-114B(2)(b) of this chapter, the Zoning Board of Appeals shall be authorized to grant an alternate form of variance as set forth herein. The Zoning Board of Appeals may vary the parking requirements established in this section by reducing the number of parking spaces required for a specific use or structure at the property under consideration, provided that any such variance shall only be granted subject to a condition requiring a payment to the Village of the sum of $2,000 per parking space so waived, varied or modified for deposit by the Village into the Parking Trust Fund."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "Dedicated trust fund. Any moneys deposited into the Parking Trust\nFund shall constitute a trust fund to be used by the Board of Trustees\nexclusively for municipal off-street parking, including the acquisition,\nimprovement and maintenance of land, facilities or parking equipment\nfor said purpose."
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "Payment required. Payment of the required fee to the Parking Trust\nFund pursuant to an alternate parking variance grant of the Zoning\nBoard of Appeals shall be a prerequisite to the issuance of a building\npermit or other municipal certificate."
												}
											]
										}
									]
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 470-22",
			"title": "Off-street parking areas, loading areas and driveways.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Residential use."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "All driveways and parking areas serving one-family and two-family\ndwellings shall be paved or graveled to handle adequately the vehicles\nfor which provision is made. All driveways and parking areas serving\nmultifamily developments shall be paved in accordance with the specifications\nof the Village Department of Public Works."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "The off-street parking facilities required for one-family, two-family\nand multifamily developments shall be on the same lot or parcel of\nland as the building they are intended to serve.[Amended 9-21-2010 by L.L. No. 1-2010]"
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "No parking of vehicles shall be permitted in landscaped, lawn or\nsidewalk areas nor, as to multifamily developments, in fire lanes,\nbuffer areas or within five feet of any property line."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "On state highways or other arterial roads, only one access road to\nparking areas shall be permitted. On all other roads, access points\nfrom any one lot crossing the street line shall be limited to a maximum\nof two along the frontage of any single street. The center lines of\nany separate access points shall be spaced at least 45 feet apart,\nshall handle no more than two lanes of traffic, shall be at least\n10 feet from any property side lines, and shall be set back from the\nstreet line of any intersecting street at least 50 feet. Continuous\nopen driveways in excess of 16 feet at the street line shall be prohibited,\nexcept that two-way driveways serving multifamily developments shall\nbe at least 22 feet wide. In all instances, due consideration shall\nbe given to the proposed width, curbing, direction of traffic flow,\nradii of curves and method of dividing traffic lanes. Curbing shall\nbe depressed at the driveway or may be rounded at the corners and\nthe driveway connected with the street in the same manner as another\nstreet."
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "All parking areas serving multifamily developments shall be designed\nto permit each vehicle to proceed to and from the parking space provided\nfor it without the moving of any other vehicle, except in the case\nof a space in front of an enclosed garage. Aisles providing access\nto parking spaces shall have the following minimum dimensions:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "Where the angle of the parking is different on both sides of\nthe aisle, the larger aisle width shall prevail."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "All parking stalls shall have a minimum width of nine feet and\na minimum depth of 18 feet, except that all handicapped spaces shall\nbe in compliance with ICC/ANSI A117.1 as adopted by the New York State\nBuilding Code.[Amended 12-15-2009 by L.L. No. 5-2009]"
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(6) ",
											"content": [
												{
													"text": "No part of the parking area shall be used for the storage or abandonment\nof any article or material."
												}
											]
										},
										{
											"number": "(7) ",
											"content": [
												{
													"text": "No commercial vehicle shall be parked or stored outdoors overnight\nin any residential zone, and only one such vehicle per lot may be\nhoused in such districts, provided that it is housed within a garage\nat all times.[1]"
												},
												{
													"footnote": "[1]\nEditor's Note: Amended at time of adoption of Code (see Ch. 1, General Provisions, Art. II).\n"
												}
											]
										},
										{
											"number": "(8) ",
											"content": [
												{
													"text": "Access driveways shall be marked with arrows indicating proper flow\nof traffic, and individual parking spaces shall be shown."
												}
											]
										},
										{
											"number": "(9) ",
											"content": [
												{
													"text": "Parking areas serving multifamily developments shall be illuminated\nat night. Such illumination, lighting and screening shall be subject\nto the prior written approval of detailed plans submitted to the Building\nInspector and shall be so constructed, arranged and shielded that\nno direct light rays from any light or fixture used in such illumination\nshall constitute a nuisance to the occupants of any neighboring residences\nor buildings. Any lighting or illumination constituting such a nuisance\nis hereby strictly prohibited."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Nonresidential uses."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Landscaping. To the maximum extent possible, each off-street parking\narea shall have a minimum landscaped area equivalent to one parking\nspace per every 10 parking spaces, with 1/2 said area having shrubs\nno higher than three feet and the other half having trees with branches\nno lower than seven feet. Such landscaped areas shall be distributed\nthroughout the parking area in order to break the view of long rows\nof parked cars in a manner not impairing visibility and shall be provided\nseparate and apart from the requirements for buffers as specified\nelsewhere in this chapter."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Surfacing and curbing. All driveways and parking areas serving nonresidential\nuses shall be paved and curbed in accordance with the specifications\nof the Village Department of Public Works."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Access driveways shall be marked with arrows indicating proper flow\nof traffic, and individual parking spaces shall be striped."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "Parking areas shall be illuminated at night during the business hours\nof the building which they serve. Such illumination, lighting and\nscreening shall be subject to the prior written approval of detailed\nplans submitted to the Building Inspector and shall be so constructed,\narranged and shielded that no direct light rays from any light or\nfixture used in such illumination shall constitute a nuisance to the\noccupants of any neighboring residences or buildings. Any lighting\nor illumination constituting such a nuisance is hereby strictly prohibited."
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "Access. On state highways or other arterial roads, only one access\nroad to parking areas shall be permitted. On all other roads, access\npoints from any one lot crossing the street line shall be limited\nto a maximum of two along the frontage of any single street. The center\nlines of any separate access points shall be spaced at least 45 feet\napart, shall handle no more than two lanes of traffic, shall be at\nleast 10 feet from any property side lines, and shall be set back\nfrom the street line of any intersecting street at least 50 feet.\nContinuous open driveways in excess of 16 feet at the street line\nshall be prohibited, except that two-way driveways serving multifamily\ndevelopments shall be at least 22 feet wide. In all instances, due\nconsideration shall be given to the proposed width, curbing, direction\nof traffic flow, radii of curves and method of dividing traffic lanes.\nCurbing shall be depressed at the driveway or may be rounded at the\ncorners and the driveway connected with the street in the same manner\nas another street."
												}
											]
										},
										{
											"number": "(6) ",
											"content": [
												{
													"text": "Location of parking and loading."
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "No parking of vehicles shall be permitted in fire lanes, driveways,\nlandscaped areas, aisles, buffer areas, sidewalks or turning areas\nor within five feet of any property line."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "Except where permitted in the HS-O Historic/Scenic Overlay District\nas part of a shared parking arrangement, off-street parking facilities\nrequired for nonresidential uses shall be provided within 400 feet\nof the building they are intended to serve, measured between the nearest\npoint of the off-street parking facilities and the nearest point of\nthe building. All such parking spaces shall be owned, leased or otherwise\nunder the control of the user of the nonresidential use."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "No parking space or aisle shall be provided within a ten-foot\nsetback from the public street right-of-way."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(7) ",
											"content": [
												{
													"text": "Type of facility. The provision of parking spaces shall also include\nadequate driveway and necessary turning areas for handling the vehicles\nfor which provision is made. Parking areas shall be designed to permit\neach motor vehicle to proceed to and from the parking space provided\nfor it without requiring the moving of any other motor vehicles."
												}
											]
										}
									]
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 470-23",
			"title": "Garages.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "In the residential districts, a private detached or attached garage\naccessory to a dwelling on the same lot or parcel shall be erected\nin a rear yard or side yard."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "In any residential district where residential use is permitted, a\nprivate detached or attached garage shall be permitted as an accessory\nuse to a multiple-family dwelling as part of the site plan approval\nprocess."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "In any R-1 or R-2 District, no accessory garage shall be erected\nto house more than two passenger vehicles, unless a special permit\ntherefor shall have been granted by the Board of Trustees.[1]"
								},
								{
									"footnote": "[1]\nEditor's Note: Original § 15.303D, which immediately followed this subsection and dealt with commercial vehicles, was deleted at time of adoption of Code (see Ch. 1, General Provisions, Art. II). See § 470-22A(7).\n"
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "No garage shall exceed 17 feet in height."
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "No garage shall have less than a three-foot side yard setback and\na three-foot rear yard setback."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 470-24",
			"title": "Open storage.",
			"content": [
				{
					"text": "No property shall be used for the open storage of any article,\nmerchandise, material, machinery, vehicles or other related items."
				}
			]
		},
		{
			"paragraph": "§ 470-25",
			"title": "Accessory buildings and structures.",
			"content": [
				{
					"text": "Except for outdoor pools, decks and garages, the following regulations\nshall apply to accessory buildings and structures in any residence\ndistrict:"
				},
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "A detached accessory building or structure may be located in and\nmay occupy not more than 30% of the area of any rear yard and shall\nbe located a distance of at least:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Eight feet from any dwelling or main building."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "One foot from any lot line, with no cornice overhanging such building\nmore than six inches."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Forty-five feet from any street line, except that on a corner lot\nthe distance shall be at least 45 feet from the line of the street\nof narrower frontage and 15 feet from the line of the street of greater\nfrontage."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "No accessory building or structure shall have a dimension in excess\nof 100 square feet in area, nor shall such building or structure exceed\n10 feet in height."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "No accessory building may be used for habitable space."
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "Mechanicals and other equipment, including, but not limited to, generators,\ncentral-air-conditioning units, pool pumps and any noise- or vibration-producing\nequipment shall require a permit and shall be installed and located\nas follows:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Equipment may only be installed in the rear yard in conformance with\nthe setback requirements for the zoning district in which it is located."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Distances to other structures and equipment shall comply with the\nNew York State Building Code in effect at the time and the manufacturer's\ninstallation requirements."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Equipment shall be screened to minimize the visual and acoustical\nimpacts to surrounding properties. Screening will comply with the\nrequirements of the Village of Roslyn Historic District Board when\nthe installation is within the Roslyn Historic District."
												}
											]
										}
									]
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 470-26",
			"title": "Unlicensed or inoperative motor vehicles; motor vehicle repairs.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "No lot or parcel shall be used for the outside storage of an inoperative\nor unlicensed motor vehicle or vehicles except as otherwise permitted\nin this chapter. No repairs shall be made to such vehicle or vehicles\noutside of enclosed buildings. Nothing herein shall be construed to\nprohibit the storage of such vehicle or vehicles inside a garage or\nother building located on the premises, provided that such vehicle\nor vehicles are owned by the owner or occupant of the principal residence."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Motor vehicle repairs."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "The following uses shall not be permitted in any residential district:\nmotor vehicle repairs of a major nature, including but not limited\nto auto painting, body work or extensive mechanical repairs. Nothing\ncontained herein shall be deemed to prohibit either emergency repairs\nor preventive maintenance of a minor nature, such as an oil change\nor tune-up; provided, however, that such preventive maintenance is\nperformed upon the premises by an individual who is an occupant of\nsaid premises and that the motor vehicle upon which the emergency\nrepairs and/or preventive maintenance is being performed is registered\nin the name of the occupant of said premises."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "The following uses shall not be permitted in all other zoning districts:\nall motor vehicle repairs are hereby prohibited, except for emergency\nrepairs, on all public streets in all zoning districts other than\nresidential, throughout the Village of Roslyn."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "The following uses shall not be permitted in municipal parking fields:\nall motor vehicle repairs are hereby prohibited in all municipal parking\nfields."
												}
											]
										}
									]
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 470-27",
			"title": "Satellite dish antennas.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Purpose. The Board of Trustees hereby determines that in a community\nsuch as the Village of Roslyn, comprised principally of one-family\nhomes, many of which are of historic significance, the aesthetic impact\nof large parabolic or hemispheric discs or other similar antennas\nor devices measuring several feet in diameter can be offensive to\nthe residential community and be inconsistent with the character of\nthe neighborhood. If unregulated, such devices can be disruptive to\nthe appearance of the skyline and disrupt the pleasant nature and\ncharacter of the community. Also, the interests of public safety require\nthat such devices be installed in accordance with well-defined engineering\nstandards, and other safety measures, such as fencing around the base,\nmay be necessary. These aesthetic and safety concerns do not arise\nin connection with dipole antennas, which blend into the skyline.\nThe Board also finds that a regulatory scheme such as is set forth\nherein allows a reasonable balancing of the needs of the community\nand the rights of persons to reasonable access to television or radio\nstations that they desire and to allow such antennas to fit into the\ncharacter of the community."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Compliance required. No person shall cause, suffer or permit the\nerection, construction, installation, relocation and/or maintenance\nof any parabolic or hemispheric disc or satellite receive-only antenna\nor other similar antenna or device, the purpose of which is to receive\ntelevision, radio and/or microwave or other electrical or similar\nsignals from satellites or from ground facilities which transmit such\nsignals, except as provided herein."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Permit required."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "In any commercial or industrial district, a satellite receive-only\nantenna two meters or less in diameter is permitted without permit."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "In any district other than a commercial or industrial district, a\nsatellite receive-only antenna one meter or less in diameter is permitted\nwithout permit."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "In all other instances, no erection, construction, installation and/or\nmaintenance of any satellite dish antenna shall be permitted or continued\nexcept when permitted by special use permit by the Zoning Board of\nAppeals after public hearing. The first permit granted to any applicant\nunder this section shall be conditional and shall be for a period\nof not more than two years. Any application for renewal of such conditional\npermit shall be acted upon in the same manner as an initial application.[1]"
												},
												{
													"footnote": "[1]\nEditor's Note: Amended at time of adoption of Code (see Ch. 1, General Provisions, Art. II).\n"
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "Requirements for special use permits."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "In evaluating whether a special use permit should be issued, the\nZoning Board of Appeals shall consider the purposes set forth in this\nsection.[2]"
												},
												{
													"footnote": "[2]\nEditor's Note: Amended at time of adoption of Code (see Ch. 1, General Provisions, Art. II).\n"
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "The antenna or other device shall be located only in the rear yard\nof the lot unless the applicant establishes that other placement is\nnecessary to obtain reasonable reception."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "No permit shall be issued if the Zoning Board of Appeals finds that\neither the type of antenna or disc or the method of its placement\nwill endanger the safety of residents, neighbors or pedestrians or\nthreaten property on the applicant's lot or adjoining lots.[3]"
												},
												{
													"footnote": "[3]\nEditor's Note: Amended at time of adoption of Code (see Ch. 1, General Provisions, Art. II).\n"
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "Use of any illumination for the disc or antenna is strictly prohibited."
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "All connections shall be made so that wiring and supporting cables\nshall not be visible from the street or sidewalk."
												}
											]
										},
										{
											"number": "(6) ",
											"content": [
												{
													"text": "No more than one parabolic, hemispheric, satellite receive-only,\nor similar antenna shall be erected, constructed, installed or maintained\non a single lot or premises."
												}
											]
										},
										{
											"number": "(7) ",
											"content": [
												{
													"text": "The Board of Appeals shall impose such screening requirements that\nare reasonable to effectuate the purposes set forth in this section\nand that will not substantially limit reception."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "Application for permit. All applications for special use permits\nshall be filed with the Zoning Board of Appeals. The application shall\ndescribe the subject premises by street address and by section, block\nand lot number and shall describe the present use of the premises.\nIn addition, the application shall be accompanied by the following:[4]"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "A location survey showing existing structures upon the premises,\ntheir location and distance from the proposed disc or antenna, the\ndimensions of the parabolic disc or antenna, the setbacks of the parabolic\ndisc or antenna from each property line and all properties and structures\nwithin a two-hundred-foot radius of the premises, showing the names\nand street addresses of the record owner of such property."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "A detailed plan showing the material from which the parabolic disc\nor antenna is to be constructed and the proposed color of the parabolic\ndisc or antenna and details illustrating the structural support system."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "A landscape plan illustrating adequate screening of the parabolic\ndisc or antenna which will be provided to screen the parabolic disc\nor antenna from the roadway and adjoining property owners. Unless\ndemonstrated to be impracticable, all screening required shall be\nby coniferous trees and shall be of sufficient height and density\nto screen 100% of the parabolic disc or antenna from sight at ground\nlevel from the roadway and from properties located within a two-hundred-foot\nradius of the premises during the entire year."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "An application fee which shall be as set forth in § 470-115."
												}
											]
										}
									]
								},
								{
									"footnote": "[4]\nEditor's Note: Amended at time of adoption of Code (see Ch. 1, General Provisions, Art. II).\n"
								}
							]
						},
						{
							"number": "F. ",
							"content": [
								{
									"text": "Notice required. Prior to the public hearing held by the Zoning Board\nof Appeals, the applicant shall file a certification of notice showing\nthat all property owners within 200 feet of the applicant's property\nwere notified, in writing, by the applicant of the application, by\ncertified mail, return receipt requested, at least 10 days and no\nmore than 21 days before the date scheduled for the public hearing.[5]"
								},
								{
									"footnote": "[5]\nEditor's Note: Amended at time of adoption of Code (see Ch. 1, General Provisions, Art. II).\n"
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 470-28",
			"title": "Retaining walls.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "No retaining wall may be built within the Village unless the Building\nInspector issues a permit for its construction. Application for a\npermit shall be made on a form promulgated by the Building Inspector."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Permit application."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "No permit will be issued for a retaining wall unless:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "The application is accompanied by plans for the development of the\nland that the retaining wall is intended to support and of any other\nland on the same tax lot or lots; or"
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "The application demonstrates a serious erosion or flooding problem\nor a serious threat to public health and safety which can be solved\nby a retaining wall or walls."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "The Building Inspector may require additional information to evaluate\napplications presented under this subsection."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "In a residential zoning district, or within 50 feet of a residential\nzoning district, no retaining wall may exceed five feet in height.\nIn other districts, no retaining wall may exceed eight feet in height.\nHeight shall be measured from the lowest point on the adjoining grade.\nThis subsection shall not prohibit applications for a series of retaining\nwalls in a parallel step design."
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "A minimum of five horizontal feet is required between retaining walls\nin parallel step design. The area between such retaining walls must\nbe landscaped with natural material and must be maintained."
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "No retaining wall may exceed the height of the adjoining grade that\nit supports or retains."
								}
							]
						},
						{
							"number": "F. ",
							"content": [
								{
									"text": "Provision must be made to accommodate stormwater on a property during\nconstruction and after completion of a retaining wall."
								}
							]
						},
						{
							"number": "G. ",
							"content": [
								{
									"text": "The height restrictions of this section do not apply to retaining\nwalls whose construction was completed and which were backfilled prior\nto the effective date of this chapter. If such walls are determined\nto be unsafe by the Building Inspector or by a licensed engineer or\narchitect, they may be repaired, subject to approval by the Building\nInspector, provided that the repaired structure is of the same, or\nsmaller, size and type. If such walls are demolished or abandoned,\nhowever, any replacement retaining wall must conform to this article."
								}
							]
						},
						{
							"number": "H. ",
							"content": [
								{
									"text": "If the property is in the Historic/Scenic Overlay District, permission\nmust first be received by the Historic District Board prior to construction\nof a retaining wall."
								}
							]
						},
						{
							"number": "I. ",
							"content": [
								{
									"text": "Timber cribbing, timber walls of any type, prefabricated pipe and\nconcrete cesspool sections shall not be permitted to be used in the\nconstruction of retaining walls.[Added 7-17-2001 by L.L. No. 3-2001]"
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 470-29",
			"title": "Swimming pools.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Residential swimming pools accessory to single-family dwellings."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "In general. Such provisions of this section as may be deemed applicable\nby the Superintendent of Buildings and the Board of Trustees shall\napply to the installation, construction, maintenance and use of residential\nswimming pools accessory to single-family dwellings."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Definitions. For the purpose of this section, certain words, terms\nand phrases shall be interpreted or defined as follows:"
												},
												{
													"footnote": "[1]\nEditor's Note: This local law also deleted the definitions\nof \"swimming pool (above-ground),\" \"swimming pool (below-ground)\"\nand \"swimming pool (semi in-ground)\" which immediately followed this\ndefinition.\n"
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Permit and certificate required. It shall be unlawful to construct,\nerect, install, modify, alter or change any below-ground, semi in-ground\nor aboveground residential swimming pool accessory to a single-family\ndwelling or to permit any of such acts without first obtaining a building\npermit, and it shall be unlawful to use such pool without obtaining\na certificate of occupancy."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "Fees. The fee for a building permit, certificate of occupancy and\ncertificate of completion shall be as established by resolution of\nthe Board of Trustees. Such fee shall accompany each application,\nwhich shall be in writing and shall be filed in duplicate with the\nSuperintendent of Buildings. The form for such application shall be\nas prescribed by the Superintendent of Buildings."
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "Building permits; additional requirements. In addition to the requirements\nfor the issuance of a building permit set forth in this chapter and\nthe Uniform Code, no building permit for a swimming pool shall be\nissued by the Superintendent of Buildings unless and until:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "There have been submitted to the Superintendent of Buildings\ndetailed plans and drawings for the swimming pool, duly certified\nby a licensed professional engineer, that the swimming pool to be\nconstructed, erected, installed, modified, altered or changed pursuant\nto said plans and drawings includes adequate facilities for the maintenance\nof the water to be contained therein in a safe and sanitary condition\nand that the overflow and drainage systems to be provided are adequate\nto dispose of such water without interfering with adjoining properties,\nany public water supply system, existing sanitary facilities and the\nstreets, roads and highways of the Village."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "All of the provisions of the Uniform Code, this chapter, this\nsection and any other laws and regulations applicable to the proposed\nconstruction, erection, installation, modification, alteration or\nchange have been complied with."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "A written statement has been submitted to the Superintendent\nof Buildings certifying that the applicant will properly guard and\nprotect a pool under construction as provided in this section and\nuntil the fencing provisions of this section have been complied with."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(6) ",
											"content": [
												{
													"text": "Drawings and plans. All drawings and plans for the construction,\nerection, installation, modification, alteration or change of any\nswimming pool shall show all lot lines of the property where the pool\nis to be located and shall include, in detail, all information pertinent\nto said swimming pool, fence construction, water supply systems, drainage\nsystems, water disposal systems, electrical systems and all appurtenances\nthereto."
												}
											]
										},
										{
											"number": "(7) ",
											"content": [
												{
													"text": "Safeguards during construction. During the time that a pool is under\nconstruction and until such time as the fencing provisions of this\nsection have been complied with, such pool under construction shall\nbe completely enclosed by a substantial fence not less than four feet\nin height."
												}
											]
										},
										{
											"number": "(8) ",
											"content": [
												{
													"text": "Water supply, disposal and drainage."
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "All swimming pools shall have an acceptable drainage system\nor systems self-contained upon the premises and adequate to dispose\nof the water therein. No water shall be permitted to drain or run\noff into an adjoining property or into any street, road or highway\nin the Village, with the exception, however, that in an emergency\nwater may be discharged directly to an existing Village storm sewer,\nprovided that prior permission therefor has been obtained from the\nSuperintendent of Public Works or the Administrator of the Village.\nIf leaching pools are used to dispose of the pool water, the minimum\nvolume of the leaching pool shall be equal to at least 1/10 of the\ntotal volume of the pool as measured to the skimmer. No wastewater\nother than from the pool shall discharge into the dry well."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "No wastewater from any pool shall discharge into a septic tank,\ncesspool or other sewage disposal system."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(9) ",
											"content": [
												{
													"text": "Health, cleanliness and safety."
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "There shall be no cross-connection with any public water supply\nsystem. If the water is supplied from a public water system, an approved\ntype backflow device shall be installed and the inlet shall be above\nthe overflow level of the swimming pool. The water in the swimming\npool shall be chemically treated so as to maintain bacterial standards\nwhich shall meet the same standards established for public swimming\npools by the New York State Sanitary Code and the Nassau County Department\nof Health. All swimming pools shall have an efficiently operating\nfiltering system which shall be maintained in good working order at\nall times. All swimming pools shall be maintained in a clean and healthful\ncondition, and no such pool shall be permitted to accumulate foul,\nstagnant or dirty water. The owner of every swimming pool shall at\nall times maintain the same and the fence and gates surrounding said\npool, as hereinafter prescribed, in a clean, safe and sanitary condition."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "The main drain covers in all swimming pools shall be installed\nin accordance with recognized safety standards and practices."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(10) ",
											"content": [
												{
													"text": "Public, institutional or recreational swimming pools. In addition\nto this section, all public, institutional or recreational swimming\npools shall be in compliance with the Uniform Code Reference Standard\nto the State Sanitary Code 10 NYCRR Part 6, Subpart 6-1."
												}
											]
										},
										{
											"number": "(11) ",
											"content": [
												{
													"text": "Fences and enclosures."
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "All outdoor swimming pools shall be provided with an approved\nenclosure which shall be at least four feet in height and have a maximum\nvertical clearance to grade of two inches. Where a picket-type fence\nis provided, horizontal openings between pickets shall not exceed\nfour inches. Where a chain-link fence is provided, the openings between\nlinks shall not exceed 2 3/8 inches. Enclosures shall be constructed\nso as not to provide footholds. Pickets and chain link twists shall\nextend above the upper horizontal bar. Such enclosure shall have railings\nand posts within the enclosure which shall be capable of resisting\na minimum lateral load of 150 pounds applied midway between posts\nand at top of posts, respectively."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "Gates provided in the enclosure shall be self-closing and self-latching\nwith the latch handle located within the enclosure and at least 40\ninches above grade, and there shall not be more than two openings\nfor ingress and egress."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "All gates shall be kept securely closed at all times, whether\nor not the swimming pool is occupied, and shall be locked whenever\nthe swimming pool is unattended."
																}
															]
														},
														{
															"number": "(d) ",
															"content": [
																{
																	"text": "A wall of a building is permitted to serve as part of a swimming\npool enclosure, provided that there is no direct access from the dwelling\nto the pool, that windows in the wall shall have a latching device\nat least 40 inches above the floor, that a swinging door in the wall\nshall be self-closing and self-latching and that a sliding door in\nthe wall shall have a self-latching device."
																}
															]
														},
														{
															"number": "(e) ",
															"content": [
																{
																	"text": "A fence which runs along the property line or on any part thereof\nmay form part of the swimming pool enclosure, except that no gates\nin such fence shall be used as common ingress and egress to the property."
																}
															]
														},
														{
															"number": "(f) ",
															"content": [
																{
																	"text": "No part of a yard in which a pool is located or which is capable\nof being used for any other activity shall be permitted to be included\nwithin the perimeter of the swimming pool enclosure."
																}
															]
														},
														{
															"number": "(g) ",
															"content": [
																{
																	"text": "Exemptions. Aboveground pools with at least 48 inches between pool decking or pool top and the adjoining grade are exempt from the requirements of this Subsection A(11), provided that their access ladder or steps are blocked by an enclosure with a self-closing, self-latching gate. An aboveground pool less than 24 inches deep is exempt from the requirements of this Subsection A(11)."
																}
															]
														},
														{
															"number": "(h) ",
															"content": [
																{
																	"text": "A manually, electrically or mechanically operated pool cover\ndoes not meet the requirements for enclosure of a pool."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(12) ",
											"content": [
												{
													"text": "Size and location."
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "An in-ground or semi in-ground swimming pool shall be located\nonly in the rear yard of the premises and shall be set back at least\n20 feet from any property line and at least 20 feet from any building\nor structure."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "An aboveground swimming pool shall not be placed closer than\n20 feet to any property line and shall be 20 feet from any residential\nbuilding.[2]"
																},
																{
																	"footnote": "[2]\nEditor's Note: Amended at time of adoption of Code (see Ch. 1, General Provisions, Art. II).\n"
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "No swimming pool shall occupy more than 10% of the total lot\narea of the premises upon which the swimming pool shall be located,\nnor shall such swimming pool exceed a height of 72 inches above the\nground level for the overall structure."
																}
															]
														},
														{
															"number": "(d) ",
															"content": [
																{
																	"text": "No aboveground swimming pool shall have a water capacity in\nexcess of 10,000 gallons as measured to the top of the skimmer."
																}
															]
														},
														{
															"number": "(e) ",
															"content": [
																{
																	"text": "All swimming pools shall comply with the requirements of the\nUniform Code and all provisions of this chapter relating to accessory\nstructures, except that the lot area occupied by said swimming pools\nshall not be included in computing the percentage of the lot area\nwhich may be built upon."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(13) ",
											"content": [
												{
													"text": "Electrical alarm devices. In-ground and semi in-ground pools\nshall be equipped with an electrical device to sound alarm on entry\nto the pool area or pool."
												}
											]
										},
										{
											"number": "(14) ",
											"content": [
												{
													"text": "Proximity to electrical installations. No swimming pool shall\nbe constructed, erected, installed, placed or otherwise situated within\na twenty-five-foot radius, as measured on a horizontal plane, of any\naboveground electrical power wires, cables or lines."
												}
											]
										},
										{
											"number": "(15) ",
											"content": [
												{
													"text": "Lights. All lights used to illuminate a swimming pool or swimming\npool area shall be shielded so as to prevent their shining upon the\nproperty of any adjacent property owner."
												}
											]
										},
										{
											"number": "(16) ",
											"content": [
												{
													"text": "Noise. No loudspeaker device, radio, phonograph, tape or compact\ndisc player or amplifier system shall be used or maintained in connection\nwith any swimming pool which would cause a public disturbance or create\na public nuisance."
												}
											]
										},
										{
											"number": "(17) ",
											"content": [
												{
													"text": "Existing pools. All swimming pools in existence at the time\nof passage of this section shall be maintained and operated in accordance\nwith the provisions set forth in this section."
												}
											]
										},
										{
											"number": "(18) ",
											"content": [
												{
													"text": "Abandonment."
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "Should an owner abandon a below-ground or semi in-ground pool,\nhe shall remove the pool or cut openings into the bottom of the pool,\nfill the depression and return the surface of the ground to its original\ngrade and to approximately the same condition as before the pool was\nconstructed. He shall notify the Superintendent of Buildings so that\nan inspection of the depression and of the finished work may be made\nand the permit records marked accordingly."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "Should the owner abandon an aboveground pool, he shall drain\nand dismantle it and ensure its proper storage or disposal so as not\nto become a blight on the neighborhood. He shall thereupon notify\nthe Superintendent of Buildings so that an inspection of the site\nmay be made and the permit records marked accordingly."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(19) ",
											"content": [
												{
													"text": "Enforcement. In addition to the penalties provided for violation\nof any of the provisions of this chapter, the Superintendent of Buildings\nis hereby empowered to drain any swimming pool and compel the removal\nof any pool that fails to meet the requirements of this section as\nto construction, maintenance, fencing, water disposal, lighting, noise\ncontrol and appurtenances. The cost of such drainage or removal shall\nbe assessed against the real property on which the pool is located.\nThe costs so assessed shall constitute a lien and charge upon such\nreal property until paid or otherwise satisfied or discharged and\nshall be collected in the same manner and at the same time as other\ncharges, taxes and assessments of the Village."
												}
											]
										},
										{
											"number": "(20) ",
											"content": [
												{
													"text": "Appeals. Any resident aggrieved by a decision of the Superintendent\nof Buildings under this section may appeal same to the Zoning Board\nof Appeals."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "All swimming pools other than residential swimming pools accessory to single-family dwellings. It shall be unlawful to construct, erect, install, modify, alter or change any below-ground, semi in-ground or aboveground swimming pool, other than a residential swimming pool accessory to a single-family dwelling, or to permit any of such acts without first obtaining the approval of the Zoning Board of Appeals after a public hearing held upon such notice and pursuant to such procedures set forth by § 470-114C and only upon issuance of a permit, and it shall be unlawful to use such pool without obtaining a certificate of occupancy in the manner prescribed in this chapter, the Uniform Code and this section."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 470-30",
			"title": "Fences.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Definitions. For the purpose of this section, certain words, terms\nand phrases shall be interpreted or defined as follows:"
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Permit required. No fence of any kind may be erected without a building\npermit issued by the Superintendent of Buildings."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Constructed fences. No person shall be permitted to erect or maintain\nor cause to be erected or maintained any constructed fence except\nas follows:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Constructed fences shall not exceed a height of more than four feet,\nwith the exception of an open-wire constructed fence of an approved\ntype, which shall not exceed six feet in height."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Constructed fences shall not be erected closer than six inches to\na property line."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "No constructed fences shall be erected in a front yard except on\nproperties located in the historic district."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "The decorative side of all constructed fences shall face away from\nthe lot or parcel enclosed."
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "Constructed fences shall be erected and maintained so as to permit\naccess from the front yard to the rear yard for emergency personnel."
												}
											]
										},
										{
											"number": "(6) ",
											"content": [
												{
													"text": "No constructed fences shall be erected or maintained in such a way\nso as to interfere with the sight lines of traffic."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "Living fences. No person shall be permitted to erect or maintain\nor cause to be erected or maintained any living fence except as follows:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Living fences in a front yard shall not exceed three feet in height."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Living fences shall not be maintained closer than 1 1/2 feet\nto a property line."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Living fences shall be planted and maintained so as to permit access\nfrom the front yard to the rear yard for emergency personnel."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "Living fences shall not encroach beyond the property line so as to\ninterfere with public walkways."
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "No living fences shall be erected or maintained in such a way so\nas to interfere with the sight lines of traffic."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "Prohibited fence materials. No person shall be permitted to erect\nor cause to be erected any barbwire, razor, chain link except with\nclosed loop at the top, electrically charged, short pointed metal,\npoultry, turkey wire, or any similar type fence."
								}
							]
						},
						{
							"number": "F. ",
							"content": [
								{
									"text": "Nonconforming fences. Any fence legally in existence on the effective\ndate of this section shall be permitted to remain, provided that such\nfence is maintained and repaired."
								}
							]
						},
						{
							"number": "G. ",
							"content": [
								{
									"text": "Appeals. Any person seeking review of the action of the Superintendent\nof Buildings may appeal to the Historic District Board if the proposed\nlocation of the fence is within the Historic/Scenic Overlay District\nand to the Zoning Board of Appeals if the proposed location of the\nfence is outside of the Historic/Scenic Overlay District. The Historic\nDistrict Board or the Zoning Board of Appeals may modify or waive\nthe requirements of this section only upon a showing that to do so\nwould not be detrimental to the neighborhood or to the residents thereof."
								}
							]
						}
					]
				}
			]
		}
	]
}	