{
	"url": "http://ecode360.com/13790264",
	"paras": [
		{
			"paragraph": "ยง 470-5",
			"title": "Schedule of Area, Yard and Building Requirements.",
			"content": [
				{
					"text": "The schedule titled \"Schedule of Area, Yard and Building Requirements\"\nwhich accompanies this chapter shall set forth the minimum and/or\nmaximum area, yard, height, building and lot coverage dimensions and\nfloor area ratio for all lots and buildings in the Village of Roslyn,\nexcept as noted below.[1]"
				},
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Corner lots. All detached single-family residential structures on\ncorner lots shall be required to comply with the front yard restriction\nonly on the narrower street front. The depth of yard from the other\nstreet line shall be 25% of the width of the lot but need not be more\nthan 25 feet in the R-1 District, not more than 20 feet in the R-2\nDistrict and the R-C District, and not more than 10 feet in the R-3\nDistrict and the R-WD District. All other uses in all residential\ndistricts located on corner lots shall be required to comply with\nthe front yard requirements on all street frontages."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Landscaped buffers. Any commercial property that, in addition to\nfrontage on a public street, has a property line on a park, waterway,\nor public easement that is utilized or can be seen by the public,\nor adjoins a residential zone, shall maintain landscaping, fencing,\nscreening and walls or a combination thereof that screens outdoor\nstorage, garbage collection, parking, loading, or any other unsightly\nelements or activities."
								}
							]
						}
					]
				},
				{
					"footnote": "[1]\nEditor's Note: The Schedule of Area, Yard and Building Requirements\nis included at the end of this chapter.\n"
				}
			]
		},
		{
			"paragraph": "ยง 470-12",
			"title": "R-C Residential Commercial District.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Purpose. The R-C Residential Commercial District is designed to allow\na mix of residential single- and two-family uses and small traffic-generating\ncommercial uses which take advantage of the zone's frontage on\na regional highway."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Permitted principal uses:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Residential single- and two-family uses; and"
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Any principal use permitted in the R-3 One-Family Residential District."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Special uses. A building may be erected, altered or used for any\npurpose set forth in this subsection only when authorized by the Board\nof Trustees as a special use after a public hearing conducted by the\nBoard of Trustees and for no other:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Uses permitted as special uses in the R-3 One-Family Residential\nDistrict."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Low-traffic-generating professional, general or business offices."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Low-traffic-generating specialty retail uses, such as home furnishing\nstores, art galleries, rug stores, antique stores, and showrooms."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "Funeral parlors."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "Prohibited uses:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "All uses which are prohibited in the C-V Village Commercial District\nshall be prohibited in the R-C District."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "Accessory uses. The following accessory uses on the same lot as the principal use shall be permitted in accordance with Article III:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Any accessory use permitted in the R-3 One-Family Residential District."
												}
											]
										}
									]
								}
							]
						}
					]
				}
			]
		}
	]
}	