{
	"url": "http://ecode360.com/13790460",
	"paras": [
		{
			"paragraph": "§ 470-5",
			"title": "Schedule of Area, Yard and Building Requirements.",
			"content": [
				{
					"text": "The schedule titled \"Schedule of Area, Yard and Building Requirements\"\nwhich accompanies this chapter shall set forth the minimum and/or\nmaximum area, yard, height, building and lot coverage dimensions and\nfloor area ratio for all lots and buildings in the Village of Roslyn,\nexcept as noted below.[1]"
				},
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Corner lots. All detached single-family residential structures on\ncorner lots shall be required to comply with the front yard restriction\nonly on the narrower street front. The depth of yard from the other\nstreet line shall be 25% of the width of the lot but need not be more\nthan 25 feet in the R-1 District, not more than 20 feet in the R-2\nDistrict and the R-C District, and not more than 10 feet in the R-3\nDistrict and the R-WD District. All other uses in all residential\ndistricts located on corner lots shall be required to comply with\nthe front yard requirements on all street frontages."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Landscaped buffers. Any commercial property that, in addition to\nfrontage on a public street, has a property line on a park, waterway,\nor public easement that is utilized or can be seen by the public,\nor adjoins a residential zone, shall maintain landscaping, fencing,\nscreening and walls or a combination thereof that screens outdoor\nstorage, garbage collection, parking, loading, or any other unsightly\nelements or activities."
								}
							]
						}
					]
				},
				{
					"footnote": "[1]\nEditor's Note: The Schedule of Area, Yard and Building Requirements\nis included at the end of this chapter.\n"
				}
			]
		},
		{
			"paragraph": "§ 470-9",
			"title": "R-4 Low-Density Single-Family Residential - Special Character District.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Purpose. The R-4 District is intended to maintain the character and\nscale of the single-family residential Roslyn Pines and Marchant Park\nneighborhoods and to allow for the appropriate development and redevelopment\nof lots in those areas. The areas included within the zoning designation\nare characterized by single-family detached residences of one to 1 1/2\nstories on lots of 10,000 square feet or more."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Permitted principal uses:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Any principal use permitted in the R-1 District (Low-Density Single-Family\nResidential)."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Special uses. A building may be erected, altered or used for a special\nuse only when authorized by the Board of Trustees as a special use\nafter a public hearing conducted by the Board of Trustees and for\nno other:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Uses permitted as special uses in the R-1 District (Low-Density Single-Family\nResidential)."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "Accessory uses. The following accessory uses on the same lot as the\nprincipal use shall be permitted:[Amended 9-21-2010 by L.L. No. 1-2010]"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Uses permitted as accessory uses in the R-1 District (Low-Density\nSingle-Family Residential)."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "Development standards."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Purpose. The intent of this Subsection E is to provide standards that address the mass and scale of buildings in the R-4 District to ensure that new development and redevelopment are consistent with the existing neighborhood opportunities."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Schedule of regulations. All development in the R-4 District shall be consistent with the standards for the R-1 District shown in the Schedule of Area, Yard and Building Requirements which accompanies this chapter, except as specifically modified by Subsection E(3) through (7) below.[1]"
												},
												{
													"footnote": "[1]\nEditor's Note: The Schedule of Area, Yard and Building Requirements\nis included at the end of this chapter.\n"
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Building height. The maximum height for principal buildings in the R-4 District shall be 24 feet consisting of not more than 1 1/2 stories, except as modified in Subsection E(7) below. In no case shall a principal building exceed 32 feet or two stories. Two-and-one-half-story buildings are not permitted."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "Building coverage. The maximum building coverage for properties in\nthe R-4 District shall not exceed 25%."
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "Maximum floor area ratio. The maximum floor area ratio in the R-4 District shall be 0.275, except as modified in Subsection E(6) below. In no case shall the floor area ratio exceed 0.30."
												}
											]
										},
										{
											"number": "(6) ",
											"content": [
												{
													"text": "Exemptions from the calculation of floor area ratio. For properties\nlocated in the R-4 District, the following areas shall not be included\nin any calculation of floor area ratio:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "Unenclosed ground floor porches, decks, patios and porticos."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "A cellar."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "A basement, if:"
																},
																{
																	"content": [
																		{
																			"number": "[1] ",
																			"content": [
																				{
																					"text": "It does not extend beyond the first-story footprint; and"
																				}
																			]
																		},
																		{
																			"number": "[2] ",
																			"content": [
																				{
																					"text": "All exposed walls facing public streets are less than five feet\nin height as measured from the existing or proposed grade, whichever\nis lower."
																				}
																			]
																		}
																	]
																}
															]
														},
														{
															"number": "(d) ",
															"content": [
																{
																	"text": "A habitable portion of an attic or half story, if:"
																},
																{
																	"content": [
																		{
																			"number": "[1] ",
																			"content": [
																				{
																					"text": "The roof above it is not a flat or mansard roof and has a slope\nof 3° to 12° or steeper;"
																				}
																			]
																		},
																		{
																			"number": "[2] ",
																			"content": [
																				{
																					"text": "It has only one floor;"
																				}
																			]
																		},
																		{
																			"number": "[3] ",
																			"content": [
																				{
																					"text": "It does not extend beyond the footprint of the floors below;"
																				}
																			]
																		},
																		{
																			"number": "[4] ",
																			"content": [
																				{
																					"text": "It is the highest habitable portion of the building, except for a two-story portion as permitted by Subsection E(7) below; and"
																				}
																			]
																		},
																		{
																			"number": "[5] ",
																			"content": [
																				{
																					"text": "Fifty percent or more of the floor area has a ceiling height\nof seven feet or less."
																				}
																			]
																		}
																	]
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(7) ",
											"content": [
												{
													"text": "Exceptions for additional building height and floor area ratio. A\nsecond-story portion of a building with a maximum height of 32 feet\nmay be provided consistent with the following additional standards:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "Additional setback required. No second-story portion of a building\nshall be located less than 20 feet from a side property line."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "Maximum floor area. The floor area for the second-story portion\nof the building shall not exceed the lesser of the following:"
																},
																{
																	"content": [
																		{
																			"number": "[1] ",
																			"content": [
																				{
																					"text": "One-half of the ground floor area; or"
																				}
																			]
																		},
																		{
																			"number": "[2] ",
																			"content": [
																				{
																					"text": "Floor area ratio of 0.125."
																				}
																			]
																		}
																	]
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "Two-story front porches prohibited. No second-story porches\nshall be located on any street-facing facade of the building."
																}
															]
														},
														{
															"number": "(d) ",
															"content": [
																{
																	"text": "Consistent roof form. The roof form used on the second-story\nportion of a building must be consistent with roof forms used on other\nportions of the building."
																}
															]
														},
														{
															"number": "(e) ",
															"content": [
																{
																	"text": "Vertical wall articulation. In order to minimize the impact\nof taller building elements, two-story volumes should be designed\nto include a clearly identifiable base, middle, and top, with horizontal\nelements separating these components. Techniques that can be used\nto achieve this standard include, but are not limited to, belt courses,\nmaterial changes, upper-story setbacks, and varied roof forms."
																}
															]
														},
														{
															"number": "(f) ",
															"content": [
																{
																	"text": "Horizontal wall articulation. A side wall of a building that\nis more than 15 feet high should not extend in an unbroken plane for\nmore than 32 feet along a side lot line. To break the plane, a perpendicular\nwall articulation of not less than four feet, for a distance along\nthe side property line of not less than 10 feet, is required."
																}
															]
														}
													]
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "F. ",
							"content": [
								{
									"text": "Architectural Design Review Board."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Purpose; findings of fact."
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "The R-4 Low-Density Single-Family Residential - Special Character\nDistrict is intended to preserve and promote the character, appearances\nand aesthetics of the Roslyn Pines and Marchant Park neighborhoods\nand to conserve the property values of those neighborhoods by providing\nprocedures for an architectural review of all land developed and all\nstructures henceforth erected, reconstructed, altered or remodeled\nin the R-4 District and by so doing to:[2]"
																},
																{
																	"content": [
																		{
																			"number": "[1] ",
																			"content": [
																				{
																					"text": "Encourage good qualities of exterior building design and good\nappearances and to relate such design and appearances to the sites\nand surroundings of structures."
																				}
																			]
																		},
																		{
																			"number": "[2] ",
																			"content": [
																				{
																					"text": "Preserve the prevailing aesthetic character of the neighborhood\nand geographic area and to enhance the same by means of complementary\nstructures."
																				}
																			]
																		},
																		{
																			"number": "[3] ",
																			"content": [
																				{
																					"text": "Permit originality and resourcefulness in building design and\nappearances which are appropriate to the sites and surroundings."
																				}
																			]
																		},
																		{
																			"number": "[4] ",
																			"content": [
																				{
																					"text": "Promote and encourage good qualities of architectural design\nand utilization of land in the erection and construction of new structures\nand the exterior refurbishing, reconstruction or alteration of existing\nstructures."
																				}
																			]
																		},
																		{
																			"number": "[5] ",
																			"content": [
																				{
																					"text": "Assure that the design and location of any proposed structure\nor the addition, alteration or reconstruction of any existing structure\nis in harmony with the existing topography of its site and/or the\nexisting structure as well as the neighboring geographic area and\nexisting property."
																				}
																			]
																		},
																		{
																			"number": "[6] ",
																			"content": [
																				{
																					"text": "Discourage and prevent such design that would adversely affect\nor cause the diminution in value of neighboring property, whether\nimproved or unimproved."
																				}
																			]
																		},
																		{
																			"number": "[7] ",
																			"content": [
																				{
																					"text": "Prevent such design and appearances as are unnecessarily offensive\nto visual sensibilities, which impair the use, enjoyment, value or\ndesirability of neighboring properties and the health, safety and\ngeneral welfare of the community at large."
																				}
																			]
																		}
																	]
																},
																{
																	"footnote": "[2]\nEditor's Note: Amended at time of adoption of Code (see Ch. 1, General Provisions, Art. II).\n"
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "The Board of Trustees hereby finds it necessary to create a\nmechanism for architectural review since:"
																},
																{
																	"content": [
																		{
																			"number": "[1] ",
																			"content": [
																				{
																					"text": "Structures which are visually offensive or inappropriate by\nreason of poor exterior design, poor site layout, monotonous similarity\nor striking visual discord or dissimilarity in relation to their site\nor surroundings would mar the appearance of and adversely affect the\ndesirability of the immediate area and neighboring areas."
																				}
																			]
																		},
																		{
																			"number": "[2] ",
																			"content": [
																				{
																					"text": "Such structures would discourage and prevent the most appropriate\ndevelopment and utilization of land throughout the R-4 District."
																				}
																			]
																		},
																		{
																			"number": "[3] ",
																			"content": [
																				{
																					"text": "Such structures would impair the use, enjoyment and desirability\nand stability of both improved and unimproved property and are detrimental\nto the character of neighborhoods, produce degeneration of the values\nof real property with attendant deterioration of conditions affecting\nthe functioning, economic stability, prosperity, health and safety\nof the inhabitants of the Village and destroy a proper relationship\nbetween the taxable value of real property and the cost of municipal\nservices provided therefor."
																				}
																			]
																		}
																	]
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "It is the purpose of this Subsection F to prevent these and other harmful effects and thus to promote the health, safety and general welfare of the community."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Delegation of authority. There is hereby created an Architectural\nDesign Review Board consisting of five members who shall serve without\ncompensation. Members of the Board shall be residents of the Village\nof Roslyn and reside in the R-4 District, and all members of said\nBoard shall be persons qualified by reason of training or experience\nin architecture, land development, community planning, real estate,\nlandscape architecture or other relevant business or profession or\nby reason of civic interest and sound judgment to determine the effects\nof a proposed building or structure (including additions or exterior\nalterations thereto), a group of buildings or structures or plan of\nbuilding development on the desirability, property values and development\nof surrounding areas and the development of the Village as a whole.\nThe members of the Board shall be appointed by the Mayor, subject\nto the approval of the Board of Trustees. The Mayor shall, upon the\nenactment of this section and thereafter at the annual organizational\nmeeting, designate the Chairperson and Vice Chairperson of the Board,\nsubject to the approval of the Board of Trustees, and the persons\nso designated shall serve as Chairperson and Vice Chairperson at the\npleasure of the Mayor and Board of Trustees. From and after the effective\ndate of this section, the respective terms of appointed members of\nthe Board, in the order of their appointment, shall be one, two, three,\nfour, and five years. Thereafter, appointments shall be for a term\nof five years. The Board of Trustees shall have the power to remove\nany such member for cause. Vacancies shall be filled by the Mayor,\nsubject to the approval of the Board of Trustees, for the unexpired\nterm of any member whose place has become vacant. The Superintendent\nof Buildings shall act in an advisory capacity without voting power."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Meetings of Board. Meetings of the Board shall be held at such times\nas the Board may determine and otherwise at the call of the Chairperson\nor, in his absence, the Vice Chairperson. A majority of the members\nof the Board shall constitute a quorum for the transaction of business.\nAll actions taken by the Board shall be by a majority of the members\nthereof. The Board shall keep minutes of its proceedings, showing\nthe vote of each member on each question, or, if absent or failing\nto vote, indicating such fact, and shall also keep records of its\nexaminations and other official actions."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "Powers of Board. The Board shall have the power, from time to time, to adopt, amend and repeal rules and regulations, not inconsistent with law or the provisions of this section, governing its procedure and the transaction of its business and for the purpose of carrying into effect the standards outlined in Subsection F(1) hereof, which rules and regulations or amendments thereto shall become effective upon ratification by the Board of Trustees."
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "Referral procedures."
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "The Board shall review and advise on all of the following:"
																},
																{
																	"content": [
																		{
																			"number": "[1] ",
																			"content": [
																				{
																					"text": "All applications for the construction of any new building or\nstructure within the R-4 District."
																				}
																			]
																		},
																		{
																			"number": "[2] ",
																			"content": [
																				{
																					"text": "All applications for alterations, additions or reconstruction\nof any building or structure within the R-4 District which will increase\nthe building lot coverage in excess of 25% thereof."
																				}
																			]
																		}
																	]
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "If any building in the R-4 District for which a building permit\nis sought is one of a group of six or more buildings proposed to be\nconstructed in the same vicinity, none of which buildings is to be\nsituated at a distance of more than 250 feet from some other building\nof the group, whether or not such buildings are to be constructed\non contiguous plots, and whether or not the permits for the other\nbuildings of the group are applied for by the same applicant, said\napplication shall be accompanied by a plan of building development\nfor the entire group, clearly setting forth the entire site layout\nand the designs of the exterior appearance of all the proposed buildings\nin the group."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "A preliminary conference may be held between the Board and the\napplicant prior to the preparation and submission of a formal submission.\nThe intended purpose of such a conference is to enable the applicant\nto inform the Board of the proposal prior to the preparation of a\ndetailed submission and to provide the Board with an opportunity to\nreview the basic design concept, to advise the applicant as to potential\nproblems and concerns and to generally determine the information to\nbe required on the formal submission."
																}
															]
														},
														{
															"number": "(d) ",
															"content": [
																{
																	"text": "The Board shall require an application which shall include,\nbut not be limited to, the following:"
																},
																{
																	"content": [
																		{
																			"number": "[1] ",
																			"content": [
																				{
																					"text": "A plan or plans drawn at a scale of 1/4 inch which clearly indicate\nthe following:"
																				},
																				{
																					"content": [
																						{
																							"number": "[a] ",
																							"content": [
																								{
																									"text": "The dimensions, orientation and area of the building plot with\nsetback dimensions clearly indicated."
																								}
																							]
																						},
																						{
																							"number": "[b] ",
																							"content": [
																								{
																									"text": "The size, shape and location of existing and proposed construction\nand relationship to adjacent properties, buildings and structures."
																								}
																							]
																						},
																						{
																							"number": "[c] ",
																							"content": [
																								{
																									"text": "A summary of areas of existing or proposed buildings and an\nindication of their proposed uses."
																								}
																							]
																						},
																						{
																							"number": "[d] ",
																							"content": [
																								{
																									"text": "Locations of existing streets, points of entry and egress for\nmotor vehicles and locations and layout of all paved areas, including\noff-street parking."
																								}
																							]
																						},
																						{
																							"number": "[e] ",
																							"content": [
																								{
																									"text": "Location of existing and proposed plantings and screening devices,\nwalls, fences and railings and their height and the materials of their\nconstruction."
																								}
																							]
																						},
																						{
																							"number": "[f] ",
																							"content": [
																								{
																									"text": "Indication of exterior lighting adequate to determine its character\nand to enable review of possible hazards and disturbances to the public\nand adjacent properties."
																								}
																							]
																						},
																						{
																							"number": "[g] ",
																							"content": [
																								{
																									"text": "Indication of other potential disturbances to the public and\nadjacent properties."
																								}
																							]
																						}
																					]
																				}
																			]
																		},
																		{
																			"number": "[2] ",
																			"content": [
																				{
																					"text": "Photographs of the site and adjacent areas and structures sufficient\nto provide adequate representation thereof."
																				}
																			]
																		},
																		{
																			"number": "[3] ",
																			"content": [
																				{
																					"text": "Detailed drawings of decorative elements."
																				}
																			]
																		},
																		{
																			"number": "[4] ",
																			"content": [
																				{
																					"text": "Sectional drawings to explain the character of the design."
																				}
																			]
																		},
																		{
																			"number": "[5] ",
																			"content": [
																				{
																					"text": "All site plan applications, if any, submitted to the Village\nBoard of Trustees.[Amended 6-17-2014 by L.L. No. 8-2014]"
																				}
																			]
																		},
																		{
																			"number": "[6] ",
																			"content": [
																				{
																					"text": "Complete and accurate exterior elevations of all facades, drawn\nat a scale adequate to show clearly the appearance of all proposed\nbuildings and structures."
																				}
																			]
																		}
																	]
																}
															]
														},
														{
															"number": "(e) ",
															"content": [
																{
																	"text": "The Board may waive any of the requirements of Subsection F(5)(c) and (d) above where, due to character, size, location or special circumstances, any particular information, or the preliminary conference, is not required in order for the Board to properly perform its review."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(6) ",
											"content": [
												{
													"text": "Reasons for disapproval of application; approval of application."
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "The Board shall disapprove any application referred to it if\nthe Board finds that the application, if granted, would be detrimental\nto the character, property values or development of the R-4 District,\nthe surrounding area or of the Village as a whole by reason of any\nof the following:"
																},
																{
																	"content": [
																		{
																			"number": "[1] ",
																			"content": [
																				{
																					"text": "Excessive similarity of design in relation to any other structure\nexisting or for which a permit has been issued, or to any other structure\nincluded in the same permit application, in respect to one or more\nof the following features, such as, but not limited to, doors, windows,\nporticos or other openings or breaks in the facade facing the street,\nincluding reverse arrangement, or other significant identical features,\nsuch as, but not limited to, construction material, roofline and height\nor other design elements, provided that a finding of excessive similarity\nof design shall include not only that such similarity exists but also\nthat it is of such a nature as to produce undesirable effects."
																				}
																			]
																		},
																		{
																			"number": "[2] ",
																			"content": [
																				{
																					"text": "Excessive dissimilarity of design or inappropriateness of design\nor of the site plan in relation to any other building or structure\nexisting or for which a permit has been issued, or to any other building\nor structure included in the same permit application, or inappropriateness\nor excessive dissimilarity of design in relation to the characteristics\nof building design generally prevailing in the R-4 District of the\nVillage, in respect to one or more of the following features: cubical\ncontents; gross floor area; height of building or height of roof;\nother significant design features, such as, but not limited to, construction\nmaterial or quality or architectural design; or yard dimensions, provided\nthat a finding of excessive dissimilarity or inappropriateness of\ndesign shall include not only that such dissimilarity or inappropriateness\nexists but also visual offensiveness, inappropriateness, inconsistency\nof design or other poor qualities of exterior design, including considerations\nof the harmony or discord of colors or materials or incompatibility\nof the proposed building or structure with the terrain on which it\nis to be located, including but not limited to excessive divergences\nof the height or levels of any part of the building or structure from\nthe grade of the terrain that are of such a nature as to produce undesirable\neffects."
																				}
																			]
																		},
																		{
																			"number": "[3] ",
																			"content": [
																				{
																					"text": "A finding that the building or structure for which the permit was requested, if erected or altered in accordance with the submitted plan, would not be in harmony with the purpose of this Subsection F; would be visually offensive or inappropriate by reason of poor quality of exterior design or inappropriateness of design in relation to any other building or structure; would mar the appearance of the area; would impair the use, enjoyment and desirability or reduce the values of properties in the area; would be detrimental to the character of the neighborhood; would prevent the most appropriate development and utilization of the site or of adjacent lands; or would adversely affect the functioning, economic stability, prosperity, health, safety and general welfare of the entire community."
																				}
																			]
																		}
																	]
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "In disapproving any application, the Board may specify modifications in the design of the buildings or structures or any of them or in requirements as to yard or other dimensions that will be adequate to render the same acceptable under the provisions of this Subsection F."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "In approving any application, the Board may impose appropriate\nconditions and safeguards designed to prevent undesirable effects."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(7) ",
											"content": [
												{
													"text": "Issuance of building permit. The Superintendent of Buildings shall\nonly issue a building permit for which the application has been approved\nby the Board. If, within 90 days after the date on which an application\nhas been duly filed, or within such longer period as may have been\nconsented to by the applicant, the Board has not disapproved the same,\nthe application shall be deemed denied.[Amended 9-21-2010 by L.L. No. 1-2010]"
												}
											]
										},
										{
											"number": "(8) ",
											"content": [
												{
													"text": "Referral of subdivision plats to Board. Every subdivision plat filed\nwith the Board of Trustees relating to the R-4 District shall be referred\nto the Board within 30 days after the date on which the same was fully\nfiled, and the Board shall, within 120 days after said date of filing,\nreport its recommendations thereon, if any, to the Board of Trustees.\nIn considering any such plat, the Board may require the proposed developer\nof the land covered by the plat to submit a plan of proposed building\ndevelopment, including drawings showing the design of the exterior\nappearance of all proposed buildings and structures.[Amended 9-21-2010 by L.L. No. 1-2010]"
												}
											]
										},
										{
											"number": "(9) ",
											"content": [
												{
													"text": "Appeals. Any person aggrieved by any action of the Board may appeal\ntherefrom to the Zoning Board of Appeals of the Village. The Zoning\nBoard of Appeals may reverse, modify or affirm the action of the Board."
												}
											]
										},
										{
											"number": "(10) ",
											"content": [
												{
													"text": "Fees. Every application hereunder shall be accompanied by a\nfee payable to the Village Clerk/Treasurer in such amount as determined\nfrom time to time by resolution of the Board of Trustees."
												}
											]
										},
										{
											"number": "(11) ",
											"content": [
												{
													"text": "Independent consultant; reimbursable expenses. The Board shall\nbe permitted to hire an independent architectural consultant to advise\nit on any application it deems appropriate. The applicant shall be\nresponsible for all consultant fees. No building permit shall be issued\nto the applicant until all expenses incurred by the Architectural\nDesign Review Board for consultation fees (including but not limited\nto architectural and legal expenses) or other extraordinary expenses\nin connection with the review of an application are reimbursed to\nthe Village by the applicant. At the time of application, the applicant\nshall deposit with the Village Clerk/Treasurer such amount to cover\nconsultation fees and extraordinary expenses. In instances where such\nexpenses are minimal, the requirement for reimbursement of expenses\nmay be waived by resolution of the Architectural Design Review Board."
												}
											]
										}
									]
								}
							]
						}
					]
				}
			]
		}
	]
}	