{
	"url": "http://ecode360.com/10977367",
	"paras": [
		{
			"paragraph": "§ 150-7",
			"title": "R-1 One-Family Residence District.",
			"content": [
				{
					"text": "In an R-1 One-Family Residence District, no\nbuilding or premises shall be used and no building or part of a building\nshall be erected or altered which is arranged, intended or designed\nto be used, in whole or in part, for any uses except the following:"
				},
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Permitted uses."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "One-family detached dwellings, not to exceed one dwelling\non each lot."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Buildings, structures and uses owned or operated by\nthe Village of Greenport."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Conditional uses. The following conditional uses are permitted, subject to approval by the Planning Board in accordance with §§ 150-29 and 150-30 hereof, and subject to the regulations specified below and elsewhere in this chapter:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Places of worship, including parish houses, but excluding\na rectory or parsonage, which shall conform to the requirements for\na one-family dwelling. Special conditions include the following:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "No building or part thereof shall be erected\nnearer than 50 feet to any street or property line."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "The sum of all areas covered by all principal\nand accessory buildings shall not exceed 20% of the area of the lot."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Schools. Special conditions include the following:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "Same as Subsection B(1)(a) and (b) above."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "Any such school shall be a nonprofit organization\nwithin the meaning of the Internal Revenue Act and shall be registered\neffectively as such thereunder."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "Any such school shall occupy a lot with an area\nof not less than one acre plus one acre for each 100 pupils for which\nthe building is designed."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Philanthropic or eleemosynary institutions, hospitals\nor sanatoriums for general medical care. Special conditions include\nthe following:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "Same as Subsection B(1)(a) and (b) above."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "Each such use shall occupy a lot which shall\nhave an area containing not less than one acre."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "Annual membership clubs providing outdoor recreational\nfacilities, such as private playgrounds, swimming pools and tennis\ncourts. Special conditions include the following:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "Same as Subsection B(1)(a) and (b), above."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "Any such club shall be incorporated pursuant\nto the provisions of the Not-for-Profit Corporation, Membership Corporation[1] or the Benevolent Orders Law of the State of New York\nand cater exclusively to members and their guests, or shall be an\nunincorporated association approved by the Village Board and catering\nexclusively to members and their guests."
																},
																{
																	"footnote": "[1]\nEditor's Note: See Art. 3, of the Cooperative\nCorporations Law.\n"
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "Any such use shall not be conducted as a business\nenterprise."
																}
															]
														},
														{
															"number": "(d) ",
															"content": [
																{
																	"text": "Such use shall occupy a lot with an area of\nnot less than one acre."
																}
															]
														},
														{
															"number": "(e) ",
															"content": [
																{
																	"text": "The use of outdoor public-address systems for\nany purpose shall be only by special permit."
																}
															]
														},
														{
															"number": "(f) ",
															"content": [
																{
																	"text": "Exterior lighting, other than that essential\nfor the safety and convenience of the users of the premises, shall\nbe only by special permit."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "Railroad, public utility and television towers, rights-of-way\nand related structures necessary to serve areas within the Village,\nsubject to such conditions as the Planning Board may impose in order\nto protect and promote the health and safety and general welfare of\nthe community and the character of the neighborhood in which the proposed\nstructure is to be constructed."
												}
											]
										},
										{
											"number": "(6) ",
											"content": [
												{
													"text": "Cemeteries."
												}
											]
										},
										{
											"number": "(7) ",
											"content": [
												{
													"text": " Bed-and-breakfast facilities, subject to the following\nconditions:[Added 11-16-1989 by L.L. No. 9-1989]"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "Facilities are clearly incidental and subordinate\nto the principal use of the dwelling."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "The dwelling is occupied on a continual basis\nby the owner during rental periods."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "The renting of rooms is limited to three rooms\nfor lodging and serving of breakfast."
																}
															]
														},
														{
															"number": "(d) ",
															"content": [
																{
																	"text": "Not more than two individuals shall occupy a\nroom for a maximum total of six casual and transient roomers."
																}
															]
														},
														{
															"number": "(e) ",
															"content": [
																{
																	"text": "Minimum lot size is 10,000 square feet."
																}
															]
														},
														{
															"number": "(f) ",
															"content": [
																{
																	"text": "Minimum house size is 2,000 square feet."
																}
															]
														},
														{
															"number": "(g) ",
															"content": [
																{
																	"text": "One off-street parking space is provided for\neach rental room."
																}
															]
														},
														{
															"number": "(h) ",
															"content": [
																{
																	"text": "Parking areas are designated and set back five\nfeet from the boundary line."
																}
															]
														},
														{
															"number": "(i) ",
															"content": [
																{
																	"text": "Parking areas are screened from neighbors by\nfence or plantings with a minimum height of five feet."
																}
															]
														},
														{
															"number": "(j) ",
															"content": [
																{
																	"text": "The minimum size of a room is 120 square feet."
																}
															]
														},
														{
															"number": "(k) ",
															"content": [
																{
																	"text": "Each room has a window which can be opened,\nminimum window size to be four square feet. Windows shall comply with\nthe New York State Uniform Fire Prevention and Building Construction\nCode (Part 714 - Openings for Emergency Use).[2]"
																},
																{
																	"footnote": "[2]\nEditor's Note: Amended at time of adoption of Code; see Ch. 1, General Provisions, Art. I.\n"
																}
															]
														},
														{
															"number": "(l) ",
															"content": [
																{
																	"text": "Guests to be transient with a maximum period\nof stay for any guest limited to one month."
																}
															]
														},
														{
															"number": "(m) ",
															"content": [
																{
																	"text": "All are subject to site plan approval."
																}
															]
														}
													]
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Permitted accessory uses, limited to the following:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Customary home occupations, provided that:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "No display of goods or signs is visible from the street, except as set forth in Subsection C(6) below."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "Such occupation is incidental to the residential\nuse of the premises and is carried on in the principal building by\na resident therein with not more than two nonresident assistants."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "Such occupation is carried on in an area not\nexceeding 30% of the area of the ground floor of the principal building."
																}
															]
														},
														{
															"number": "(d) ",
															"content": [
																{
																	"text": "At no time shall any premises be used in such\na manner as to cause the emanation therefrom of offensive or noxious\nodors, vapors, fumes, glare, dust, smoke, gas, vibration, noise or\nradiation, or be used in such a manner as to cause injury, annoyance\nor disturbance to any of the surrounding properties and to their owners\nand occupants."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Professional office or studio of an architect, artist,\ndentist, real estate agent, engineer, lawyer, musician, teacher, physician,\nveterinarian or other professions of similar character, provided that:[Amended 5-16-1996 by L.L. No. 3-1996]"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "Such office or studio is incidental to the residential\nuse of the premises and is carried on by a resident thereon with not\nmore than two nonresident assistants."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "Such office or studio shall occupy not more\nthan 30% of the area of the ground floor of the main building."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "Studios where dancing or music instruction is\noffered to groups in excess of four pupils at one time or where concerts\nor recitals are held are prohibited."
																}
															]
														},
														{
															"number": "(d) ",
															"content": [
																{
																	"text": "Equipment capable of causing interference with\nradio or television reception in the neighborhood shall be prohibited\nunless also equipped with means to prevent such interference."
																}
															]
														},
														{
															"number": "(e) ",
															"content": [
																{
																	"text": "Veterinarians' offices shall not be located\nwithin 50 feet of any lot line, and no kennel, runway, exercise pen\nor similar animal housing shall be located within 100 feet of any\nlot line."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Garden house, toolhouse, playhouse, wading pool or\nswimming pool incidental to the residential use of the premises and\nnot operated for gain, provided that swimming pools of any size and\na depth in excess of six inches shall be subject to the following\nrequirements:[Amended 5-16-1996 by L.L. No. 3-1996]"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "The edge of the pool shall be kept a distance\nof not less than 20 feet from all property lines."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "If located within 50 feet of any property line,\nsuch pool shall be screened from the view of abutting properties."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "An adequate permanent fence or barrier shall\nbe erected, maintained and provided with a self-closing, self-latching\ngate to prevent unauthorized use of the pool and to prevent accidents,\nin accordance with Section 720.1 of the New York State Uniform Fire\nPrevention and Building Construction Code."
																}
															]
														},
														{
															"number": "(d) ",
															"content": [
																{
																	"text": "Swimming pools 100 square feet in area and having\na depth of six inches shall require a permit and the payment of a\nfee."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "Private garages. Two passenger automobile spaces in\nsuch garages may be leased to persons not resident on the premises."
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "The keeping of three customary household pets, but\nexcluding the commercial breeding or keeping of the same.[Amended 5-16-1996 by L.L. No. 3-1996]"
												}
											]
										},
										{
											"number": "(6) ",
											"content": [
												{
													"text": "The following signs, subject to § 150-15:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "One nonilluminated nameplate or professional\nsign with an area of not over two square feet."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "One temporary nonilluminated sign advertising\nthe sale or rental of the premises on which such sign is situated,\nwith an area of not over four square feet, provided that such sign\nis located on the front wall of a building or, if freestanding, then\nnot nearer than 15 feet to any street line and to any property line."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "One indirectly illuminated bulletin board or other announcement sign for educational or religious institutions permitted in Subsection B above, with an area of not over 10 square feet, provided that such sign is located not nearer than 15 feet to any street or property line or is attached to the building if closer."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(7) ",
											"content": [
												{
													"text": "Boats. Not more than four boats may be stored, docked,\nmoored or anchored for more than 48 hours on any waters or adjoining\nwaterways.[Amended 5-16-1996 by L.L. No. 3-1996]"
												}
											]
										},
										{
											"number": "(8) ",
											"content": [
												{
													"text": "Yard sales, attic sales, garage sales, auction sales,\nporch sales or similar type of sales of personal property owned by\nthe occupant of the premises and located thereon, subject to the following\nrestrictions:[Added 12-10-1979 by L.L. No. 5-1979]"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "Not more than two such sales shall be conducted\non any lot in any one calendar year.[Amended 8-15-2002 by L.L. No. 3-2002]"
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "Adequate supervised parking facilities shall\nbe provided."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "No signs, except one on-premises sign not larger\nthan three by four (3 x 4) feet in size, displayed for a period of\nno longer than one week immediately prior to the day of such sale,\nshall be permitted."
																}
															]
														},
														{
															"number": "(d) ",
															"content": [
																{
																	"text": "A permit is obtained therefor from the Building\nInspector upon the payment of a fee of $5."
																}
															]
														}
													]
												}
											]
										}
									]
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 150-8",
			"title": "R-2 One- and Two-Family Residence District.",
			"content": [
				{
					"text": "In an R-2 One- and Two-Family Residence District,\nno building or premises shall be used and no building or part of a\nbuilding shall be erected or altered which is arranged, intended or\ndesigned to be used, in whole or in part, for any purpose except for\nthe following:"
				},
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Permitted uses."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Any use permitted in an R-1 One-Family Residence District as provided in § 150-7A."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Two-family dwelling."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Conditional uses. The following conditional uses are permitted, subject to approval by the Planning Board in accordance with §§ 150-29 and 150-30 hereof, and subject to the regulations specified below and elsewhere in this chapter:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Any use conditionally permitted in the R-1 Residence District as provided in § 150-7B, except cemeteries."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "[1]Conversion of an existing dwelling to a multifamily dwelling, as provided in Art. VII of this chapter, subject to the following conditions:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "Said structure shall have contained on the effective\ndate of this chapter not less than 1,000 square feet of livable floor\narea for each dwelling unit created."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "The lot on which such structure is located shall\ncontain a minimum of 15,000 square feet of lot area and shall contain\nat least 5,000 square feet of lot area for each dwelling unit."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "One and one-half (11/2) parking spaces shall\nbe provided for each dwelling unit."
																}
															]
														}
													]
												},
												{
													"footnote": "[1]\nEditor's Note: Amended at time of adoption of Code; see Ch. 1, General Provisions, Art. I.\n"
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Permitted accessory uses. Any accessory use permitted in the R-1 One-Family District as provided in § 150-7C."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 150-9",
			"title": "CR Retail Commercial District.",
			"content": [
				{
					"text": "In a CR Retail Commercial District, no building or premises shall be used and no building or part of a building shall be erected or altered which is arranged, intended or designed to be used, in whole or in part, for any use except as listed below, and all such uses will be subject to site plan approval in accordance with Article XI, § 150-30, hereof:"
				},
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": " Permitted uses:[Amended 3-1-1990 by L.L. No. 1-1990]"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Retail stores and banks."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Personal service stores, such as but not limited to\nbarbershops, beauty parlors and tailors."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Eating and drinking places."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "Business, professional or governmental offices."
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "Service establishments furnishing services other than\nof a personal nature.[1]"
												},
												{
													"footnote": "[1]\nEditor's Note: Amended at time of adoption of Code; see Ch. 1, General Provisions, Art. I.\n"
												}
											]
										},
										{
											"number": "(6) ",
											"content": [
												{
													"text": "Theaters, hotels and motels."
												}
											]
										},
										{
											"number": "(7) ",
											"content": [
												{
													"text": "Outlets and pickup stations for laundries and cleaning\nestablishments, excluding a commercial laundry as such. Cleaning of\nwearing apparel or household efforts on the premises shall be permitted\nonly if noncombustible solvent is used, except for the incidental\nremoval of spots with combustible solvent."
												}
											]
										},
										{
											"number": "(8) ",
											"content": [
												{
													"text": "Newspaper printing, including incidental job printing."
												}
											]
										},
										{
											"number": "(9) ",
											"content": [
												{
													"text": "Manufacturing, assembling, converting, altering, finishing,\ncleaning or any other processing of products where goods so produced\nor processed are to be sold at retail exclusively on the premises,\nprovided that:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "The space so used is fully concealed from any\nstreet and equal in area to no more than 20% of the square footage\ndevoted to retail sales."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "Not more than two employees are engaged in such\nproduction or processing."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(10) ",
											"content": [
												{
													"text": "Clubs and fraternal lodges."
												}
											]
										},
										{
											"number": "(11) ",
											"content": [
												{
													"text": "Mortuary and funeral parlors."
												}
											]
										},
										{
											"number": "(12) ",
											"content": [
												{
													"text": "Marina and docking facilities."
												}
											]
										},
										{
											"number": "(13) ",
											"content": [
												{
													"text": "Gasoline service stations, except that they\nshall be prohibited in a floodplain or in an historic district.[2]"
												},
												{
													"footnote": "[2]\nEditor's Note: Amended at time of adoption of Code; see Ch. 1, General Provisions, Art. I.\n"
												}
											]
										},
										{
											"number": "(14) ",
											"content": [
												{
													"text": "Self-service gasoline stations, subject to all of the provisions of § 150-10A(8), and the following additional requirements."
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "A service station which offers both self-service\nfacilities and full service shall confine the self-service dispensing\nunits to one service island with not more than three units, each of\nwhich may utilize up to two hoses and nozzles."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "Self-service gasoline stations shall be protected\nby an automatic fire-protection system in the form of an approved\nsystem of dry-powder release which will act as an automatic fire extinguisher,\nor in a form in conformity with nationally recognized good practice\nand standards."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "Self-service gasoline stations, whether totally\nor partly self-service, shall operate the self-service dispensing\nunits only when there is at least one attendant working on the premises\nwhose primary function shall be to supervise, observe and control\nthe dispensing of motor fuels while said motor fuels are actually\nbeing dispensed."
																}
															]
														},
														{
															"number": "(d) ",
															"content": [
																{
																	"text": "It shall be the responsibility of the attendant\nto prevent the dispensing of motor fuels into portable containers\nwhich do not comply with any state, county and local requirements;\nto control sources of ignition and to immediately handle accidental\nspills and fire extinguishers if needed. The attendant or supervisor\non duty shall be mentally and physically capable of performing the\nfunctions and assuming the responsibility prescribed in this subsection.\nNo attendant shall be less than 18 years of age.[Amended 5-16-1996 by L.L. No. 3-1996]"
																}
															]
														},
														{
															"number": "(e) ",
															"content": [
																{
																	"text": "The dispensing areas shall at all times be in\nclear view of the attendant, and the placing or allowing of any obstacles\nto come between the dispensing area and the attendant control area\nshall be prohibited. The attendant shall at all times be able to communicate\nwith the persons in the dispensing area."
																}
															]
														},
														{
															"number": "(f) ",
															"content": [
																{
																	"text": "Self-service gasoline stations shall have all\nself-service dispensing units controlled by approved dispensing devices,\nsuch as coin- or card-operated, or remote-controlled types, such as\ncomputer consoles."
																}
															]
														},
														{
															"number": "(g) ",
															"content": [
																{
																	"text": "There shall be no latch-open device on any self-service\ndispensing nozzle."
																}
															]
														},
														{
															"number": "(h) ",
															"content": [
																{
																	"text": "Operating instructions shall be conspicuously\nposted on each self-service dispensing unit."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(15) ",
											"content": [
												{
													"text": "Service stations and repair garages, subject\nto the following regulations:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "The minimum lot size for such establishments\nshall be 7,500 square feet, and the minimum street frontage shall\nbe 75 feet."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "Entrance and exit driveways shall have an unrestricted\nwidth of not less than 16 feet and not more than 20 feet, shall be\nlocated not nearer than 10 feet to any property line and shall be\nso laid out as to avoid the necessity of any vehicle backing out across\nany public right-of-way."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "Vehicle lifts or pits, dismantled automobiles\nand all parts or supplies shall be located within a building enclosed\non all sides."
																}
															]
														},
														{
															"number": "(d) ",
															"content": [
																{
																	"text": "All service or repair of motor vehicles, other\nthan such minor servicing as change of tires or sale of gasoline or\noil, shall be conducted in a building fully enclosed on all sides.\nThis requirement shall not be construed to mean that the doors to\nany repair shop must be kept closed at all times."
																}
															]
														},
														{
															"number": "(e) ",
															"content": [
																{
																	"text": "The storage of gasoline or flammable oils in\nbulk shall be located fully underground and not nearer than 15 feet\nto any property line other than the street."
																}
															]
														},
														{
															"number": "(f) ",
															"content": [
																{
																	"text": "No gasoline pumps shall be located nearer than\n15 feet to any street line."
																}
															]
														},
														{
															"number": "(g) ",
															"content": [
																{
																	"text": "No building permit shall be issued for any such\nestablishment within a distance of 200 feet of any school, church,\nhospital or other place of public assembly designed for occupancy\nby more than 50 persons, said distance to be measured in a straight\nline between the nearest points of each of the lots or premises."
																}
															]
														},
														{
															"number": "(h) ",
															"content": [
																{
																	"text": "Sale of used cars shall be conducted only as\nan accessory to new car sales."
																}
															]
														},
														{
															"number": "(i) ",
															"content": [
																{
																	"text": "Unused service station or commercial property\nmust be enclosed to prevent unauthorized use."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(16) ",
											"content": [
												{
													"text": "Gallery.[Added 11-19-1998 by L.L. No. 11-1998]"
												}
											]
										},
										{
											"number": "(17) ",
											"content": [
												{
													"text": "Studio.[Added 11-19-1998 by L.L. No. 11-1998]"
												}
											]
										},
										{
											"number": "(18) ",
											"content": [
												{
													"text": "Accessory apartment dwelling units over retail\nstores and businesses, professional and governmental offices existing\nas of July 1, 2002, and in accessory buildings thereof also existing\nas of July 1, 2002, subject to the following standards and requirements:[Added 7-19-2002 by L.L. No. 2-2002]"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "Inspection by the Village Building Inspector\nto ensure compliance with all requirements of the New York State Uniform\nFire Prevention and Building Code and all other applicable state and\nlocal regulations prior to the issuance of a building permit or certificate\nof occupancy."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "Apartments shall not be located on the first\nfloor of principal buildings. Residential units in accessory buildings\nmay be on any floor of such accessory building."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "Notwithstanding anything in Chapter 150 to the contrary, accessory apartment dwelling units as permitted by this subsection shall not be subject to site plan approval."
																}
															]
														},
														{
															"number": "(d) ",
															"content": [
																{
																	"text": "The property owner shall provide proof, to the\nsatisfaction of the Village Building Inspector, that the apartment\nwill be occupied year-round, and not on a seasonal basis."
																}
															]
														}
													]
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Conditional uses permitted upon approval by the Planning Board in accordance with Article XI hereof. The following conditional uses are permitted, subject to the approval of the Planning Board in accordance with §§ 150-29 and 150-30 hereof, and subject to the regulations specified below and elsewhere in this chapter:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Conditional uses permitted in § 150-7B(5)."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Permitted accessory uses."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Customary accessory uses, including off-street parking and loading facilities, subject to § 150-16, and signs, subject to § 150-15, and the following conditions:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "Not more than one such sign shall be permitted\nfor each tenant on the premises on each wall fronting on a street."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "The aggregate area in square feet of all signs\non any wall shall be not greater than two times the length in feet\nof such wall."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "In addition, where the building is set back\nfrom the street line a distance of 25 feet or more, not more than\none freestanding sign may be erected with a total area on all faces\nof not more than 40 square feet. Such sign shall not be erected nearer\nthan six feet to any building nor encroach on any required side yard."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Artist dwelling.[Added 11-19-1998 by L.L. No. 11-1998]"
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "All uses permitted in Subsections A and B above shall be carried on in buildings fully enclosed on all sides, except for parking and loading facilities."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 150-10",
			"title": "CG General Commercial District.",
			"content": [
				{
					"text": "In a CG General Commercial District, no building or premises shall be used and no building or part of a building shall be erected or altered which is arranged, intended or designed to be used, in whole or in part, for any use except those listed below, and all such uses shall be subject to site plan approval in accordance with § 150-30 hereof:"
				},
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Permitted uses."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Any use permitted in the CR Retail Commercial District as provided in § 150-9A."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Service establishments furnishing services other than\nof a personal nature."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Self-service gasoline stations, subject to all of the provisions of § 150-10A(8), and the following additional requirements:[Added 6-19-1979 by L.L. No. 1-1979]"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "A service station which offers both self-service\nfacilities and full service shall confine the self-service dispensing\nunits to one service island with not more than three units, each of\nwhich may utilize up to two hoses and nozzles."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "Self-service gasoline stations shall be protected\nby an automatic fire-protection system in the form of an approved\nsystem of dry-powder release which will act as an automatic fire extinguisher,\nor in a form in conformity with nationally recognized good practice\nand standards."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "Self-service gasoline stations, whether totally\nor partly self-service, shall operate the self-service dispensing\nunits only when there is at least one attendant working on the premises\nwhose primary function shall be to supervise, observe and control\nthe dispensing of motor fuels while said motor fuels are actually\nbeing dispensed."
																}
															]
														},
														{
															"number": "(d) ",
															"content": [
																{
																	"text": "It shall be the responsibility of the attendant\nto prevent the dispensing of motor fuels into portable containers\nwhich do not comply with any state, county and local requirements;\nto control sources of ignition; and to immediately handle accidental\nspills and fire extinguishers if needed. The attendant or supervisor\non duty shall be mentally and physically capable of performing the\nfunctions and assuming the responsibility prescribed in this subsection.\nNo attendant shall be less than 18 years of age.[Amended 5-16-1996 by L.L. No. 3-1996]"
																}
															]
														},
														{
															"number": "(e) ",
															"content": [
																{
																	"text": "The dispensing areas shall at all times be in\nclear view of the attendant, and the placing or allowing of any obstacles\nto come between the dispensing area and the attendant control area\nshall be prohibited. The attendant shall at all times be able to communicate\nwith the persons in the dispensing area."
																}
															]
														},
														{
															"number": "(f) ",
															"content": [
																{
																	"text": "Self-service gasoline stations shall have all\nself-service dispensing units controlled by approved dispensing devices,\nsuch as coin- or card-operated, or remote-controlled types, such as\ncomputer consoles."
																}
															]
														},
														{
															"number": "(g) ",
															"content": [
																{
																	"text": "There shall be no latch-open device on any self-service\ndispensing nozzle."
																}
															]
														},
														{
															"number": "(h) ",
															"content": [
																{
																	"text": "Operating instructions shall be conspicuously\nposted on each self-service dispensing unit."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "Light manufacturing, assembling, converting, altering,\nfinishing or any other processing and incidental storage of products\nand materials."
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "Wholesaling, storing and warehousing, including building\ncontractors, building supply and lumber yards."
												}
											]
										},
										{
											"number": "(6) ",
											"content": [
												{
													"text": "Research and design laboratory."
												}
											]
										},
										{
											"number": "(7) ",
											"content": [
												{
													"text": "Utility and public transportation facilities."
												}
											]
										},
										{
											"number": "(8) ",
											"content": [
												{
													"text": "Motor vehicle sales, service stations and repair garages,\nsubject to the following regulations:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "The minimum lot size for such establishments\nshall be 7,500 square feet, and the minimum street frontage shall\nbe 75 feet."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "Entrance and exit driveways shall have an unrestricted\nwidth of not less than 16 feet and not more than 20 feet, shall be\nlocated not nearer than 10 feet to any property line and shall be\nso laid out as to avoid the necessity of any vehicle backing out across\nany public rights-of-way."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "Vehicle lifts or pits, dismantled automobiles\nand all parts or supplies shall be located within a building enclosed\non all sides."
																}
															]
														},
														{
															"number": "(d) ",
															"content": [
																{
																	"text": "All service or repair of motor vehicles, other\nthan such minor servicing as change of tires or sale of gasoline or\noil, shall be conducted in a building fully enclosed on all sides.\nThis requirement shall not be construed to mean that the doors to\nany repair shop must be kept closed at all times."
																}
															]
														},
														{
															"number": "(e) ",
															"content": [
																{
																	"text": "The storage of gasoline or flammable oils in\nbulk shall be located fully underground and not nearer than 15 feet\nto any property line other than the street line."
																}
															]
														},
														{
															"number": "(f) ",
															"content": [
																{
																	"text": "No gasoline pumps shall be located nearer than\n15 feet to any street line."
																}
															]
														},
														{
															"number": "(g) ",
															"content": [
																{
																	"text": "No building permit shall be issued for any such\nestablishments within a distance of 200 feet of any school, church,\nhospital or other place of public assembly designed for occupancy\nby more than 50 persons, said distance to be measured in a straight\nline between the nearest points of each of the lots or premises regardless\nof the district where either premises are located."
																}
															]
														},
														{
															"number": "(h) ",
															"content": [
																{
																	"text": "Sale of used cars shall be conducted only as\nan accessory to new car sales."
																}
															]
														},
														{
															"number": "(i) ",
															"content": [
																{
																	"text": "Unused service station or commercial property\nmust be enclosed to prevent unauthorized use."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(9) ",
											"content": [
												{
													"text": "Gallery.[Added 11-19-1998 by L.L. No. 11-1998]"
												}
											]
										},
										{
											"number": "(10) ",
											"content": [
												{
													"text": "Studio.[Added 11-19-1998 by L.L. No. 11-1998]"
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Conditional uses permitted upon approval by the Planning Board in accordance with Article XI hereof. The following conditional uses are permitted, subject to approval by the Planning Board in accordance with §§ 150-29 and 150-30 hereof, and subject to the regulations specified below and elsewhere in this chapter:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Conditional uses permitted in § 150-7B(5)."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Permitted accessory uses."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Customary accessory uses, including off-street parking and loading facilities subject to § 150-16, and signs, subject to § 150-15, and the conditions as stated in § 150-9C(1)."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Artist dwelling.[Added 11-19-1998 by L.L. No. 11-1998]"
												}
											]
										}
									]
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 150-11",
			"title": "WC Waterfront Commercial District. \n                                                                                          [1]",
			"content": [
				{
					"text": "The objective of this district is to preserve, maintain and encourage water-dependent uses that have traditionally been associated with the Village of Greenport waterfront and to accommodate water-enhanced commercial uses that are compatible with water-dependent uses. In the Waterfront Commercial District, no building or premises shall be used and no building or part of a building shall be erected or altered which is arranged, intended or designed to be used, in whole or in part, for any use except those listed below, and all such uses shall be subject to site plan approval in accordance with § 150-30 hereof:"
				},
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Permitted uses."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Public and private yacht clubs, marinas and docking\nfacilities."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Municipal parks and facilities."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Boat launching facilities."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "Tour boats, commercial, charter and party fishing\nboats."
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "Boat sales, rental, service, repair and storage."
												}
											]
										},
										{
											"number": "(6) ",
											"content": [
												{
													"text": "Shipbuilding yards including facilities for building,\nrepairing and maintaining boat engines and other marine equipment."
												}
											]
										},
										{
											"number": "(7) ",
											"content": [
												{
													"text": "Manufacture of items related or incidental to the\noperations associated with boat building."
												}
											]
										},
										{
											"number": "(8) ",
											"content": [
												{
													"text": "Fish and shellfish processing plants."
												}
											]
										},
										{
											"number": "(9) ",
											"content": [
												{
													"text": "Retail sale of equipment, goods, supplies, materials,\ntools and parts used in connection with boating and fishing."
												}
											]
										},
										{
											"number": "(10) ",
											"content": [
												{
													"text": "Retail and wholesale of seafood products."
												}
											]
										},
										{
											"number": "(11) ",
											"content": [
												{
													"text": "Retail fuel storage and sales solely for boats."
												}
											]
										},
										{
											"number": "(12) ",
											"content": [
												{
													"text": "Boating instruction schools."
												}
											]
										},
										{
											"number": "(13) ",
											"content": [
												{
													"text": "Oceanographic or marine-related scientific research\nand equipment manufacture and testing."
												}
											]
										},
										{
											"number": "(14) ",
											"content": [
												{
													"text": "Maritime museums."
												}
											]
										},
										{
											"number": "(15) ",
											"content": [
												{
													"text": "Aquaculture facilities, including fish rearing\nand fish release facilities."
												}
											]
										},
										{
											"number": "(16) ",
											"content": [
												{
													"text": "Gallery.[Added 11-19-1998 by L.L. No. 11-1998]"
												}
											]
										},
										{
											"number": "(17) ",
											"content": [
												{
													"text": "Studio.[Added 11-19-1998 by L.L. No. 11-1998]"
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Conditional uses."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Motels and hotels which may include conference facilities."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Eating and drinking establishments."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Retail sale and manufacturing of retail products."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "Marine-related business offices (except as provided\nfor under permitted accessory uses) which handle matters principally\nrelated to the design, manufacture, service, storage, purchase, sale\nand lease of insurance of boats and related marine equipment; fishing\nand other marine harvesting; and fish processing."
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "Hospitals for human health care."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Standards for conditional uses."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Where the subject property abuts the water, conditional uses shall be permitted when established in conjunction with a permitted use or uses listed in § 150-11A and in accordance with the following conditions:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "Conditional uses and related accessory uses\nshall not exceed more than 70% of the allowed lot coverage."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "Any conditional use shall cease if the permitted\nuse or uses on the subject property are discontinued."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "Uses over water."
																},
																{
																	"content": [
																		{
																			"number": "[1] ",
																			"content": [
																				{
																					"text": "Such use or combination of conditional uses\nshall not be permitted over surface waters, except in accordance with\nthe following conditions:"
																				},
																				{
																					"content": [
																						{
																							"number": "[a] ",
																							"content": [
																								{
																									"text": "The adjacent upland property shall\nbe within the Waterfront Commercial District."
																								}
																							]
																						},
																						{
																							"number": "[b] ",
																							"content": [
																								{
																									"text": "Such use and related accessory\nuse shall be located on and occupy a pier existing on the effective\ndate of this section."
																								}
																							]
																						},
																						{
																							"number": "[c] ",
																							"content": [
																								{
																									"text": "Such use and related accessory\nuse shall not displace an existing permitted use or uses."
																								}
																							]
																						},
																						{
																							"number": "[d] ",
																							"content": [
																								{
																									"text": "Such use and related accessory\nuses shall not cover more than 50% of the over-water deck, dock, pier\nor wharf or any other over-water structure upon which it is located\nand shall be located upon the most landward portion of the structure."
																								}
																							]
																						},
																						{
																							"number": "[e] ",
																							"content": [
																								{
																									"text": "The waterward portion of the structure\nshall be a designated public accessway or a permitted use or uses."
																								}
																							]
																						},
																						{
																							"number": "[f] ",
																							"content": [
																								{
																									"text": "Such uses and related accessory\nuses are summer seasonal (May through October) and shall not be contained\nin a permanently enclosed structure."
																								}
																							]
																						},
																						{
																							"number": "[g] ",
																							"content": [
																								{
																									"text": "The site of such use and related\naccessory uses provides public access on a year-round basis to and\non the site as an extension as part of a designated public accessway\nno less than eight feet in width."
																								}
																							]
																						}
																					]
																				}
																			]
																		},
																		{
																			"number": "[2] ",
																			"content": [
																				{
																					"text": "Provided that a permanent structure existed\nprior to October 12, 1988, existing year-round nonconforming uses\nmay be allowed to occupy a permanently enclosed structure on a deck,\ndock, pier or wharf or any other over-water structure."
																				}
																			]
																		}
																	]
																}
															]
														},
														{
															"number": "(d) ",
															"content": [
																{
																	"text": "Consideration shall be given to the quality\nand extent of views from the adjacent public streets through the property\nto the water as well as the design and relationship of development\nto the waterfront as viewed from the water."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Where the subject property does not abut the water,\nconditional uses shall be permitted when established in accordance\nwith condition C(1)(d) above."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "Special conditions for motels and hotels include the\nfollowing:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "The entire facility shall strictly adhere to the definition of a motel or hotel in § 150-2 of the Village Code."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "All units shall be in multiple-unit structures, and\nthe site shall not be subdivided for the purposes of creating individual\nlots or sites for the creation of single-family residences or units."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "The design, scale and appearance of units, structures\nand the entire facility shall be compatible with present and potential\nuses of adjacent properties and structures and with the character\nof the neighborhood."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "The size, scale or configuration of a proposed facility\nmust be found not to create an undue increase in traffic congestion\non adjacent and nearby public streets or highways."
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "Structures and outdoor activities will be reasonably\nscreened from adjacent properties. Landscaping and buffer zones will\nbe provided to reduce noise, dust and visibility."
												}
											]
										},
										{
											"number": "(6) ",
											"content": [
												{
													"text": "Outdoor lighting shall be contained on the site and\nshielded to assure that lighting is not visible from neighboring lots."
												}
											]
										},
										{
											"number": "(7) ",
											"content": [
												{
													"text": "There shall be no outdoor public address or music\nsystem audible beyond the limits of the site."
												}
											]
										},
										{
											"number": "(8) ",
											"content": [
												{
													"text": "The number of guest rooms may be limited to the availability\nof public water and sewage facilities."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "Special conditions for eating and drinking establishments\ninclude the following:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "The use shall be an on-premises sit-down-type eating\nor drinking establishment. A drive-in or window service facility is\nspecifically prohibited."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "There shall be no outdoor public-address or music\nsystem audible beyond the limits of the site."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "The maximum customer capacity of the restaurant shall\nbe calculated in order to determine potential sewage and kitchen waste\ndisposal. A plan demonstrating how the disposal of sewage and kitchen\nwastes will be handled shall be provided."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "Structures and outdoor eating areas will be reasonably\nscreened from adjacent properties. Landscaping and buffer zones will\nbe provided to reduce noise, dust and visibility."
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "Outdoor lighting shall be contained on the site and\nshielded to assure that lighting is not visible from neighboring lots."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "F. ",
							"content": [
								{
									"text": "Permitted accessory uses."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Customary accessory uses, including off-street parking and loading facilities and offices related to the principal permitted use subject to § 150-16 and signs subject to § 150-15 and the conditions as stated in § 150-9C(1)."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Artist dwelling.[Added 11-19-1998 by L.L. No. 11-1998]"
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "G. ",
							"content": [
								{
									"text": "Public access and building coverage bonus. All uses,\npremises and structures should be designed to allow pedestrian access\nto and along the waterfront. An applicant who proposes to construct\na permanent pedestrian walkway, a minimum of 10 feet in width, for\npublic use along Greenport Harbor to Front Street, that is accepted\nby the Planning Board, shall be granted a bonus building coverage\nof 10% on the lot to be developed. The walkway shall be made available\nfor public use under a mutually acceptable arrangement between the\nVillage and the property owner."
								}
							]
						}
					]
				},
				{
					"footnote": "[1]\nEditor's Note: See Ch. 139, Waterfront Consistency Review, for additional provisions.\n"
				}
			]
		},
		{
			"paragraph": "§ 150-12",
			"title": "Schedule of regulations.",
			"content": [
				{
					"text": "The following schedules of regulations apply to the area of lots, the heights of buildings, the yards and other open spaces to be provided, off-street parking spaces, minimum floor areas and all other matters contained therein as indicated for the various districts established by this chapter. Additional bulk requirements are specified in § 150-13, and off-street loading and parking requirements are specified in § 150-16."
				},
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Bulk and parking regulations for uses permitted in\nR-1 and R-2. [Amended 5-16-1996 by L.L. No. 3-1996; 7-19-2002 by L.L. No. 2-2002]"
								},
								{
                                	"content": [
                                		{
                                			"number": "1. ",
                                			"content": [
                                				{
                                					"text": "Lot area (square feet): One Family: 7,500  Two Family: 7,500 "
                                				}
                                			]
                                		},
                                		{
                                			"number": "2. ",
                                			"content": [
                                				{
                                					"text": "Lot width (feet) One Family: 60  Two Family: 60"
                                				}
                                			]
                                		},
                                		{
                                			"number": "3. ",
                                			"content": [
                                				{
                                					"text": "Lot depth (feet) One Family: 100  Two Family: 100"
                                				}
                                			]
                                		},
                                		{
                                			"number": "4. ",
                                			"content": [
                                				{
                                					"text": "Front yard (feet) One Family: 30  Two Family: 30"
                                				}
                                			]
                                		},
                                		{
                                			"number": "5. ",
                                			"content": [
                                				{
                                					"text": "One side yard (feet) One Family: 10  Two Family: 10"
                                				}
                                			]
                                		},
                                		{
                                			"number": "6. ",
                                			"content": [
                                				{
                                					"text": "Both side yards (feet) One Family: 25  Two Family: 25"
                                				}
                                			]
                                		},
                                		{
                                			"number": "7. ",
                                			"content": [
                                				{
                                					"text": "Rear yard (feet) One Family: 30  Two Family: 30"
                                				}
                                			]
                                		},
                                		{
                                			"number": "8. ",
                                			"content": [
                                				{
                                					"text": "Lot coverage (percent) One Family: 30  Two Family: 35"
                                				}
                                			]
                                		},
                                		{
                                			"number": "9. ",
                                			"content": [
                                				{
                                					"text": "Building height Number of stories. One Family: 2.5  Two Family: 2.5"
                                				}
                                			]
                                		},
                                		{
                                			"number": "10. ",
                                			"content": [
                                				{
                                					"text": "Building height Feet per building. One Family: 35  Two Family: 35"
                                				}
                                			]
                                		}
                                	]
                                }
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Bulk and parking regulations for commercial uses permitted\nin CR Retail Commercial District, CG General Commercial District and\nWC Waterfront Commercial District."
								},
								{
									"footnote": "[1]\nEditor's Note: Amended at time of adoption of Code; see Ch. 1, General Provisions, Art. I.\n[2]\nEditor's Note: Amended at time of adoption of Code; see Ch. 1, General Provisions, Art. I.\n"
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "The use, adaptation or change of use of any building\nwithin the CR and WC Districts in existence as of January 1, 1991,\nshall be entirely exempt from any off-street parking requirements\nas provided in this or in any other Article. This exemption shall\napply thenceforth to improved parcels only and shall not apply to\nunimproved parcels, notwithstanding other provisions to the contrary.[Added 11-15-1990 by L.L. No. 4-1990]"
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 150-13",
			"title": "Residence district regulations.\n                                                                                          [1]",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Accessory buildings:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "An accessory building may be located in any required\nrear yard, provided that:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "Such building shall not exceed 15 feet in height."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "Such building shall be set back five feet from\nany lot line and shall not be located less than 10 feet from the principal\nbuilding."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "All such buildings in the aggregate shall not\noccupy more than 30% of the area of the required rear yard."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Accessory buildings constructed at the same time may\nbe located in pairs or groups in the required rear yard along the\ncommon side lot line or rear lot line of contiguous lots."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "An accessory building on that portion of a lot not\nincluded in any required yard shall conform to the height regulations\nfor principal buildings."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Corner lots."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Obstruction to vision at street intersections. At\nall street intersections or driveway entrances in all residence districts,\nno obstructions to vision exceeding 30 inches in height above curb\nlevel shall be erected or maintained on any lot within the triangle\nformed by the street lines of such lot and a line drawn between points\nalong such street lines 30 feet distant from their point of intersection."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Rear and side yards. On a corner lot, front yards\nare required on both street frontages, and one yard other than the\nfront yards shall be deemed to be a rear yard and the other or others\nto be side yards."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Exceptions to lot depth requirements. The required\nlot depth at any point may be decreased by 25% if the average lot\ndepth conforms to the minimum requirement."
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "Exceptions to yard requirements."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Permitted obstructions. Cornices or cantilevered roofs may project not more than three feet into a required yard. Belt courses, window sills and other ornamental features may project not more than six inches into a required yard. Fences or walls not over six and one-half (61/2) feet in height may be erected anywhere on the lot, except as set forth in Subsection B(1) above. Fences or walls with a height in excess of six and one-half (61/2) feet shall conform to the requirements set forth herein for buildings. Paved areas, other than such as are needed for access to the buildings on the lot, shall not project within 15 feet of a street line or four feet of a lot line."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Entries and porticos. A roofed-over but unenclosed\nprojection in the nature of an entry or portico, not more than eight\nfeet wide and extending not more than six feet out from the front\nwall of the building, shall be exempt from front yard requirements\nwhen the building otherwise complies with all other yard restrictions\nof this chapter."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Existing setback. No proposed one- or two-family dwelling\nneed have a setback greater than the average setback of the two existing\ndwellings with the greatest setbacks within 200 feet on each side\nof said proposed dwelling, on the same side of the street and within\nthe same block and the same district."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "Existing small lots. A lot, owned individually and\nseparately and separated in ownership from any adjoining tracts of\nland, which has a total lot area or lot width less than, prescribed\nin this chapter may be used for a one-family residence, provided that\nsuch lot shall he developed in conformity with all applicable district\nregulations."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "The total dimensions of both side yards for a principal\nbuilding shall be computed on the basis of four-tenths (0.4) of the\nlot width; however, no side yard dimension shall be less than four-tenths\n(0.4) of the total dimensions of both side yards computed as aforesaid,\nand no side yard dimension shall be less than 10 feet."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "The total rear yard dimension for a principal building\nshall be computed on the basis of three-tenths (0.3) of the lot depth;\nhowever, no dimension for the rear yard of a principal building shall\nbe less than 30 feet."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "F. ",
							"content": [
								{
									"text": "Fences in residence districts.[Added 10-19-2006 by L.L. No. 5-2006]"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "No fence or wall in a required front yard shall have\na height greater than four feet."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "No fence or wall in a required rear or side yard she\nhave a height greater than 6 1/2 feet:"
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "In no case shall any fence or wall have a height greater\nthan 6 1/2 feet."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "All fences shall require a building permit as set forth in Chapter 65 of the Code."
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "All fences to be erected will have a finished side\nof the fence facing toward adjoining neighboring property(ies)."
												}
											]
										},
										{
											"number": "(6) ",
											"content": [
												{
													"text": "The height of a fence or wall shall be the vertical\ndistance from any point on the top of the fence to the existing natural\ngrade at the base of the fence at that point."
												}
											]
										},
										{
											"number": "(7) ",
											"content": [
												{
													"text": "The owner is required to certify that fence lies within\nproperty line."
												}
											]
										}
									]
								}
							]
						}
					]
				},
				{
					"footnote": "[1]\nEditor's Note: Amended at time of adoption of Code; see Ch. 1, General Provisions, Art. I.\n"
				}
			]
		},
		{
			"paragraph": "§ 150-14",
			"title": "Nonresidential building regulations.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Waiver of yards. No side yard or rear yard shall be\nrequired where such premises abuts an operating railroad right-of-way."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Courts. The minimum dimension of an inner court shall\nnot be less than twice the height of all surrounding walls. However,\nin no case shall an inner court have a dimension of less than 30 feet.\nThe height of walls surrounding an inner court shall be measured from\nfinished grade at the base thereof to the top of such walls, except\nthat in the case of a roof with a slope exceeding five inches vertical\nto 12 inches horizontal, the height shall be measured to the mean\npoint between the top of said wall and the highest point of the roof.\nThe minimum dimension of an outer court shall be 20 feet, and its\ndepth shall not exceed its width."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Existing setback. No proposed nonresidential building\nneed have a setback greater than the average setback of the two existing\nnonresidential buildings with the greatest setbacks within 200 feet\non each side of said proposed nonresidential building on the same\nside of the street and within the same block and the same district.[Added 5-16-1996 by L.L. No. 3-1996]"
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 150-15",
			"title": "Sign regulations.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "No sign, billboard, advertising display or structure,\nposter or device shall be erected, moved, enlarged or reconstructed\nexcept as expressly permitted in this chapter."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Each commercial building or structure shall be entitled\nto a sign or signs based on the formula set forth herein; where more\nthan one commercial establishment occupies a building or structure,\nthe permissible area shall be ascertained by allocation of the sign\narea on the basis of frontage of the particular establishment in relation\nto the whole building or structure, provided that second-floor establishments\nshall be restricted to not more than one nameplate at ground-floor\nlevel access and not more than two nameplates in second-floor windows,\nnot in excess of four square feet each and nonilluminated, which sign\narea shall not be deducted from the above-permitted establishment\nsign area."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "The area of a sign shall be the area of the largest\nrectangle required to enclose the sign or each face of a two-faced\nsign."
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "A sign is any advertising structure, display board,\nscreen, structure, shadow box, poster, banner, pennant, cloth, bill,\nbulletin, printing, balloon or other device or object or part thereof\nused to announce, identify, declare, demonstrate, display or in any\nmanner advertise or attract the attention of the public by means of\nwords, letters, figures, colors, illumination or iridescence, publicly\ndisplayed out-of-doors or located indoors but directed out-of-doors\nand particularly illuminated, reflective or iridescent for the purpose\nof exterior display, or painted or permanently affixed to window glass.\nIt shall not include traffic or directional signs erected or placed\nby the Village, state or county in connection with its governmental\nor proprietary functions. A sign may be single-faced or double-faced.\nThe area of the face or side of a double-faced sign shall be deemed\none-half (1/2) the area of the sign."
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "Permits for signs. No person, firm or corporation\nshall erect, post, affix or maintain any sign in the Village of Greenport,\nexcept as specifically permitted by this chapter, unless a permit\ntherefor has been granted, in writing, and signed by the Mayor. A\npermit shall be granted for any sign complying with the requirements\nof this chapter upon filing an application with the Building Inspector\nand payment to the Village Clerk of a fee of $5. Every application\nfor a sign permit shall be in writing, signed by the applicant, and\nshall be accompanied by a plan in duplicate showing the size of the\nsign, the exact width of the building or structure on which the sign\nis to be located, color, lighting, if any, and location of the proposed\nsign. One copy of the plan shall be returned to the applicant upon\nthe issuance of the permit."
								}
							]
						},
						{
							"number": "F. ",
							"content": [
								{
									"text": "Temporary signs. Permits shall be issued without payment\nof fee for temporary signs for public benefit, educational, religious\nand charitable uses, provided that such temporary signs shall not\nexceed an area of 32 square feet and shall not be used or maintained\nfor a period exceeding 20 days. No permits shall be issued for temporary\nsigns to be posted on or attached to utility poles or trees. Permits\nfor small temporary and directional signs may be issued by the Building\nInspector in his discretion upon written application by letter therefor,\nindicating the nature of the sign and the quantity to be erected."
								}
							]
						},
						{
							"number": "G. ",
							"content": [
								{
									"text": "Prohibited signs."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "No sign shall be erected, affixed or maintained upon\na roof of any building or structure, except at the cornice of the\nroof of a one-story commercial or industrial building, which sign\nshall not exceed 24 inches in height above the cornice."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "No flashing, mobile, directly illuminated or reflecting,\ncloth or flyer signs shall be erected, affixed or maintained, and\nthe source of any exterior illumination shall not be visible across\nproperty lines."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "H. ",
							"content": [
								{
									"text": "Commercial signs. Commercial signs, facing public\nstreets only, shall be permitted only in districts zoned for retail\ncommercial, general commercial and waterfront commercial uses and\nshall advertise only the business conducted on the premises upon which\nthe same shall be placed or maintained. Such signs shall not exceed\nan area of 11/2 square feet for each horizontal foot of the wall to\nwhich they are attached, nor project more than 1/2 foot from such\nwall, nor shall the top of such signs be more than 20 feet above the\nground level."
								}
							]
						},
						{
							"number": "I. ",
							"content": [
								{
									"text": "Detached and ground signs; off-street business directional\nsigns."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Detached and ground signs, except professional and\ntemporary signs, shall be permitted only in districts zoned for retail\ncommercial, general commercial and waterfront commercial. Such signs\nshall not exceed a total area of 24 square feet and shall advertise\nonly the business conducted on the premises upon which the same shall\nbe placed or maintained, and the top of the same shall be not more\nthan 10 feet above the ground level."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Pylon or pole signs shall be permitted only at gasoline\nor service stations and shall not exceed an area of 30 square feet,\nexcluding supports, and the top of the same shall not exceed 20 feet\nin height above the ground level."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Businesses which are not located on Front Street,\nMain Street or Third Street. south of Front Street may have one or\nmore directional sign(s) on either Front Street, Main Street or Third\nStreet, south of Front Street. Applications for such off-street business\ndirectional sign(s) must be approved by the Planning Board. Such off-street\nbusiness directional sign(s) shall be limited to 8 inches x 24 inches\nin size. The sign(s) shall only be installed by the Greenport Public\nWorks Department for a fee of $50 per location. The sign(s) shall\nbe licensed for a period of two years, and such license(s) shall be\nrenewed upon expiration. When the business is discontinued the sign(s)\nwill be taken down.[Added 8-16-2001 by L.L. No. 5-2001]"
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "J. ",
							"content": [
								{
									"text": "Marquees and signs thereon. No marquee shall hereafter\nbe erected over any public street or sidewalk in the Village."
								}
							]
						},
						{
							"number": "K. ",
							"content": [
								{
									"text": "Existing signs. All signs in the Village of Greenport\nat the time of the adoption of this chapter which do not conform to\nthe provisions hereof may be maintained hereafter, but if any major\nchange, modification, structural repair or replacement thereof is\nhereafter made, such sign shall thereafter conform to the provisions\nof this chapter, provided that a legal nonconforming sign may not\nbe replaced by another nonconforming sign."
								}
							]
						},
						{
							"number": "L. ",
							"content": [
								{
									"text": "Regulations regarding overhead signs.[Added 6-27-2011 by L.L. No. 6-2011[1]]"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Overhead signs over sidewalks shall be permitted in the General Commercial,\nWaterfront Commercial and Retail Commercial Zoning Districts only,\nand only where there are sidewalks present."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "For all businesses where there is only one business in the building,\neach business shall be permitted one overhead sign."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "In the event that there is more than one business in a building,\nthe building will be permitted one sign, and the businesses in the\nbuilding must share the sign for that building."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "Overhead signs shall be limited to an area of two square feet or\nless on each side, and may be two sides (front and back) only."
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "Overhead signs must be initially approved by the Village Planning\nBoard. The Village Planning Board will set standards for overhead\nsigns, and each application to the Village Planning Board will contain\neight color copies of both sides of the proposed plan, in not less\nthan one-inch-equals-four-inches scale. The Planning Board will decide\non the appropriateness of each sign and the conformance of each sign\nwith the standards that will be set by that Board."
												}
											]
										},
										{
											"number": "(6) ",
											"content": [
												{
													"text": "A license shall be required for each overhead sign, and the license\nwill be issued upon the business owner providing proof of Planning\nBoard approval, providing proof of required insurance coverage for\nthe sign, and payment of the required fee in full."
												}
											]
										},
										{
											"number": "(7) ",
											"content": [
												{
													"text": "The business owner shall obtain and provide the Village with a certificate\nof liability insurance in the amount of not less than $500,000 naming\nthe Village of Greenport as additional insured. In the event that\nthe insurance coverage or policy expires or is terminated during the\nterm of a license, the license will be automatically terminated."
												}
											]
										},
										{
											"number": "(8) ",
											"content": [
												{
													"text": "The fee for a license shall be $50 for one square foot of sign facing\nand $100 for two square feet. The license must be renewed each year\nwith a new fee paid in full each year."
												}
											]
										},
										{
											"number": "(9) ",
											"content": [
												{
													"text": "In the event of a sale of a business, the new business owner is required\nto obtain a new sign license, including providing proof of insurance\ncoverage, and pay a new sign fee."
												}
											]
										},
										{
											"number": "(10) ",
											"content": [
												{
													"text": "Any overhead sign which is existing in the Village of Greenport\non the date of the filing of this local law[2] and which has been approved by the Village of Greenport\nshall be grandfathered with regard to Planning Board approval and\nshall not require new Planning Board approval, but will require a\nlicense."
												},
												{
													"footnote": "[2]\nEditor's Note: \"This local law\" refers to L.L. No. 6-2011,\nadopted 6-27-2011.\n"
												}
											]
										}
									]
								},
								{
									"footnote": "[1]\nEditor's Note: This local law also provided for the redesignation\nof former Subsection L as Subsection M.\n"
								}
							]
						},
						{
							"number": "M. ",
							"content": [
								{
									"text": "Enforcement."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Any sign erected or maintained in violation of any\nof the provisions of this chapter shall be removed within 10 days\nafter service of written notice in person or by mail upon the owner\nof such sign or any other person responsible for the property upon\nwhich the sign is maintained, or upon the agent or legal representative\nof such owner or other responsible person. Such notice shall specify\nthe nature of the violation and shall be signed by the Mayor, Building\nInspector or such other official of the Village as the Board of Trustees\nshall designate. Failure to comply with such notice shall be deemed\na violation."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "For every violation of the provisions of this chapter pertaining to signs or for a failure to comply with a notice of violation issued by the Building Inspector, the owner, builder, contractor or their agents or any person who commits, takes part in or assists in any such violation or who shall fail to comply with a notice of violation issued by the Building Inspector shall be guilty of a violation and, upon conviction, shall be punishable as provided in § 150-24.[Amended 5-16-1996 by L.L. No. 3-1996]"
												}
											]
										}
									]
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 150-16",
			"title": "Parking and loading regulations.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Off-street parking requirements. Off-street parking\nspaces, open or enclosed, are permitted accessory to any use, subject\nto the following provisions:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": " Schedule of parking requirements. Accessory off-street\nparking spaces, open or enclosed, shall be provided for any use as\nspecified below, for land which is unimproved within the CR and WC\nDistricts, and for all other land in all other districts, improved\nor unimproved. Land within the CR and WC Districts which is improved\nas of January 1, 1991, shall be entirely exempt from off-street parking\nrequirements and from payments in lieu thereof. Any land which is\ndeveloped as a unit under single ownership and control shall be considered\na single lot for the purpose of these parking regulations. Reasonable\nand appropriate off-street parking requirements for structures and\nuses which do not fall within the categories listed below shall be\ndetermined by the Planning Board upon consideration of all factors\nentering into the parking needs of each such use.[Amended 11-15-1990 by L.L. No. 4-1990]"
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Areas computed as parking spaces. Areas which may be computed as open or enclosed off-street parking spaces include any private garage, carport or other area available for parking, other than a street or a driveway. However, a driveway within a required front yard for a one-family or two-family residence may count as one parking space, other than on a corner lot as provided in § 150-13B(1)."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Size of spaces. Three hundred square feet shall be considered one parking space, to provide room for standing area and aisles for maneuvering. Entrance and exit lanes shall not be computed as parking space, except for driveways for one-family and two-family residences as set forth in Subsection A(2) above. Minimum parking stall width shall be 10 feet and minimum length shall be 20 feet."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "Access. Unobstructed access to and from a street shall\nbe provided. Such access shall consist of at least one ten-foot lane\nfor parking areas with less than 20 spaces and at least two ten-foot\nlanes for parking areas with 20 spaces or more. No entrance or exit\nfor any off-street parking area shall be located within 50 feet of\nany street intersection."
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "Drainage and surfacing. All open parking areas shall\nbe properly drained and all such areas shall be provided with a dustless\nsurface, except for parking spaces accessory to a one-family or two-family\nresidence."
												}
											]
										},
										{
											"number": "(6) ",
											"content": [
												{
													"text": "Joint facilities. Required parking spaces, open or\nenclosed, may be provided in areas designed to serve jointly two or\nmore establishments whether or not located on the same lot, provided\nthat the number of required spaces in such joint facilities shall\nbe not less than the total required for all such establishments."
												}
											]
										},
										{
											"number": "(7) ",
											"content": [
												{
													"text": "Combined spaces. When any lot contains two or more\nuses having different parking requirements, the parking requirements\nfor each use shall apply to the extent of that use. Where it can be\nconclusively demonstrated that one or more of such uses will be generating\na demand for parking spaces primarily during periods when the other\nuse or uses is not or are not in operation, the Planning Board may\nreduce the total parking spaces required for that use with the least\nrequirement."
												}
											]
										},
										{
											"number": "(8) ",
											"content": [
												{
													"text": "Location and ownership. Required accessory parking\nspaces, open or enclosed, shall be provided upon the same lot as the\nuse to which they are accessory or elsewhere, provided that all spaces\ntherein are located within 200 feet walking distance of such lot.\nIn all cases such parking spaces shall conform to all the regulations\nof the district in which the parking spaces are located, and in no\nevent shall such parking spaces be located in any residence district\nunless the use to which the spaces are accessory is permitted in such\nresidence district or except upon approval by the Planning Board.\nSuch spaces shall be in the same ownership as the use to which they\nare accessory and shall be subject to deed restriction, approved by\nthe Planning Board, binding the owner and his heirs and assigns to\nmaintain the required number of spaces available either throughout\nthe existence of such use to which they are accessory or until such\nspaces are provided elsewhere."
												}
											]
										},
										{
											"number": "(9) ",
											"content": [
												{
													"text": "Parking lots divided by district boundaries. When\na parking lot is located partly in one district and partly in another\ndistrict, the regulations for the district requiring the greater number\nof parking spaces shall apply to all of the lot. Parking spaces on\nsuch a lot may be located without regard to district lines, provided\nthat no such parking spaces shall be located in any residence district\nunless the use to which they are accessory is permitted in such district\nor except upon approval of the Planning Board."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Off-street loading requirements. Off-street loading\nberths, open or enclosed, are permitted accessory to any use, except\none- or two-family residences, subject to the following provisions:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Uses for which required. Accessory off-street loading\nberths shall be provided for any use specified below. Any land which\nis developed as a unit under single ownership and control shall be\nconsidered a single lot for the purpose of these loading requirements."
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "For a public library, museum or similar quasi-public\ninstitution or governmental building, community center, hospital or\nsanatorium, nursing or convalescent home, institution for children\nor the aged or school with a floor area of 10,000 square feet, one\nberth; for each additional 25,000 square feet or fraction thereof,\none additional berth."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "For buildings with professional, governmental\nor business offices, or laboratory establishments, with a floor area\nof 10,000 to 25,000 square feet, one berth; for each additional 25,000\nsquare feet or fraction thereof up to 100,000 square feet, one additional\nberth; for each additional 50,000 square feet or fraction thereof,\none additional berth."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "For buildings with offices and retail sales\nand service establishments, one berth for 8,000 to 25,000 square feet\nof floor area, and one additional berth for each additional 25,000\nsquare feet of floor area or fraction thereof so used."
																}
															]
														},
														{
															"number": "(d) ",
															"content": [
																{
																	"text": "For undertakers and funeral homes, one berth\nfor each chapel. Such berths shall be at least 10 feet wide and 20\nfeet long."
																}
															]
														},
														{
															"number": "(e) ",
															"content": [
																{
																	"text": "For hotels or motels, one berth for each 25,000\nsquare feet of floor area."
																}
															]
														},
														{
															"number": "(f) ",
															"content": [
																{
																	"text": "For manufacturing, wholesale and storage uses\nand for dry-cleaning and rug-cleaning establishments and laundries,\none berth for 5,000 to 10,000 square feet of floor area in such use,\nand one additional berth for each additional 20,000 square feet of\nfloor area or fraction thereof so used."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Size of spaces. Each required loading berth shall\nbe at least 12 feet wide, 33 feet long and 14 feet high."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Location and access. Unobstructed access at least 10 feet wide to and from a street shall be provided. Such access may be combined with access to a parking lot. All permitted or required loading berths shall be on the same lot as the use to which they are accessory, except as provided in Subsection B(4) below. No entrance or exit for any off-street loading berth shall be located within 50 feet of any street intersection. No off-street loading berth shall be located in any front yard."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "Joint facilities. Permitted or required loading berths,\nopen or enclosed, may be provided in spaces designed to serve jointly\ntwo or more adjacent establishments, provided that the number of required\nberths in such joint facilities shall not be less than the total required\nfor all such establishments."
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "Lots divided by district boundaries. When a lot is\nlocated partly in one district and partly in another district, the\nregulations for the district requiring the greater number of loading\nberths shall apply to all of the lot. Loading berths on such a lot\nmay not be located in any residence district unless the use to which\nthey are accessory is permitted in such district or except upon approval\nby the Planning Board."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Regulations for parking spaces adjacent to lots in\nany residence district."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Whenever a parking area of over five spaces abuts\nor is within 15 feet of the side or rear lot line of a lot in any\nresidence district, said parking lot shall be screened from such adjoining\nlot by a substantial wall, fence or thick hedge approved by the Planning\nBoard. Generally such screen shall be not less than three nor more\nthan eight feet in height."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Whenever a parking area of over five spaces is located\nacross the street from other land in any residence district, it shall\nbe screened from the view of such land by a thick hedge, wall or fence\napproved by the Planning Board, located along a line drawn parallel\nto the street and a distance of 20 feet therefrom, such screening\nto be interrupted only at points of ingress and egress. Generally\nno such screening shall be less than three feet nor more than eight\nfeet in height. The open area between such screening and the street\nshall be landscaped in harmony with the landscaping prevailing on\nneighboring properties fronting on the same street. Two identification\nand directional signs located on the street side of such screening\nshall be permitted; however, they shall not exceed an area of three\nsquare feet each."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "Driveways. No driveway shall provide access to a lot\nlocated in another district, which lot is used for any use prohibited\nin the district in which such driveway is located."
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "Commercial vehicles."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "One commercial vehicle not exceeding 25 feet in length\nmay be parked on an occupied lot in any residential district, but\nnot within the required front yard of such lot, and in no case between\nthe street line and the principal building.[1]"
												},
												{
													"footnote": "[1]\nEditor's Note: Amended at time of adoption of Code; see Ch. 1, General Provisions, Art. I.\n"
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "One commercial vehicle not exceeding 25 feet in length\nmay be parked within a private garage in any residence district."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "F. ",
							"content": [
								{
									"text": "House trailers, mobile homes and boats."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "The storage or parking and use of a house trailer\nby any person or persons is hereby prohibited in all districts, except\nthat:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "One camping trailer not over 25 feet in length\nmay be stored, but not used for any purpose, on an occupied lot in\nany R-1 or R-2 Residence District, provided that such trailer is not\nstored within the required front or side yards of said lot nor between\nthe street line and the principal building.[2]"
																},
																{
																	"footnote": "[2]\nEditor's Note: Amended at time of adoption of Code; see Ch. 1, General Provisions, Art. I.\n"
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "Where a building permit has been issued for\nthe construction or alteration of a building, the Building Inspector\nmay issue a temporary permit for one trailer for a period not to exceed\nsix months. Said temporary permit may be extended for one additional\nperiod of six months if the Building Inspector finds that construction\nhas been diligently pursued and that justifiable circumstances require\nsuch an extension. Said trailer may be occupied during the term of\nthe temporary permit and shall be situated upon the lot for which\nthe building permit has been issued. Prior to the issuance of such\na temporary permit by the Building Inspector, the location of said\ntrailer on the lot shall be subject to Planning Board approval. Said\nBoard may attach to its approval whatever conditions it deems necessary\nto carry out the intent of this chapter."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "A house trailer may be parked in the McCann\nTrailer Park and is subject to the trailer parks rules and regulations.[3]"
																},
																{
																	"footnote": "[3]\nEditor's Note: Amended at time of adoption of Code; see Ch. 1, General Provisions, Art. I.\n"
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Not more than two boats per dwelling unit may be stored\non an occupied lot in any residence district, provided that such boat\nis not stored within any required front or side yard of such lot nor\nbetween the street line and the principal building.[4]"
												},
												{
													"footnote": "[4]\nEditor's Note: Amended at time of adoption of Code; see Ch. 1, General Provisions, Art. I.\n"
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "G. ",
							"content": [
								{
									"text": "The Planning Board may, when it deems it to be in the best interest of the Village, require an owner to deposit a cash payment in lieu of any parking requirements set forth in this section or § 150-12, but not to exceed a waiver of more than 20 required parking spaces. The amount to be paid shall be $2,500 per parking space required but not provided. Said funds will be deposited with the Village Board and maintained by the Village Board in a special fund and used by the Village Board for the construction, acquisition or maintenance of public parking facilities. Any decision of the Planning Board pursuant to this section may be appealed to the Village Board within 60 days of the filing of the Planning Board's decision.[Added 6-10-1981 by L.L. No. 4-1981; amended 10-16-1986 by L.L. No. 6-1986; 6-18-1987 by L.L. No. 6-1987; 8-12-1993 by L.L. No. 3-1993]"
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 150-17",
			"title": "Prohibited uses.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "[1]The following uses are prohibited in all districts unless\nauthorized by special permit:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Any use which is noxious, offensive or objectionable\nby reason of the emission of smoke, dust, gas, odor or other form\nof air pollution or by reason of the deposit, discharge or dispersal\nof liquid or solid wastes in any form in a manner or amount as to\ncause permanent damage to the soil and streams or to adversely affect\nthe surrounding area, or by reason of the creation of noise, vibration,\nelectromagnetic or other disturbance, or by reason of illumination\nby artificial light or light reflection beyond the limits of the lot\non or from which such light or light reflection emanates, or which\ninvolves any dangerous fire, explosive, radioactive or other hazard,\nor which causes injury, annoyance or disturbance to any of the surrounding\nproperties or to their owners and occupants, and any other process\nor use which is unwholesome and noisome and may be dangerous or prejudicial\nto health, safety or general welfare."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Artificial lighting facilities of any kind with light\nsources visible beyond the lot lines which create glare beyond such\nlines."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Amusement parks and circuses and related activities\nexcept for a temporary period upon special license from the Village\nBoard."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "Junkyard or dump except a dump established as an official\nVillage dump or duly licensed as a dump by the Village Board."
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "Retail bulk storage of petroleum products in excess\nof 20,000 gallons; wholesale bulk storage of petroleum products; bulk\nstorage of any liquids aboveground; processing, refining and/or packaging\nof petroleum products, chemicals and/or gases."
												}
											]
										},
										{
											"number": "(6) ",
											"content": [
												{
													"text": "Ownership, operation, maintenance, distribution, sale\nor rental of an amusement device or amusement devices. An amusement\ndevice shall be any coin-operated mechanical or electrical device\nor contrivance which, by means of the insertion of a coin, token,\nslug, disk or other article into a slot, crevice, opening or attachment\nconnected with or forming a part of any such devices or contrivance,\neffects the operation thereof for use as a game, contest or amusement,\nor which may be so used. The term \"amusement device\" includes but\nis not necessarily limited to pinball machines and electronic devices.\nThe term \"amusement devices\" does not include jukeboxes.[Amended 9-16-1982 by L.L. No. 7-1982]"
												}
											]
										}
									]
								},
								{
									"footnote": "[1]\nEditor's Note: Amended at time of adoption of Code; see Ch. 1, General Provisions, Art. I.\n"
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "All fossil-fuel-burning units must meet Suffolk County\nair pollution levels.[2]"
								},
								{
									"footnote": "[2]\nEditor's Note: Former Subsection C, Yard sales,\nwas repealed by 12-10-1979 by L.L. No. 5-1979.\n"
								}
							]
						}
					]
				}
			]
		}
	]
}