{
	"url": "http://www.shorehamvillage.org/zone.htm",
	"paras": [
		{
			"paragraph": "§ 300",
			"title": "Residence A and B Districts.",
			"content": [
				{
					"text": "In any residential district no building or premises shall be used, and no building or part of a building shall be erected or structurally altered which is arranged, intended or designed to be used in whole or in part for other than one or more of the uses permitted in a residential district. The uses permitted in any of said residential districts shall be the following, together with the accessory uses permitted by ARTICLE IV hereof:"
				},
				{
					"content": [
						{
							"number": "1. ",
							"content": [
								{
									"text": "Single family detached dwelling."
								}
							]
						},
						{
							"number": "2. ",
							"content": [
								{
									"text": "Customary occupations and uses incidental to a single family residence."
								}
							]
						},
						{
							"number": "3. ",
							"content": [
								{
									"text": "Professional office or studio of a physician, surgeon, doctor, dentist, public accountant, lawyer, architect, musician, artist or teacher, residing on the premises and incidental to such residence, including a small professional name plate or sign as the only display or advertising."
								}
							]
						},
						{
							"number": "4. ",
							"content": [
								{
									"text": "Churches, Public Schools, Libraries."
								}
							]
						},
						{
							"number": "5. ",
							"content": [
								{
									"text": "Private Club, or parking space for the members of a private club, but only when a permit therefore is authorized by the Board of Appeals."
								}
							]
						},
						{
							"number": "6. ",
							"content": [
								{
									"text": "Any lawful municipal use or purpose authorized by resolution of the Board of Trustees."
								}
							]
						},
						{
							"number": "7. ",
							"content": [
								{
									"text": "Display of one non-illuminated sign in connection with the sale or renting of a plot or a building thereon as a whole, provided that such sign does not exceed four square feet in area."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 400",
			"title": "Accessory Uses in Residence Districts",
			"content": [
				{
					"text": "In any residence district the following uses shall be permitted provided that they are accessory to an existing permitted use:"
				},
				{
					"content": [
						{
							"number": "1. ",
							"content": [
								{
									"text": "If a single family detached dwelling is in existence on the plot, a private garage or parking space for not more than three motor vehicles; on plots of 1 acre or more, such garage or space may be designed to accommodate four motor vehicles."
								}
							]
						},
						{
							"number": "2. ",
							"content": [
								{
									"text": "Quarters of not more than two rooms, located over or attached to such a private garage, when such accommodations are used by members of the immediate family of the occupant of the main dwelling or his bona-fide non-paying guests and household servants only."
								}
							]
						},
						{
							"number": "3. ",
							"content": [
								{
									"text": "On plots 60,000 square feet or more, a cottage with a minimum first floor building area of 800 square feet, but otherwise conforming to every requirement of this Ordinance for a single family dwelling in the District in which it is located, when used by members of the immediate family of the occupant of the main building or his bona-fide non-paying guests and household servants only."
								}
							]
						},
						{
							"number": "4. ",
							"content": [
								{
									"text": "On plots of 80,000 square feet or more, the keeping or stabling of horses, providing that not more than one horses shall be kept or stabled for each full acre of land in said plot; and provided that the feeding, watering, grazing or tethering of horses for a period not in excess of five hours per day shall not be considered the keeping or stabling of horses within the meaning of this ordinance."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 700",
			"title": "Minimum Plot Requirements",
			"content": [
				{
					"text": "For buildings hereafter erected, the minimum plot area for each building together with the accessory buildings thereto shall be as follows: In the Residence A District - One acre. In all other Residence Districts - 30,000 square feet. In a Public Utility District - 5,000 square feet. In the Business District - 5,000 square feet"
				}
			]
		},
		{
			"paragraph": "§ 701",
			"title": "Minimum Plot Requirements (cont'd)",
			"content": [
				{
					"text": "For buildings hereafter erected, the minimum average width of the plot for each building together with the accessory buildings thereto shall be as follows: In the Residence A District - 150 feet. In the Residence B District - 100 feet. In the Business District - 40 feet. In the Public Utility District - 50 feet."
				}
			]
		},
		{
			"paragraph": "§ 702",
			"title": "Minimum Plot Requirements (cont'd)",
			"content": [
				{
					"text": "For buildings hereafter erected, the minimum frontage of the plot for each building (together with the accessory buildings thereto) upon a Village or Town street or a street duly established in accordance with the Village Law, shall be as follows: In the Residence A District - 100 feet. In the Residence B District - 75 feet. In the Business District - 40 feet. In the Public Utility District - 50 feet."
				}
			]
		},
		{
			"paragraph": "§ 800",
			"title": "Height, Area and Yards",
			"content": [
				{
					"text": "For each class of Residence District and for the Business District and Public Utility District, the regulations governing the maximum height of buildings, the minimum and maximum building areas, the minimum side and rear yards and the minimum set back are hereby established as set forth in the table included in this Ordinance entitled Table of Heights, Area and Yard Regulations. Front yard:No building or any portion thereof shall be erected, reconstructed or altered so as to project beyond the minimum set back line as prescribed in the Table of Heights, Area and Yard Regulations. Corner Lot: A building erected on a corner plot shall be required to comply with the minimum set back from the street on which the building faces as prescribed in the Table of Heights, Area and Yard Regulations, and the set-back from the other street shall be considered as a side yard for purposes thereof."
				}
			]
		},
		{
			"paragraph": "§ 801",
			"title": "TABLE OF HEIGHT, AREA AND YARD REGULATIONS",
			"content": [
				{
					"text": "Residence A:"
				},
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Minimum Setback(feet): 60"
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "One Story Building(square feet): 1400"
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "1st floor buildings(square feet): 1200"
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "Total(square feet): 1500"
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "Max Total Area(%): 15%"
								}
							]
						},
						{
							"number": "F. ",
							"content": [
								{
									"text": "Maximum Height: (stories/feet): 2.5/35"
								}
							]
						},
						{
							"number": "G. ",
							"content": [
								{
									"text": "Minimum Side Yard (One Side/Both): 35/80"
								}
							]
						},
						{
							"number": "H. ",
							"content": [
								{
									"text": "Minimum Rear Yard(feet): 50"
								}
							]
						},
						{
							"number": "I. ",
							"content": [
								{
									"text": "NOTES: 1) In the case of plots of less than the prescribed minimum average width, the side yard requirements shall be proportionately reduced. 2) In computing the minimum main building area of a residence, only livable enclosed area shall be included. Rooms for heating equipment, garages or basement and cellar rooms shall not be included. If second or third floor area is to qualify then such area shall have a permanent flooring and shall have access from the floor below by a permanent built in stairway. In no event shall such floor area with a height of less than 5 feet be counted, nor shall an area be accepted which has a width in excess of twice the width of the room at a height 7 feet 6 inches above the finished floor. 3) Each business building shall provide off-street parking of at least two square feet per square foot of selling space. Minimum rear yard requirements shall apply only in case of front parking; in other cases the rear yard is to be the same as required in Residence B. Minimum side yards are required only when business property adjoins residential property. A business building may be subdivided, but each store shall have a frontage of not less than 20 feet. 4) No rear yard need exceed 25% of the depth of the plot."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 900",
			"title": "Accessory Buildings",
			"content": [
				{
					"text": "Accessory buildings hereafter erected shall comply to the following regulations as to their location upon the lot:"
				},
				{
					"content": [
						{
							"number": "1. ",
							"content": [
								{
									"text": "In the case of an interior plot fronting upon only one street, no accessory building shall be erected or altered so as to encroach upon that half of the plot depth nearest the street."
								}
							]
						},
						{
							"number": "2. ",
							"content": [
								{
									"text": "In the case of an interior plot fronting upon two or more streets, no accessory building shall be erected or altered so as to encroach upon that fourth of the plot nearest each and every street."
								}
							]
						},
						{
							"number": "3. ",
							"content": [
								{
									"text": "In the case of a corner plot facing upon two streets, no accessory building shall be erected or altered so as to encroach upon the area between each respective street and a line drawn parallel to such street in a manner to divide the plot into two equal parts except that an accessory building on a corner plot of more than the required frontage and area need not be set back from the street line a greater distance than would be required in the case of an accessory building on a corner plot of the minimum frontage and area permitted in the district in which such plot is located."
								}
							]
						},
						{
							"number": "4. ",
							"content": [
								{
									"text": "In the case of a corner plot fronting upon three or more streets, no building shall be erected or altered so as to encroach upon that fourth of the plot depth nearest each and every street."
								}
							]
						},
						{
							"number": "5. ",
							"content": [
								{
									"text": "Accessory buildings shall not occupy more than 30% of the required area of the rear yard and shall not be more than 25 feet in height."
								}
							]
						},
						{
							"number": "6. ",
							"content": [
								{
									"text": "No part of an accessory building shall be nearer the rear or side plot lines than five feet."
								}
							]
						},
						{
							"number": "7. ",
							"content": [
								{
									"text": "The limitations imposed by this Section upon the location of an accessory building shall not apply when the accessory building is incorporated as an integral part of the principal building, or when any part of the wall of the accessory and principal building are common. No wall of a detached accessory building shall be located nearer than 10 feet to any wall of the principal building, except that where the accessory building is connected with the principal building by means of a breezeway or similar connection, this distance may be reduced to a minimum of five feet."
								}
							]
						}
					]
				}
			]
		}
	]
}