{
	"url": "http://ecode360.com/14496332",
	"paras": [
		{
			"paragraph": "§ 147",
			"title": "Title.",
			"content": [
				{
					"text": "This article shall be known and cited as the \"Cluster Residence\nDistricts (CR) Article.\""
				}
			]
		},
		{
			"paragraph": "§ 148",
			"title": "Purpose.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "The purpose of the article is to provide for planned cluster residential\ndevelopment affording greater flexibility and variety than traditional\nzoning districts. Such development will require the establishment\nof one or more districts. More particularly, such districts will provide\na means of encouraging imaginative designs, consolidation and use\nof open space, separation of pedestrian and vehicular traffic and\nproject amenities. These things will advance the Town's long-established\nand continuing policy of encouraging home ownership. These also present\nthe best means of home ownership at a lower cost in the face of the\nclimbing costs of land, construction, loans, operation and maintenance,\nand to provide for the changing needs of town residents."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "At the outset, it is proposed to establish one such district. As\ntime goes on, additional similar districts may be warranted because\nof the size of the Town, the scarcity of vacant land and the varying\ncircumstances of its numerous communities and neighborhoods. Additional\ndistricts will permit development at different densities and sizes.\nHowever, it is intended that densities shall remain low in order to\npreserve the suburban character of the Town."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "The Condominium Law of the State of New York (Real Property Law,\nArticle 9-B) provides a legal mechanism and structure suitable for\nthe implementation of cluster residential development, beginning with\nthe initiation of the development and continuing through its life."
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "This article, in combination with the Condominium Act. is intended\nto provide a framework to accomplish these purposes."
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "The Town Board finds that the creation of this zoning district is\nin the public interest and that the provisions of this district are\nin the interest of the protection and promotion of the public health,\ngeneral welfare and safety of the residents of the Town of Hempstead.\nThe application of this district to a specific plot shall be made\nonly after reasonable consideration is given to, among other things,\nthe character of the district. its suitability for the use, the desire\nto conserve the economic value of other properties in the neighborhood,\nand encouraging the most appropriate use of lands, including the development\nof a property in such a way as to enhance its natural features. The\napplication of this district to a specific plot shall be made only\nafter it has been determined to be compatible with other land uses\nin the area and the character of the community."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 149",
			"title": "Applicability.",
			"content": [
				{
					"text": "The provisions of this article shall apply to the CR Cluster\nResidence Districts (CR), which may be developed within the B Residence\nDistricts and the Business Districts upon approval of the Town Board\nunder the provisions set forth herein."
				}
			]
		},
		{
			"paragraph": "§ 150",
			"title": "Conditions.",
			"content": [
				{
					"text": "The tract of land to be developed shall be in one ownership\nand shall be developed under unified direction and control as a single\narchitectural project."
				}
			]
		},
		{
			"paragraph": "§ 151",
			"title": "Definitions.",
			"content": [
				{
					"text": "For the purpose of this article, certain terms or words have\nmeanings not necessarily applicable to other sections of this ordinance\nand shall be interpreted or defined as follows:"
				}
			]
		},
		{
			"paragraph": "§ 152",
			"title": "Interpretation; conflicts with other provisions.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "In interpreting and applying the provisions of this article, the\nrules of interpretation applicable to remedial legislation shall be\nused so that the spirit and intent of this article shall be observed."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "In the event of a conflict between this and other existing provisions\nof this ordinance, the provisions of the more restrictive Article\nshall control."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 153",
			"title": "Severability.",
			"content": [
				{
					"text": "If any clause, sentence, section, paragraph or provision of\nthis article shall be adjudged by a court of competent jurisdiction\nto be invalid, such judgment shall not affect, impair or invalidate\nthe remainder of this article, but shall be confined in its operation\nto the clause, sentence, section, paragraph or provision directly\ninvolved in the controversy in which such judgment shall be made."
				}
			]
		},
		{
			"paragraph": "§ 154",
			"title": "Application requirements.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "An application for a change of zone to a CR District shall be filed\nin writing with the Town Board and shall be accompanied by a plan\nwhich shall conform to the regulations and procedures of this article.\nIn addition to any other requirements, the application shall be made\nand verified by either the fee owner or contract vendee of all premises\ndescribed in the application. If made by a contract vendee, the consent\nof the owner of the fee shall accompany the application consenting\nto and joining in the request for approval of the application. The\napplication shall also contain a written statement which sets forth\nthe proposed treatment of any open land section of the site, the proposed\nmethod or type of ownership thereof, and the designation of responsibility\nfor its maintenance."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "The application shall contain a statement and maps fully setting\nforth proposals for developing the overall project in stages, including\nbut limited to the order of construction, location, and number of\nunits by type."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "The application shall be accompanied by a general site plan providing\nsufficient information to allow the Town Board to meet the review\nrequirements of § 155 of this article. The site plan shall\nbe prepared at a scale of not less than one inch equals 100 feet,\nbut in any case, at such a scale as to show sufficient detail, with\nsupporting maps at such scales as necessary to clearly indicate the\nfollowing, in addition to all data and information to meet the rules\nand regulations for approval of site plans for § 305 of\nthe Town of Hempstead Building Zone Ordinance:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Topography of the site at a contour interval no greater than two\nfeet; existing major trees and landscape and environmental features,\nexisting easements, covenants, public rights-of-way, and all other\nrestrictions."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Existing property boundary lines, setbacks and location of proposed\nstructures."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Outline of proposed building perimeters, including elevation of basement\nand cellar areas at doorway openings; first-floor elevations and roof\nelevations."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "Proposed topography, including elevations at corners of buildings,\nparking areas, and grades of other significant construction areas."
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "Proposed building configuration, which shall show, for townhouses,\nstaggered rooflines and front facades."
												}
											]
										},
										{
											"number": "(6) ",
											"content": [
												{
													"text": "Proposed treatment of exterior building surfaces."
												}
											]
										},
										{
											"number": "(7) ",
											"content": [
												{
													"text": "Height of all buildings and structures."
												}
											]
										},
										{
											"number": "(8) ",
											"content": [
												{
													"text": "Location, nature and ownership of all proposed streets and parking\nareas."
												}
											]
										},
										{
											"number": "(9) ",
											"content": [
												{
													"text": "Adjoining streets, access roads and walkways."
												}
											]
										},
										{
											"number": "(10) ",
											"content": [
												{
													"text": "Method of vehicular and pedestrian ingress and egress, including\nnecessary off-site improvements and emergency access."
												}
											]
										},
										{
											"number": "(11) ",
											"content": [
												{
													"text": "Proposed landscaping, recreation facilities, fencing and exterior\nlighting."
												}
											]
										},
										{
											"number": "(12) ",
											"content": [
												{
													"text": "Proposed methods of preserving views and vistas from and through\nthe site; and protection and enhancement of these and other environmental\nfeatures."
												}
											]
										},
										{
											"number": "(13) ",
											"content": [
												{
													"text": "Proposed grading of the plot to include the disposal of surface\nwater drainage and to indicate by report or map the effect of development\non surrounding area drainage patterns."
												}
											]
										},
										{
											"number": "(14) ",
											"content": [
												{
													"text": "A table showing the following data, both required and proposed:\nsite size, number of units by bedroom count, floor area and land area;\nparking spaces, coverage, height and common facilities."
												}
											]
										},
										{
											"number": "(15) ",
											"content": [
												{
													"text": "General methods of providing for collection and disposal of\nstormwater runoff and for handling sanitary sewage, refuse or other\nwaste."
												}
											]
										},
										{
											"number": "(16) ",
											"content": [
												{
													"text": "Provision of municipal services."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "In addition, the site plan shall be accompanied by sketches showing\nproposed architectural treatment; single-line floor plans showing\nlayout of all buildings, and the text of all filed or proposed restrictions\non the use of the land and buildings. The applicant shall submit a\ngeneral statement describing the type of development proposed, which\nshall include a description of the proposed management and ownership\nof the various elements of the condominium development, including:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Dwelling units."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Common areas and facilities ownership."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Ground, building and facility maintenance."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "Street ownership and maintenance."
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "Parking area ownership and maintenance."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "The applicant shall submit any other information deemed by the Town\nBoard to be necessary to a reasonable determination of the application.\nSuch information shall be provided by the applicant."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 155",
			"title": "Application procedure.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Any application made pursuant to the provisions of this article shall\noriginate by an application to the Town Board."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "An application for inclusion of any premises in any district created by this article shall be submitted in accordance with Article XXVI of this Building Zone Ordinance. Site plans and statements, as required by § 305 of this Building Zone Ordinance and by this article, shall accompany such application. All applications shall provide for development and continued ownership and maintenance under the Condominium Act; further, the Town shall have the right to enter upon the open space and common elements to make inspections for compliance with the safeguards and conditions imposed by the Town Board in connection with site plan approval and with applicable provisions of law."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "In the event that the Town Board approves said application, it may\nattach certain conditions to said approval, which conditions shall\nbecome an integral part thereof. The Town Board may dispense in whole\nor in part with conformity with the provisions applicable to this\ndistrict, and may impose safeguards and conditions as it may deem\nappropriate, necessary or desirable to provide the spirit and objectives\nof this article."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 156",
			"title": "General requirements.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "On the filing of the detailed building plans and specifications with the Building Inspector, there shall be deposited with the Town a fee established in accordance with the provisions of Article XXVI of this ordinance and Chapter 86 of the Code of the Town of Hempstead."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "No modification, or any change in the general location, layout and\ncharacter of the project, including all elements of the approved site\nplan which shall include the architectural designs and arrangements\nof all buildings, as shown in the plans and specifications of the\nbuildings and structures as approved, or in any of the other conditions\nset forth in the approval; shall be permitted without approval of\nthe Town Board."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "The failure to make application for a building permit within one\nyear after approval by the Town Board of the CR District designation,\nor the failure to complete construction as set forth in said building\npermit within two years after the issuance thereof, shall be deemed\nto be an abandonment. Application for an extension of time may be\napproved by the Town Board subject to appropriate conditions and safeguards.\nIf the project is deemed to be abandoned by virtue of the provisions\nabove, all rights heretofore granted with respect to the CR approval\nshall terminate, and the requirements for development under the prior\nzoning district shall apply."
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "A certificate of occupancy shall not be issued for dwelling units\nuntil all of the facilities, buildings and improvements shown upon\nthe approved site plan have been completed; however, a temporary certificate\nof occupancy may be issued when deemed to be appropriate by the Building\nInspector."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 157",
			"title": "Permitted uses.",
			"content": [
				{
					"text": "A building or structure may be erected, altered or used and\na lot or premises may be used for one or more of the following purposes,\nand no other:"
				},
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Single-family detached dwelling."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Single-family townhouse."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Accessory buildings, subject to limitations and provisos as follows:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Detached private garages accessory to single-family dwellings on\nthe same lot are permitted; all other detached private garages are\nprohibited."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Group garages accessory to townhouses shall be integrated architecturally\nwith the main building; all other group garages accessory to single-family\ndwellings and to townhouses are prohibited."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "Professional offices located in the same dwelling unit in which the\npractitioner resides and incidental to such residential use, provided\nthat these do not produce noxious or offensive odors, noises or vibrations."
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "Professional signs no larger than six by twelve (6 x 12) inches,\nbearing only the name and occupation of the professional practitioner\nresiding on the same lot: all other signs are prohibited. These shall\nbe no more than two signs per practitioner at any two of the following\nlocations:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "The main entrance (directory)."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "The lot front."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "The building face."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "F. ",
							"content": [
								{
									"text": "Recreational areas and facilities, where provided, shall be for the\nsole use of residents of the CR District and their guests, which may\ninclude, subject to the provisions of this ordinance, but is not limited\nto: tennis courts, clubhouse, swimming pool and other common area\nrecreational facilities; and maintenance facilities."
								}
							]
						},
						{
							"number": "G. ",
							"content": [
								{
									"text": "Fences, hedges and shrubbery."
								}
							]
						},
						{
							"number": "H. ",
							"content": [
								{
									"text": "Parking areas constructed, used and maintained as a common element."
								}
							]
						},
						{
							"number": "I. ",
							"content": [
								{
									"text": "Other expressly permitted parking areas."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 158",
			"title": "Gross development area; population density; maximum number of units per building.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "The gross development area shall not be less than 10 contiguous acres\nnot traversed by existing streets."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Maximum density shall not exceed four dwelling units per gross developable\nacre or eight dwelling units per net developable acre, whichever is\nless. In no event shall the number of dwelling units exceed eight\nper acre of buildable land as defined in this article."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "There shall be not more than eight units in any one building, except,\nhowever, that the Town Board may, as part of site plan approval, modify\nthis standard to allow improved site development."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 159",
			"title": "Height.",
			"content": [
				{
					"text": "The following height limitations shall apply:"
				},
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Single-family detached dwellings shall not exceed 25 feet in height."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Townhouses shall not exceed 30 feet in height, the measurement of which is set forth in Article I, § 1, the definition of \"height of building,\" except, however, where the mean level of the foundation wall used to determine the ground or first story is below the mean level of the established center-line grade of the street adjacent to the building plot, then this vertical difference shall be added to the required height."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "The height of accessory buildings shall be determined upon site plan\napproval, but shall not exceed 20 feet."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 160",
			"title": "Lot coverage.",
			"content": [
				{
					"text": "All buildings, including accessory buildings, shall not cover\nmore than 20% of the area of the plot."
				}
			]
		},
		{
			"paragraph": "§ 161",
			"title": "Yards and setbacks.",
			"content": [
				{
					"text": "Setbacks shall be required for all principal and accessory buildings\nas follows:"
				},
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Front yards:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Not less than 25 feet from any private street or town road."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Not less than 50 feet from any county road or any county recreation\narea, including beaches."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Not less than 100 feet from any state highway."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Side yards:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "For single-family detached dwellings, the requirement shall be the\nsame as the zoning of the site prior to CR in the case of residential\ndistricts: and in the case of Business Districts, the same as in B\nResidence."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "For townhouses, not less than 20 feet, except that there shall be\na yard of at least 50 feet at each end of the development area, the\npurpose of which is to provide vistas and views and preserve and/or\ncreate open space on the perimeter of the site and for the neighborhood."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Rear yards:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "For single-family detached dwellings, the requirement shall be the\nsame as the zoning of the site prior to CR in the case of residential\ndistricts: and in the case of Business Districts, the same as in B\nResidence."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "For townhouses, not less than 30 feet."
												}
											]
										}
									]
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 162",
			"title": "Distance between buildings.",
			"content": [
				{
					"text": "The distance between any two principal building structures shall\nequal at least the average height of such structures at the point\nwhere such structures are nearest to one another. The distance between\nany principal structure and any accessory building, or between two\ndetached accessory buildings, shall be not less than 20 feet. However,\nany other provision notwithstanding, a minimum distance of 60 feet\nshall be maintained between the center of any legal window, other\nthan a legal bathroom or kitchen window, and any wall of the same\nor of another structure. the plane of which is parallel to, or which\nintersects the plane of, the wall in which said window is located\nat an angle of less than 90°, such distance being measured in\nhorizontal projection at the sill level of said window."
				}
			]
		},
		{
			"paragraph": "§ 163",
			"title": "Permitted encroachments.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "The following encroachments upon required areas are permitted:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Cornices, eaves, gutters, chimneys or bay windows projecting not\nmore than 24 inches."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "One-story open porches and terraces not exceeding three feet in height,\nprojecting not more than six feet only into a front or rear yard."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "One-story enclosed vestibules not greater than six feet wide and\nfive feet deep, projecting only into a front yard."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "In any case where the Board of Appeals, by variance, has permitted\nthe reduction of a required yard, none of the foregoing encroachments\nshall be permitted into such diminished yard."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 164",
			"title": "Accessory buildings, structures and uses.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "The area occupied by accessory buildings or structures shall be included\nin computing the maximum percentage of the lot area which may be utilized\nfor buildings."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Outdoor or indoor pools shall be considered accessory structures,\nsubject to the following requirements:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "All pools shall be shown on the site plan and shall be permitted\nby the Town Board only upon making a finding as part of the resolution\ngranting the zone change that the proposed pool and ancillary equipment\nor facilities:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "Will not adversely affect the public health, safety and general\nwelfare."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "Will be limited to use by members and guests of the condominium\nassociation."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "Will not tend to depreciate the value of the property in the\narea immediately adjoining the land being so used."
																}
															]
														},
														{
															"number": "(d) ",
															"content": [
																{
																	"text": "Will not tend to alter the essential character of the neighborhood."
																}
															]
														},
														{
															"number": "(e) ",
															"content": [
																{
																	"text": "Will not be located so as to be visible to a significant extent\nfrom adjoining residential properties. nor interfere with the use\nand enjoyment of adjoining properties."
																}
															]
														},
														{
															"number": "(f) ",
															"content": [
																{
																	"text": "No aboveground pools are permitted."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "In order to safeguard the general safety of the community, particularly\nthe children thereof, and to ensure the public health of the community\ngenerally, the following specific conditions are hereby imposed on\nall swimming pools of permanent construction:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "Any electric wiring for lighting or other use, other than for\nlighting which is part of and enclosed in the pool structures, shall\nnot be closer than 15 feet to said pool."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "Said pool shall be located no closer than 20 feet to any cesspool\nor dry well (excluding roof leader dry wells) on its own or adjacent\nproperty."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "Any water from a public water supply shall be introduced into\na swimming pool by means of a permanent rigid system of piping, and\nshall in every manner conform to the New York State Sanitary Code."
																}
															]
														},
														{
															"number": "(d) ",
															"content": [
																{
																	"text": "No swimming pool shall have a water capacity in excess of 7,500\ngallons without a recirculating and filtering system of sufficient\ncapacity to meet good public health and engineering practice."
																}
															]
														},
														{
															"number": "(e) ",
															"content": [
																{
																	"text": "A permit, when issued, may also have endorsed thereon any such\nreasonable rules and regulations for the operation, maintenance and\nuse of such pool as may be promulgated by the Town Board."
																}
															]
														},
														{
															"number": "(f) ",
															"content": [
																{
																	"text": "A fence meeting the requirements of Article XXV of this ordinance shall be provided."
																}
															]
														},
														{
															"number": "(g) ",
															"content": [
																{
																	"text": "No part of any pool shall be located within 50 feet of any external\nproperty line, nor within 100 feet of any residence district boundary."
																}
															]
														},
														{
															"number": "(h) ",
															"content": [
																{
																	"text": "The fence referred to in Subsection B(2)(f) above shall be erected at least eight feet from the edge of the pool. Said fence shall be at least 45 feet from any property line unless the Town Board shall otherwise direct as part of site plan approval."
																}
															]
														},
														{
															"number": "(i) ",
															"content": [
																{
																	"text": "A walkway of at least eight feet in width shall be built on\nall sides of the pool."
																}
															]
														},
														{
															"number": "(j) ",
															"content": [
																{
																	"text": "All lighting, accessory to said pool, shall be located at a\ndistance of at least two feet therefrom, and shall not throw any rays\nbeyond property lines. Underwater lighting may be part of the pool\nstructure where so designated on the plans submitted to the Town Board."
																}
															]
														},
														{
															"number": "(k) ",
															"content": [
																{
																	"text": "No permission shall be granted for the installation of any swimming\npool, unless the plans meet the requirements of §§ 252B\nand 253 of this ordinance."
																}
															]
														},
														{
															"number": "(l) ",
															"content": [
																{
																	"text": "All applications and the plans submitted in connection therewith\nshall indicate the approval of any governmental agency having jurisdiction\nof the local water supply."
																}
															]
														},
														{
															"number": "(m) ",
															"content": [
																{
																	"text": "Application. The following data shall be submitted at the time\nof the application for a permit for the entire development, or may\nbe submitted at a later date as part of a request for a separate swimming\npool permit:"
																},
																{
																	"content": [
																		{
																			"number": "[1] ",
																			"content": [
																				{
																					"text": "The location and size of the swimming pool area."
																				}
																			]
																		},
																		{
																			"number": "[2] ",
																			"content": [
																				{
																					"text": "The location of all structures and improvements."
																				}
																			]
																		},
																		{
																			"number": "[3] ",
																			"content": [
																				{
																					"text": "The location of the site in relation to adjacent properties\nand buildings."
																				}
																			]
																		},
																		{
																			"number": "[4] ",
																			"content": [
																				{
																					"text": "The location of all cesspools within 50 feet of the pool or\npool dry wells."
																				}
																			]
																		},
																		{
																			"number": "[5] ",
																			"content": [
																				{
																					"text": "The size of the pool, including dimensions, design and elevation\nthereof, drainage, sewerage, sanitary facilities, safety walkway around\nthe pool, fences and location thereof in relation to said pool and\nproperty lines."
																				}
																			]
																		},
																		{
																			"number": "[6] ",
																			"content": [
																				{
																					"text": "The location of all electrical wiring and lines."
																				}
																			]
																		},
																		{
																			"number": "[7] ",
																			"content": [
																				{
																					"text": "The breakdown of estimated costs used in the application."
																				}
																			]
																		}
																	]
																}
															]
														},
														{
															"number": "(n) ",
															"content": [
																{
																	"text": "All heaters and filters used in or in connection with the operation\nof the pool shall be located and placed not closer than 75 feet from\nany and all residence boundaries."
																}
															]
														},
														{
															"number": "(o) ",
															"content": [
																{
																	"text": "Any outdoor pool shall be constructed in such manner so as to\npermit the pool to be securely covered during such time as the use\nof said pool has been seasonally discontinued. The covering of such\npool shall be by cloth or other substance of sufficient strength to\nprevent the same from tearing or ripping when a weight of not more\nthan 175 pounds is placed on any part thereof."
																}
															]
														},
														{
															"number": "(p) ",
															"content": [
																{
																	"text": "No change in the location of the pool or any of its equipment,\nfixtures or appurtenances, as shown on the application as granted,\nshall be made without the express written consent and approval of\nthe Town Board."
																}
															]
														}
													]
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Outdoor or indoor tennis courts shall be considered accessory uses,\nsubject to the following requirements:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "There shall be no more than one court for each 20 units."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Tennis courts shall not be constructed in required yards."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Loudspeaker devices shall be prohibited, nor shall any lighting be\ninstalled in connection therewith which shall throw any rays beyond\nproperty lines."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "Administrative, management and maintenance space shall be considered\naccessory uses."
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "If, in the judgment of the Town Board, the proposed condominium development\nis one that is likely to be occupied by families with children, there\nshall be provided by the developer a suitably improved children's\nrecreation and play facility with an area of not less than 150 square\nfeet for each unit in the development. Such space shall be deemed\na part of the required open space."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 165",
			"title": "Open space.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Not less than 20% of the entire tract shall be reserved as common\nopen space to serve all residents of the development."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "The plan and layout of such open space and any facilities located\ntherein shall be submitted to the Town Board for approval, which approval\nshall be contingent upon the submission by the applicant of such covenants\nas the Town Board shall find adequate to assure that the private common\nopen space shall not be built upon throughout the life of any building\nin the development of which it is a part, that continued ownership\nand maintenance shall be properly provided for, and that taxes shall\ncontinue to be paid upon the open space or upon the total condominium\nof which the open space is a part."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 166",
			"title": "Fences, hedges and shrubbery.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Fences not over four feet in height may be erected only if shown\non the approved site plan, provided that if such fence shall be erected\nalong any street, the permitted height thereof shall be measured from\nthe existing elevation of the center line of such street, and provided\nfurther that within a radius of 30 feet of the corner formed by any\nintersecting streets, the height of any fences, hedges or shrubberies\nmeasured from the existing elevation of the center line of the abutting\nstreet shall not exceed a height of 2 1/2 feet at any point.\nOtherwise, fences may be erected and shall be erected in accordance\nwith the approved site plan and shall thereafter be properly maintained\nat all times."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "All fences shall be so erected that the finished surface shall be\nvisible to adjacent residential zoning district properties."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Any other provision notwithstanding, the Town Board, upon its review\nof a site plan, may waive or alter fence requirements in the interest\nof improved building or site design and when it determines that such\nwaiver will contribute to the livability and design quality of the\nproject."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 167",
			"title": "Off-street parking.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Not less than two parking spaces shall be provided for each dwelling\nunit, of which at least one shall be located within the principal\nstructure with the balance provided in a parking area as a common\nelement, within a reasonable distance, as shown on the site plan."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Not less than four additional parking spaces shall be provided for\neach professional office, in a location convenient to the professional\noffice, and shall be shown on the site plan."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "All garages shall be architecturally compatible with the principal\nbuildings. Detached single-car garages shall not be permitted for\ntownhouses. Where garages are provided in separate accessory structures,\neach such structure may not exceed a total capacity of eight cars."
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "All parking spaces, whether open or closed, shall be restricted to\nthe parking of currently registered private passenger vehicles."
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "All parking areas shall be paved and all parking spaces shall be\nindividually identified by means of pavement markings."
								}
							]
						},
						{
							"number": "F. ",
							"content": [
								{
									"text": "Wherever a parking lot abuts on any street, the entire street frontage,\nexcept at points of ingress and egress, shall be screened with a thick\nhedge, fence or wall of a material and design acceptable to the Town\nBoard. Such hedge, fence or wall shall have a height above grade of\nnot less than 30 inches."
								}
							]
						},
						{
							"number": "G. ",
							"content": [
								{
									"text": "All parking lots shall be lighted from sunset to sunrise at an intensity\nnot in excess of five footcandles nor less than 1.5 footcandles at\npavement level. The installation of such lighting shall be so hooded\nor shielded as to reflect the light away from abutting or neighboring\nstreets and properties."
								}
							]
						},
						{
							"number": "H. ",
							"content": [
								{
									"text": "No parking spaces shall be installed or maintained on any plot or\nlot in the required front yard, except when permitted by the Town\nBoard."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 168",
			"title": "Landscaping.",
			"content": [
				{
					"text": "The entire plot of any condominium development, except for areas\ncovered by buildings or parking or service areas, shall be suitably\nlandscaped and properly maintained. Wherever any lot abuts the boundary\nof a one-family residence, there shall be provided a densely planted\nevergreen screen with an initial height of six feet. A landscaping\nplan and planting schedule (using common names) prepared by a landscape\narchitect shall be submitted with the site plan and shall be subject\nto review in the same manner as the site plan."
				}
			]
		},
		{
			"paragraph": "§ 169",
			"title": "Disposal of garbage and refuse.",
			"content": [
				{
					"text": "Adequate provision shall be made on the premises for safe and\nconvenient storage and removal of garbage and refuse located and screened\nin accordance with the approved site plan. Containers shall be housed\nin a roofed structure or structures enclosed on three sides, of material\nthat is architecturally compatible with the principal buildings."
				}
			]
		},
		{
			"paragraph": "§ 170",
			"title": "Service areas.",
			"content": [
				{
					"text": "All service areas shall be screened at all times of the year\nin accordance with screening shown on the site plan."
				}
			]
		},
		
	]
}