{
	"url": "http://ecode360.com/14554192",
	"paras": [
		{
			"paragraph": "§ 108.1",
			"title": "Legislative intent; applicability.",
			"content": [
				{
					"text": "It is in the public interest for the Town to utilize its zoning\nauthority to solve a long-existing problematic use and at the same\ntime provide higher density housing near a popular railroad station\nand bus route. It is envisioned that such proximate housing will increase\nridership of trains and buses in the vicinity. Moreover, by enacting\ncontrols ensuring proper space for pedestrian walkways, accessory\nuses and landscaped or recreational areas, the Town will be able to\nensure that this higher-density housing will be developed in a manner\nthat is aesthetically pleasing and protects surrounding area character\nfrom the adverse effects of overcrowding or undue development. In\na CA-S Residence District, the following regulations shall apply."
				}
			]
		},
		{
			"paragraph": "§ 108.2",
			"title": "Permitted uses.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "A building may be erected, altered or used and a lot or premises\nmay be used for the following purposes, and for no other:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Multiple-family dwellings, including the office, studio or occupational\nroom of a professional person, such as a physician, dentist, lawyer,\nartist, architect, real estate broker, engineer or accountant when\nlocated in the same apartment or suite of rooms in which the practitioner\nresides and incidental to such residential use, and provided that\nthere is no display of goods or advertising other than a sign not\nlarger than six inches by 12 inches attached to the building and bearing\nonly the name and occupation (words only) of the practitioner."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Accessory building, structures, and uses, including retail,\nrestaurant, and personal service uses, as part of a multiple-family\ndevelopment, provided that the amount of retail, restaurant and personal\nservice uses do not exceed 7% of the total lot area."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Indoor and outdoor recreation, clubhouses, and community buildings\nservicing the multiple-family development."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "No basement or cellar shall be occupied as living or sleeping quarters\nexcept for a janitor's apartment in the basement."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 108.3",
			"title": "Height.",
			"content": [
				{
					"text": "No building shall be greater than 4 1/2 stories and 60\nfeet in height. \"Height\" shall be defined as applicable to the CA\nResidence Districts (CA)."
				}
			]
		},
		{
			"paragraph": "§ 108.4",
			"title": "Building area.",
			"content": [
				{
					"text": "The building area shall not exceed 60% of the lot area, exclusive\nof all landscaped areas and landscaped courtyards, whether or not\nconstructed above parking areas."
				}
			]
		},
		{
			"paragraph": "§ 108.5",
			"title": "Front yards.",
			"content": [
				{
					"text": "The required front yard depth shall be a minimum of 15 feet.\nIn the case of a corner lot, a front yard shall be required on each\nstreet."
				}
			]
		},
		{
			"paragraph": "§ 108.6",
			"title": "Side yards.",
			"content": [
				{
					"text": "The required side yard depth shall be a minimum width of at\nleast 20 feet on each side, except that where there are two or more\nmain buildings upon the plot, the minimum side yard requirement of\n20 feet shall apply only along the side property lines of the entire\nplot."
				}
			]
		},
		{
			"paragraph": "§ 108.7",
			"title": "Rear yards.",
			"content": [
				{
					"text": "There shall be a rear yard, the depth of which shall be at least\n25 feet."
				}
			]
		},
		{
			"paragraph": "§ 108.8",
			"title": "Minimum lot area.",
			"content": [
				{
					"text": "No multiple-family dwelling or other building shall be constructed\non a lot unless it contains an area of not less than 2.5 acres."
				}
			]
		},
		{
			"paragraph": "§ 108.9",
			"title": "Permitted encroachments.",
			"content": [
				{
					"text": "Cornices, eaves, gutters or bay windows projecting not more\nthan 24 inches are hereby permitted as encroachments."
				}
			]
		},
		{
			"paragraph": "§ 108.10",
			"title": "Accessory buildings, structures and uses.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Accessory buildings may occupy no greater than 40% of the area of\nthe rear yard, with an average height of no greater than 12 feet.\nThe yard area occupied by such accessory buildings shall be included\nin computing the maximum percentage of the lot area which may be built\nupon. An accessory building shall not be nearer to any front property\nline than 45 feet and must be at least two feet from the rear and\nside property lines, except that accessory garages may have a party\nwall."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Swimming pools. Outdoor or indoor pools shall be considered accessory\nstructures and shall be subject to the following requirements:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Site plan. All pools shall be shown on the site plan and may\nbe permitted by site plan approval of the Town Board of the Town of\nHempstead based upon the following criteria:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "Will not adversely affect the public health, safety and general\nwelfare;"
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "Will be limited to use by the residents and guests of the subject\nmultiple-family dwelling;"
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "Will not tend to depreciate the value of the property in the\narea immediately adjoining the land being so used;"
																}
															]
														},
														{
															"number": "(d) ",
															"content": [
																{
																	"text": "Will not tend to alter the essential character of the neighborhood;\nand"
																}
															]
														},
														{
															"number": "(e) ",
															"content": [
																{
																	"text": "Will not be visible to a significant extent from adjoining residential\nproperties nor interfere with the use and enjoyment of adjoining properties."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "In order to ensure the health and safety of the community, and\nparticularly the children thereof, the following specific conditions\nhereby are imposed on all swimming pools of permanent construction:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "Any electric wiring for lighting or other use, other than for\nlighting which is part of and enclosed in the pool structures, shall\nnot be maintained closer than 15 feet to said pool."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "The pool shall be located no nearer than 20 feet to any cesspool\nor dry well (excluding roof leader dry wells) on its own or adjacent\nproperty."
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "Any water from a public water supply shall be introduced into\na swimming pool by means of a permanent rigid system of piping and\nshall in every manner conform to the New York State Sanitary Code."
																}
															]
														},
														{
															"number": "(d) ",
															"content": [
																{
																	"text": "No swimming pool shall have a water capacity in excess of 7,500\ngallons without a recirculating and filtering system of sufficient\ncapacity to meet good and accepted public health and engineering practice."
																}
															]
														},
														{
															"number": "(e) ",
															"content": [
																{
																	"text": "A permit, when issued, also may have endorsed thereon any such\nreasonable rules and regulations for the operation, maintenance and\nuse of such pool as may be promulgated by the Town Board of the Town\nof Hempstead."
																}
															]
														},
														{
															"number": "(f) ",
															"content": [
																{
																	"text": "A fence meeting the requirements of Article XXV of this ordinance shall be provided."
																}
															]
														},
														{
															"number": "(g) ",
															"content": [
																{
																	"text": "No part of any pool shall be located within 50 feet of any external\nproperty line, other than the front yard, which shall not be located\nwithin the front yard setback nor within 100 feet of any residence\ndistrict boundary."
																}
															]
														},
														{
															"number": "(h) ",
															"content": [
																{
																	"text": "The fence referred to in § 108.10(2)(f) above shall\nbe erected at least eight feet from the edge of the pool."
																}
															]
														},
														{
															"number": "(i) ",
															"content": [
																{
																	"text": "A walkway of at least eight feet in width shall be built on\nall sides of the pool."
																}
															]
														},
														{
															"number": "(j) ",
															"content": [
																{
																	"text": "All lighting accessory to said pool shall be located at a distance\nof at least two feet therefrom and shall not throw any rays beyond\nproperty lines. Underwater lighting may be part of the pool structure\nwhere so designated on the plans submitted to the Town Board of the\nTown of Hempstead."
																}
															]
														},
														{
															"number": "(k) ",
															"content": [
																{
																	"text": "No permission shall be granted for the installation of any swimming\npool unless the plans meet the requirements of §§ 252B\nand 253 of this ordinance."
																}
															]
														},
														{
															"number": "(l) ",
															"content": [
																{
																	"text": "All applications and the plans submitted in connection therewith\nshall indicate the approval of any governmental agency having jurisdiction\nof the local water supply."
																}
															]
														},
														{
															"number": "(m) ",
															"content": [
																{
																	"text": "Application. The following information shall be submitted at\nthe time of the application for a permit for the entire development\nor may be submitted at a later date as part of a request for a separate\nswimming pool permit:"
																},
																{
																	"content": [
																		{
																			"number": "[1] ",
																			"content": [
																				{
																					"text": "The location and size of the swimming pool area."
																				}
																			]
																		},
																		{
																			"number": "[2] ",
																			"content": [
																				{
																					"text": "The location of all structures and improvements."
																				}
																			]
																		},
																		{
																			"number": "[3] ",
																			"content": [
																				{
																					"text": "The location of the site in relation to adjacent\nproperties and buildings."
																				}
																			]
																		},
																		{
																			"number": "[4] ",
																			"content": [
																				{
																					"text": "The location of all cesspools within 50 feet of\nthe pool or pool dry wells."
																				}
																			]
																		},
																		{
																			"number": "[5] ",
																			"content": [
																				{
																					"text": "The size of the pool, including dimensions, design\nand elevation thereof, drainage, sewerage, sanitary facilities, safety\nwalkway around the pool, fences and location thereof in relation to\nsaid pool and property lines."
																				}
																			]
																		},
																		{
																			"number": "[6] ",
																			"content": [
																				{
																					"text": "The location of all electrical wiring and lines."
																				}
																			]
																		},
																		{
																			"number": "[7] ",
																			"content": [
																				{
																					"text": "The breakdown of estimated costs used in the application."
																				}
																			]
																		}
																	]
																}
															]
														},
														{
															"number": "(n) ",
															"content": [
																{
																	"text": "All heaters and filters used in or in connection with the operation\nof the pool shall be located and placed not closer than 25 feet to\nany and all residence boundaries."
																}
															]
														},
														{
															"number": "(o) ",
															"content": [
																{
																	"text": "Any outdoor pool shall be constructed in such a manner as to\npermit the pool to be securely covered during such time as the use\nof said pool had been seasonally discontinued. The covering of such\npool shall be by cloth or other substance of sufficient strength to\nprevent the same from tearing or ripping when a weight of not more\nthan 175 pounds is placed on any part thereof."
																}
															]
														},
														{
															"number": "(p) ",
															"content": [
																{
																	"text": "No change in the location of the pool or any of its equipment,\nfixtures or appurtenances as shown on the application as granted shall\nbe made without the express written consent and approval of the Town\nBoard of the Town of Hempstead."
																}
															]
														}
													]
												}
											]
										}
									]
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 108.11",
			"title": "Parking.",
			"content": [
				{
					"text": "In the case of a multiple dwelling, there shall be provided\non the premises parking or garage facilities adequate to accommodate\nfive automobiles for each three units. In the event that any single-car\ngarages or single driveways are provided, then each single-car garage\nand single driveway shall count as one parking space and each double-car\ngarage and double driveway shall count as two parking spaces. A minimum\nof one parking space for each 300 square feet of retail, take-out\nrestaurant, or personal service floor area shall be provided."
				}
			]
		},
		{
			"paragraph": "§ 108.12",
			"title": "Population density.",
			"content": [
				{
					"text": "No multiple-family dwelling shall be erected or altered to accommodate\nor make provision for more than 55 families per acre, exclusive of\nstreet areas, or more than a proportionate number of families on any\nfractional part of an acre of land."
				}
			]
		},
		{
			"paragraph": "§ 108.13",
			"title": "Sewage disposal.",
			"content": [
				{
					"text": "No multiple-family dwelling shall be permitted unless provided\nwith municipal sewage disposal facilities or unless an independent\nsewerage system or installation approved by the Nassau County Department\nof Health is constructed for the sanitary disposal of the sewage of\nsuch buildings."
				}
			]
		},
		{
			"paragraph": "§ 108.14",
			"title": "Fences.",
			"content": [
				{
					"text": "A fence, not exceeding six feet in height, shall be permitted on the rear lot line and side lot lines; provided, however, that said fence along the rear lot lines and side lot lines shall not exceed a greater distance frontward to the street than the street side building line of buildings constructed pursuant to regulations of this article; and with respect to all other lot lines, any fence shall not exceed four feet in height except when authorized by the Board of Zoning Appeals, pursuant to Article XXVII hereof."
				}
			]
		},
		{
			"paragraph": "§ 108.15",
			"title": "Location.",
			"content": [
				{
					"text": "This CA-S Zone shall only be applicable to parcels of land conforming\nto all of the following characteristics:"
				},
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Located adjacent to a railroad station or railroad tracks adjoining\nthe platform of such railroad station;"
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Located along a county or state roadway;"
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Located along a bus route; and"
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "Located a minimum of 200 feet away from any property situated within\na residential zoning district."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 108.16",
			"title": "Application of provisions.",
			"content": [
				{
					"text": "This CA-S Zone shall be a floating zone. Upon application to\nthe Town Board, a parcel may be considered for a change of zone to\nCA-S if said parcel meets the bulk, area and location requirements\nof this article and the Town Board makes a finding that said parcel\nof land is located in a blighted area which includes significant criminal\nactivity and is in need of redevelopment and that the incentive to\nincrease density is in the best interest of the community in order\nto encourage redevelopment and thereby eliminate such blighted use\nor improve such blighted area."
				}
			]
		},
		{
			"paragraph": "§ 298",
			"title": "Height of towers, steeples and poles.",
			"content": [
				{
					"text": "In no residence district shall a tower, steeple or pole be erected\nor maintained at a height greater than 30 feet, other than the spires\nor belfries of a building used for religious worship."
				}
			]
		},
		{
			"paragraph": "§ 299",
			"title": "Minimum floor space.",
			"content": [
				{
					"text": "In any use district, no dwelling shall be erected which has\na habitable floor space of less than 1,000 square feet, unless otherwise\nspecified."
				}
			]
		},
		{
			"paragraph": "§ 300",
			"title": "Lots abutting parkway.",
			"content": [
				{
					"text": "In a residence district where a lot abuts on a parkway, the\nlot shall be considered to front and have a front yard on the street\nand also on the parkway; and where the building accords with this\nsection, a private accessory garage may be incorporated in the building\nor attached thereto, regardless of distance from streets."
				}
			]
		},
		{
			"paragraph": "§ 302",
			"title": "Prohibited and restricted uses.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "An institution required to be licensed under the Mental Hygiene Law\nof the State of New York is hereby prohibited in all use districts."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "In any use district, no premises may be used or occupied and no structure erected or maintained for the harboring of pigeons, poultry, fowl, ducks, geese, swine, goats, sheep, lambs, horses, ponies, donkeys, snakes, cattle, monkeys, rabbits, chinchillas, minks, skunks, foxes or bees, except when permitted as a special exception by the Board of Appeals pursuant to Article XXVII hereof.[Effective 8-13-1973]"
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "In any use district, no premises may be used or occupied and no structure\nmay be erected or maintained for the harboring of any dangerous or\nobnoxious animal which is wild in its natural habitat."
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "Notwithstanding the provisions of Subsections B and C of this section, a recognized pharmaceutical, medical, scientific or research laboratory shall be permitted, without a special exception being required therefor, to keep, maintain and harbor upon the premises occupied by it such animals, birds and/or reptiles as shall have a recognized usefulness in scientific study or research and/or the development or production of vaccines and similar substances. Any animals, birds or reptiles kept pursuant to the provisions of this section shall be securely enclosed and shall be kept and maintained in such a manner as to not constitute a nuisance."
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "In any use district, no premises may be used or occupied and no structure\nmay be erected or maintained where the release of airborne asbestos\nfibers, due to the handling or presence of asbestos in any form, may\noccur. In those instances where asbestos was in use prior to the enactment\nof this amendment, it shall be the responsibility of any owner, agent\nor lessee of any place of employment, public place or place where\npeople assemble which uses asbestos or asbestos-related products,\ncoverings or materials which cause the release of asbestos fibers\nwhich may reach the breathing zone of employees and/or other occupants,\nor which cause the release of asbestos fibers into the environment,\nto register with and provide the Department of Buildings of the Town\nof Hempstead with copies of the initial determination and, when indicated,\ncopies of the periodic personal and environmental monitoring reports\nrequired to be provided pursuant to Title 29, United States Department\nof Labor, Chapter XVII, Occupational Safety and Health Administration\nSection 1910.1001(29 CFR 1910) OSHA 2206, Revised March 11, 1983.\nThis section shall not apply to buildings and structures wherein the\nuse of asbestos is as a component of fireproofing, insulation, soundproofing\nor other building material installed in or on such building or structure,\nor is an asbestos-bearing material stored therein, provided that such\nbuildings or structures have been registered with the Department of\nBuildings of the Town of Hempstead and a certification of compliance\nwith federal and New York State laws related to asbestos has been\nfiled with the Department of Buildings.[Effective 12-23-1985]"
								}
							]
						},
						{
							"number": "F. ",
							"content": [
								{
									"text": "In any use district, no premises may be used or occupied and no structure\nmay be erected or maintained which may be determined by the Department\nof Buildings to be noxious or offensive by reason of the emission\nof odor, dust, fumes, smoke, gas, vibration or noise.[Effective 1-6-1992; 8-19-1997]"
								}
							]
						},
						{
							"number": "G. ",
							"content": [
								{
									"text": "It shall be prohibited, in dwelling units, hotel units, lodging units\nand dormitory units, to conduct a home occupation (accessory use)\nas set forth as follows:[Effective 1-6-1992)"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "When the utilized floor area is more than 25% of the total floor\narea of the unit, and in no event more than 500 square feet of floor\narea."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "When the home occupation produces offensive noise, vibration, smoke,\ndust or other particulate matter, odorous matter, heat, humidity,\nglare or other objectionable effects."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "H. ",
							"content": [
								{
									"text": "Placement of commercial vehicles on premises improved with a single-\nor two-family residence.[Effective 7-30-1996]"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "No commercial vehicle shall be placed upon the exterior portion of\nany premises which is improved with a single- or two-family residence,\nexcept during active loading or off-loading of merchandise, or except\nduring the active performance of any commercial service or duty undertaken\nby the operator of such vehicle in connection with said premises."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "For the purpose of Subsection H(1) above, a \"commercial vehicle\" shall be defined as a vehicle which requires commercial registration under the New York State Vehicle and Traffic Law or the regulations adopted thereunder, or as any other vehicle which, by reason of the attachment of advertising messages and/or storage of service equipment or other commercial merchandise or hardware, presents the outward appearance of a vehicle which is primarily utilized in furtherance of commercial or industrial enterprise."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "I. ",
							"content": [
								{
									"text": "In any use district, each commercial establishment opened to patrons\nof all ages shall display adult materials only in the following manner:[Effective 1-8-1996]"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Adult materials shall not be displayed in the same casement as materials\nwhich are permitted to be sold to patrons of all ages."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "A casement displaying adult materials shall be enclosed and not displayed\nin a manner visible to all patrons."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "The area of a commercial establishment displaying adult materials\nshall not exceed 5% of the establishment's total floor space\nutilized for display, except that in no event shall such area exceed\n50 square feet."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "A casement displaying adult materials shall be clearly identified\nas an adult display which is not to be viewed by minors."
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "For the purpose of the above provisions, the term \"adult materials\"\nis defined as any book, magazine, periodical, film, slide, videotape,\ngame, toy or device which is forbidden to be sold to minors."
												}
											]
										},
										{
											"number": "(6) ",
											"content": [
												{
													"text": "The right of any commercial establishment which is lawfully in existence\non the effective date of this section to operate in violation of this\nsection as a legal nonconforming use shall terminate by amortization\non July 31, 1996."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "M. ",
							"content": [
								{
									"text": "Prohibition on cooking facilities in certain zones. Notwithstanding\nany other provision in this ordinance, cooking facilities shall not\nbe permitted in any individual sleeping accommodation or unit in any\nmotel, hotel, or other lodging facility in an X Business (X), LM Light\nManufacturing (LM) or Y Industrial (Y) Districts.[Effective 3-9-2004]"
								}
							]
						},
						{
							"number": "N. ",
							"content": [
								{
									"text": "Eradication of graffiti.[Effective 4-14-2009]"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "The Town Board believes that defacement of buildings and structures\nwith graffiti is a serious blight that reflects badly on the commercial\nand residential neighborhoods where it is found. This problem detracts\nfrom area character and property values, and it is imperative that\nthe Town take affirmative steps to encourage abatement in a meaningful\nway. Apprehension of persons who commit the crime of defacement via\ngraffiti is difficult, because they will immediately abscond from\nthe scene on completion of their act. It is therefore imperative for\nthe good of the communities where it is found to place certain legal\nburdens on persons or entities in charge of properties which have\nbeen defaced. To meaningfully combat the problem of graffiti, this\nnew section of the Town's zoning regulations shall impose a strict\nliability on owners, lessees and other persons in control of buildings\nand structures which have been defaced. Specifically, they will have\nto remove the graffiti within certain time limitations, or the Town\nwill do it for them and recoup the cost via special tax assessment,\nor prosecute them in court."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "The term \"graffiti\" means one or a series of images appearing on\nprivately owned property, including a building thereon, a fixed or\nmobile structure thereon, or a ground surface thereof, applied by\nmeans of painting, drawing, dye, ink, writing, etching, carving, or\nany similar method or substance, and visible from a public place,\nif any of the following is true:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "It was applied without the written consent of the owner, lessee,\nor other person in control of such private property; or"
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "It is not an image or series of images that is customarily found\non that type of building, structure or ground surface; or"
																}
															]
														},
														{
															"number": "(c) ",
															"content": [
																{
																	"text": "It was applied with intent to damage the building, structure\nor ground surface."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Notice to owners, lessees and persons in control of private property. Whenever the Building Inspector or a person acting on his/her behalf shall verify a complaint that graffiti as defined in this Subsection N is present upon any building, structure or ground surface located on private property within the unincorporated part of the Town, the Building Inspector or person acting on his/her behalf shall send written notice to the owner, lessee and any other known person in managerial control of such building, structure or ground surface that such graffiti exists, and shall order that the graffiti be removed. The notice and order shall be sent to these persons or entities at their last known address, and a copy shall be posted conspicuously on the subject property. The notice shall state that the person notified must remove the graffiti or consent to its removal by the Town within 10 days from the date the notice was mailed, or such longer time as the Building Inspector may allow under the circumstances. Removal shall include either elimination, painting over, or otherwise obscuring the graffiti from view, in a manner that shall cause the affected area to appear in a finished condition and substantially the way that it did prior to the imposition of the graffiti."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "Removal by Town with consent. Whenever the Building Inspector, or a person acting on his/her behalf, determines that graffiti is being maintained at a location in violation of this Subsection N, the Building Inspector, or a person acting on his/her behalf, is authorized to provide for and use Town resources or funds, if necessary and warranted, to remove the graffiti, upon securing the written consent from one or more of the owners, lessees, or other person or entity in managerial control of the property, together with a properly executed release and waiver in favor of the Town of Hempstead approved by the Town Attorney."
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "Removal by Town without consent. The Town may also remove graffiti that violates this Subsection N if the notice referenced in Subsection N(3) above has been sent; the graffiti has not been removed; no consent for the Town to do so has been provided; the time period in the notice has expired; and any required hearing has been held as provided below."
												}
											]
										},
										{
											"number": "(6) ",
											"content": [
												{
													"text": "Hearing. Prior to the Town abating graffiti on private property without\nconsent, a hearing before the Building Inspector or his designee shall\nbe held if, prior to removal, it is requested in writing by any recipient\nof the notice, addressed to the Building Inspector and delivered to\nhim personally at his office or by mailing to his office by certified\nmail, return receipt requested. After the hearing, the Building Inspector\nmay proceed with removal by the Town or provide the person who requested\nthe hearing a period of not more than 30 days from the date of the\nhearing to do so. If time is given and the graffiti is not removed\nby expiration thereof, the Town may proceed with removal."
												}
											]
										},
										{
											"number": "(7) ",
											"content": [
												{
													"text": "Assessment of cost. Whenever the Town removes any graffiti, either\nwith or without consent as provided herein, upon completion of the\nabatement, the costs and expenses thereof shall be itemized and collected\nin the manner fixed by law for the collection of Town taxes, and further,\nthe assessed amount shall be increased by imposition of a delinquent\npenalty of 6% in the event same is not paid in full on or before the\ndate the tax bill upon which said charge appears becomes delinquent."
												}
											]
										},
										{
											"number": "(8) ",
											"content": [
												{
													"text": "As an alternative measure to Subsection N(3) through (7) hereof, whenever the Building Inspector or a person acting on his behalf shall verify a complaint that graffiti as defined in this Subsection N is present upon any building, structure or ground surface located on private property within the unincorporated part of the Town, enforcement of this Subsection N may be pursued by way of prosecution of the owner, lessee and any other person in control of such building, structure or ground surface in the District Court of Nassau County, Hempstead Part, or application for an injunction in New 'Cork State Supreme Court, County of Nassau."
												}
											]
										},
										{
											"number": "(9) ",
											"content": [
												{
													"text": "It shall be an unclassified misdemeanor for any person to remove, relocate, obscure or alter the posted notice and order referenced in Subsection N(3) hereof."
												}
											]
										},
										{
											"number": "(10) ",
											"content": [
												{
													"text": "This ordinance shall take effect six months after its adoption and publication, and said six-month period shall constitute an amortization period in which all owners, lessees, or other persons with managerial control of places in the Town where graffiti exists on the effective date of this Subsection N must remove same or face enforcement procedures as outlined herein."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "O. ",
							"content": [
								{
									"text": "In any use district, no storefront of any premises adjacent to a\npublic street shall be maintained with a roll-down or retractable-type\nsecurity gate, unless:[Effective 6-8-2012]"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "The\ngate shall be installed on the interior side of the storefront; and"
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "When\nthe gate is rolled down or unretracted, it shall not fully or substantially\nblock the view of the interior of the premises from the public street."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "P. ",
							"content": [
								{
									"text": "No parcel\nof real property improved with a business, dwelling or multiple dwelling\nmay be maintained in such a manner that a light-emitting device or\nfacility, including but not limited to a spotlight or floodlight,\nshall emit glare (visible light) from any point upon the parcel onto\nany part of an adjacent or nearby residential dwelling. Any such light\nshall be deemed in compliance with this section if it is hooded or\nshielded in such a manner as shall direct the glare downward and away\nfrom adjacent or nearby dwellings, or if the light emits 1,500 lumens\n(one-hundred-watt bulb) or less. The owner or lessee of any property\nlawfully maintaining a light-emitting device or facility upon the\neffective date of this subsection may continue to do so as a legal\nnonconforming use, but such legal nonconforming status shall terminate\nby amortization on January 1, 2013, at which time such property shall\nbe brought into compliance with this subsection.[Effective 7-28-2012]"
								}
							]
						},
						{
							"number": "Q. ",
							"content": [
								{
									"text": "No building\nshall be erected or maintained, the principal use of which is to serve\nfood to patrons for on-site consumption, unless each exterior wall\nof the building shall have a window or windows, to the extent that\nwindows shall occupy not less than 20% of the surface area of each\nsuch wall, and each such window is unobstructed such that persons\nmay directly and substantially view the indoors or outdoors at all\ntimes that the use is open for business. Nothing herein shall be construed\nin a manner which would violate or supersede any applicable fire or\nbuilding code regulations. This provision shall be applicable to all\nbuildings to be constructed after the effective date hereof, and to\nany existing building which does not have a certificate of occupancy\nfor restaurant use on the effective date hereof.[Effective 3-3-2016]"
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 302.1",
			"title": "Permitted encroachments.",
			"content": [
				{
					"text": "The following encroachments hereby are permitted:"
				},
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "In any use district, an exterior accessible route for use by the\nphysically handicapped, which may include parking access aisles, curb\nramps, walks, ramps and lifts."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 302.2",
			"title": "Temporary storage containers.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Definition. As used in this section, the following terms shall have\nthe meanings indicated:"
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "It shall be unlawful for any person, firm or corporation to place,\nkeep or maintain any storage container on any property improved with\na single-family dwelling without securing a permit."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Any person desiring a permit to place or maintain a storage pod shall\nfile an application with the Building Department. The form for this\napplication is to be furnished by the Department of Buildings and\nshall be sworn to and filed by the applicant with the Department of\nBuildings, along with an application fee of $100 for a new permit,\n$75 for a time extension of a permit."
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "A permit for a storage pod may only be granted if there is currently\na permit for improvement to a single-family dwelling with a cost of\nimprovement of at least $25,000."
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "A storage container may not be more than 120 square feet, and may\nbe no more than eight feet in height."
								}
							]
						},
						{
							"number": "F. ",
							"content": [
								{
									"text": "The storage container shall be set back from any side yard a minimum\nof five feet, from the front yard by a minimum of five feet, and also\nbe a minimum of five feet away from any structures on the property.\nIn granting the permit the Building Inspector shall consider the rights\nof adjacent property owners so that there shall not be any unreasonable\ndeprivation of light, air or a reasonable use of adjoining property."
								}
							]
						},
						{
							"number": "G. ",
							"content": [
								{
									"text": "The Building Inspector is hereby authorized, in the exercise of reasonable\ndiscretion, to revoke any permit issued hereunder if, after due investigation,\nhe deems that the holder thereof has violated any provisions of this\nordinance, in that the storage pod is being maintained in an unsafe\nmanner or is being maintained as a nuisance. Written notice of said\nrevocation shall be given, either by personal service upon the person\nto be notified or by depositing said notice in the United States mail\nin a sealed envelope, postage prepaid, addressed to such person at\nthe address which appears on the records of the Building Department."
								}
							]
						},
						{
							"number": "H. ",
							"content": [
								{
									"text": "The length of time a storage container shall be permitted to remain\nshall be 90 days with up to two thirty-day extensions. A further extension\nshall be permitted only upon good cause demonstrated to the Department\nof Buildings. It shall be mandatory that the storage container be\nremoved at the end of the permitted period of time."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 302.3",
			"title": "Bird feeding and bird-feeding receptacles.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Migratory water fowl."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Legislative intent. Feeding of migratory waterfowl in residential\nareas has an unreasonably adverse effect on the use and enjoyment\nof neighboring residential properties. The below provisions are intended\nto curb such adverse effect by prohibiting bird feeding and bird feeders\nin close proximity to waterways. Nothing in these provisions shall\nbe construed to make legal any act or condition otherwise prohibited\nby applicable law or regulation."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "In any district in which single-family residences are expressly\npermitted, no exterior portion of a premises within 300 feet of a\nwaterway shall be used or maintained as a place for the outdoor feeding\nof birds, either by provision of edible or nutritive material in a\nreceptacle, or by placing such material upon the ground or water,\nor by otherwise creating or fostering any condition or allowing any\ncondition to exist or continue which attracts, encourages or results\nin multiple birds returning to such premises on a regular basis. Aggregation\nof at least 10 birds upon such premises at no less than three specific\ndates and times within any consecutive fifteen-day period shall create\na rebuttable presumption that such premises is being used or maintained\nas a place for the outdoor feeding of birds in violation of this subsection."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "In any district in which single-family residences are expressly\npermitted, no exterior portion of a premises within 300 feet of a\nwaterway shall be used as a place for the installation or maintenance\nof any receptacle containing edible or nutritive material, which receptacle\nis used or usable for the outdoor feeding of birds."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Pigeons."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Legislative intent. Unregulated feeding of pigeons in residential\nareas has an unreasonably adverse effect on the use and enjoyment\nof neighboring residential properties. The below provisions are intended\nto curb such adverse effect by regulating pigeon feeding and pigeon\nfeeders in residentially zoned areas. Nothing in these provisions\nshall be construed to make legal any act or condition otherwise prohibited\nby applicable law or regulation."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "In any district in which single-family residences are expressly\npermitted, no exterior portion of a premises shall be used or maintained\nas a place for the outdoor feeding of pigeons, either by provision\nof edible or nutritive material in a receptacle, or by placing it\nupon the ground or water, or by otherwise creating or fostering any\ncondition or allowing any condition to exist or continue which attracts,\nencourages or results in multiple pigeons returning to such premises\non a regular basis, except upon the grant of a special exception by\nthe Board of Appeals. Aggregation of at least 10 pigeons upon such\npremises at no less than three specific dates and times within any\nconsecutive fifteen-day period and without prior grant of such special\nexception shall create a rebuttable presumption that such premises\nis being used or maintained as a place for the outdoor feeding of\npigeons in violation of this subsection."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "In any district in which single-family residences are expressly\npermitted, no exterior portion of a premises shall be used as a place\nfor the installation or maintenance of any receptacle containing edible\nor nutritive material, which receptacle is used or usable for the\noutdoor feeding of pigeons, except upon the grant of a special exception\nby the Board of Appeals."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Amortization. Any right to maintain premises in violation of this\nSection 302.3 as a legal nonconforming use shall terminate by amortization\nupon the expiration of 90 days immediately following the adoption\nof this Section 302.3."
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "Exemption."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Nothing herein shall prohibit outdoor placement of one or two\nelevated bird feeders which are customarily incidental to residential\nuse and are specifically designed and manufactured for bird feeder\nusage, provided that any such bird feeder is at least four feet off\nthe ground and not capable of being used for feeding by more than\none or two birds at any one time."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "The Department of Buildings shall exercise prosecutorial discretion\nto ensure that nothing herein shall prohibit intermittent and occasional\nfeeding of birds that has no substantial adverse impact on neighboring\nproperties. However, no such discretion shall be exercised if it appears\nupon due investigation that greater than one quart of food material\nwas distributed on the property within any twenty-four-hour period."
												}
											]
										}
									]
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 303",
			"title": "Discontinuance of existing signs and billboards in residence districts.",
			"content": [
				{
					"text": "Notwithstanding any other provision of this ordinance, any sign\nor commercial billboard in existence at the effective date of this\nordinance in a residence district shall, at the expiration of five\nyears from such date, be discontinued. The Town Board may, however,\npermit its continuance as a special exception as herein provided."
				}
			]
		},
		{
			"paragraph": "§ 304",
			"title": "Authority of Planning Board.",
			"content": [
				{
					"text": "The Planning Board is hereby empowered to approve subdivision plats or plans, as provided in § 278 of the Town Law, as amended. The Planning Board shall also have the power to modify the zoning regulations for such subdivisions as provided in § 281 of the Town Law, as amended; and said Planning Board shall study the application of this ordinance and shall from time to time recommend to the Town Board such changes in the ordinance and in the boundaries of the various districts as it shall deem advisable to further promote the health, safety, morals or the general welfare of the community."
				}
			]
		},
		{
			"paragraph": "§ 305",
			"title": "Site plans.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "For the purpose of this section, the word \"parcel\" shall mean any\nlot, plot or parcel of land within a Marine Recreation District regardless\nof size or any lot, plot or parcel of land having an aggregate area\nof one acre or more for the improvement of which an application for\na building permit shall be filed and which is or is proposed to be\ndeveloped or improved as a single unit or project by one person or\nany number of persons associated for that purpose, whether or not\nsaid lots or pieces shall be in separate ownership, and whether or\nnot any buildings, structures or other improvements exist thereon,\nbut shall not include a lot, plot or parcel of land proposed to be\ndeveloped or improved exclusively by one-family or two-family dwellings.[Effective 6-26-1987]"
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "No building permit shall be issued for the use of any such parcel or for the installation, erection or alteration of any building or structure thereon or otherwise for the improvement of such parcel or any part thereof unless there shall be submitted to the Town Board of the Town of Hempstead a site plan of the premises or such part, prepared by and submitted under the seal of a licensed professional engineer or architect, showing the proposed use, dimension, types and locations of each of the buildings, structures or other improvements proposed to be installed, erected or altered thereon, and the provisions proposed to be made for the facilities and improvements referred to in Subsection B(1), (2), (3), (6), (7), (8) and (9) below, and unless and until said Town Board shall by resolution have approved the same after giving due consideration to:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "The provisions, including grading and paving made for the draining\nand disposition of storm- and surface water."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "The effect of the proposed use upon the movement of the vehicular\ntraffic in the vicinity, including consideration of the provisions\nfor access of such traffic between the premises and public highways."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "The availability of or provisions made for the treatment, removal\nor discharge of sewage or other effluent (whether liquid, solid, gaseous\nor otherwise) and the removal of garbage and other refuse created\nor generated by or as a result of the proposed use of the premises."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "Possible overcrowding of land or undue concentration of population\nresulting from the proposed use of the premises or the nature, size\nor location of the buildings, structures or improvements proposed\nto be erected or installed thereon."
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "The proximity of the proposed buildings, structures or improvements\nto each other and to other premises or buildings on such other premises,\ndepending on whether the uses proposed therein may create or discharge\nobnoxious gases, odors, smoke, dust, light, vibration or noise."
												}
											]
										},
										{
											"number": "(6) ",
											"content": [
												{
													"text": "The provisions for fencing the premises from abutting properties\nand for the landscaping or other treatment of open, unused areas."
												}
											]
										},
										{
											"number": "(7) ",
											"content": [
												{
													"text": "The provisions for on-premises parking and for loading areas and\nfacilities."
												}
											]
										},
										{
											"number": "(8) ",
											"content": [
												{
													"text": "The provisions for the lighting of parking areas, roads, walks and\nother open areas to be used by the public."
												}
											]
										},
										{
											"number": "(9) ",
											"content": [
												{
													"text": "Approval by the Nassau County Department of Public Works or the New\nYork State Department of Public Works, as the case may be, of drainage\nprovisions affecting curb cuts or other installations in county and\nstate roads."
												}
											]
										},
										{
											"number": "(10) ",
											"content": [
												{
													"text": "The provisions of adequate facilities for refuse and garbage\nstorage and collection."
												}
											]
										},
										{
											"number": "(11) ",
											"content": [
												{
													"text": "Such other matters as the Town Board may require in order to effect the purposes defined in § 263 of the Town Law of the State of New York."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Upon the receipt of such site plan, the Town Board may, in its discretion,\neither refer such plan to the Town of Hempstead Planning Board, for\nthe purpose of making a report and recommendations with respect thereto,\nor delegate to the Planning Board the authority to approve such plans."
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "The Town Board shall have the right at all times to modify or alter\nsaid site plan after issuance of said building permit and/or certificate\nof occupancy with the consent of the holder thereof or his successor\nin interest."
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "Nothing contained in this section shall be deemed to require the submission or approval of a site plan as a condition precedent to the issuance of a permit for the repair or alteration of any building or structure for which a certificate of occupancy or completion is then in effect; provided, however, that such alteration shall make no substantial change in any exterior dimension of such building or structure and shall comply with every lawful condition or limitation theretofore imposed by a town officer or board on the construction, maintenance, occupancy or use of such building or structure. The fee for a waiver under this section shall be in accordance with Subsection B of § 263 of this ordinance.[Effective 4-10-1993]"
								}
							]
						},
						{
							"number": "F. ",
							"content": [
								{
									"text": "The Town Board may, by resolution, waive any of the requirements\nof this section upon approval of a written application from a duly\norganized religious or eleemosynary institution or body. The application\nshall be filed with the Town Board and shall set out in detail the\nreasons for the request for such waiver and be executed by an officer\nor attorney empowered to sign such application.[Effective 5-14-1970]"
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 306",
			"title": "Buildings damaged by fire.",
			"content": [
				{
					"text": "No building which has been damaged by fire or other causes to\nthe extent of more than 50% of its replacement value, exclusive of\nfoundations, shall be repaired or rebuilt except in conformity with\nthe regulations of this ordinance and the Building Code."
				}
			]
		},
		{
			"paragraph": "§ 307",
			"title": "Subdivision into undersized or substandard lots.",
			"content": [
				{
					"text": "It shall be unlawful and deemed a violation of this ordinance\nfor the owner of a parcel of property to subdivide the same, either\nby sale, devise, gift or otherwise, into smaller plots which would\nresult in the creation of one or more undersized or substandard sized\nplots, with relation to the area and street frontage and minimum width\nrequirements of this ordinance in effect at the time of such subdivision,\nand any plot so created shall be deemed to be in violation of this\nordinance, and said violation shall be deemed to extend and apply\nto all newly created lots out of the original plot subdivided, whether\nor not one or more of the newly created plots is technically in conformity\nwith the then-existing ordinance."
				}
			]
		},
		{
			"paragraph": "§ 308",
			"title": "Reduction of lot area restricted.",
			"content": [
				{
					"text": "No lot area shall be reduced so that the dimensions of any of\nthe open spaces shall be smaller than herein prescribed.[1]"
				},
				{
					"footnote": "[1]\nEditor's Note: Former Sections G-10.0 and G-10.1, which\nimmediately followed this section, were repealed 5-26-1964; former\nSection G-11.0, was repealed 9-24-1957.\n"
				}
			]
		},
		{
			"paragraph": "§ 309",
			"title": "Municipal or public use.",
			"content": [
				{
					"text": "Notwithstanding any other provisions of this ordinance, buildings,\nstructures and premises necessary for use and occupancy by the Town\nor the County of Nassau for public or municipal purposes are hereby\npermitted in any use district."
				}
			]
		},
		{
			"paragraph": "§ 310",
			"title": "Public utility buildings.",
			"content": [
				{
					"text": "Public utility buildings or structures are permitted in any\nresidence or business districts, if approved by the Board of Appeals.\nThe height, area and setback provisions of this ordinance shall be\ninapplicable to such buildings or structures if and when approved,\nexcept that, as a condition to the granting of the approval, the Board\nof Appeals may impose reasonable restrictions in order to promote\nthe health, safety, morals or the general welfare of the community."
				}
			]
		},
		{
			"paragraph": "§ 311",
			"title": "Clear sight triangle.",
			"content": [
				{
					"text": "On any corner lot, no wall, fence or other structure shall be\nerected or altered and no hedge, tree, shrub or other growth shall\nbe maintained at a height greater than 2 1/2 feet at any point\nwithin a radius of 20 feet of the point formed by any intersecting\nproperty lines adjacent to roads or highways, and provided further\nthat such height shall be measured from the existing elevation of\nthe center line of such road or highway opposite such wall, fence,\nother structure, hedge, tree or shrub."
				}
			]
		},
		{
			"paragraph": "§ 312",
			"title": "Fences and planting screens.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Fencing or screening required."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "To provide for the health, safety and welfare of residents of property\nwhich is, has been or is about to be zoned Residence A, AA, A1, A2,\nB, BB, BA, C, or LPRD, a fence, as hereinafter described, shall be\ninstalled on adjacent property which is, has been or is about to be\nzoned otherwise, under any of the following circumstances:[Effective 10-31-1987; 6-18-2002]"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "On immediately adjacent (contiguously abutting) property which\nis used or is intended to be used for any purpose not permitted on\nproperty that is, has been or is about to be zoned Residence A, AA,\nA1, A2, B, BB, BA, C or LPRD."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "In lieu of contiguous abutment, when property zoned Residence\nA, AA, A1, A2, B, BB, BA, C or LPRD is separated from property zoned\notherwise for any purpose not permitted in said residence-zoned property\nby a street upon which the residence-zoned side yard or rear yard\nabuts."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Any required fence shall be installed and maintained upon the nonresidence-zoned\nside of the common boundary or upon the nonresidence-zoned side of\nwhatever property line abuts the street which separates the dissimilar-zoned\nproperties."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Any required fence shall consist of either a continuous evergreen\nplanting screen or other fence installed and maintained in a manner\ndesigned to obscure any such boundary from the view of persons on\nadjacent residence-zoned property and shall also be installed and\nmaintained in a manner designed to prevent all reflection from artificial\nlighting of any kind, and said planting screen or other fence shall\nbe installed at a height of not less than six feet; wherever applicable,\nthe finished side of a fence shall face the residential property."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "Any use of adjacent property which does not conform to the provisions\nof this section on the date of the latest reenactment thereof shall\nbe required to so conform within 18 months of the date of said reenactment.[Effective 5-27-1978]"
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Where a planting screen is installed in compliance with the provisions of Subsection A of this section, it shall also include the erection and maintenance of a woven wire fence to prevent paper and debris from being carried or blown through or under such planting screen."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Where another type of fence is erected in compliance with the provisions of Subsection A of this section, it shall be installed with the finished side thereof facing the premises zoned for residential use.[Effective 3-28-1975]"
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "The Board of Zoning Appeals may, upon a verified application and\nafter a public hearing, permanently waive the requirements of this\nsection; provided, however, that it shall find that all of the record\nowners of abutting residentially zoned premises do not wish a fence\nto be erected, as evidenced by the filing with said Board, at least\nfive days prior to said hearing, by each abutting owner of a written\nrequest for a waiver signed and acknowledged as a deed of conveyance\nof real property. Each request shall state that the waiver, if granted,\nshall be irrevocably binding upon the successors in interest of each\nsaid owner.[Effective 3-28-1975]"
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "On any interior lot where a fence, planting screen or open fence shall be erected along a road or highway, the permitted height thereof measured from the existing elevation of the center of the highway opposite the fence shall not exceed four feet in height when the location of the fence shall exceed toward the street a greater distance than the streetside building line of any buildings located on the adjoining plot or plots except when authorized by the Board of Zoning Appeals, pursuant to Article XXVII hereof.[Effective 3-28-1975]"
								}
							]
						},
						{
							"number": "F. ",
							"content": [
								{
									"text": "On any corner lot where a fence, planting screen or open fence not controlled by § 311 hereof shall be erected along a road or highway, the height thereof measured from the existing elevation of the center of the highway opposite the fence shall not exceed four feet when the location of the fence shall exceed toward the street a greater distance then the streetside building line of any buildings located on the corner lot except when authorized by the Board of Zoning Appeals, pursuant to Article XXVII hereof.[Effective 3-28-1975]"
								}
							]
						},
						{
							"number": "G. ",
							"content": [
								{
									"text": "Anything in this ordinance to the contrary notwithstanding, the owner\nor occupant of premises zoned for residential use abutting premises\nused for a purpose not permitted in a residential zone may erect a\nfence of any height, but not exceeding six feet, along the common\nboundary of the premises zoned for a purpose not permitted in a residential\nuse."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 313",
			"title": "Location of parking spaces for premises zoned for business, light manufacturing or industrial uses.",
			"content": [
				{
					"text": "The required off-street automobile parking space on premises\nzoned for business, light manufacturing or industrial use, directly\nabutting on premises zoned for residential use, shall as far as practicable\nbe installed and maintained on that portion of such premises zoned\nfor business, light manufacturing or industrial use contiguous to\nsuch residential-zoned premises.[1]"
				},
				{
					"footnote": "[1]\nEditor's Note: Former Section G-13.0, which immediately\nfollowed this section, was repealed 5-29-1962.\n"
				}
			]
		},
		{
			"paragraph": "§ 314",
			"title": "Tidal lands or other lands not shown on Zoning Map.",
			"content": [
				{
					"text": "When the tidal lands or other lands are not shown as zoned on\nthe Zoning Map, they shall be considered to lie within the B Residence\nDistrict, but no structure erected herein shall be erected upon such\nlands owned by the Town of Hempstead except upon the approval of the\nTown Board."
				}
			]
		},
		{
			"paragraph": "§ 315",
			"title": "Severability.",
			"content": [
				{
					"text": "Should any section or provision of this ordinance be declared\nby a court of competent jurisdiction to be invalid, such decisions\nshall not affect the validity of the ordinance as a whole or any part\nthereof."
				}
			]
		},
		{
			"paragraph": "§ 316",
			"title": "Interpretation; effect on other regulations.",
			"content": [
				{
					"text": "In interpreting and applying the provisions of this ordinance,\nthey shall be held to be the minimum requirements for the promotion\nof the health, safety, morals or the general welfare of the Town.\nIt is not intended by this ordinance to interfere with or abrogate\nor annul any town building code or any rules or regulations adopted\nor issued thereunder, or the rules and regulations of the Department\nof Health of the County of Nassau, and not in conflict with any of\nthe provisions of this ordinance; provided, however, that where this\nordinance imposes a greater restriction upon the use of buildings\nor premises or upon the height of the building or requires larger\nopen spaces than are imposed or required by such ordinance, rules\nand regulations, the provisions of this ordinance shall control."
				}
			]
		},
		{
			"paragraph": "§ 317",
			"title": "Remedies.",
			"content": [
				{
					"text": "In case any building or structure is erected, constructed, reconstructed,\naltered, repaired, converted or maintained or any building, structure\nor land is used in violation of this ordinance, or of any regulations\nmade pursuant thereto, in addition to other remedies provided by law,\nany appropriate action or proceeding, whether by legal process or\notherwise, may be instituted or taken to prevent such unlawful erection,\nconstruction, reconstruction, alteration, repair, conversion, maintenance\nor use, to restrain, correct or abate such violation, to prevent the\noccupancy of said building, structure or land or to prevent any illegal\nact, conduct, business or use in or about such premises."
				}
			]
		},
		{
			"paragraph": "§ 318",
			"title": "Penalties for offenses.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "It is the intent of the Town Board, pursuant to § 10(1)(ii)(d)(3) of the Municipal Home Rule Law of the State of New York, to supersede a portion of § 268 of the Town Law of the State of New York in its application to the Town of Hempstead insofar as it penalizes a violation of this ordinance by a fine not exceeding $350 or imprisonment for a period not to exceed six months, or both, for conviction of a first offense; by a fine of not less than $350 nor more than $700 or imprisonment for a period not to exceed six months, or both, for conviction of a second offense, both of which were committed within a period of five years; and by a fine not less than $700 nor more than $1,000 or imprisonment for a period not to exceed six months, or both, upon conviction for a third or subsequent offense all of which were committed within a period of five years. It is the intent of the Town Board, via the superseding authority, to instead penalize any and every violation of the provisions of this ordinance as follows: The owner, general agent or contractor of a building or premises where such violations have been committed or shall exist, and the lessee or tenant of an entire building or entire premises where such violations have been committed or shall exist, or the owner, general agent, contractor, lessee or tenant of any part of a building or premises in which part such violation has been committed or shall exist, and the general agent, architect, builder, contractor or any other person who knowingly commits, takes part in or assists in any such violation or who maintains a building or premises in which any violation shall exist, shall be guilty of an offense punishable by a fine of not less than $1,000 and not exceeding $2,500 or by imprisonment for a period not to exceed 15 days, or both, for conviction of a first offense; for conviction of a second offense, both of which were committed within a period of five years, such violation shall be punishable by a fine of not less than $2,500 nor more than $5,000 or by imprisonment for a period not to exceed 15 days, or both; and, upon conviction of a third or subsequent offense, all of which were committed within a period of five years, such violation shall be punishable by a fine of not less than $5,000 nor more than $10,000 or by imprisonment for a period not to exceed 15 days, or both. Each week's continued violation shall constitute a separate additional violation."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "For any\nand every violation of the provisions of this ordinance, the owner,\ngeneral agent or contractor of a building or premises where such violations\nhave been committed or shall exist, and the lessee or tenant of an\nentire building or entire premises where such violations have been\ncommitted or shall exist, or the owner, general agent, contractor,\nlessee or tenant of any part of a building or premises in which part\nsuch violation has been committed or shall exist, and the general\nagent, architect, builder, contractor or any other person who knowingly\ncommits, takes part in or assists in any such violation or who maintains\na building or premises in which any violation shall exist, shall be\nguilty of an offense punishable by a fine of not less than $1,000\nand not exceeding $2,500 or by imprisonment for a period not to exceed\n15 days, or both, for conviction of a first offense; for conviction\nof a second offense, both of which were committed within a period\nof five years, such violation shall be punishable by a fine of not\nless than $2,500 nor more than $5,000 or by imprisonment for a period\nnot to exceed fifteen days, or both; and, upon conviction of a third\nor subsequent offense, all of which were committed within a period\nof five years, such violation shall be punishable by a fine of not\nless than $5,000 nor more than $10,000 or by imprisonment for a period\nnot to exceed 15 days, or both. Each week's continued violation shall\nconstitute a separate additional violation."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 319",
			"title": "Accessory parking.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "No person shall maintain any of the following uses in any district\nunless he shall provide off-street automobile parking spaces either\non such premises or off the premises within 300 feet of such premises,\nin the amounts or proportions as follows, unless otherwise specified:[Effective 11-13-1964; 11-12-1977; 2-27-1978; 12-14-1981; 8-29-1986; 4-11-1993; 5-17-1993]"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "In the case of multiple-family dwellings of three or more units in\nthe Golden Age (GA) Residence District for which the minimum occupancy\nage is 62 years: five parking spaces for each three units or apartments.\nIn the case of all other multiple-family dwellings of three or more\nunits and apartment houses in all districts, there shall also be provided\none common visitor parking space per unit or apartment. Each single-car\ngarage and single driveway shall count as two parking spaces, and\neach two-car garage and double driveway shall count as four parking\nspaces.[Effective 11-29-2005; 4-4-2006; 1-3-2010]"
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Hotels, motels, boatels and tourist homes or cabins: one parking\nspace for each guestroom or unit."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Beach or cabana club: two parking spaces for each cabana, bath cabin\nor locker having a floor area of more than 30 square feet, and two\nparking spaces for each three cabanas, bath cabins or lockers each\nhaving a floor area of 30 square feet or less."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "Theaters: one parking space for each three seats.[Effective 11-29-2005; 4-4-2006]"
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "Places of public assembly, including churches, temples and religious auditoriums, but excluding theaters, bowling alleys, discotheques and cabarets: one parking space for each three authorized occupants of the hall or sanctuary or for each 200 square feet of the hall or sanctuary, whichever is the greater. Additional spaces intended or used for catering, school or other purposes shall have their own parking requirements. Catering spaces shall be provided with parking using the standard for restaurants in Subsection A(16) below.[Effective 9-12-1995; 11-29-2005; 4-4-2006]"
												}
											]
										},
										{
											"number": "(6) ",
											"content": [
												{
													"text": "Bowling alleys: four parking spaces for each alley."
												}
											]
										},
										{
											"number": "(7) ",
											"content": [
												{
													"text": "Discotheques and cabarets: one parking space for each three authorized\noccupants.[Effective 11-12-1977]"
												}
											]
										},
										{
											"number": "(8) ",
											"content": [
												{
													"text": "Retail stores, launderettes and dry-cleaning establishments: one\nparking space for each 200 square feet of floor area."
												}
											]
										},
										{
											"number": "(9) ",
											"content": [
												{
													"text": "Funeral parlors: 25 parking spaces or one parking space for each\n100 square feet of floor area, whichever is greater."
												}
											]
										},
										{
											"number": "(10) ",
											"content": [
												{
													"text": "Furniture and appliance stores: one parking space for each 600\nsquare feet of floor area."
												}
											]
										},
										{
											"number": "(11) ",
											"content": [
												{
													"text": "Shopping centers: Effective January 1, 1982, all shopping centers\nor facilities containing five or more retail stores and providing\n20 or more accessory parking spaces shall provide a minimum of 5%\nof said parking spaces or 10 spaces, whichever is less, for off-street\nparking spaces for the handicapped. The parking spaces designated\npursuant to the provisions of this subsection shall be clearly identified\nfor use by either handicapped drivers or other handicapped persons,\nwhich designation shall include permanently installed above-grade\nsigns which display the international symbol of access and may include\nthe use of blue painted lines or markings."
												}
											]
										},
										{
											"number": "(12) ",
											"content": [
												{
													"text": "Office buildings: one parking space for each 200 square feet\nof total floor area or for each three employees, whichever is greater."
												}
											]
										},
										{
											"number": "(13) ",
											"content": [
												{
													"text": "Hospitals and sanatoriums: one parking space for each four beds\nor for each 1,000 square feet of total floor area, whichever is the\ngreater, plus one parking space for each four employees."
												}
											]
										},
										{
											"number": "(14) ",
											"content": [
												{
													"text": "Industrial plants: one parking space for each 2 1/2 employees\nor for each 800 square feet of total floor area, whichever is the\ngreater."
												}
											]
										},
										{
											"number": "(15) ",
											"content": [
												{
													"text": "Warehouses: one parking space for each employee plus one parking\nspace for each commercial vehicle kept on the lot, but not less than\none parking space for each 1,000 square feet of total floor area.[Effective 11-29-2005; 4-4-2006]"
												}
											]
										},
										{
											"number": "(16) ",
											"content": [
												{
													"text": "Restaurants, whether operated individually or as accessory to\nsome other use: one parking space for each three seats or each 100\nsquare feet of total floor area, whichever is the greater, plus one\nparking space for each four employees."
												}
											]
										},
										{
											"number": "(17) ",
											"content": [
												{
													"text": "Schools: one parking space for each employee plus one parking\nspace for each five students in the 11th grade or above, or one parking\nspace for each four assembly seats, whichever is greater.[Effective 11-29-2005; 4-4-2006]"
												}
											]
										},
										{
											"number": "(18) ",
											"content": [
												{
													"text": "Marinas: one parking space for each two boat slips.[Effective 11-29-2005; 4-4-2006]"
												}
											]
										},
										{
											"number": "(19) ",
											"content": [
												{
													"text": "All commercial uses not otherwise provided for: one parking\narea for each four employees or each 500 square feet of total floor\nspace, whichever is the greater."
												}
											]
										},
										{
											"number": "(20) ",
											"content": [
												{
													"text": "Outdoor retail sales areas, including but not limited to used\ncar lots, garden centers, flea markets and open air markets, but excluding\nthe sale of \"live\" Christmas trees and wreaths: one parking space\nfor each 500 square feet of gross sales area (including pedestrian\naisles)."
												}
											]
										},
										{
											"number": "(21) ",
											"content": [
												{
													"text": "Self-storage facilities: one parking space for each 4,000 square\nfeet of total floor area.[Effective 11-29-2005; 4-4-2006]"
												}
											]
										},
										{
											"number": "(22) ",
											"content": [
												{
													"text": "Business, trade or vocational schools: one parking space for\neach employee plus one parking space for each two students.[Effective 11-29-2005; 4-4-2006]"
												}
											]
										},
										{
											"number": "(23) ",
											"content": [
												{
													"text": "Day-care facilities: one parking space for each 15 children\nand one parking space for each employee. Provisions shall also be\nmade for an on-site maneuvering aisle for the pickup and dropoff of\nchildren attendees. For purposes of this section a \"day-care facility\"\nshall be defined as: a building which provides care for a child on\na regular basis away from the child's residence for fewer than\n24 hours per day by someone other than the parent, stepparent, guardian,\nor relative within the third degree of consanguinity of the parents\nor stepparents of such child.[Effective 5-10-2006]"
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "The provisions of this section shall apply only to uses commenced\nafter June 25, 1957, and to uses prior to that date on premises which\nhave area sufficient to comply herewith. With respect to uses commenced\nprior to June 25, 1957, that do not have area sufficient to comply\nwith this section, any area of the premises that is not building area,\na defined in this ordinance, shall be used for off-street automobile\nparking spaces in compliance with this section to whatever extent\nsuch automobile parking spaces are available on such premises or on\nnonmunicipal areas within 300 feet of such premises. However, no space\nfor the parking of automobiles shall be installed or maintained on\nany plot in the minimum area required for front setback requirements\nof such property.[Effective 7-19-1969]"
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "The Board of Appeals may vary the application of this section in\nany case in which it shall find that compliance herewith is not necessary\nto prevent traffic congestion or undue on-street parking, or where\nthere are practical difficulties or unnecessary hardships in the way\nof carrying out the strict letter of this section, and in granting\nsuch variance may impose such conditions as it shall find to be in\nthe public interest."
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "Building permit applications.[Effective 3-1-1976; 7-15-1984; 9-12-1995]"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Every applicant for a building permit, on premises affected by this\nsection, shall file with his plans, a plot plat showing the portion\nof said premises which he proposes to use for off-street automobile\nparking, and such permit shall be denied unless the plot plan shall\nprovide for off-street parking in compliance herewith. All parking\nareas shall have sufficient self-contained drainage, asphalt paving\nand adequate levels of lighting."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Each parking space shall be a minimum of nine feet in width and 18\nfeet in depth. Employee parking spaces, which are intended for long-term\nuse with low turnover, need be only 8 1/2 feet in width. Employee\nparking spaces shall not exceed 15% of the total required or provided\nparking, whichever is less, for retail or service business or other\nsimilar types of uses designed to attract the general public. All\nparking spaces shall be separated by double painted lines in accordance\nwith specifications as approved by the Department of Buildings and\nas illustrated on Figure 1: Typical Parking Space Details.[1]"
												},
												{
													"footnote": "[1]\nEditor's Note: Figure 1: Typical Parking Space Details,\nis included at the end of this volume.\n"
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "All parking spaces shall be designated at a ninety-degree angle with\na twenty-four-foot-wide two-way maneuvering aisle unless a different\nangle is permitted by the approving authority based upon the unique\nsize and/or shape of the parking facility. In those circumstances\nwhere the approving authority does permit parking at an angle other\nthan 90°, circulation in each maneuvering aisle shall be limited\nto one-way only. The following is a table of minimum parking space\nand maneuvering aisle dimensions:"
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "On all sites of one acre or larger, raised landscaped islands shall\nbe provided for the purpose of preventing the diagonal movement of\nvehicles, alleviating the visual impact of large expanses of paved\nareas and otherwise improving traffic and pedestrian safety. Such\nlandscaped islands shall be located: at the ends of each parking bay\ncontaining 10 or more spaces, and separating opposing rows of parking\nspaces at least every third parking bay. The minimum width of landscaped\nislands shall be five feet where located at the ends of parking bays\nand eight feet where separating opposing rows of parking spaces or\nadjacent to circulation aisles. In addition, the approving authority\nmay permit nonlandscaped islands, if appropriate for such purposes\nas pedestrian circulation, in which case such islands shall not be\nless than four feet in usable width. Where curbs are kept to a maximum\nheight of six inches, 1 1/2 feet of the parking space shall be\nallowed to overhang an island. Such bumper overhang area shall be\nconsidered a part of the parking space and shall not be counted toward\nmeeting minimum yard setbacks or buffer area requirements. Figure\n2: Sample Parking Layout, and Figure 3: Sample Parking Layout - Angled\nParking, graphically illustrate the above requirements.[2]"
												},
												{
													"footnote": "[2]\nEditor's Note: Figure 2: Sample Parking Layout, and Figure\n3: Sample Parking Layout-Angled Parking, are included at the end of\nthis volume.\n"
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "The landscaping of off-street parking areas shall include at least\none shade tree of not less than three inches caliper for each 10 parking\nspaces. This is in addition to ground cover, shrubs and hedges which\nare to be provided in appropriate locations where they will not interfere\nwith safe sight distance for pedestrian or vehicular circulation.\nAll landscaping as shown on the approved site plan shall be maintained\nin a vigorous growing condition throughout the duration of the use\nbeing served. Any plants not so maintained shall be replaced with\nhealthy new plants of comparable size and type at the beginning of\nthe next immediately following growing seasons."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "The Town Board may, on finding that the owner or occupant of premises\naffected by this section is not maintaining parking facilities as\nprovided herein, forthwith revoke any certificate of occupancy issued\nfor any structure on such premises."
								}
							]
						},
						{
							"number": "F. ",
							"content": [
								{
									"text": "No space for the parking of automobiles shall be installed or maintained on any plot in the minimum area required for the front yard of such plot, except when permitted by resolution of the Town Board on findings that the enforcement of this prohibition will cause the occupant of the plot undue hardship and is not required in the public interest, or when a special exception from this prohibition is granted by the Board of Zoning Appeals in accordance with the provisions of Article XXVII of this ordinance.[Effective 9-12-1995]"
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 320",
			"title": "Offices for physicians or dentists in residence districts.",
			"content": [
				{
					"text": "Anything in this ordinance to the contrary notwithstanding, in any residence district, if approved by the Board of Appeals as a special exception after a public hearing and subject to the provisions of Article XXVII herein, premises may be used by a physician or a dentist for the conduct of his practice, irrespective of whether said physician or dentist resides or has resided at said premises. Such special exception shall be granted only to single practitioners, and in the event that a special exception shall be authorized by the Board of Appeals pursuant to this section, said special exception shall be limited to an individual practitioner and shall specify that, in the event that more than one practitioner utilizes the special exception, it shall become null and void."
				}
			]
		},
		{
			"paragraph": "§ 321",
			"title": "Projections over public ways.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "In any use district, no sign, awning or other encroachment, nor any\nportion of such sign, awning or other encroachment, shall project\nout, over or into a sidewalk, street or mall unless the lowest portion\nof such encroachment is at least seven feet in height above such sidewalk,\nstreet or mall, except as otherwise modified by the remainder of this\nsection."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Mouldings, belt courses, lintels, sills, architraves, pediments and\nsimilar projections of a decorative character may project beyond the\nstreet line not more than 10 inches."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Subject to the approval of the Town Highway Department, marquees\nat entrances to buildings may extend beyond the street line and across\nthe sidewalk to within two feet of the curbline, provided that they\nare not less than 10 feet above the curb level at all points. That\nside of a marquee attached to a portion of a building and the side\nof the marquee parallel to it may not exceed in size a number of feet\nequal to 50% of that portion of the building to which it is attached."
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "Drop awnings, attached to buildings, may extend beyond the street\nline but not nearer than two feet to the curbline, provided that,\nwhen let down to their full extent, they are not less than seven feet\nabove the sidewalk at all points, and provided further that no lettering\nor other display shall be placed thereon other than the name of the\nindividual firm or corporation transacting business in the building\nand the house number. No fixed awnings shall extend beyond the street\nline. These provisions shall not prohibit the use for periods not\nto exceed 48 hours of temporary canopies across sidewalks so arranged\nthat a free passage at least six feet in width is afforded along the\nsidewalk."
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "Subject to the approval of the Town Highway Department, fire escapes\nand balconies to fire towers or other required exits, constructed\nof steel or other incombustible material, when required only, may\nproject beyond the street line not more than four feet, but no part\nof such fire escapes or balconies shall be less than 10 feet above\nthe sidewalk, provided that nothing in this section shall prevent\nthe use of movable stairs to the sidewalk, so arranged that they are\nmore than 10 feet above the sidewalk when not in actual use."
								}
							]
						},
						{
							"number": "F. ",
							"content": [
								{
									"text": "Nothing in this section shall be deemed to authorize any projection\nbeyond the street line that is prohibited by the Building Zone Ordinance\nor any other law or ordinance."
								}
							]
						},
						{
							"number": "G. ",
							"content": [
								{
									"text": "Any permission, expressed or implied, under the provisions of this\nsection, to construct a building or any appurtenances that project\nbeyond the street line is revocable by the Town Board at will."
								}
							]
						},
						{
							"number": "H. ",
							"content": [
								{
									"text": "No change or enlargement shall be made to an existing part of a building\nnow projecting beyond the street line except in conformity with the\nprovisions of this section for new construction."
								}
							]
						},
						{
							"number": "I. ",
							"content": [
								{
									"text": "Such parts of buildings which already project beyond the street line\nmay be maintained as constructed until their removal is directed by\nthe Town Board."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 322",
			"title": "Commercial and noncommercial kennels; hobby breeders.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "A commercial kennel may be maintained only on premises zoned for business, light manufacturing or industrial use if approved by the Board of Appeals as a special exception after a public hearing and subject to the provisions of Article XXVII herein."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "In any use district except industrial and light manufacturing zoned districts, no premises may be used or occupied and no structure erected or maintained to harbor or keep more than three adult dogs at any one time, except that a premises may be used by a hobby breeder or for a noncommercial kennel to harbor or keep more than three adult dogs when approved by the Board of Appeals as a special exception after a public hearing and subject to the provisions of Article XXVII herein. For purposes of this section, a dog of adult age shall be deemed to be to be any dog that has attained an age of six months or greater. Such special exception shall be granted only on the condition that the hobby breeder or owner and/or operator of the noncommercial kennel has a purebred license pursuant to the provisions of Article 7 of the Agricultural and Markets Law of the State of New York, and if a dwelling is located on a premises, the hobby breeder or owner and/or operator of the noncommercial kennel resides at the premises where the dogs are located, and further provided that licenses for all dogs required to be licensed pursuant to Chapter 152 of the Code of the Town of Hempstead are obtained."
								}
							]
						}
					]
				}
			]
		}
	]
}