{
	"url": "http://ecode360.com/14496496",
	"paras": [
		{
			"paragraph": "§ 171",
			"title": "Legislative purpose.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "In order to preserve the integrity of the plan of the original Levittown,\nthe Town Board of the Town of Hempstead herein enacts this article\nof the Town of Hempstead Building Zone Ordinance, to be known as \"Levittown\nPlanned Residence District (LPRD).\" This Town Board finds that due\nto the expiration of the original restrictive covenants governing\nlots in the planned community of Levittown, numerous properties that\nwould otherwise be protected may become subject to further subdivision\nunder existing town zoning provisions."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Due to the fact that originally Levittown was planned and developed\nas a whole community, piecemeal intrusion on scattered parcels by\ndevelopment will change the physical character of the residential\nareas and reduce open space. This new Article is designed to prevent\nany future deterioration to this stable community. This new Article\napplies to the various areas in Levittown appearing on the original\nLevitt & Sons, Inc., maps, more particularly described hereinafter."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "This new Article, in combination with Town Law § 262 of the State of New York, is intended to provide a framework to carry out the intention of Levitt & Sons, Inc., as an owner who developed certain land in the Town of Hempstead as a planned suburban community of one-family dwellings, as evidenced by various declarations of restrictions which were filed in the office of the County Clerk of Nassau County."
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "This Town Board intends to accomplish these purposes, thereby protecting,\npreserving and promoting the public health, safety, general welfare\nand amenity of the Town of Hempstead."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 172",
			"title": "Title.",
			"content": [
				{
					"text": "This article shall be known and cited as the \"Levittown Planned\nResidence District (LPRD) Article.\""
				}
			]
		},
		{
			"paragraph": "§ 173",
			"title": "Severability.",
			"content": [
				{
					"text": "If any clause, sentence, section, paragraph or provisions of\nthis article shall be adjudged by a court of competent jurisdiction\nto be invalid, such judgment shall not affect, impair or invalidate\nthe remainder of this article, but shall be confined in its operation\nto the clause, sentence, section, paragraph or provision directly\ninvolved in the controversy in which such judgment shall have been\nrendered."
				}
			]
		},
		{
			"paragraph": "§ 174",
			"title": "Interpretation; conflicts with other provisions.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "In interpreting and applying the provisions of this article, the\nrules of interpretation applicable to remedial legislation shall be\nused so that the spirit and intent of this article shall be observed."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "In the event of a conflict between the provisions of this article\nand other provisions of this Building Zone Ordinance, the provisions\nof this article shall control."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 175",
			"title": "Definitions.",
			"content": [
				{
					"text": "In addition to the definitions in this Building Zone Ordinance,\nthe following special definitions are applicable to this article.\nIn the event of conflict, the following definitions will be controlling:"
				}
			]
		},
		{
			"paragraph": "§ 176",
			"title": "Establishment.",
			"content": [
				{
					"text": "There is hereby established the Levittown Planned Residence\nDistrict (LPRD). In the Levittown Planned Residence District (LPRD),\nbuildings and structures may be erected, altered or used and lots\nor premises may be used in accordance with the provisions of §§ 177\nto 193, both inclusive, and not otherwise."
				}
			]
		},
		{
			"paragraph": "§ 177",
			"title": "Permitted uses.",
			"content": [
				{
					"text": "A building may be erected, altered or used and a lot or premises\nmay be used for any of the following purposes, and for no other:"
				},
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Single-family detached dwelling or senior residence.[Effective 8-31-1992]"
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "(Reserved)[1]"
								},
								{
									"footnote": "[1]\nEditor's Note: Former Subsection B, permitting schools, colleges\nand universities, was repealed effective 8-30-2007.\n"
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "(Reserved)[2]"
								},
								{
									"footnote": "[2]\nEditor's Note: Former Subsection C, permitting religious uses,\nwas repealed effective 8-30-2007.\n"
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "Agriculture or nursery, provided that there is no display for commercial\npurposes or advertisement on the premises."
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "Municipal recreational use."
								}
							]
						},
						{
							"number": "F. ",
							"content": [
								{
									"text": "Railway passenger station."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 178",
			"title": "Accessory uses.",
			"content": [
				{
					"text": "Accessory uses on the same lot with and customarily incidental\nto any of the above-permitted uses, including a private garage, are\npermitted. This shall be understood to include the professional office\nor studio of a doctor, dentist, masseur, teacher, artist, architect,\nreal estate broker, engineer, musician or lawyer or rooms used for\nhome occupations such as dressmaking, millinery or similar handicrafts,\nprovided that the office, studio or occupational room is located in\nthe dwelling in which the practitioner resides and provided further\nthat no goods are publicly displayed on the premises."
				}
			]
		},
		{
			"paragraph": "§ 179",
			"title": "Signs.",
			"content": [
				{
					"text": "No sign whatsoever shall be displayed except a family or professional\nname and address plate."
				}
			]
		},
		{
			"paragraph": "§ 180",
			"title": "Excavations.",
			"content": [
				{
					"text": "No excavations for purposes other than the construction of a\ndriveway, walk, a permitted wall or building or part thereof or accessory\nthereto, or to remove topsoil from one part of the lands of an owner\nto another part of the same premises, which such removal is necessary\nas an accessory use or is made for the purpose of farming or improving\nsaid property, shall be made unless approved by the Board of Appeals."
				}
			]
		},
		{
			"paragraph": "§ 181",
			"title": "Prohibited uses.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "No business or trade of any kind shall be carried on upon any lot except when approved by the Board of Appeals pursuant to Article XXVII."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "No permanent trailer, tent, shack or other structure shall be located,\nerected or used."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 182",
			"title": "Continuation of existing permitted uses.",
			"content": [
				{
					"text": "All existing and permitted uses may be continued as provided\nin this ordinance."
				}
			]
		},
		{
			"paragraph": "§ 183",
			"title": "Special uses.",
			"content": [
				{
					"text": "Special uses, when approved by the Board of Appeals pursuant\nto § 272, shall be permitted."
				}
			]
		},
		{
			"paragraph": "§ 184",
			"title": "Height.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "In the case of a single-family dwelling, no building shall be greater\nin height than 2 1/2 stories or 30 feet."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "In case of a building other than a single-family dwelling, no building\nshall be greater than three stories or 45 feet in height, except a\nchurch."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 185",
			"title": "Building area.",
			"content": [
				{
					"text": "The building area shall not exceed 30% of the lot area."
				}
			]
		},
		{
			"paragraph": "§ 186",
			"title": "Ground floor area.",
			"content": [
				{
					"text": "The ground floor of each dwelling, exclusive of one-story open\nporches and garages, shall be not less than 750 square feet in the\ncase of a one-story dwelling, nor less than 550 square feet in the\ncase of one-and-one-half-, two- or two-and-one-half-story dwellings."
				}
			]
		},
		{
			"paragraph": "§ 187",
			"title": "Front yards.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "The required front yard depth shall be the same as the average front\nyard depth of the existing buildings within 200 feet on each side\nof the lot and within the same block in the same use district, or\nif there are less than two existing buildings on the same side of\nthe street, the average front yard depth of existing buildings with\n200 feet on each side directly opposite the lot in the same use district.\nIn any case, no front yard shall be required to have a depth greater\nthan 40 feet."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "In case of a corner lot, a front yard shall be required on each street,\nand notwithstanding the foregoing, each such front yard shall be not\nless than 25 feet."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Where a building is not controlled by Subsection A above, there shall be a front yard, the depth of which shall be at least 25 feet back of the street line."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 188",
			"title": "Side yards.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "In case of a single-family dwelling, there shall be two side yards,\none on each side of the main building, the aggregate widths of which\nshall be at least 15 feet. Neither side yard shall be less than five\nfeet wide."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "In case of any building other than a single-family dwelling or a\nbuilding accessory thereto, there shall be two side yards. If such\nbuilding is not over 40 feet high, the width of each of the two side\nyards shall be at least 20 feet; and if such building is over 40 feet\nhigh, this width shall be increased five feet for each 12 feet or\nportion thereof by which the building exceeds 40 feet."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 189",
			"title": "Rear yards.",
			"content": [
				{
					"text": "There shall be a rear yard, the depth of which shall be at least\n25 feet. In case of a building over 40 feet high, the depth shall\nbe increased five feet for each 12 feet or portion thereof by which\nthe building exceeds 40 feet in height."
				}
			]
		},
		{
			"paragraph": "§ 190",
			"title": "Permitted encroachments.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "The following encroachments are hereby permitted:[Effective 1-27-1991; 6-8-2012]"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Cornices, eaves, gutters, chimneys or bay windows projecting not\nmore than 24 inches."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "One-story open porches and terraces not exceeding three feet in height,\nprojecting not more than six feet into a front or rear yard."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "One-story enclosed front vestibules not greater than six feet wide\nand five feet deep."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "One-story additions to the main dwelling projecting into one of the\nrequired side yards, provided that the area of encroachment shall\nbe used for garage purposes only, and provided further that neither\nside yard shall be less than five feet wide, and provided further\nthat the aggregate widths of the two side yards shall be at least\n12 feet."
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "One-story additions to the main dwelling encroaching into the required\nrear yard, provided that the area of encroachment is not in excess\nof 240 square feet, and provided further that the rear yard shall\nnot be diminished thereby to a depth of less than 15 feet."
												}
											]
										},
										{
											"number": "(6) ",
											"content": [
												{
													"text": "One-story additions to the exterior of the main dwelling containing\nonly an aboveground fuel-oil storage tank used for heating the premises\nupon which installation is made, projecting into one of the required\nside yards, provided that said side yard shall not be diminished thereby\nto a width of less than five feet."
												}
											]
										},
										{
											"number": "(7) ",
											"content": [
												{
													"text": "Air-conditioning condenser units, emergency generators, basement\nstairs and basement areaways, projecting into one of the required\nside yards, provided that said side yard shall not be diminished thereby\nto a width of less than five feet."
												}
											]
										},
										{
											"number": "(8) ",
											"content": [
												{
													"text": "Retractable awnings encroaching into any yard, provided that the\nyard shall not be diminished to a depth of less than two feet. Additionally\nsuch retractable awnings shall not be calculated into lot coverage."
												}
											]
										},
										{
											"number": "(9) ",
											"content": [
												{
													"text": "Exclusive of encroachments permitted under this section and structures\napproved by Board of Appeals grant, second-story additions above existing\npermitted one-story structures may project into any required yard,\nprovided that they do not extend beyond the wall of the existing structure."
												}
											]
										},
										{
											"number": "(10) ",
											"content": [
												{
													"text": "Sheds which have an inside capacity of less than 52 cubic feet\nand do not exceed 72 inches in height shall not require building permits.\nFurthermore, these types of sheds may project into one of the required\nside yards, provided that the said side yard shall not be diminished\nto a width of less than five feet."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "In any case where the Board of Appeals had diminished a required\nyard by a variance or special exception, none of the foregoing encroachments\nshall be permitted encroachments in such diminished yard."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 191",
			"title": "Fences.",
			"content": [
				{
					"text": "A fence, not exceeding six feet in height, shall be permitted on the rear lot line and those linear portions of the side lot lines enclosing a rear yard; provided, however, that the six-foot fencing and its relationship to the street fronting upon the premises shall not exceed a greater distance frontward to the street than the front building line of the dwelling; provided that any fencing frontward of the front building line shall be no greater than four feet in height, and of a type which does not substantially obstruct line of sight, and provided that there shall be compliance with § 311 of Article XXXI of this ordinance, with respect to clear sight triangles."
				}
			]
		},
		{
			"paragraph": "§ 192",
			"title": "Accessory buildings.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Accessory buildings may occupy 40% of the required area of the rear\nyard up to an average height of 12 feet. The yard area occupied by\nsuch accessory building shall, however, be included in computing the\nmaximum percentage of the lot area which may be built upon. No accessory\nbuilding shall be nearer to any front property line than 45 feet,\nand it must be at least two feet from the rear and side property lines,\nexcept that accessory garages may have a party wall. However, in the\ncase of an accessory private garage which may include a porch or an\nenclosed patio annexed thereto, it may be located not nearer to the\nfront property line than the main building which it tends and must\nnot be less than five feet from any side line; should such accessory\ngarage be located 45 feet or more from the property line, it cannot\nbe less than two feet from the side and rear property lines."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "In the case of a corner lot, an accessory building shall be neither more nor less than two feet from the rear and side property lines, except in the case of an accessory private garage, which may be located not nearer to the front property line than the main building which it tends and must be not less than five feet from any side line, but must, in any other event and in all other respects, conform to Subsection A of this section."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Exclusive of an accessory private garage and a cabana permitted as an accessory to a swimming pool pursuant to § 252A(6) of Article XXV, only one structure can be erected and thereafter maintained, and such structure shall be erected on the ground and in the rear yard only and shall not exceed 144 square feet of floor area, nine feet in height maximum and 12 feet horizontally maximum, unless authorized as a special exception by the Board of Appeals.[Effective 7-6-1992]"
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 193",
			"title": "Lot area; density.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "The legislative intent of this section is to permit the Town Board\nto enact higher standards for structures within the Levittown Planned\nResidence District (LPRD) than those prescribed by the provisions\nof this ordinance."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "No dwelling or other building shall be erected on any lot unless\nit contains an area of not less than 6,000 square feet and has a minimum\nwidth of 60 feet from and on the street line to the front setback\nline. The foregoing provision shall not apply to the construction\nof accessory uses, dwelling additions or building additions on a lot.\nIn the case of a corner lot, a front yard shall be required on each\nstreet.[Effective 1-29-1988]"
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "No dwelling or other building shall be erected on any lot having\na depth of less than 100 feet."
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "No more than one single-family dwelling shall be erected on any lot\non any map being part of the Levittown Area as defined in this article."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 194",
			"title": "Compliance required.",
			"content": [
				{
					"text": "If any plot on which a building has been erected shall be subdivided\ninto two or more plots in such a manner that the resulting plot on\nwhich such building remains shall not comply with § 193\nhereof, the right of the owner thereof to maintain such building on\nsuch plot shall immediately cease, and he shall remove the same on\nthe order of the Town Building Inspector."
				}
			]
		},
	]
}