{
	"url": "http://ecode360.com/14497264",
	"paras": [
		{
			"paragraph": "ยง 287",
			"title": "Legislative intent.",
			"content": [
				{
					"text": "The Town of Hempstead has undertaken a program of Urban Renewal\nat Inwood (NYR-63). The Inwood Urban Renewal Project is unique in\nthat it involves both redevelopment and the rehabilitation of a substantial\nnumber of homes owned for the most part by disadvantaged persons.\nIn the process of revitalizing the area covered by the Inwood Urban\nRenewal Project it became apparent that several new zoning districts\nwould have to be created which would tend to revitalize the neighborhood,\npromote property values and minimize dislocation of existing residents,\nto inhibit blight, all in cooperation with federal and state programs.\nWith this in view, this article is enacted with the intention of promoting\nthe health, safety, morals and general welfare of the Town of Hempstead."
				}
			]
		},
		{
			"paragraph": "ยง 288",
			"title": "Title; applicability.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "This article shall be known and cited as the \"Inwood Urban Renewal\nZoning Article of the Town of Hempstead.\""
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "This article shall apply to any existing dwelling and any existing\ndwelling unit and any new dwelling unit in an existing structure or\nin an existing structure to be enlarged or altered in the Inwood Urban\nRenewal Project Area NYR-63."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "ยง 289",
			"title": "Definitions.",
			"content": [
				{
					"text": "In addition to the definitions of this Building Zone Ordinance,\nthe following special definitions are applicable to this article.\nIn the event of conflict, the following definitions shall be controlling:"
				}
			]
		},
		{
			"paragraph": "ยง 291",
			"title": "URD-C Urban Renewal Residence C District (URD-C).",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "In an Urban Renewal Residence C District, buildings and structures\nmay be erected in accordance with the provisions of this section,\nand not otherwise."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "A building or structure may be erected, altered or used and a lot\nor premises may be used for any of the following purposes, and for\nno other:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Three-or-more-family multiple dwellings."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "In the case of three-or-more-family multiple dwellings, which include the office of a person practicing the profession of medicine, dentistry, law, architecture or engineering, together with the studio or occupational room of a chiropractor, a real estate or insurance broker or accountant, provided that such use is conducted in not more than 20% of the floor area of the apartment or suite of rooms in which the practitioner resides and is incidental to such residential use, and provided that there is no visible advertising, except such sign as is permitted in the Sign Article (Article XXIV) of this ordinance."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Encroachments, fences, accessory buildings and cellars. All buildings, uses and structures shall comply with the permitted encroachments, fences, accessory buildings and basement or cellar provisions of Article X hereof."
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "Height. No building shall be greater than 35 feet in height; three-\nand four-family dwellings shall not be greater than three stories;\nmore than four-family dwellings shall not be greater than 3 1/2\nstories."
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "Building area."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "The building area required for three- and four-family dwellings shall\nnot exceed 40% of the lot area."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "The building area required for more than four-family dwellings shall\nnot exceed 30% of the lot area."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "F. ",
							"content": [
								{
									"text": "Front yards."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "The required minimum front yard depth shall be the average of the\nfront yard depth of existing buildings within 200 feet on each side\nof the lot and within the same block, or if there are not at least\ntwo existing buildings within 200 feet on each side of the lot and\nwithin the same block, the required front yard shall be not less than\n20 feet. In any case, no front yard shall be required to have a depth\ngreater than 30 feet."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "In the case of a corner lot, a front yard shall be required on each street, and each such front yard depth shall be governed by Subsection F(1) of this section, but in no case shall it be less than 20 feet nor more than 30 feet."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "G. ",
							"content": [
								{
									"text": "Side yards."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "In the case of three- and four-family multiple dwellings, there shall\nbe two side yards, one on each side of the main building, the aggregate\nwidths of which shall be at least 15 feet. Neither side yard shall\nbe less than five feet wide."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "In the case of more-than-four-family multiple dwellings, there shall\nbe two side yards, one on each side of the main building, the aggregate\nwidths of which shall be at least 30 feet. Neither side yard shall\nbe less than 15 feet wide."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "H. ",
							"content": [
								{
									"text": "Front yards."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "The required minimum front yard depth shall be the average of the\nfront yard depth of existing buildings within 200 feet on each side\nof the lot and within the same block, or if there are not at least\ntwo buildings within 200 feet on each side of the lot and within the\nsame block, the required front yard shall be not less than 25 feet.\nIn any case, no front yard shall be required to have a depth greater\nthan 30 feet."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "In the case of a corner lot, a front yard shall be required on each street, and each such front yard depth shall be governed by Subsection H(1) of this section, but in no case shall it be less than 25 feet or more than 30 feet."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "I. ",
							"content": [
								{
									"text": "There shall be a rear yard, the depth of which shall be at least\n25 feet."
								}
							]
						},
						{
							"number": "J. ",
							"content": [
								{
									"text": "Lot area, width and depth."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "In the case of three- and four-family multiple dwellings, no dwelling\nor other building shall be constructed on a lot unless it contains\nan area of no less than 6,000 square feet and has a minimum lot width\nof 60 feet at the street line and at the front setback line and has\na minimum lot depth of 100 feet."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "In the case of more-than-four-family multiple dwellings, no dwelling\nor other building shall be constructed on a lot unless it contains\nan area of not less than 10,000 square feet and has a minimum lot\nwidth of 80 feet at the street line and at the front setback line\nand has a minimum lot depth of 100 feet."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "In the case of more-than-four-family multiple dwellings, the minimum\nlot area per dwelling unit shall be 1,600 square feet.[Effective 8-16-1970]"
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "K. ",
							"content": [
								{
									"text": "Floor area ratio."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "In the case of three- and four-family multiple dwellings, the maximum\nfloor area ratio shall be 0.8."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "In the case of more-than-four-family multiple dwellings, the maximum\nfloor ratio shall be 0.9."
												}
											]
										}
									]
								}
							]
						}
					]
				}
			]
		}
	]
}