{
	"url": "http://ecode360.com/11779406",
	"paras": [
		{
			"paragraph": "§ 225-43",
			"title": "Applicability.",
			"content": [
				{
					"text": "In the Residence T District, the following regulations\nshall apply."
				}
			]
		},
		{
			"paragraph": "§ 225-44",
			"title": "Permitted uses.",
			"content": [
				{
					"text": "In the Residence T District, no building shall\nbe erected, altered or used and no lot or premises shall be used except\nfor one or more of the following purposes:"
				},
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Single-family dwellings."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Churches."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Public free schools, libraries or public museums."
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "Multiple dwellings."
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "Clustered single-family housing."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 225-45",
			"title": "Permitted accessory uses.",
			"content": [
				{
					"text": "A building or land in the Residence T District\nmay be used for any accessory use. No accessory use shall be erected\nwithin five feet of any side or rear line or nearer than 50 feet to\nany street line."
				}
			]
		},
		{
			"paragraph": "§ 225-46",
			"title": "Prohibited use.",
			"content": [
				{
					"text": "Except as otherwise provided in §§ 225-50.1 and 225-50.2, a mixed-use occupancy of any building or parcel of real property, even where such uses are otherwise permitted pursuant to § 225-44 of this Article, is hereby prohibited."
				}
			]
		},
		{
			"paragraph": "§ 225-47",
			"title": "Minimum lot size.",
			"content": [
				{
					"text": "No building shall hereafter be erected or altered\non a lot less than 12,000 square feet."
				}
			]
		},
		{
			"paragraph": "§ 225-48",
			"title": "Height; coverage.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Except as otherwise provided in §§ 225-50.1 and 225-50.2, no building may exceed a maximum height of 40 feet."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Except as otherwise provided in §§ 225-50.1 and 225-50.2, the total coverage of all buildings on a lot shall not exceed 35% of the area of the lot."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 225-49",
			"title": "Yard space.",
			"content": [
				{
					"text": "Except as otherwise provided in § 225-50.1 or § 225-50.2:"
				},
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "The front and rear yards shall in aggregate be a minimum\nof 50 feet, provided that under no circumstances may the front yard\nbe less than 25 feet."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "There shall be two side yards which in aggregate shall\nbe a minimum of 40 feet, provided that each side yard may be no less\nthan 15 feet."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "No portion of a building may encroach on any yard\nexcept the following:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Driveways."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "A balcony without walls or railings of any kind which\nmay be located only in the rear of the first floor of a building,\nwhich balcony may project no more than 10 feet from the building."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Planting boxes."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "Air-conditioning units projecting not more than six\ninches into or over such yards."
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "Eaves, gutters or downspouts projecting not more than\n16 inches into such yards."
												}
											]
										},
										{
											"number": "(6) ",
											"content": [
												{
													"text": "Steps."
												}
											]
										},
										{
											"number": "(7) ",
											"content": [
												{
													"text": "Fences."
												}
											]
										},
										{
											"number": "(8) ",
											"content": [
												{
													"text": "Retaining walls."
												}
											]
										},
										{
											"number": "(9) ",
											"content": [
												{
													"text": "Balconies, provided that:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "They project not more than five feet from the\nbuilding wall to which they are attached; and"
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "There shall be 15 feet between the furthest\nprojection of any such balcony and the lot line or between the furthest\nprojection of such balcony and any wall of the same or any other building."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(10) ",
											"content": [
												{
													"text": "Bay windows, provided that:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "They project no more than five feet (into the\nminimum required area of a yard); and"
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "They are no greater than eight feet in width."
																}
															]
														}
													]
												}
											]
										}
									]
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 225-50",
			"title": "Size of buildings.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Except as provided in § 225-50.1 or § 225-50.2, the total gross floor area of all buildings on a lot shall not exceed 28,000 gross square feet per acre adjusted proportionately for all lots which are smaller or larger than one acre."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "No single-family dwelling, church, public free school,\nlibrary, public museum or individual dwelling unit in a multiple dwelling\nor clustered single-family housing shall have a gross floor area of\nless than 1,200 square feet."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "The total gross floor area of any building shall include\nall habitable and nonhabitable space, exclusive of any parking structures\nand space related thereto."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 225-50.1",
			"title": "Renovation or rehabilitation of existing buildings.",
			"content": [
				{
					"text": "The Board of Trustees, in its sole discretion, may authorize the renovation or rehabilitation on such terms and conditions as it deems appropriate within the exterior structure of a building or building complex which existed as of April 15, 1981, irrespective of whether the gross floor area of the building or building complex exceeds 28,000 gross square feet per acre, and irrespective of the existing height or coverage of the building or building complex, and irrespective of whether the building or building complex encroaches on front, side or rear yards, and irrespective of whether the building or building complex consists of the mixed uses authorized in § 225-50.2A(4), where the Board of Trustees finds that the preservation of the complex will protect and secure the character of the existing neighborhood. Such terms and conditions may relate to elements of architectural and functional enhancement including, but not limited to, balconies, stoops, roofs and other structures which protrude beyond the exterior structure of the building or building complex."
				}
			]
		},
		{
			"paragraph": "§ 225-50.2",
			"title": "Conditional permits.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "If the side or rear property line of a lot abuts either\nthe Business B District or a Residence D District or an existing multiple-dwelling\nland use that equals or exceeds a 1.50 floor/area ratio or a building\nwith a gross square feet per acre equal to or greater than 65,340,\nadjusted proportionately for all lots which are smaller or larger\nthan one acre, then the Board of Trustees, in its sole discretion,\nmay:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Authorize a total gross floor area of all buildings\non said lot up to but not exceeding 39,000 gross square feet per acre,\nadjusted proportionately for all lots which are smaller or larger\nthan one acre, provided that the total coverage of all buildings on\nthe lot shall, in no event, exceed 40% of the area of the lot."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Authorize a building height on said lot up to\nbut not exceeding 45 feet, provided that no building which abuts and\nis adjacent to a single-family dwelling off said lot or which fronts\non a public right-of-way shall exceed the height of 2 1/2 stories\nand provided further that no building which abuts and is adjacent\nto a single-family dwelling off said lot or which fronts on a public\nright-of-way shall exceed the height of 40 feet."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Decrease the applicable front, side and rear\nyard requirements, but in no case shall the front yard be less than\n20 feet and the side and rear yards less than five feet."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "Allow a mixed use on said lot of single-family\ndwellings, clustered single-family housing and multiple dwellings."
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "Allow fences on said lot up to six feet in height, notwithstanding any provision to the contrary in Article XII, § 225-99, of this chapter."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "The Board of Trustees shall not grant a permit under\nthis section unless it finds that the granting of such permit will\nbe in accordance with the Village's comprehensive zoning plan, will\nconform to the general character of the neighborhood in which the\nsubject property is located and will secure the public health, safety\nand welfare. If it determines to issue such a permit, the Board may\nalso impose such conditions and safeguards in connection therewith\nas it deems appropriate and necessary to effectuate these goals."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "The Board of Trustees, in considering an application\nfor a conditional permit under this section, shall classify said action\nas a Type I action for purposes of review under the State Environmental\nQuality Review Act[1] (SEQRA) and shall implement an SEQRA environmental review\nin accordance with applicable statutory procedures."
								},
								{
									"footnote": "[1]\nEditor's Note: See Art. 8 of the Environmental\nConservation Law.\n"
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "In connection with issuing any conditional permit\nunder this section, the Board of Trustees shall be required to make\na determination whether there will be a loss of open space and greenery\nwithin the Village by reason of the requested permit. If it makes\nsuch a determination, then the Board may impose as a condition of\nissuing the permit either that the applicant undertake necessary landscaping\nmeasures to compensate for said loss or that the applicant pay the\nVillage a sum sufficient to enable the Village to undertake compensatory\nmeasures within the Village to alleviate the loss of such space within\nthe Village, or both. Said sum shall not exceed an amount equal to\n$5 for each square foot of gross floor area authorized by said conditional\npermit above 28,000 square feet per acre, adjusted proportionately\nfor all lots which are larger or smaller than one acre."
								}
							]
						}
					]
				}
			]
		}
	]
}