{
	"url": "http://ecode360.com/11779453",
	"paras": [
		{
			"paragraph": "§ 225-51",
			"title": "Applicability.",
			"content": [
				{
					"text": "In the Residence E District, the following regulations\nshall apply."
				}
			]
		},
		{
			"paragraph": "§ 225-52",
			"title": "Permitted uses.",
			"content": [
				{
					"text": "No building shall be erected, altered or used\nand no lot or premises shall be used except for one or more of the\nfollowing purposes:"
				},
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Single-family dwelling."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Churches."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Public free schools, libraries or public museums."
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "Multiple dwellings."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 225-52.1",
			"title": "Temporary moratorium on certain permitted uses.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "For the period commencing on the effective date of\nLocal Law 13 of 1999 and ending on the effective date of Local Law\n8 of 2003, the Board of Trustees shall not consider, grant, approve,\nor issue a building permit, permit of compliance or conditional use\npermit which would authorize the use of any building, structure or\npremises in the Village's RE Zoning District as a multiple dwelling.[Amended 11-15-2000 by L.L. No. 10-2000; 12-18-2002 by L.L. No. 6-2002; 7-2-2003 by L.L. No. 4-2003; 12-17-2003 by L.L. No.\n8-2003]"
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Notwithstanding the above, nothing contained in this\nsection shall prevent the Board of Trustees from modifying a building\npermit, permit of compliance or conditional permit relating to the\nuse of a structure, building or premises in the Residence E District\nas a multiple dwelling if, prior to the effective date of this section,\nsuch structure, building or premises had in effect a valid building\npermit, permit of compliance or conditional permit authorizing its\nuse as a multiple dwelling, except that no such modification of an\nexisting permit shall result in a more intensive use of the building,\nstructure or premises."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Nothing contained in this section shall be deemed\nto prevent the reconstruction of a building, structure or premises\nin the Residence E District used as a multiple dwelling in the event\nof casualty or act of God, provided that, as of the effective date\nof this section, such building, structure or premise had been legally\nused for a multiple dwelling and further provided that any reconstruction\nshall be substantially similar in physical dimension, area coverage\nand location to the building, structure or premises which existed\nprior to said reconstruction."
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "For the period commencing on November 3, 1999, and\ncontinuing during the period of the moratorium established by this\nsection, the Village shall not accept, consider or approve any applications\nfor a building permit, conditional permit or permit of compliance\nfor a multiple dwelling in the Residence E District. This moratorium\nshall not apply to any application for a building permit, conditional\npermit or permit of compliance for a multiple dwelling in the Residence\nE District that was filed with the Village prior to November 3, 1999,\nprovided that there has been no substantial or material modification\nto such application after November 3, 1999."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 225-53",
			"title": "Permitted accessory uses.",
			"content": [
				{
					"text": "A building or land in the Residence E District\nmay be used for any accessory use. No accessory use shall be erected\nwithin five feet of any side or rear line or nearer than 50 feet from\nany street line."
				}
			]
		},
		{
			"paragraph": "§ 225-54",
			"title": "Prohibited uses.",
			"content": [
				{
					"text": "A mixed-use occupancy of any building or parcel of real property, even where such uses are permitted pursuant to § 225-52 of this article, is hereby prohibited."
				}
			]
		},
		{
			"paragraph": "§ 225-55",
			"title": "Height limitation.",
			"content": [
				{
					"text": "No building may exceed a maximum height of 40\nfeet. The following are not considered obstructions and may exceed\nthe height limitation:"
				},
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Chimneys or flues."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Elevator or stair bulkheads."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Roof water towers or cooling towers."
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "Flagpoles or aerials."
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "Parapet walls not more than four feet high."
								}
							]
						},
						{
							"number": "F. ",
							"content": [
								{
									"text": "Mechanical equipment, provided that it is screened\nor concealed by methods other than parapet walls."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 225-56",
			"title": "Size of buildings.",
			"content": [
				{
					"text": "As of the effective date of Local Law 8 of 2003, the total gross floor area of all buildings on a lot shall not exceed 54,450 gross square feet per acre, adjusted proportionately for lots which are smaller or larger than one acre. This standard shall not apply to any multiple dwelling with respect to which an application for a building permit, conditional permit or permit of compliance was filed, but not issued, prior to November 3, 1999, provided that there has been no substantial or material modification to such application after November 3, 1999; such multiple dwellings shall be governed by the permissible floor area ratio applicable immediately prior to November 3, 1999. Nonconforming buildings, uses and properties which were constructed pursuant to valid permits issued before November 3, 1999, shall be governed in accordance with Article XVII of this chapter. The total gross area of a building shall include all habitable and nonhabitable space, exclusive of any parking structure and space related thereto."
				}
			]
		},
		{
			"paragraph": "§ 225-57",
			"title": "Lot coverage.",
			"content": [
				{
					"text": "All buildings shall occupy no more than 50%\nof the area of the lot."
				}
			]
		},
		{
			"paragraph": "§ 225-58",
			"title": "Yard space.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "There shall be a minimum front yard of 25 feet."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "There shall be a rear yard which shall be a minimum\nof 20 feet."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "There shall be two side yards each of which shall\nbe a minimum of 15 feet wide, except that where appropriate due to\nthe nature of the plot and building and/or the character and design\nof surrounding uses and buildings, the Board of Trustees by resolution,\nand upon such terms and conditions as it deems suitable, may permit\none side yard to be less than 15 feet wide, provided that the total\nwidth of the two side yards is a minimum of 30 feet."
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "No portion of a building may encroach on any yard, except as provided in Subsection E below."
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "The following are permitted obstructions in yards:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Driveways."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "A balcony without walls or railings of any kind which\nmay be located only in the rear of the first floor of a building,\nwhich balcony may project no more than 10 feet from the building."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Planting boxes."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "Air-conditioning units projecting not more than six\ninches into or over such yards."
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "Eaves, gutters or downspouts projecting not more than\n16 inches into such yards."
												}
											]
										},
										{
											"number": "(6) ",
											"content": [
												{
													"text": "Steps."
												}
											]
										},
										{
											"number": "(7) ",
											"content": [
												{
													"text": "Fences."
												}
											]
										},
										{
											"number": "(8) ",
											"content": [
												{
													"text": "Retaining walls."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "F. ",
							"content": [
								{
									"text": "Balconies."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Balconies are a permitted obstruction, provided that:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "They are unenclosed except for a parapet or\nrailing not exceeding three feet eight inches in height; and"
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "They project not more than five feet from the\nbuilding wall to which they are attached."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "However, there shall be a minimum of 15 feet between\nthe furthest projection of any such balcony and the lot line or between\nthe furthest projection of such balcony and any wall of the same or\nany other building."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "G. ",
							"content": [
								{
									"text": "Bay windows are a permitted obstruction, provided\nthat they do not project more than five feet."
								}
							]
						},
						{
							"number": "H. ",
							"content": [
								{
									"text": "These yard regulations may be modified by the Board of Trustees pursuant to Article XVI, Preservation of Natural Features and Landscaping Requirements."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 225-59",
			"title": "Special yard provisions for corner and through lots.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Front yard. In the case of a corner lot or through\nlot, each yard extending along the full length of a street line shall\nbe considered a front yard."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Rear yard or rear yard equivalent:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "For a corner lot, the rear yard shall be provided\non the side of the lot opposite the side used for the building's main\nentrance."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "For through lots, in lieu of a rear yard, there shall\nbe either:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "An open area 40 feet wide at approximately the\ncenter of the lot, from one side lot line to the other; or"
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "Two side yards totaling 40 feet wide, but neither\nside yard shall be less than 15 feet."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "For any portion of the rear lot line of a through\nlot which coincides with a rear lot line of an adjoining lot, a twenty-foot\nrear yard shall be required."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "These yard regulations may be modified by the Board of Trustees pursuant to Article XVI, Preservation of Natural Features and Landscaping Requirements."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 225-60",
			"title": "Minimum distance between windows and walls, balconies or lot lines.",
			"content": [
				{
					"text": "Minimum distance shall not be less than 15 feet\nas measured between any apartment window and:"
				},
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Any wall."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Any lot line."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Any projecting balcony on an opposite wall at any\nangle of 90° or less from such window."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 225-60.1",
			"title": "Incentive provision for public parking.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "As of July 1, 2004, any person proposing to construct\na multiple dwelling within the RE District may submit to the Board\na plan to provide public parking on the same parcel of land containing\nsuch multiple dwelling."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "\"Public parking\" as used herein shall mean on-grade\nparking which is made available for use either by residents or merchants\nof the Village."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "A \"plan for public parking,\" as used herein, must:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Provide a minimum of 30 public parking spaces\non-site and on-grade."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Provide for the availability of the public parking\nspaces on a long-term basis, i.e., for at least 99 years, whether\nby transfer, gift, lease, easement or otherwise."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Provide for the continued availability of the\npublic parking spaces after any transfer of ownership of or control\nover the property to a successor, assignee or other entity."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "Require the applicant or its successor to pay\nall costs incurred in connection with the construction and maintenance\nof such public parking spaces, including planning expenses; construction\ncosts; the cost of equipment such as parking meter posts, lighting\nand security gates; the cost of routine and long-term maintenance;\nthe cost of necessary security measures; and the cost of liability\ninsurance."
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "Provide that such public parking shall be available\n(not necessarily on an exclusive basis) during specified hours for\nVillage residents and/or merchants under the terms and conditions\nto be approved by the Village and incorporated into a written agreement\nbetween the Village and the applicant, which shall be recorded and\nwhich shall run with the land."
												}
											]
										},
										{
											"number": "(6) ",
											"content": [
												{
													"text": "Provide an adequate and satisfactory mechanism\nfor enforcement of parking regulations governing the use of said public\nparking spaces, which shall be incorporated into the above-referenced\nwritten agreement between the Village and the applicant, which shall\nbe recorded and which shall run with the land."
												}
											]
										},
										{
											"number": "(7) ",
											"content": [
												{
													"text": "Provide that, in the event the applicant or\nits assignee successor becomes insolvent, files for bankruptcy or\ndefaults on any financing obligation, such event shall not adversely\naffect or impair the Village's right to continue the use of such public\nparking spaces as provided herein and, if the Village is required\nto make expenditures in such situation which should have been paid\nby the applicant or its assignee or successor, that the Village will,\nafter appropriate written notice and cure period given to applicant\nor its assignee, have a lien on the property for the amount of such\nexpenditures if such expenditures are not reimbursed to the Village."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "Subject to the above requirements, the determination\nof whether any plan for public parking is feasible, adequate and in\na form acceptable to the Village shall rest in the sole and unfettered\ndiscretion of the Board of Trustees."
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "If the Board, after public hearing, finds a proposed\nplan for public parking to be feasible and acceptable in terms of\nproviding additional public parking in the Village and finds that\nsaid plan shall not result in any substantial expense to the Village,\nthen, in order to encourage the provision of public parking according\nto such plan:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Notwithstanding any other section of the Village\nCode, any public parking provided in accordance with an approved plan\nshall be a permitted accessory use of the property."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Notwithstanding any other section of the Village Code, including § 225-52 of this chapter, any public parking provided in accordance with an approved plan will not constitute a prohibited mixed use of the property."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "The Board may waive the requirements of § 225-84I of this chapter with respect to underground parking, provided the applicant submits to the Village and receives approval from the Village of engineering designs for any proposed underground parking on the property which, based on the written opinion of licensed engineers expert in such area, will provide adequate protection for the underground parking, in terms of longevity; protection from structural deterioration; protection from leakage; and similar construction concerns."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "Notwithstanding any other provision of the Village Code, including § 225-56 of this chapter, the Board may authorize a floor area ratio (FAR) of up to 1.375 (i.e., 59,895 gross square feet per acre adjusted proportionately for lots which are smaller or larger than one acre) on any parcel of land where it approves a proposed plan for on-grade public parking under this section."
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "Notwithstanding any other section of the Village Code, including § 225-55 of this chapter, the Board may authorize an increased maximum height for a multiple dwelling on property which contains public parking pursuant to an approved plan, up to a maximum building height of 55 feet, in order to accommodate increased setbacks on the property in accordance with Subsection F below."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "F. ",
							"content": [
								{
									"text": "Notwithstanding any other section of the Village Code,\nin order to ameliorate the potential impact on surrounding residences\nfrom any on-grade public parking that may be approved under this section,\nby providing additional light and air on such property, the multiple\ndwelling to be constructed on such property shall comply with the\nfollowing setback requirements:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Each side yard shall be a minimum of 20 feet\n(as measured 10 feet above the curb grade) on each side of the building\nwhere the property is adjoined by a residential structure."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "The rear yard shall be a minimum of 30 feet\n(as measured 10 feet above the curb grade) where the rear of the property\nis adjoined by a residential structure."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "G. ",
							"content": [
								{
									"text": "Notwithstanding any other provision of this Village\nCode, the Board of Trustees may impose any additional terms and conditions\nwhich it finds reasonable, necessary and appropriate to effectively\nsecure for the Village the benefit of the public parking in accordance\nwith the approved plan."
								}
							]
						}
					]
				}
			]
		}
	]
}