{
	"url": "http://ecode360.com/6977013",
	"paras": [
	    {
        	"paragraph": "§ 197a",
        	"title": "City of Rye Table A: Residence Districts Area, Yard, Height and Miscellaneous Regulations.",
        	"content": [
        		{
        			"text": "R-2:"
        		},
        		{
        			"content": [
        				{
        					"number": "5. ",
        					"content": [
        						{
        							"text": "Maximum Ratio of Floor Area to Lot Area: 0.20"
        						}
        					]
        				},
        				{
        					"number": "6. ",
        					"content": [
        						{
        							"text": "Minimum Size of Lot (sq. ft.): 21,780"
        						}
        					]
        				},
        				{
        					"number": "7. ",
        					"content": [
        						{
        							"text": "Minimum Width (feet): 115"
        						}
        					]
        				},
        				{
        					"number": "8. ",
        					"content": [
        						{
        							"text": "Minimum Yard Dimensions (feet) Front: 35"
        						}
        					]
        				},
        				{
        					"number": "9. ",
        					"content": [
        						{
        							"text": "Minimum Yard Dimensions (feet) One Side: 15"
        						}
        					]
        				},
        				{
        					"number": "10. ",
        					"content": [
        						{
        							"text": "Minimum Yard Dimensions (feet) Total of Two Sides: 40"
        						}
        					]
        				},
        				{
        					"number": "11. ",
        					"content": [
        						{
        							"text": "Minimum Yard Dimensions (feet) Rear: 50"
        						}
        					]
        				},
        				{
        					"number": "13. ",
        					"content": [
        						{
        							"text": "Maximum Height (stories): 2.5"
        						}
        					]
        				},
        				{
        					"number": "14. ",
        					"content": [
        						{
        							"text": "Maximum Height (feet): 32"
        						}
        					]
        				},
        				{
        					"number": "15. ",
        					"content": [
        						{
        							"text": "One-Story Accessory Structures Maximum Coverage of Required Rear Yard: 20%"
        						}
        					]
        				},
        				{
        					"number": "16. ",
        					"content": [
        						{
        							"text": "One-Story Accessory Structures Minimum Distance to Side Line (feet): 15"
        						}
        					]
        				}
        			]
        		}
        	]
        },
		{
			"paragraph": "§ 197-32",
			"title": "District regulations other than use.",
			"content": [
				{
					"text": "The restrictions and regulations as to minimum lot size, minimum lot area per family or equivalent, minimum lot width, maximum floor area ratio, minimum residential floor area, maximum height, minimum dimensions of front, side and rear yards, minimum usable open space, building spacing and minimum dimensions of courts in the several districts shall be as set forth in the Table of Regulations incorporated as Article VIII of this chapter, except as hereinafter provided."
				}
			]
		},
		{
			"paragraph": "§ 197-33",
			"title": "Area and yard requirements applicable to only one building.",
			"content": [
				{
					"text": "No land area, yard or other open space provided\nabout any building for the purpose of complying with these regulations\nshall be included as any part of the land area, yard or open space\nrequired for any other building; no land area, yard or any other open\nspace on one lot shall be considered as land area, yard or open space\nfor a building on any other lot. Should a lot hereafter be formed\nfrom the part of a lot already occupied by a building, such separation\nshall be effected in such manner as not to impair conformity with\nany of these regulations with respect to the existing building and\nall land area, yards and other required spaces in connection therewith,\nand no permit shall be issued for the erection of a building on the\nnew lot thus created unless both lots comply with all the provisions\nof these regulations."
				}
			]
		},
		{
			"paragraph": "§ 197-34",
			"title": "Lot area requirements for combined uses.",
			"content": [
				{
					"text": "In computing the lot area requirements for any\nstructure in which residential accommodations are combined with one\nor more nonresidential permitted main uses, each 1,500 square feet\nof floor space devoted to such nonresidential uses shall be counted\nas equivalent to one family unit."
				}
			]
		},
		{
			"paragraph": "§ 197-35",
			"title": "Parts of lot not counted toward requirements.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "For any lot created by subdivision subsequent to the\neffective date of this section, no part of such lot less in width\nthan 1/2 of the requirement for the district in which it is located\nshall be counted as part of the required lot area."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "No portion of any watercourse or wetland (as defined by § 195-3 of the Rye City Code) shall be counted as part of the required lot area nor shall any such watercourse or wetland area be used in the ratio of floor area to lot area calculation."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 197-36",
			"title": "Lot width required.",
			"content": [
				{
					"text": "Within any residence district no part of any dwelling, house or other structure housing a main use, and within any business district no part of any residence structure, shall be erected on any part of the lot which has a width of less than the distances specified in the table incorporated as Article VIII, except as hereinafter provided."
				}
			]
		},
		{
			"paragraph": "§ 197-37",
			"title": "Exemption of certain nonconforming lots not located in areas of special flood hazard.",
			"content": [
				{
					"text": "The provisions of Article VIII shall not prevent the construction or alteration of a single-family dwelling, provided that the yard requirements are observed, on any lot in separate ownership which was duly recorded by plan or deed or was assessed as a separate parcel prior to the effective date of this section or on any lot in a subdivision approved by the Planning Commission within five years prior to said date. Except in such a subdivision, two or more contiguous lots in a single ownership on or after such date shall be replotted to create one or more lots which will conform to the above provisions. The Board of Appeals, however, if it finds that such a reparceling or replotting cannot reasonably be done without creating or retaining one or more lots that provide less than the required area or width, may permit the construction of a single-family dwelling on such lot or lots. The Board shall not permit any lesser dimensions than the following unless more than 1/2 of the frontage on the same street block between the two nearest intersecting streets is already built up at lower standards:"
				}
			]
		},
		{
			"paragraph": "§ 197-37.1",
			"title": "Exemption of certain nonconforming lots located in an area of special flood hazard.",
			"content": [
				{
					"text": "The provisions of Article VIII shall not prevent the construction or alteration of a single-family dwelling on any lot in separate ownership which was legally recorded by subdivision plat or deed and was assessed as a separate parcel prior to February 17, 1988, that conforms to the requirements for a lot not located in an area of special flood hazard. The Board of Appeals may permit the construction of a single-family dwelling on existing lots that provide less than the area and width required for lots located outside of an area of special flood hazard, provided that the Board shall not permit any lesser dimensions than the following unless more than 1/2 of the frontage on the same street block between the two nearest intersecting streets is already built up at lower standards:"
				}
			]
		},
		{
			"paragraph": "§ 197-37.2",
			"title": "(Reserved)\n                                                                                          [1]",
			"content": [
				{
					"footnote": "[1]\nEditor's Note: Former § 197-37.2,\nReduction of standards for development in areas of special flood hazard,\nadded 3-5-1980 by L.L. No. 3-1980 as amended, was repealed 6-15-1988\nby L.L. No. 10-1988.\n"
				}
			]
		},
		{
			"paragraph": "§ 197-38",
			"title": "Nonconforming lots containing watercources or wet-lands.",
			"content": [
				{
					"text": "The provisions of § 197-1, Definitions and usage, \"lodging house\" through \"lot width,\" and § 197-23 shall not prevent the construction, alteration or expansion of a permitted main or accessory use, provided the yard requirements are observed, on any lot in an undivided ownership prior to the effective date of this section or any lot in a subdivision approved by the Planning Commission within five years prior to said date which is nonconforming due to the exclusion of a wetland or watercourse area from allowed calculations as provided in the above-cited section, provided that the proposed filling of a wetland or watercourse or the development of such land created by such filling does not result in an increase in permitted development beyond that which would have been allowed before the dredging or filling. However, the exemptions of this section shall not apply to a lot or parcel conveyed to the present or past owner as an underwater land grant or to any illegally filled-in watercourse, and, further, in the case of a subdivision approved more than five years prior to the effective date of this section, two or more contiguous lots in a single ownership shall be replotted to create one or more lots which conform to the standards of this chapter. "
				}
			]
		},
		{
			"paragraph": "§ 197-39",
			"title": "Lots in new subdivisions.",
			"content": [
				{
					"text": "Simultaneously with the approval of a subdivision\nplat, the Planning Commission may either confirm the zoning regulations\nof the land so platted as shown on the Official Zoning Map or create\nlots, by lot averaging or lot grouping, with lesser area and dimensional\nrequirements than permitted in the Table of Regulations and require\nthe owner to submit a plat which reflects such change, which lots\nshall thenceforward be deemed conforming, subject to the following\nlimitations:"
				},
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": " Lot averaging. The creation of one or more lots of\nlesser area and width than are required in the Table of Regulations\nshall be permitted, provided that the following conditions are met:[Amended 6-18-1975 by Ord. No. 3-1975]"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "The area and width of no lot shall be reduced below the area and width specified for each district in § 197-37."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "The average area and the average width of all lots\nshall be equal to or greater than the minimum area and width required\nin the Table of Regulations."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Not more than 1/4 of the lots shall have areas and\nwidths smaller than the area and width specified in the Table of Regulations."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": " Lot grouping. The creation of lots of lesser area\nand dimensional requirements than specified in the Table of Regulations\nshall be permitted when the grouping of smaller lots will, in the\nopinion of the Planning Commission, improve the appearance of the\nsubdivision, contribute to the attractiveness of the neighborhood,\npreserve areas of open space, protect or enhance wetlands or reduce\nthe exposure of residences to flood hazards for recreational, scenic,\nsafety or ecological purposes, provided that the following conditions\nare met:[Added 6-18-1975 by Ord. No. 3-1975; amended 7-19-1978 by Ord. No. 2-1978; 3-7-1979 by Ord. No. 1-1979]"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "The property proposed to be subdivided is located\nin an R-1, R-2, R-3, R-4, R-5 or R-6 One-Family Zoning District and\nhas an area of three acres or more."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "The number of lots shall not exceed the number the\nPlanning Commission has determined would be approved if the property\nwere subdivided in the conventional manner, based on a review of a\nconventional layout supplied by the subdivider. The Commission, in\ndetermining the permitted number of lots, shall take into consideration\nprovisions of the Land Subdivision Regulations[1] concerning the reservation of land for park and playground\npurposes and shall require the reservation of such land or a cash\npayment in lieu thereof."
												},
												{
													"footnote": "[1]\nEditor's Note: See Ch. 170, Subdivision of Land.\n"
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "The lots shall meet all requirements for the zoning district, except that the area and dimensional requirements shall conform to the single-family requirements of the next-less-restrictive residence district and, in the case of subdivisions which will protect or enhance wetlands or reduce the exposure of residences to flood hazards, then to the requirements of the next two less-restrictive residence district, as specified in the Table A of the Table of Regulations, and, further, the Planning Commission may waive the requirements of § 197-51 when both of the affected lots will directly abut lands in the subdivision which will be preserved as open space.[Amended 5-2-1990 by L.L. No. 10-1990]"
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "The open space to be preserved is shown on the approved\nsubdivision plat with a notation that such land is to be covenanted\nas permanent open space in the ownership of the owners of the subdivided\nlots and is provided in such a manner that it is available for use\nby all residents of the subdivision."
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "The open space to be preserved has an area equal to\nor greater than 30% of the total area of the land to be subdivided\nand shall exclude all lands shown on the approved plat as building\nlots, public and private rights-of-way created as part of the subdivision,\nand land, if any, reserved for conventional park and playground purposes."
												}
											]
										},
										{
											"number": "(6) ",
											"content": [
												{
													"text": "The land to be preserved as open space is restricted by deed or covenant to scenic, recreational and ecological activities and to facilities designed for common use, which shall include buildings, structures and man-made surfaces as are approved by the Planning Commission, provided that such facilities constructed for common use do not have an aggregate gross floor area in excess of 1/2 of 1% of the area of such land or cover more than 10% of the area of such land and conform to the setback and related restrictions governing active recreational facilities located on lands to be reserved for park and playground purposes set forth in § 170-17A(3) of this Code. The Planning Commission may modify these requirements where, in its judgment, it deems such modifications desirable and appropriate because of characteristics of the specific site, such as topography, size, shape and location, and proximity to facilities such as streets, schools, public buildings and facilities, other recreational facilities and similar active use areas.[Amended 2-17-1988 by L.L. No. 3-1988]"
												}
											]
										},
										{
											"number": "(7) ",
											"content": [
												{
													"text": "An existing house intended to remain shall be provided with a lot meeting all of the requirements of the district, including the requirements of § 197-71, except that the lot for such building may be reduced in the manner provided for in Subsection B(3) above if the Planning Commission finds that the size and shape of the house will not significantly differ from the size and shape of the houses to be developed on other lots in the subdivision."
												}
											]
										}
									]
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 197-40",
			"title": "Approval of lot prior to sale or construction.",
			"content": [
				{
					"text": "No person shall develop any lot or plot created after August 1, 1961, or erect any permanent building thereon, without first obtaining approval of the Planning Commission of the proposed lot arrangement and the proposed methods of providing water and sanitary and storm sewerage facilities and physical access for each of the said lots or plots, except as provided for in § 170-5E, Exemptions for historic properties, of the Code of the City of Rye. No permit for construction on said lot or plot shall be approved by the Building Inspector for issuance by the Clerk until the aforesaid approval of the Planning Commission has been obtained."
				}
			]
		},
		{
			"paragraph": "§ 197-41",
			"title": "Ratio of gross floor area to lot area.",
			"content": [
				{
					"text": "For any building or group of related buildings on a lot, the aggregate gross floor area, including accessory buildings, shall not exceed the ratios specified in the Table of Regulations (Article VIII), except as provided in the following sections."
				}
			]
		},
		{
			"paragraph": "§ 197-42",
			"title": "Gross floor area authorized for later construction.",
			"content": [
				{
					"text": "For uses permitted subject to additional standards\nand requirements, the gross floor area authorized in the permit as\ngranted but not constructed initially shall be deemed to be authorized\nfor later construction within a period of 10 years from the date of\nthe issuance of the permit, regardless of reductions in lot area resulting\nfrom taking of parts of the lot for public use, provided such takings\ndo not reduce the aggregate lot area by more than 15% of the area\nincluded in the plot plan approved in connection with the permit."
				}
			]
		},
		{
			"paragraph": "§ 197-43",
			"title": "Exceptions to gross floor area ratio.",
			"content": [
				{
					"text": "For a single-family house to be built upon a nonconforming lot under the provisions of § 197-37, the ratio specified in the Table of Regulations may be increased to permit a gross floor area no greater than is permitted on a lot of the minimum size specified in said table for the district in which the lot is located, but in no event shall such increase exceed the specified ratio by more than 0.10."
				}
			]
		},
		{
			"paragraph": "§ 197-43.1",
			"title": "Floor area ratio for oversized properties.",
			"content": [
				{
					"text": "The floor area ratio for single-family residences located in one-family districts (i.e., R-1 through R-6) as set forth in Article VIII, Tables of Regulations, § 197-86, shall be reduced to 1/2 of that portion of a property exceeding 150%, but less than 250% of the minimum lot area for the district in which the property is situated. The floor area ratio as set forth in Article VIII, Tables of Regulations, § 197-86, shall be further reduced to 1/4 of that portion of a property exceeding 250% of the minimum lot area for the district in which the property is situated. For example, a property of 122,000 square feet (approximately 2.8 acres) in the R-1 District would be permitted to build a total of 13,559 square feet of floor area. The R-1 District has a minimum lot area of 43,560 square feet (one acre) and a maximum FAR of 0.15. To calculate the maximum permitted floor area, the first 150% of the minimum lot area of the R-1 District (43,560 x 1.5 = 65,340) would apply the FAR of 0.15, resulting in 9,801 square feet of floor area (65,340 x 0.15 = 9,801). The next 100% of minimum lot area of the R-1 District (or 43,560 square feet) would apply an FAR reduced to one-half (0.15 x 0.50 = 0.075), resulting in 3,267 square feet of floor area (43,560 x 0.075 = 3,267). The remaining 13,100 square feet of lot area (122,000 - 65,340 - 43,560 = 13,100) would apply an FAR reduced to one-quarter (0.15 x 0.25 = 0.0375), resulting in 491 square feet of floor area (13,100 x 0.0375 = 491). Total floor permitted floor area would be 13,559 square feet (9,801 + 3,267 + 491 = 13,559)."
				},
				{
					"footnote": "[1]\nEditor's Note: This local law also stated\nthat it would not apply if a building permit application or Zoning\nBoard of Appeals application had been received by the City prior to\n7-3-2003.\n"
				}
			]
		},
		{
			"paragraph": "§ 197-43.2",
			"title": "Calculation of floor area for single-family residences.",
			"content": [
				{
					"text": "The gross floor area for single-family residences\nlocated in one-family districts (i.e., R-1 through R-6) shall be the\nsum of the horizontal areas of all floors, roofed or covered areas\nof a residence measured from the exterior of the outside walls. Certain\nother space shall be counted in the computation of gross floor area\nfor single-family residences as follows:"
				},
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Voids. Any interior floor area, excluding stairways,\nwith a floor-to-ceiling height in excess of 14 feet shall be counted\ntwice. In the case of a sloped ceiling, only that portion of the interior\nfloor area shall be counted twice where a theoretical floor above\nsuch floor area could be provided and the headroom above such theoretical\nfloor (excluding headroom associated with a sloped ceiling) exceeds\nseven feet, six inches and the width between existing or theoretical\nfive-foot high knee walls exceeds seven feet."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Attics. Fifty percent of the attic floor area shall\nbe counted in the computation of gross floor area where the headroom\nheight measured from the finished or unfinished attic floor to the\nbottom of the roof rafters exceeds seven feet and the distance between\nexisting or theoretical five-foot-high knee walls exceeds seven feet.[Amended 12-18-2013 by L.L. No. 5-2013[2]]"
								},
								{
									"footnote": "[2]\nEditor’s Note: This local law also provided that it\nshall take effect eight months upon its adoption and filing with the\nSecretary of State.\n"
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Basements. Twenty-five percent of the basement floor area shall be included in the computation of gross floor area only where the preexisting grade (as defined in § 197-1) abutting the exterior of the basement wall has been reduced by more than three feet to create an exposed wall more than seven feet in height and five feet in width."
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "Porches. Unenclosed porches at or below the first-floor\nelevation shall not be included in the computation of gross floor\narea. For the purposes of this regulation, “unenclosed porches”\nshall mean any roofed area attached to a building where 80% of the\nouter limits of the area under the porch ceiling, to a point three\nfeet, six inches above the floor of the roofed area, is open to air\nand having no solid material. Walls, screens, glass, lattice or other\nsimilar materials, as well as structural or architectural elements,\nshall be considered a solid material. Any roofed structure associated\nwith the storage of vehicles such as a carport or porte cochere shall\nnot be considered an unenclosed porch and shall be included in the\ncomputation of gross floor area."
								}
							]
						}
					]
				},
				{
					"footnote": "[1]\nEditor's Note: This local law also stated\nthat it would not apply if a building permit application or Zoning\nBoard of Appeals application had been received by the City prior to\n7-3-2003.\n"
				}
			]
		},
		{
			"paragraph": "§ 197-44",
			"title": "Minimum residential floor area.",
			"content": [
				{
					"text": "For any dwelling unit in any district, the minimum\namount of residential floor area, calculated by subtracting from the\ngross floor area the sum of the floor areas of public halls, public\nstairs and elevators, unenclosed roofed areas, accessory buildings\nand nonresidential accessory floor space, shall be not less than the\nfollowing:"
				},
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "For a single-family house or for each dwelling unit\nof a two-family house, 1,000 square feet."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "For dwelling units in apartments or other buildings\ncontaining three or more dwelling units, except in an RA-5 District,\nan average of 750 square feet for all dwelling units in the same building\nor group of related buildings. In an RA-5 District the minimum size\nof all dwelling units shall be 400 square feet.[Amended 4-21-1982 by Ord. No. 2-1982; readopted 11-21-1984 by Ord. No. 1-1984]"
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "For dwelling units in B-2 Central Business Districts,\nan average of 500 square feet for all dwelling units in the same building\nor group of related buildings."
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "For a single-family residence used as a residential\ncare facility, 1,500 square feet.[Added 10-4-1978 by Ord. No. 3-1978]"
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "For dwelling units in apartments or other buildings containing three\nor more dwelling units in an RA-6 District, the minimum amount of\nresidential floor area in each unit shall be 750 square feet for one-bedroom\nunits, 900 square feet for two-bedroom units and 1,100 square feet\nfor three-bedroom units. Additionally, three-bedroom units must be\nequipped with at least 1 1/2 bathrooms.[Added 12-2-2015 by L.L.\nNo. 1-2016]"
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 197-45",
			"title": "Height restrictions.",
			"content": [
				{
					"text": "The restrictions as to height of buildings and structures in the several districts shall be as set forth in the Table of Regulations incorporated as Article VIII of this chapter."
				}
			]
		},
		{
			"paragraph": "§ 197-46",
			"title": "Exceptions to height limits.",
			"content": [
				{
					"text": "The provisions of § 197-45 shall not apply to church spires, belfries, cupolas, domes, monuments, observation towers, windmills, chimneys, smokestacks, silos, derricks, flagpoles, utility poles, masts, aerials other than satellite earth station dish antennas, the requirements for which are set forth in § 197-9A(4), and roof-mounted wireless telecommunications facilities, the requirements for which are set forth in Chapter 196, Wireless Telecommunications Facilities, bulkheads, elevator headhouses, water tanks, parapet walls, scenery lofts, air-conditioning and ventilating equipment and other necessary mechanical appurtenances usually carried above the roof level. Such features shall be erected only to such height as is necessary to accomplish the purpose they are intended to serve, shall not exceed in cross-sectional area 10% of the lot area nor 15% of the roof area and shall not be used for human occupancy. In addition, such features as water tanks, scenery lofts, air-conditioning and ventilating equipment and other necessary mechanical appurtenances usually carried above the roof level shall be enclosed by walls so as to obscure pedestrian view of these features from sidewalks on abutting streets. The requirement for walls to obscure the view of water tanks, scenery lofts, air-conditioning and ventilating equipment and other necessary mechanical appurtenances usually carried above the roof level shall not apply to buildings for which a building permit was approved prior to May 19, 1989, or to existing buildings proposed to be modified or enlarged when such required walls would interfere with the proper functioning of existing water tanks, scenery lofts, air-conditioning and ventilating equipment and other necessary mechanical appurtenances usually carried above the roof level."
				}
			]
		},
		{
			"paragraph": "§ 197-46.1",
			"title": "First-floor elevations for single-family residences.",
			"content": [
				{
					"text": "The first-floor elevation (excluding basements) for single-family residences located in one-family districts (i.e., R-1 through R-6) shall not be more than three feet above the average preexisting grade (as defined in § 197-1) abutting the front building line of the residence. This provision shall not apply in the following cases:"
				},
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Area of special flood hazard. Where a residence is situated in an area of special flood hazard, the first-floor elevation shall be no less than the minimum floor elevation required to comply with Chapter 100, Floodplain Management, of the Rye City Code."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Modifications to existing residences. The requirement that the first-floor elevation shall not be more than three feet above the average preexisting grade (as defined in § 197-1) shall not apply where an expansion is proposed to an existing residence that increases the floor area of the first floor by less than 50%."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Corner lots. In the case of a property having frontage\non more than one street, the applicant shall have the option of choosing\nonly one front yard in meeting the requirements of this section."
								}
							]
						}
					]
				},
				{
					"footnote": "[1]\nEditor's Note: This local law also stated\nthat it would not apply if a building permit application or Zoning\nBoard of Appeals application had been received by the City prior to\n7-3-2003.\n"
				}
			]
		},
		{
			"paragraph": "§ 197-47",
			"title": "Front yard restrictions.",
			"content": [
				{
					"text": "The restrictions in the various districts as to front yard lines shall be as set forth in the Table of Regulations, incorporated as Article VIII of this chapter. No building or structure shall be erected within the required front yard except as permitted in Chapter 90, Fences and Walls."
				}
			]
		},
		{
			"paragraph": "§ 197-48",
			"title": "Exception for existing building alignment.",
			"content": [
				{
					"text": "If the alignment of existing buildings within\n100 feet on each side of the lot in question and within the same district\nand block between the nearest two intersecting streets is nearer the\nstreet than the setback line above prescribed, any building or structure\nmay extend as near the street lot line as the average formed by the\nprescribed setback and such existing alignment. This provision shall\nnot apply to apartments in all RA Districts."
				}
			]
		},
		{
			"paragraph": "§ 197-49",
			"title": "(Reserved)",
			"content": []
		},
		{
			"paragraph": "§ 197-50",
			"title": "(Reserved)\n                                                                                          [1]",
			"content": [
				{
					"footnote": "[1]\nEditor's Note: Former § 197-49, Traffic visibility across corners, and § 197-50, Fences and terraces, as amended, were repealed 12-1-1999 by L.L. No. 9-1999. See now Ch. 90, Fences and Walls.\n"
				}
			]
		},
		{
			"paragraph": "§ 197-51",
			"title": "Front yard for rear lot.",
			"content": [
				{
					"text": "Where a residence is to be located on a lot\nin such a position that that portion of the lot including required\nside and rear yards is to the rear of some other lot on which a residence\nis or may be located, the minimum distance of the residence on the\nrear lot from the nearest point of the other lot shall be 50 feet\ngreater than the depth of the required front yard specified in the\nTable of Regulations.[1]"
				},
				{
					"footnote": "[1]\nEditor's Note: See § 197-86, Tables of regulations.\n"
				}
			]
		},
		{
			"paragraph": "§ 197-52",
			"title": "Front yards for corner lots.",
			"content": [
				{
					"text": "The owner of a corner lot shall, for the purposes\nof this chapter, have the privilege of calling either street lot line\nthe front, without reference to the building arrangement, except that\nany part of such a parcel more than 100 feet from the front street\nlot line shall be considered as fronting on the side street for purposes\nof determining its required front, side and rear yards. On any corner\nlot in a residential subdivision approved by the Planning Commission\nafter the effective date of this section, the building shall observe\nthe required front yard setback on each of its street frontages."
				}
			]
		},
		{
			"paragraph": "§ 197-53",
			"title": "Side yard restrictions.",
			"content": [
				{
					"text": "In any residence district a side yard extending through from the front yard line to the rear is required along each side lot line of each lot, except as hereinafter prescribed, within which no building or structure shall be erected except as hereinafter permitted. The restrictions as to side yards in the various districts shall be as set forth in the Table of Regulations, incorporated as Article VIII of this chapter."
				}
			]
		},
		{
			"paragraph": "§ 197-54",
			"title": "Apartment house side yards.",
			"content": [
				{
					"text": "In RA-1, RA-2, RA-3, RA-4 and RA-5 Districts\nwhere all the habitable rooms of any dwelling unit face only upon\none side yard, the minimum width of the side yard opposite such rooms\nshall be 30 feet in an RA-5 District and the same as the required\nrear yard depth in all other districts; and where some of the habitable\nrooms of any dwelling unit face upon one side yard and the other such\nrooms of the same dwelling units face only upon the other side yard,\nthe minimum width of one side yard shall be the same as the required\nfront yard depth opposite such rooms and of the other side yard 30\nfeet in an RA-5 District and the same as the required rear yard depth\nin all other districts."
				}
			]
		},
		{
			"paragraph": "§ 197-55",
			"title": "Side yards in business districts.",
			"content": [
				{
					"text": "In business districts, except as required by § 197-69, no side yards are required except as specified in the schedule of side yard requirements, but if a side yard is provided or is substituted for a required court, its width shall be at least six feet, and for the purposes of determining its width, the lowest story it is required to serve shall be considered the ground story."
				}
			]
		},
		{
			"paragraph": "§ 197-56",
			"title": "Reduction of side yard widths.",
			"content": [
				{
					"text": "For each foot by which a lot, at the time of\nenactment of this chapter, is narrower than the required width in\nthe district in which it is located, one inch shall be deducted from\nthe required width of any side yard and two inches from the required\nsum of both side yards, provided that no side yard shall be narrower\nthan eight feet in any R, RS, RT or RA-1 District or six feet in any\nother district. This provision shall not apply to apartments in RA-1\nDistricts."
				}
			]
		},
		{
			"paragraph": "§ 197-57",
			"title": "Side walls not parallel to lot line.",
			"content": [
				{
					"text": "Where a side wall of a building is not parallel\nto the side lot line, the required width of any side yard may be taken\nas the average width, provided that said side yard shall not be narrower\nat any point than 3/4 of the required side yard width."
				}
			]
		},
		{
			"paragraph": "§ 197-58",
			"title": "Location of accessory buildings.",
			"content": [
				{
					"text": "In any residence district no part of any accessory building, garage or stable situated within 75 feet, or a distance equal to 75% of the lot depth if that be less, of the street line shall extend within any required side yard. Elsewhere on the lot it may extend to within the distance of the side lot line set forth in the Table of Regulations, incorporated as Article VIII of this chapter."
				}
			]
		},
		{
			"paragraph": "§ 197-59",
			"title": "Mutual garages across lot lines.",
			"content": [
				{
					"text": "In any residence district a detached garage\nmay be built across a common lot line by written agreement between\nadjoining property owners, recorded in the office of the County Clerk."
				}
			]
		},
		{
			"paragraph": "§ 197-60",
			"title": "(Reserved)\n                                                                                          [1]",
			"content": [
				{
					"footnote": "[1]\nEditor's Note: Former § 197-60, Fences and walls not in front yards, as amended, as repealed 12-1-1999 by  L.L. No. 9-1999. See now Ch. 90, Fences and Walls.\n"
				}
			]
		},
		{
			"paragraph": "§ 197-61",
			"title": "Projections into side yards.",
			"content": [
				{
					"text": "Bays, balconies, chimneys, flues and fire escapes\nmay project into a required side yard not more than 1/3 of the width\nof the latter, nor more than 3 1/2 feet in any case. Open iron fire\nescapes and ground story bays or porches, not over half the length\nof the side wall, may project into any side yard 3 1/2 feet. Belt\ncourses, leaders, sills, pilasters, lintels and ornamental features\nmay project not more than one foot and cornices and gutters not more\nthan two feet over a required sideyard. In any case no such projection\nshall come within three feet of any side lot line. "
				}
			]
		},
		{
			"paragraph": "§ 197-62",
			"title": "Side yards for certain corner lots.",
			"content": [
				{
					"text": "Where the rear lot line of a corner lot is also\nthe side line of a lot fronting on the side street, no main or accessory\nbuilding shall be erected on the rear third of the corner lot nearer\nto the side street than the required front setback on the side street,\nexcept that for any such corner lot created after the effective date\nof this chapter, the side yard along the entire side street frontage\nof the corner lot shall not be less than the required front yard on\nthe side street."
				}
			]
		},
		{
			"paragraph": "§ 197-63",
			"title": "Rear yard restrictions.",
			"content": [
				{
					"text": "In every district there shall be a rear yard on every lot, except as hereinafter specified, within which no building or structure shall be erected except as hereinafter provided. The restrictions as to rear yards in the various districts shall be as set forth in the Table of Regulations, incorporated as Article VIII of this chapter."
				}
			]
		},
		{
			"paragraph": "§ 197-64",
			"title": "Rear yards in business districts.",
			"content": [
				{
					"text": "Except as required by § 197-69, there shall be a rear yard having a depth at least equal to the height of each building in a business district, provided that this section shall not be interpreted as requiring that any part of a business property within 60 feet of a street be devoted to rear yard. Where a rear or side yard for other than one- and two-family residences, hotels and lodging houses in an RA-1, RA-2, RA-3, RA-4 or Business District would adjoin the right-of-way of a railroad, a parkway or a limited access highway, the rear or side yard requirement may be waived by the Board of Appeals in accordance with § 197-82. In the case of a development plan for apartments and nonresidential structures requiring the approval of the Planning Commission, and in the case of uses permitted subject to additional standards and requirements, the rear or side yard requirement may be waived by the Building Inspector on recommendation of the Planning Commission. Accessory structures in the rear yard area shall be permitted to be extended to the side lines and rear line of said rear yard."
				}
			]
		},
		{
			"paragraph": "§ 197-65",
			"title": "Accessory buildings in rear yards.",
			"content": [
				{
					"text": "Accessory buildings may occupy portions of the required rear yards as indicated in the table in Article VIII, except that no garage or other accessory building may be located within three feet of a rear lot line in all residence districts, provided that any building accessory to apartments in RA-1 Districts may not be located within 10 feet of a rear lot line. "
				}
			]
		},
		{
			"paragraph": "§ 197-66",
			"title": "Reduction of rear yards.",
			"content": [
				{
					"text": "For each foot by which a lot at the time of\nenactment of this chapter is less than 100 feet deep, four inches\nmay be deducted from the required depth of the rear yard, provided\nthat no rear yard shall be less than 10 feet in depth any case. In\nany district no lot shall be so reduced in area after the enactment\nof this chapter as to make the required rear yard less in depth than\nis prescribed herein for a lot 100 feet in depth."
				}
			]
		},
		{
			"paragraph": "§ 197-67",
			"title": "Projections into rear yards.",
			"content": [
				{
					"text": "Chimneys and flues, elevator shafts and connecting\nhallways, fire escapes, fire balconies and fireproof outside stairways,\nbays and balconies, cornices and belt courses may project not over\n3 1/2 feet into a required rear yard. No permitted projection into\na required rear yard, except cornices and belt courses, shall extend\nwithin 15 feet of a rear lot line or within eight feet of an accessory\nbuilding."
				}
			]
		},
		{
			"paragraph": "§ 197-68",
			"title": "Open space provision.",
			"content": [
				{
					"text": "Included in every lot used in whole or in part\nfor residences for three or more families, there shall be a total\narea allotted, designed appropriately, developed and maintained for\noutdoor recreational use equal to at least 400 square feet per family,\nexcept that this may be reduced to 200 square feet per family in an\nRA-2, RA-3 or RA-4 District and to 40 square feet per family and an\nRA-5 District. Development of said outdoor recreational space shall\nbe subject to the following restrictions:"
				},
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Such space shall be of such grade and dimensions as\nto be in fact usable for recreation, with at least 75% of the area\nhaving a grade of less than 5% and with no dimension less than 20\nfeet, and shall be located conveniently to building entrances and\nnot less than 10 feet away from any residence structure and any lot\nline."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Outdoor tennis courts, paddle courts, racquet courts\nand other similar courts, swimming pools and other active recreational\nactivities shall be subject to the following restrictions:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "They shall be set back from all property lines of\nabutting properties not included in the site development plan a distance\nat least equal to the number of proposed residences times 10 feet\nbut not to exceed 300 feet and not less than 20 feet from any proposed\nresidence in the development."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "They shall be screened, including accessory equipment,\nfrom the view of the street and abutting residentially owned properties.\nSuch screening shall, at a minimum, consist of a ten-foot-wide landscape\nstrip planted and maintained with at least a double row of alternately\nspaced evergreens, with an actual height of at least six feet above\nthe natural grade when installed."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Fence heights shall not be in excess of six feet above\nthe average natural grade, except that fences not exceeding a height\nof 10 feet above the average natural grade, which are open mesh and\nare set back and screened, as required for tennis and other similar\ncourts, are permitted and may be equipped with the customary attached\nwindbreaks."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "Tennis and other similar courts shall have no lighting."
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "Swimming pools shall have no floodlighting, directly\nor indirectly, and all other lighting shall be arranged and shaded\nso as to reflect light away from adjoining premises or a public street."
												}
											]
										},
										{
											"number": "(6) ",
											"content": [
												{
													"text": "Swimming pools shall be completely surrounded by fences,\nfreestanding walls and/or the walls of a building containing no doors,\nat least four feet high above grade at all points, and each gate or\ndoor opening through the fence or freestanding wall shall be equipped\nwith a self-closing and self-latching device for keeping the gate\nor door securely closed at all times and shall be locked when the\npool is not in actual use."
												}
											]
										},
										{
											"number": "(7) ",
											"content": [
												{
													"text": "Swimming pools shall be located at least 25 feet away\nfrom any septic tank and its fields."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "The Planning Commission may modify these requirements\nwhere, in its judgment, it deems such modifications desirable and\nappropriate because of characteristics of the specific site, such\nas topography, size, shape and location, and proximity to facilities\nsuch as streets, schools, public buildings and facilities, other recreational\nfacilities and similar active use areas."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 197-69",
			"title": "Transitional yard requirements.",
			"content": [
				{
					"text": "In any business district, a side yard or rear\nyard abutting a residence district shall conform to the requirements\nin that residence district as to minimum width or depth and as to\nmaximum percentage of rear yard occupied by accessory buildings, and\na strip at least 10 feet wide along such side or rear lot line shall\nbe planted and maintained with appropriate landscaping. In any business\ndistrict facing a residence district across a street, there shall\nbe a front yard which shall be planted and maintained with appropriate\nlandscaping, shall contain no parking, storage or other business use\nand shall be crossed only by sidewalks and access drives. The front\nyard shall be at least 10 feet in depth in B-1, B-2 and B-6 Districts,\nat least five feet in B-7 Districts and as specified elsewhere in\nthis chapter for B-3, B-4 and B-5 Districts. Required landscaping\nshall include evergreens sufficient to screen from view from the street\nor from abutting property any accessory parking area and any business\noperations, other than operations such as servicing of cars at filling\nstations, not hidden by buildings or other walls or fences. In the\ncase of a required site development plan or a use permitted subject\nto additional standards and requirements, a fence or wall suitable\nin appearance to the surrounding area may be substituted for or required\nin addition to the landscaping on recommendation of the Planning Commission."
				}
			]
		},
		{
			"paragraph": "§ 197-70",
			"title": "Building spacing.",
			"content": [
				{
					"text": "Two or more buildings for more than two families\non the same lot shall be located so that the primary entrance to the\nbuilding, whether a main entrance serving several dwelling units in\nthe building or a separate entrance to an individual dwelling unit\nin the building, is located on a side of the building which is parallel\nto the street upon which the property has frontage. Each building,\nwhether principal or accessory, shall be at least 25 feet distant\nfrom any other building in the group, which distance shall be measured\nin a straight line between the points of the buildings which are nearest\neach other. In the case of principal buildings, no principal building\nshall be located on the site such that another principal building\non the site will be located between it and the street upon which the\nproperty has frontage, unless they are separated by a distance of\nnot less than 75 feet, which distance shall be measured in a straight\nline between the points of the buildings which are nearest each other.\nThe Planning Commission may modify the strict application of the requirements\nof this section in a specific case where it is demonstrated to the\nPlanning Commission that said modification will accomplish the following:"
				},
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Be more compatible with the character of the neighborhood,\nincluding the predominant streetscape in the area."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Provide for a safe site with sufficient separation\nbetween buildings to ensure adequate air and light for the dwelling\nunits."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Reduce the potential impacts of surface water runoff."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 197-71",
			"title": "Setbacks for existing houses in new subdivisions.",
			"content": [
				{
					"text": "In order to provide a suitable lot for any existing\nhouse in a new subdivision, each proposed lot line shall be located\naway from the building a distance equal to the normal minimum yard\ndimension or a distance equal to half the sum of the length and height\nof the building facade parallel or substantially parallel to that\nproposed lot line, whichever is greater."
				}
			]
		},
		{
			"paragraph": "§ 197-72",
			"title": "When courts required.",
			"content": [
				{
					"text": "In any district, wherever any rooms in which\npersons live, sleep or work, except stores or storage rooms, cannot\nbe reasonably and adequately lighted and ventilated from a street\nor from a side yard or rear yard as required in this chapter, a court\nconforming to the provisions of the following sections shall be provided\non which such rooms shall open. Such court need not extend below the\nlowest story it is required to serve."
				}
			]
		},
		{
			"paragraph": "§ 197-73",
			"title": "Court restrictions.",
			"content": [
				{
					"text": "The restrictions as to courts in the various\ndistricts and at various heights shall be as follows:"
				}
			]
		},
		{
			"paragraph": "§ 197-74",
			"title": "Area of inner courts.",
			"content": [
				{
					"text": "No inner court shall be shorter than twice its\nwidth, except that such court may be shorter and wider, provided that\nits area is at least the same as that of the required inner court."
				}
			]
		},
		{
			"paragraph": "§ 197-75",
			"title": "Courts between apartment wings.",
			"content": [
				{
					"text": "When a court is enclosed by apartment wings\neither of which contains all the rooms of one or more dwelling units,\nits width shall be not less than 18 inches for each foot of court\nheight, and its length shall not exceed its width unless the width\nis greater than 40 feet, and shall not exceed 1 1/2 times its width\nunless the width is greater than 60 feet."
				}
			]
		},
		{
			"paragraph": "§ 197-76",
			"title": "Projections into courts.",
			"content": [
				{
					"text": "Required courts shall be open to the sky, unobstructed,\nexcept that cornices, gutters, belt courses, sills, pilasters and\nornamental features may project not more than six inches into such\ncourts."
				}
			]
		},
		{
			"paragraph": "§ 197-77",
			"title": "Fences and walls within courts.",
			"content": [
				{
					"text": "No fence or wall above a height of six feet,\nexcept retaining wall, shall be permitted within the limits of any\nrequired outer court."
				}
			]
		},
		{
			"paragraph": "§ 197-78",
			"title": "Accessory buildings excluded from courts.",
			"content": [
				{
					"text": "No accessory building shall be located within\nany required court."
				}
			]
		}
	]
}