{
	"url": "http://ecode360.com/6957819",
	"paras": [
		{
			"paragraph": "§ 288-7",
			"title": "Uses.",
			"content": [
				{
					"text": "In Residential A Districts, no building or premises\nshall be used and no building shall be erected or altered for other\nthan one or more of the following uses:"
				},
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Permitted uses."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Single-family detached houses which shall have a roof\nother than one of the character or description known as a \"flat roof.\""
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Places of worship."
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "Off-street parking must be provided at the ratio\nof one space for each 100 feet of usable floor space."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Public schools."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "Public libraries, museums or historical buildings."
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "Public parks and municipal playgrounds."
												}
											]
										},
										{
											"number": "(6) ",
											"content": [
												{
													"text": "Philanthropic and eleemosynary institutions other\nthan correctional."
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "Off-street parking must be provided at the ratio\nof one space for each 100 square feet of usable floor space."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "No conventions shall be held in any such buildings,\nnor shall any portion of the same be occupied for the sale at either\nretail or wholesale of any articles of personal property."
																}
															]
														}
													]
												}
											]
										},
										{
											"number": "(7) ",
											"content": [
												{
													"text": "Buildings, structures and premises necessary for the\nuse and occupancy by the Village for administrative purposes, water\nsupply, sewage pumping stations, fire and police stations and for\npublic or municipal parks, municipal playgrounds and municipal parking\nplaces and municipal airports."
												}
											]
										},
										{
											"number": "(8) ",
											"content": [
												{
													"text": "The office of a physician, lawyer, architect, teacher\nor similar professional person residing on the premises, and when\nsuch use is incidental to such residence; provided, however, that\nsuch use shall be within the main building and occupying not more\nthan 1/3 of the first floor area."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Permitted accessory uses located on the same lot with\nthe permitted principal use."
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Private garages as provided in Article VII."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Accessory use, exclusive of a private garage, shall\nnot include the erection or maintenance hereafter of any structure\nother than one erected on the ground and not exceeding 80 square feet\nof floor area and 7 1/2 feet in height maximum, unless authorized\nas a variance by the Zoning Board of Appeals."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Fences, hedges, walls or other property demarcations\nas provided in Chapter 143, Fences and Hedges."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "No sign, billboard, signboard or other advertisement\nshall be allowed in a Residential A District except as hereinafter\nset forth:"
												},
												{
													"content": [
														{
															"number": "(a) ",
															"content": [
																{
																	"text": "A real estate sign for the selling or rental\nof the property upon which it appears, provided that such real estate\nsign is not nearer to the street line than the building setback line\nand shall not be larger than six square feet in area."
																}
															]
														},
														{
															"number": "(b) ",
															"content": [
																{
																	"text": "Professional signs: one sign not exceeding two\nsquare feet in area bearing only the name and profession of the resident\npractitioner. Such sign may be illuminated by an electric lamp not\nexceeding 15 watts of power contained within the sign."
																}
															]
														}
													]
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Temporary election signs as described in § 244-27B(5).[Added 4-10-1995 by L.L. No. 2-1995]"
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 288-8",
			"title": "Building height.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Principal building. No principal building shall exceed\n2 1/2 stories or 35 feet in height."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Accessory building, structure or use.  No accessory\nbuilding or structure shall exceed 1 1/2 stories or 15 feet in height. "
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 288-9",
			"title": "Area of lot occupied by building.",
			"content": [
				{
					"text": "No building or part thereof, erected or altered\nin Residential A Districts shall occupy, either alone or with other\nbuildings, a greater percentage of the area of the lot than as follows:"
				},
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "In case of a corner lot, not more than 50%."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "In case of an interior lot which exceeds 90 feet in\ndepth and does not exceed 105 feet in depth, not more than 55%."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "In case of an interior lot which exceeds 105 feet\nin depth, not more than 50%."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 288-10",
			"title": "Lot area.",
			"content": [
				{
					"text": "No dwelling house shall be built on property\nthat has less than 50 feet frontage, and each house must have a separate\nlot area of at least 5,000 square feet, and no residence shall be\nerected in the rear of another residence on the same lot."
				}
			]
		},
		{
			"paragraph": "§ 288-11",
			"title": "Side yards.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "On an interior lot, two side yards are required, one\non each side of the building, one of which must not be less than five\nfeet wide and the other of which must not be less than 10 feet wide."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "On a corner lot, one side yard is required, and such\nside yard shall be on the side adjoining the interior lot opposite\nthe front yard having the greater street frontage. Said side yard\nshall have a minimum width of five feet."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 288-12",
			"title": "Rear yards.",
			"content": [
				{
					"text": "A rear yard is required on every lot, the depth\nof a rear yard shall be at least 25 feet."
				}
			]
		},
		{
			"paragraph": "§ 288-13",
			"title": "Front yards.",
			"content": [
				{
					"text": "No building or part thereof shall be erected\nor altered that is nearer the street line upon which it fronts than\nthe average setback of the buildings on the same side of the street\nwithin the same block, but no street wall of a building need set back\nmore than 30 feet: when all lots within the block are vacant, no street\nwall of a building shall set nearer than 25 feet to the street line.\nA building erected on a corner plot shall comply with the minimum\nsetback from the abutting street on at least one side as indicated\non the Setback Map. The setback distance from the other abutting street\nshall be not less than 15 feet. One of the interior yards shall have\na width not less than the minimum width prescribed for side yards\nin the district, and the other shall have a depth not less than the\nminimum depth prescribed for rear yards in the district."
				}
			]
		},
		{
			"paragraph": "§ 288-14",
			"title": "Satellite antennas.",
			"content": [
				{
					"text": "No person shall cause, suffer or permit the\nerection and/or maintenance of any parabolic dish or other antenna\nor device, the purpose of which is to receive television, radio and/or\nmicrowave or other electrical signals from space satellites, except\nas set forth herein:"
				},
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Any such antenna shall be confined to the rear yard\nof any parcel of realty."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "No such antenna shall be maintained, erected or affixed\nto the roof of any building."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "Upon recommendation of the Superintendent of Construction,\nthe Zoning Board of Appeals of the Village of East Rockaway is hereby\nempowered to designate the exact location of the device to be installed\nor maintained and to require any screening or other procedure in order\nto reduce or eliminate aesthetic damage to the community which may\nresult from said installation or maintenance."
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "No such installation shall be permitted or continued\nexcept by permit from the Superintendent of Construction."
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "No such device shall exceed six feet at its maximum\nheight, width or depth, and no part of such device shall be less than\n20 feet from the rear and/or side property lines."
								}
							]
						},
						{
							"number": "F. ",
							"content": [
								{
									"text": "There shall be no more than one such device maintained\nand/or erected on any parcel of realty."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 288-46",
			"title": "Location and size restricted.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "No public garage shall be located on a lot located\non any portion of a street between two intersecting streets in which\nportion there exists an entrance or exit to a public or private school\nfor children less than 16 years of age, hospital, public library or\nplace of worship, or within 200 feet of any charitable institution.\n No public garage shall be designed or used for the storage or accommodation\nof more than five vehicles."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "No private garage shall be designed for the storage\nof more than three vehicles. "
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "In all Residential A and Residential B Districts,\nlots may be used to provide private garage space for not more than\none vehicle for each 2,000 square feet of lot area, except that a\nlot shall not be used to provide private garage space for more than\na total of three vehicles."
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 288-47",
			"title": "(Reserved)",
			"content": []
		},
		{
			"paragraph": "§ 288-48",
			"title": "(Reserved)",
			"content": []
		},
		{
			"paragraph": "§ 288-49",
			"title": "Side yards with detached garages.",
			"content": [
				{
					"text": "When a detached garage is erected as an accessory\nbuilding on the same property, the side yard used as a driveway as\na means of ingress or egress to such garage shall not be less than\n10 feet in width."
				}
			]
		},
		{
			"paragraph": "§ 288-50",
			"title": "(Reserved)",
			"content": []
		},
		{
			"paragraph": "§ 288-51",
			"title": "One-car garage minimum for one-family dwellings.",
			"content": [
				{
					"text": "Whenever a one-family dwelling shall hereafter\nbe erected, there shall be erected and maintained on the same premises\nat least a one-car garage."
				}
			]
		},
		{
			"paragraph": "§ 288-52",
			"title": "Two-car garage minimum for two-family dwellings.",
			"content": [
				{
					"text": "Whenever a two-family dwelling shall hereafter\nbe erected, there shall be erected and maintained on the same premises\nat least a two-car garage."
				}
			]
		},
		{
			"paragraph": "§ 288-53",
			"title": "Construction below curb level.",
			"content": [
				{
					"text": "No garage hereafter erected as an accessory\nto a one- or two-family dwelling shall be constructed below the level\nof the curb."
				}
			]
		},
		{
			"paragraph": "§ 288-54",
			"title": "Maintenance and replacement.",
			"content": [
				{
					"text": "All existing garages shall be maintained and,\nif destroyed or demolished, shall be replaced within four months."
				}
			]
		},
		{
			"paragraph": "§ 288-55",
			"title": "Commercial A Districts.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "In a Commercial A District, a public garage, automobile\nwashing or polishing establishment or gasoline service station shall\nbe permitted when approved by the Board of Trustees, after a public\nhearing had upon at least 15 days' notice, provided that no part of\nthe storage space, workshop or cleaning apparatus incidental thereto\nshall be nearer than 25 feet to any street."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "Permitted principal uses for gasoline filling stations\nare as follows:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Use shall be limited to the retail sale of motor fuels,\nlubricants and other motor vehicle supplies, including spark plugs,\nbatteries, tires and other minor parts for the repair and upkeep of\nmotor vehicles. Minor repairs and servicing shall be permitted, except\nthat body and fender work is expressly prohibited."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "No repair work shall be performed in the open. All\nrepair work, excluding emergency service, shall be conducted only\nbetween the hours of 7:00 a.m. and 9:00 p.m."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "No pumping or sales of any motor fuels, lubricants\nor other motor vehicle supplies may be performed between the hours\nof 11:00 p.m. and 6:00 a.m.[Added 6-13-1988 by L.L. No. 13-1988]"
												}
											]
										}
									]
								}
							]
						}
					]
				}
			]
		},
		{
			"paragraph": "§ 288-56",
			"title": "Placement and operation within property lines.",
			"content": [
				{
					"text": "In any district, no building, station, pump\nor other apparatus for the furnishing or dispensing of gasoline, oil,\nair or water to motor vehicles shall be altered, erected or installed,\nunless the same shall be so located and equipped that it must be operated\nand used wholly inside of the property lines of the premises on which\nthe same may be erected and not in any portion of any public street,\nroad, avenue or highway."
				}
			]
		},
		{
			"paragraph": "§ 288-57",
			"title": "Sales rooms in Commercial A Districts.",
			"content": [
				{
					"text": "A sales room where motor vehicles are kept for\nsale or demonstration purposes, and when no gasoline or oil are stored\non the premises, shall be permitted in a Commercial A District, provided\nthat no repair work is carried on nearer than 25 feet from any street."
				}
			]
		},
		{
			"paragraph": "§ 288-58",
			"title": "Setbacks and proximity to dwellings in residence districts.",
			"content": [
				{
					"text": "In either Residential A or Residential B Districts,\nno part of any garage shall be nearer to the street line than the\ngreatest setback distance of the street wall of the building, nor\nshall any garage which is nearer to the street line than the rear\nwall of a dwelling be nearer than six feet to any side lot line. No\ngarage shall be nearer than eight feet to any part of a dwelling on\nanother lot or nearer to the street line than 25 feet."
				}
			]
		},
		{
			"paragraph": "§ 288-59",
			"title": "Relation of detached garages to front wall lines.",
			"content": [
				{
					"text": "In either Residential A or Residential B Districts,\nno part of any detached garage shall be nearer to the street line\nupon which said garage faces than the front wall line of the main\nbuilding on said premises. In the event that such detached garage\nfaces on a street other than the street upon which the main house\nfaces, no part of any such garage shall be nearer to the street line\nthan the front wall line of the main building of the adjoining property.\nIf there is no building on the adjoining property, such garage shall\nnot be nearer to the street line than 25 feet."
				}
			]
		},
		{
			"paragraph": "§ 288-60",
			"title": "Proximity to adjoining property lines in residence districts.",
			"content": [
				{
					"text": "In either Residential A or Residential B Districts,\nno part of any garage shall be nearer to any adjoining property line\nthan two feet."
				}
			]
		}
	]
}