{
	"url": "http://ecode360.com/6966349",
	"paras": [
		{
			"paragraph": "§ 155-13.1",
			"title": "Residential District (R-1).",
			"content": [
				{
					"text": "R-1 residential one-family detached or two-family\nattached dwelling units shall conform to the following regulations. "
				},
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "The minimum lot area shall be 4,000 square feet. Lots\nmay not be subdivided or assembled without complying with minimum\nlot areas. Lots, regardless of size, may not have more than one two-family\ndwelling unit."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "The minimum lot width shall be 40 feet."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "The minimum lot depth shall be 100 feet."
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "On an interior lot, the minimum front yard setback\nshall be 20 feet or the same as the average front yard setback of\nthe existing buildings within 200 feet on each side of the lot and\nwithin the same block front and district, whichever shall be greater.\nOn a corner lot a front yard setback shall be required on each street\nfrontage as follows: The front yard setback on the narrower street\nfrontage shall be a minimum of 20 feet or the same as the average\nfront yard setback of the existing buildings within 200 feet on each\nside of the lot and within the same block front and district, whichever\nis greater, and the front yard setback on the other street frontage\nshall be a minimum of 10 feet, and if the street frontages are equal,\neach street frontage shall have a minimum front yard setback of 20\nfeet or the same as the average front yard setback of the existing\nbuildings within 200 feet on each side of the lot and within the same\nblock front and district, whichever is greater."
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "On an interior lot, the minimum side yard setback\nshall be six feet, with a minimum aggregate of 14 feet. A corner lot\nshall have a minimum side yard setback of six feet on the side adjoining\nthe interior lot opposite the front yard having a greater street frontage.\nThe two yards fronting on streets shall be considered front yards,\nand the remaining yard shall be considered the rear yard."
								}
							]
						},
						{
							"number": "F. ",
							"content": [
								{
									"text": "The minimum rear yard setback shall be 20 feet.[Amended 3-13-2004 by L.L. No. 9-2004]"
								}
							]
						},
						{
							"number": "G. ",
							"content": [
								{
									"text": "No building shall exceed two stories or 26 feet in\nheight, measured from the established street grade."
								}
							]
						},
						{
							"number": "H. ",
							"content": [
								{
									"text": "The minimum floor area for each dwelling unit shall\nbe 750 square feet."
								}
							]
						},
						{
							"number": "I. ",
							"content": [
								{
									"text": "In a two-family dwelling located on a lot less than\n5,000 square feet in area, at least one of the dwelling units shall\nnot have more than two bedrooms.[Amended 2-15-2001 by L.L. No. 1-2001]"
								}
							]
						},
						{
							"number": "J. ",
							"content": [
								{
									"text": "The maximum lot building coverage for a one-family\ndwelling shall be 28%. The maximum lot building coverage for a two-family\ndwelling shall be 25%; provided, however, that with respect to conversion\nof an existing one-family dwelling to a two-family dwelling, where\nthe building lot coverage is 28% or less, the one-family dwelling\nmay be so converted on condition that the building lot coverage not\nbe increased as the result of said conversion, except to the extent\nthat additional on-site parking is required. Building coverage shall\ninclude the principal building, including attached or detached porches\nand decks extending more than two feet above average finished grade\nand attached or detached garages and all other accessory uses. Moreover,\naccessory uses other than attached porches and decks extending more\nthan two feet above average finished grade shall occupy no more than\n40% of the rear yard area and no more than 40% of the side yard area.\nIn the event that a preexisting, nonconforming dwelling under this\nsubsection is destroyed by fire, flood and/or other like disaster,\nsuch dwelling may be reconstructed to the extent of the nonconformity\nherein, with respect to lot building coverage only.[Amended 9-27-2000 by L.L. No. 6-2000; 2-15-2001 by L.L. No. 1-2001]"
								}
							]
						},
						{
							"number": "K. ",
							"content": [
								{
									"text": "The total of building lot coverage and the area occupied\nby structures, terraces, paved yard areas, paved driveways and any\nother impermeable surface shall not exceed 50% of the area of the\nlot.[Added 2-15-2001 by L.L. No. 1-2001[1]]"
								},
								{
									"footnote": "[1]\nEditor's Note: This local law repealed former\nSubsection K, which described when a one-family dwelling may not be\nconverted to a two-family dwelling.\n"
								}
							]
						},
						{
							"number": "L. ",
							"content": [
								{
									"text": "Each single-family dwelling unit shall have at least\ntwo on-site parking spaces for occupant use, and each two-family dwelling\nunit shall have at least three on-site parking spaces for occupant\nuse."
								}
							]
						},
						{
							"number": "M. ",
							"content": [
								{
									"text": "No structure or accessory use may be located in the\nfront yard."
								}
							]
						},
						{
							"number": "N. ",
							"content": [
								{
									"text": "No structure or accessory use, other than a detached\ngarage, as permitted, and parking of vehicles (but not commercial\nvehicles), may be located in a required side yard setback. A detached\ngarage must have a minimum of a three-foot side yard setback and a\nminimum three-foot rear yard setback.[Amended 3-13-2004 by L.L. No. 9-2004]"
								}
							]
						},
						{
							"number": "O. ",
							"content": [
								{
									"text": "Permitted accessory uses shall be limited to play\nequipment, private auto garages, storage of boats, garden sheds, ground\nplayhouses, tool sheds, fences or walls (under four feet) and aboveground\ndecks extending no higher than two feet above average finished grade.\nAn accessory shed must have a minimum of a three-foot side yard setback\nand a minimum three-foot rear yard setback.[Amended 2-15-2001 by L.L. No. 1-2001; 3-13-2004 by L.L. No. 9-2004]"
								}
							]
						},
						{
							"number": "P. ",
							"content": [
								{
									"text": "Accessory uses, in accordance with Article VIII, with a special use permit from the Board of Zoning and Appeals, shall be limited to:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Fences and walls above four feet."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Aboveground/in-ground pools."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Satellite antennas measuring more than 36 inches in diameter at any point. Satellite dishes of less diameter shall be permitted in accordance with § 155-48."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "Radio antennas."
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "Cabanas."
												}
											]
										},
										{
											"number": "(6) ",
											"content": [
												{
													"text": "Basketball, tennis or other courts, with or\nwithout fencing."
												}
											]
										},
										{
											"number": "(7) ",
											"content": [
												{
													"text": "Tree playhouses."
												}
											]
										},
										{
											"number": "(8) ",
											"content": [
												{
													"text": "Vehicle storage and parking."
												}
											]
										},
										{
											"number": "(9) ",
											"content": [
												{
													"text": "Boat storage."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "Q. ",
							"content": [
								{
									"text": "The height of the average grade of the habitable area\nshall conform to the grades required by the applicable state laws\nfor flood hazard designated areas by the National Flood Insurance\nProgram."
								},
								{
									"paragraph": "§ 155-27",
									"title": "Height.",
									"content": [
										{
											"content": [
												{
													"number": "A. ",
													"content": [
														{
															"text": "On all buildings where building plans indicate a height\nlimit of 26 feet, the builder must provide the Code Official with\na height survey of the foundation footings before construction can\ncontinue.[Amended 3-23-1988 by L.L. No. 2-1988]"
														}
													]
												},
												{
													"number": "B. ",
													"content": [
														{
															"text": "In order to ensure the compliance with height limits,\nthe builder and his licensed surveyor, in the presence of the Code\nOfficial, must take a height survey when the ridge pole is installed."
														}
													]
												}
											]
										}
									]
								},
								{
									"paragraph": "§ 155-28",
									"title": "Lot area.",
									"content": [
										{
											"text": "For all buildings, the minimum lot area for each principal and accessory use shall be required as specified under Article V, Use Regulations."
										}
									]
								},
								{
									"paragraph": "§ 155-29",
									"title": "Lot width.",
									"content": [
										{
											"text": "For all buildings, the minimum lot width for each principal and accessory use shall be required as specified under Article V, Use Regulations."
										}
									]
								},
								{
									"paragraph": "§ 155-30",
									"title": "Front yard space.",
									"content": [
										{
											"content": [
												{
													"number": "A. ",
													"content": [
														{
															"text": "For all buildings, the minimum front yard setback for each principal and accessory use shall be required as specified under Article V, Use Regulations."
														}
													]
												},
												{
													"number": "B. ",
													"content": [
														{
															"text": "On any corner lot on which a front yard is required\nby this chapter, no wall, fence or other structure shall be erected\nand no hedge, tree, shrub or other structure growth shall be maintained\nin such a location within the front yard space so as to cause danger\nto traffic by obstruction of the view."
														}
													]
												},
												{
													"number": "C. ",
													"content": [
														{
															"text": "A through lot shall have a front yard on each frontage."
														}
													]
												},
												{
													"number": "D. ",
													"content": [
														{
															"text": "The space designated as the front yard as required\nby this chapter shall be left open and clear, except for surface vegetation,\nand shall not be used for any purpose except for parking space in\na residential district other than the front yard along the principal\nstreet frontage of a corner lot.[Amended 3-23-1988 by L.L. No. 2-1988]"
														}
													]
												},
												{
													"number": "E. ",
													"content": [
														{
															"text": "There shall be no accessory use situated in a front\nyard, nor shall any front yard be used for the parking or storage\nof any passenger vehicle not licensed or operable, commercial vehicle,\ncamper, trailer, boat or device of any kind."
														}
													]
												},
												{
													"number": "F. ",
													"content": [
														{
															"text": "The maximum paved area shall not exceed 50% in a residential\nzone."
														}
													]
												}
											]
										}
									]
								},
								{
									"paragraph": "§ 155-31",
									"title": "Rear yard space.",
									"content": [
										{
											"text": "For all buildings, the minimum rear yard setback for each principal and accessory use shall be required as specified under Article V, Use Regulations."
										}
									]
								},
								{
									"paragraph": "§ 155-32",
									"title": "Side yard space.",
									"content": [
										{
											"text": "For all buildings, the minimum side yard setback for each principal and accessory use shall be required as specified under Article V, Use Regulations."
										}
									]
								},
								{
									"paragraph": "§ 155-33",
									"title": "Courtyard construction.",
									"content": [
										{
											"text": "In a residential district, every living or sleeping\nroom in a dwelling shall have at least one window opening directly\neither upon a street, a front yard, a side yard or a courtyard. The\nleast dimension of any such court shall be not less than four inches\nfor each foot of the height of the highest wall of such court. Such\ncourt shall be open and unobstructed to the sky except for ordinary\nprojections of windowsills, brick courses and other ornamental features\nto the extent of not more than four inches."
										}
									]
								},
								{
									"paragraph": "§ 155-34",
									"title": "Roof construction.",
									"content": [
										{
											"content": [
												{
													"number": "A. ",
													"content": [
														{
															"text": "In all cases where flat roof construction is used\nand there is no ridge, there shall be an average air space of 18 inches\nbetween the ceiling beams and roof beams, and a parapet wall shall\nbe erected on all sides of the building, such parapet wall to be carried\nalong horizontal lines to a height of not less than six inches above\nthe roof at all points. On flat roof construction with an overhang,\nit shall not be necessary to erect a parapet wall at that portion\nof the building where the overhang exists."
														}
													]
												},
												{
													"number": "B. ",
													"content": [
														{
															"text": "Where ridge construction is used, the pitch of the\nroof shall not be less than four inches to the foot."
														}
													]
												},
												{
													"number": "C. ",
													"content": [
														{
															"text": "Ridge construction must be used in R-1, R-2 and R-3\nResidential Districts."
														}
													]
												}
											]
										}
									]
								},
								{
									"paragraph": "§ 155-35",
									"title": "Appurtenance construction.",
									"content": [
										{
											"text": "Appurtenances on structures which encroach into\nrequired yards are hereby permitted as provided in this section only:"
										},
										{
											"content": [
												{
													"number": "A. ",
													"content": [
														{
															"text": "Cornices, eaves and gutters projecting not more than\n24 inches; chimneys or bay windows not more than six feet in length\nand projecting not more than 24 inches, provided that there is a minimum\nsix-foot side yard."
														}
													]
												},
												{
													"number": "B. ",
													"content": [
														{
															"text": "One-story covered or uncovered open porches, decks\nand terraces projecting not more than five feet into the minimum front\nyard. These cannot be enclosed."
														}
													]
												},
												{
													"number": "C. ",
													"content": [
														{
															"text": "One-story enclosed vestibule not greater than six\nfeet in width and five feet in depth, extending into a minimum front\nyard."
														}
													]
												},
												{
													"number": "D. ",
													"content": [
														{
															"text": "Covered or uncovered open porches or stoops extending\ninto a side yard, provided that a three-foot side yard is maintained."
														}
													]
												},
												{
													"number": "E. ",
													"content": [
														{
															"text": "Entry stairs on the side of a structure leading to\na second story, either open or enclosed, covered or uncovered, are\nnot permitted."
														}
													]
												}
											]
										}
									]
								},
								{
									"paragraph": "§ 155-36",
									"title": "Accessory structures.",
									"content": [
										{
											"content": [
												{
													"number": "A. ",
													"content": [
														{
															"text": "Accessory structures shall not be over 15 feet in\nheight at their highest points.[Amended 3-23-1988 by L.L. No. 2-1988]"
														}
													]
												},
												{
													"number": "B. ",
													"content": [
														{
															"text": "All accessory structures shall be located in the side\nyard or rear yard and shall comply with the applicable side yard and\nrear yard minimum setback requirements.[Amended 3-23-1988 by L.L. No. 2-1988]"
														}
													]
												},
												{
													"number": "C. ",
													"content": [
														{
															"text": "No accessory structure shall be erected within 12\nfeet of a building used for residential purposes on an adjoining lot."
														}
													]
												},
												{
													"number": "D. ",
													"content": [
														{
															"text": "(Reserved)[1]"
														},
														{
															"footnote": "[1]\nEditor's Note: Former Subsection D, restricting\nthe erection of accessory structures in rear yards, was repealed 3-23-1988\nby L.L. No. 2-1988.\n"
														}
													]
												}
											]
										}
									]
								},
								{
									"paragraph": "§ 155-37",
									"title": "Sewage disposal.",
									"content": [
										{
											"text": "All sewer applications and connections shall\nconform to the Sewer Use Ordinance of the Port Washington Water Pollution\nControl District.[1] No structure shall have installed any other sewerage or\ndisposal system."
										},
										{
											"footnote": "[1]\nEditor's Note: See Ch. 123, Sewers, Art. II, Use.\n"
										}
									]
								},
								{
									"paragraph": "§ 155-38",
									"title": "Certain buildings restricted.",
									"content": [
										{
											"text": "Buildings of wood-frame or metal-skin construction\nshall be prohibited in any commercial or industrial district."
										}
									]
								},
								{
									"paragraph": "§ 155-39",
									"title": "Use of vacant lots.",
									"content": [
										{
											"text": "Vacant lots shall not be utilized for vehicle\nor other forms of parking, storage or other activity unless in conformance\nwith this chapter or a special use permit from the Board of Zoning\nand Appeals."
										}
									]
								},
								{
									"paragraph": "§ 155-41",
									"title": "Fences, gates and walls.\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t[1]",
									"content": [
										{
											"text": "In all districts, fences and walls over four\nfeet may be erected, subject to a special use permit from the Board\nof Zoning and Appeals, subject to the following restrictions:"
										},
										{
											"content": [
												{
													"number": "A. ",
													"content": [
														{
															"text": "On residential property abutting or across from land\nused for nonresidential purposes, the fence shall be of stockade or\nother solid construction and may be no more than six feet high. The\nfinished side of the fence shall face outside."
														}
													]
												},
												{
													"number": "B. ",
													"content": [
														{
															"text": "On commercial or industrial property where a fence,\ngate or wall is set back at least 25 feet from the nearest property\nline, the height may be no more than eight feet."
														}
													]
												},
												{
													"number": "C. ",
													"content": [
														{
															"text": "On commercial or industrial property abutting or across\nfrom land used for residential purposes, the fence shall be of stockade\nor other solid construction and may be no more than six feet high.\nThe finished side of the fence shall face out."
														}
													]
												},
												{
													"number": "D. ",
													"content": [
														{
															"text": "On residential or other property in conjunction with\na tennis court or pool, where a special use permit has been granted."
														}
													]
												}
											]
										},
										{
											"footnote": "[1]\nEditor's Note: See also Ch. 65, Fences.\n"
										}
									]
								},
								{
									"paragraph": "§ 155-42",
									"title": "Aboveground/in-ground swimming pools or spas.\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t[1]",
									"content": [
										{
											"text": "A swimming pool or spa accessory to a one-or-more-family\ndwelling unit shall conform to the following regulations and shall\nbe subject to a special use permit from the Board of Zoning and Appeals:"
										},
										{
											"content": [
												{
													"number": "A. ",
													"content": [
														{
															"text": "A pool (above or below ground) and related nonslip\ndecks, small-mesh fences and secured machinery shall be entirely within\nthe rear yard. No portion thereof shall be closer to the street line\nthan the rear wall the main building."
														}
													]
												},
												{
													"number": "B. ",
													"content": [
														{
															"text": "A pool and related nonslip decks, fences and machinery\nshall be located not less than 10 feet from side and rear property\nlines."
														}
													]
												},
												{
													"number": "C. ",
													"content": [
														{
															"text": "A pool and related nonslip decks, fences and machinery\nshall be completely enclosed by a substantial fence not less than\nsix feet high, with a self-locking, child tamperproof gate."
														}
													]
												},
												{
													"number": "D. ",
													"content": [
														{
															"text": "Machinery used in connection with a pool shall be\nenclosed in a soundproof structure."
														}
													]
												},
												{
													"number": "E. ",
													"content": [
														{
															"text": "Glare from pool lights shall be shielded from adjacent\nproperties."
														}
													]
												},
												{
													"number": "F. ",
													"content": [
														{
															"text": "Pool size and depth shall conform to National Spa\nand Pool Institute (NSPI) safety standards for residential pool in\neffect on the effective date of this chapter."
														}
													]
												},
												{
													"number": "G. ",
													"content": [
														{
															"text": "Pools, spas, etc., shall have required depth markings,\nlifesaving equipment and user warning signs available, according to\nNSPI safety standards in effect on the effective date of this chapter."
														}
													]
												},
												{
													"number": "H. ",
													"content": [
														{
															"text": "Pools shall have diving fixtures or places located\naccording to NSPI standards in effect on the effective date of this\nchapter to avoid hazardous and dangerous conditions."
														}
													]
												},
												{
													"number": "I. ",
													"content": [
														{
															"text": "Pools shall have no adjacent structure potentially\naccessible for improper diving or other unsafe play."
														}
													]
												},
												{
													"number": "J. ",
													"content": [
														{
															"text": "No public use shall be made of the pool or spa."
														}
													]
												},
												{
													"number": "K. ",
													"content": [
														{
															"text": "Pool installation shall have provision made on the\npremises for drainage of water from the pool tank."
														}
													]
												}
											]
										},
										{
											"footnote": "[1]\nEditor's Note: See also Ch. 134, Swimming Pools.\n"
										}
									]
								},
								{
									"paragraph": "§ 155-43",
									"title": "Storage and parking of certain vehicles.\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t[1]",
									"content": [
										{
											"content": [
												{
													"number": "A. ",
													"content": [
														{
															"text": "No recreational boat, bus, truck, trailer, van, camper,\nsleeping bus or other vehicle designed or used for living or sleeping\nshall be parked or stored on or in any front or side yard of any lot\nlocated in a residential district of the Village. Such vehicle or\nboat shall be parked or stored on or in any part of a rear yard of\nany lot located in a residential district of the Village only with\na special use permit from the Board of Zoning and Appeals. Such permit\nmay not be issued unless such parking or storage is not within 10\nfeet of the rear or side lot lines nor on any portion of a lot where\nsuch boat or vehicle is visible from any street abutting the lot on\nwhich such boat or vehicle is parked or stored."
														}
													]
												},
												{
													"number": "B. ",
													"content": [
														{
															"text": "No commercial vehicle shall be parked or stored on\nproperty located in a residential district in the Village unless enclosed\nin a private garage, except that such vehicle may be parked for such\nperiods of time as required for the continued performance of any service\non or deliveries to said premises."
														}
													]
												}
											]
										},
										{
											"footnote": "[1]\nEditor's Note: See also Ch. 148, Vehicles, Use of.\n"
										}
									]
								},
								{
									"paragraph": "§ 155-44",
									"title": "Outdoor tennis and other courts.",
									"content": [
										{
											"text": "Outdoor tennis or other courts accessory to\na one-or-more-family dwelling unit and commercial and industrial use\nshall conform to the following restrictions with a special use permit\nfrom the Board of Zoning and Appeals:"
										},
										{
											"content": [
												{
													"number": "A. ",
													"content": [
														{
															"text": "Outdoor tennis or other courts shall be permitted\nonly on plots of adequate size to conform to the following requirements."
														}
													]
												},
												{
													"number": "B. ",
													"content": [
														{
															"text": "The minimum setback from a street line to an outdoor\ntennis court shall be 50 feet."
														}
													]
												},
												{
													"number": "C. ",
													"content": [
														{
															"text": "The minimum setback from a property line to an outdoor\ntennis court shall be 25 feet."
														}
													]
												},
												{
													"number": "D. ",
													"content": [
														{
															"text": "The maximum height of a fence around tennis courts\nshall be 10 feet."
														}
													]
												},
												{
													"number": "E. ",
													"content": [
														{
															"text": "No more than two courts may be grouped together."
														}
													]
												},
												{
													"number": "F. ",
													"content": [
														{
															"text": "No outdoor tennis courts shall be located within 50\nfeet of any interior road or in any front yard."
														}
													]
												},
												{
													"number": "G. ",
													"content": [
														{
															"text": "All outdoor tennis courts shall be visually screened\nfrom the roads and streets by plant materials."
														}
													]
												},
												{
													"number": "H. ",
													"content": [
														{
															"text": "All lighting of outdoor tennis courts shall be directed\naway from residential units and roads. No lights shall be permitted\nto be used between the hours of 10:00 p.m. and 7:00 a.m."
														}
													]
												}
											]
										}
									]
								},
								{
									"paragraph": "§ 155-45",
									"title": "Parking and loading space.",
									"content": [
										{
											"content": [
												{
													"number": "A. ",
													"content": [
														{
															"text": "For every building erected or altered or use established\nafter the effective date of this chapter, there shall be provided\non the same premises suitably graded and paved off-street parking\nand off-street loading areas. Such off-street parking area shall be\nsufficient to accommodate the number of vehicles customarily used\nfor conveying occupants and visitors to such structure and requiring\nto be parked during the hours of average maximum use. It is not intended\nhereby to require provision for abnormal peak loads but for normal\naverage maximum hour requirements. Such off-street parking and off-street\nloading areas shall conform to the requirements of this chapter."
														}
													]
												},
												{
													"number": "B. ",
													"content": [
														{
															"text": "Such off-street parking and off-street loading space,\ntogether with the necessary entrances, exits, passageways, turning\nareas and landscaped borders shall be deemed to be required open space\non the lot on which it is situated and shall not thereafter be encroached\nupon or reduced in any manner."
														}
													]
												},
												{
													"number": "C. ",
													"content": [
														{
															"text": "In all R-1 or R-2 Residential Districts, there shall\nbe at least two off-street parking spaces for a single-family dwelling\nand at least three off-street parking spaces for a two-family dwelling."
														}
													]
												},
												{
													"number": "D. ",
													"content": [
														{
															"text": "In all R-3 Residential Districts, there shall be at\nleast two off-street parking spaces per dwelling unit and off-street\ncommon parking spaces, which all shall be one per five dwelling units\nif there is no clubhouse and two per five dwelling units if there\nis a clubhouse."
														}
													]
												},
												{
													"number": "E. ",
													"content": [
														{
															"text": "In all commercial districts and industrial districts, off-street parking spaces shall be provided in accordance with § 155-46."
														}
													]
												},
												{
													"number": "F. ",
													"content": [
														{
															"text": "All areas available for off-street parking and access\ndriveways shall be surfaced in accordance with the following specifications:\nnot less than two inches of broken stone after compaction and one\ninch of premixed bituminous material after compaction; or concrete\nnot less than four inches thick; or, in a residential district, Belgian\nblock or brick not less than four inches thick.[Amended 3-23-1988 by L.L. No. 2-1988]"
														}
													]
												},
												{
													"number": "G. ",
													"content": [
														{
															"text": "No part of the parking area shall be used for the\nstorage or abandonment of any article or material."
														}
													]
												},
												{
													"number": "H. ",
													"content": [
														{
															"text": "Parking areas shall be marked with arrows showing\nflow of traffic, and individual parking spaces."
														}
													]
												},
												{
													"number": "I. ",
													"content": [
														{
															"text": "In a commercial or industrial district, the entire\nparking space area, except entrances and exits, shall be screened\nfrom outside view by landscaping property borders."
														}
													]
												},
												{
													"number": "J. ",
													"content": [
														{
															"text": "In commercial or industrial districts, each off-street\nparking area shall have an area of not less than 10 feet by 20 feet,\nwith access drives or aisles, in usable shape and condition, not less\nthan 20 feet."
														}
													]
												},
												{
													"number": "K. ",
													"content": [
														{
															"text": "In residential districts, each parking space shall\nnot be less than 10 feet by 20 feet. There shall be adequate ingress\nand egress to all parking spaces. There shall be provided an access\ndrive not less than 10 feet in width. Curb cuts shall not be more\nthan two and shall not exceed an aggregate amount of 16 feet in width.\nNo single curb cut shall be less than eight feet in width.[Amended 3-23-1988 by L.L. No. 2-1988; 4-24-1997 by L.L. No. 4-1997]"
														}
													]
												},
												{
													"number": "L. ",
													"content": [
														{
															"text": "Off-site facilities shall be located in the same district\nas the use to which they are accessory, with the exception of the\nuses set forth in § 155-23F, G, I, J, K, L, M and N, only\nwith a special use permit from the Board of Zoning and Appeals, and\nwithin a distance of 400 feet thereof. Such off-site facilities must\nalso be in the same ownership as the use to which they are accessory\nand shall not be sold off or leased for any other use.[Amended 2-2-2004 by L.L. No. 1-2004]"
														}
													]
												},
												{
													"number": "M. ",
													"content": [
														{
															"text": "Off-street parking and loading facilities may be provided\njointly for separate use, with a special use permit from the Board\nof Zoning and Appeals, if landscaped open space is substituted and\nif on-street parking is not generated."
														}
													]
												}
											]
										}
									]
								},
								{
									"paragraph": "§ 155-46",
									"title": "Off-street parking requirements.",
									"content": [
										{
											"text": "Off-street parking requirements shall be as\nfollows:"
										}
									]
								},
								{
									"paragraph": "§ 155-47",
									"title": "(Reserved)\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t[1]",
									"content": [
										{
											"footnote": "[1]\nEditor's Note: Former § 155-47,\nMarine accessory uses, was repealed 4-25-2001 by L.L. No. 6-2001.\n"
										}
									]
								},
								{
									"paragraph": "§ 155-48",
									"title": "Satellite antennas.",
									"content": [
										{
											"content": [
												{
													"number": "A. ",
													"content": [
														{
															"text": "A private-use satellite antenna, disc or similar device\nfor the reception of television signals from satellites shall be permitted\non the roof or in the yard of any residence, provided that its diameter\ndoes not exceed 36 inches at any point."
														}
													]
												},
												{
													"number": "B. ",
													"content": [
														{
															"text": "No television antenna of a commercial use, or private-use\nsatellite antenna, disc or other device for the reception of television\nsignals from satellites, measuring more than 36 inches in diameter\nat any point, shall be permitted in any yard or at any other location\nof any residence without a special use permit from the Board of Zoning\nand Appeals. An applicant for such special use permit shall specify\nthe size, location, make and other specifications of said device and\nshall establish that it will not adversely affect any neighbor by\nreason of its proposed location."
														}
													]
												}
											]
										}
									]
								},
								{
									"paragraph": "§ 155-49",
									"title": "Radio antennas.",
									"content": [
										{
											"text": "No radio antenna of any type of a commercial\nuse or private use, antenna tower or other device will be permitted\nwithout a special use permit from the Board of Zoning and Appeals,\nwith all details specified and proof as not to adversely affect any\nneighbor."
										}
									]
								},
								{
									"paragraph": "§ 155-50",
									"title": "Cabanas.",
									"content": [
										{
											"text": "No cabana of a commercial or private use will\nbe permitted without a special use permit from the Board of Zoning\nand Appeals, with all construction details being submitted, developed\nand approved and proof as not to adversely affect any neighbor."
										}
									]
								},
								{
									"paragraph": "§ 155-51",
									"title": "Tree playhouses.",
									"content": [
										{
											"text": "No tree playhouse of a private use will be permitted\nwithout a special use permit from the Board of Zoning and Appeals,\nwith all construction details being submitted, reviewed and approved\nand proof as not to adversely affect any neighbor."
										}
									]
								},
								{
									"paragraph": "§ 155-52",
									"title": "Hazardous uses.\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t[1]",
									"content": [
										{
											"content": [
												{
													"number": "A. ",
													"content": [
														{
															"text": "No land or building shall be used or occupied in any\nmanner so as to create dangerous, injurious, noxious, hazardous, fire,\nexplosive, radioactive or other unsafe or unhealthy conditions; noise\nor vibration, smoke, dust, odor or other form of air pollution; electrical\nor other disturbances, glare or heat; liquid or solid refuse or wastes;\nconditions conducive to the breeding of rodents or insects or other\ndangerous elements in an amount or manner as to adversely affect the\nsurrounding area. All uses of land shall conform to the limitations\nset forth below and to all applicable laws and regulations of the\nState of New York and the County of Nassau relating to air pollution,\nsmoke, dust and fumes. The Code Official shall review and approve\nthe certification required by this section."
														}
													]
												},
												{
													"number": "B. ",
													"content": [
														{
															"text": "Vibration. No vibration shall be produced which is\ntransmitted through the ground and is discernible without the aid\nof instruments at or at any point beyond the lot line; nor shall any\nvibration produced exceed 1.002g peak, measured at or beyond the lot\nline using either seismic or electronic vibration measuring equipment.\nAny use that, in the opinion of the Code Official, has the potential\nof creating a vibration shall require certifications and data by a\nprofessional engineer as to its negative impact before a zoning permit\nis issued."
														}
													]
												},
												{
													"number": "C. ",
													"content": [
														{
															"text": "Noise. All noise shall be muffled as to intermittence,\nbeat, frequency or shrillness. In no event shall the sound-pressure\nlevel of noise radiated continuously from a facility at nighttime\nexceed, at the lot line, the values given in Table 1 (set out hereafter)\nin any octave band of frequency. However, where the lot line adjoins\nor lies within 25 feet of the boundary of a residential district the\nsound-pressure levels of noise radiated at nighttime shall not exceed,\nat the lot line, the values given in Table II (set out hereafter)\nin any octave band of frequency. The sound-pressure level shall be\nmeasured with a sound-level meter and an octave-band analyzer that\nconforms to specifications published by the American Standards Association."
														},
														{
															"content": [
																{
																	"number": "(1) ",
																	"content": [
																		{
																			"text": "Table I."
																		},
																		{
																			"content": [
																				{
																					"number": "(a) ",
																					"content": [
																						{
																							"text": "Maximum permissible sound-pressure levels at\nthe lot line for noise radiated continuously from a facility between\nthe hours of 10:00 p.m. and 7:00 a.m.:"
																						}
																					]
																				},
																				{
																					"number": "(b) ",
																					"content": [
																						{
																							"text": "If the noise is not smooth and continuous and\nis not radiated between the hours of 10:00 p.m. and 7:00 a.m., one\nor more of the corrections in Table III shall be added to or subtracted\nfrom each of the decibel levels given above in Table I."
																						}
																					]
																				}
																			]
																		}
																	]
																},
																{
																	"number": "(2) ",
																	"content": [
																		{
																			"text": "Table II:"
																		},
																		{
																			"content": [
																				{
																					"number": "(a) ",
																					"content": [
																						{
																							"text": "Maximum permissible sound-pressure levels at\na lot line for noise radiated continuously from a facility between\nthe hours of 10:00 p.m. and 7:00 a.m. where the lot line adjoins or\nlies within 25 feet of the boundary of a residential district:"
																						}
																					]
																				},
																				{
																					"number": "(b) ",
																					"content": [
																						{
																							"text": "If the noise is not smooth and continuous and\nis not radiated between the hours 10:00 p.m. and 7:00 a.m., one or\nmore of the corrections in Table III which follows shall be added\nto or subtracted from each of the decibel levels given above in Table\nII."
																						}
																					]
																				}
																			]
																		}
																	]
																},
																{
																	"number": "(3) ",
																	"content": [
																		{
																			"text": "Table III:"
																		}
																	]
																},
																{
																	"number": "(4) ",
																	"content": [
																		{
																			"text": "Any use that, in the opinion of the Code Official,\nhas the potential of creating any noise shall require certification\nand data by a professional engineer as to its negative impact before\na zoning permit may be issued."
																		}
																	]
																}
															]
														}
													]
												},
												{
													"number": "D. ",
													"content": [
														{
															"text": "Odors."
														},
														{
															"content": [
																{
																	"number": "(1) ",
																	"content": [
																		{
																			"text": "There shall not be discharged or permitted to escape\ninto the atmosphere odors which shall endanger public comfort, repose,\nhealth or safety."
																		}
																	]
																},
																{
																	"number": "(2) ",
																	"content": [
																		{
																			"text": "The intensity of dangerous odors shall be determined\nat the property line adjacent to the source in the manner described\nin Air Pollution Abatement Manual, Chapter 5, Table III; Manufacturing\nChemists Association: Washington, D.C., 1951. Any use that, in the\nopinion of the Code Official, has the potential of creating any odor\nshall require certification and data by an accredited testing laboratory."
																		}
																	]
																},
																{
																	"number": "(3) ",
																	"content": [
																		{
																			"text": "Any use that, in the opinion of the Code Official,\nhas the potential of creating any odor shall require certification\nand data by a professional engineer as to its negative impact before\na zoning permit may be issued."
																		}
																	]
																}
															]
														}
													]
												},
												{
													"number": "E. ",
													"content": [
														{
															"text": "Electromagnetic radiation."
														},
														{
															"content": [
																{
																	"number": "(1) ",
																	"content": [
																		{
																			"text": "It shall be unlawful to operate any equipment which,\nas a source of electromagnetic radiation, does not comply with the\npertinent current rules and regulations of the Federal Communications\nCommission or any pertinent laws or regulations of the State of New\nYork or the County of Nassau."
																		}
																	]
																},
																{
																	"number": "(2) ",
																	"content": [
																		{
																			"text": "If, in the opinion of the Code Official, any equipment\nis believed to be a potential hazard or nuisance due to electromagnetic\nradiation, then such equipment shall not be operated without certification\nby a testing laboratory."
																		}
																	]
																},
																{
																	"number": "(3) ",
																	"content": [
																		{
																			"text": "All certifications regarding radiation shall indicate\nthe measurements and the interpretation of the field strengths. Certification\nshall be made by a professional engineer."
																		}
																	]
																},
																{
																	"number": "(4) ",
																	"content": [
																		{
																			"text": "Any use that, in the opinion of the Code Official,\nhas the potential of creating radiation shall require certification\nand data by a professional engineer as to its negative impact before\na zoning permit may be issued."
																		}
																	]
																}
															]
														}
													]
												},
												{
													"number": "F. ",
													"content": [
														{
															"text": "Fire and explosion. All activities and all storage\nof flammable and explosive materials at any place shall be provided\nwith adequate safety and fire-fighting devices required by the Fire\nPrevention Code of the Village[2] and/or the Nassau County Fire Marshal's office. Any use\nthat, in the opinion of the Code Official, has the potential of creating\nany fire or explosion shall require data and certification by a professional\nengineer as to its negative impact before any zoning permit may be\nissued."
														},
														{
															"footnote": "[2]\nEditor's Note: See Ch. 69, Fire Prevention.\n"
														}
													]
												},
												{
													"number": "G. ",
													"content": [
														{
															"text": "Radioactive materials. The handling of radioactive\nmaterials, the discharge of such materials into air and water and\nthe disposal of radioactive wastes shall be in conformance with the\napplicable regulations of the Nuclear Regulatory Commission, as from\ntime to time amended, and all applicable laws and regulations of the\nVillage of Manorhaven. Any use that, in the opinion of the Code Official,\nhas the potential of creating radiation shall require data and certification\nby a professional engineer as to its negative impact before any zoning\npermit may be issued."
														}
													]
												},
												{
													"number": "H. ",
													"content": [
														{
															"text": "Heat. For the purpose of this chapter, \"heat\" is defined\nas thermal energy of a radioactive, conductive or convective nature\nfrom high temperature processes, such as combustion or welding or\notherwise, so as to be in excess of 100º F. at the lot line.\nThere shall be no emission or transmission of heat or heated air discernible\nat the lot line. Any use that, in the opinion of the Code Official,\nhas the potential of creating any heat shall require data and certification\nby a professional engineer as to its negative impact before a zone\npermit is issued."
														}
													]
												},
												{
													"number": "I. ",
													"content": [
														{
															"text": "Glare."
														},
														{
															"content": [
																{
																	"number": "(1) ",
																	"content": [
																		{
																			"text": "Direct glare. \"Direct glare\" is defined, for the purpose\nof this chapter, as illumination beyond property lines caused by direct\nor specularly reflected rays from incandescent, fluorescent or arc\nlighting or from such high-temperature processes as welding or petroleum\nor metallurgical refining. No such direct glare shall be permitted,\nwith the exceptions that parking areas and walkways may be illuminated\nby luminaires so hooded or shielded that the maximum angle of the\ncone of direct illumination shall be 60º, drawn perpendicular\nto the ground, with the exception that such angle may be increased\nto 90º if the luminair is less than four feet above the ground.\nThe luminaires shall not be less than 16 feet above ground level,\nand the maximum illumination at ground level shall not be in excess\nof three footcandles. All lighting shall require Planning Board approval."
																		}
																	]
																},
																{
																	"number": "(2) ",
																	"content": [
																		{
																			"text": "Indirect glare. \"Indirect glare\" is defined, for the\npurpose of this Code, as illumination beyond property lines caused\nby diffuse reflection from a surface such as a wall or roof of a structure.\nIndirect glare shall not exceed that value which is produced by an\nillumination of the reflecting surface not to exceed 0.3 footcandle\n(maximum) and 0.1 footcandle (average). Deliberately induced sky-reflected\nglare, as by casting a beam upward for advertising purposes, is specifically\nprohibited. All lighting shall require Planning Board approval."
																		}
																	]
																}
															]
														}
													]
												},
												{
													"number": "J. ",
													"content": [
														{
															"text": "Nonradioactive liquid or solid wastes. There shall\nbe no discharge at any point into any public or private sewage disposal\nsystem or stream or into the ground of any liquid or solid materials,\nexcept in accordance with applicable regulations of Nassau County.\nAll uses having any such discharge must furnish certification by the\nCounty Health Department as to their composition and condition."
														}
													]
												},
												{
													"number": "K. ",
													"content": [
														{
															"text": "Trash, garbage and debris. All trash, garbage and\ndebris areas shall be suitably screened as not to be objectionable\nto neighboring uses. All trash, garbage and debris shall be periodically\nremoved to avoid accumulation. All commercial and industrial uses\nshall require certification by a suitable collector that a periodic\npickup will be implemented. All collection bins shall be identified\nconspicuously with the name and telephone number of the owner and\ncarter."
														}
													]
												}
											]
										},
										{
											"footnote": "[1]\nEditor's Note: See also Ch. 99, Nuisances.\n"
										}
									]
								},
								{
									"paragraph": "§ 155-53",
									"title": "Signs.",
									"content": [
										{
											"content": [
												{
													"number": "A. ",
													"content": [
														{
															"text": "Purpose. The Board of Trustees recognizes the highly\nsignificant role signage plays in the image the Village presents to\nresidents and visitors alike. The purpose of this section is to improve\nand perpetuate the attractive nautical appearance and tranquil image\nof the Village of Manorhaven and to promote and protect public health,\nwelfare and safety by regulating signs of all types. It is intended\nto create attractive signage to protect property values, to enhance\nthe aesthetic character of buildings and sites, to preserve scenic\nand natural beauty, to prevent distractions and obstructions that\nmay contribute to traffic accidents, and to limit the use of energy\nin sign design, construction and operation."
														}
													]
												},
												{
													"number": "B. ",
													"content": [
														{
															"text": "Definitions. As used in this section, the following\nterms shall have the meanings indicated:"
														}
													]
												},
												{
													"number": "C. ",
													"content": [
														{
															"text": "Permitted sign defined and regulated."
														},
														{
															"content": [
																{
																	"number": "(1) ",
																	"content": [
																		{
																			"text": "General."
																		},
																		{
																			"content": [
																				{
																					"number": "(a) ",
																					"content": [
																						{
																							"text": "Each business establishment shall be permitted\na maximum of two signs. Permitted signs may be wall, ground, window\nor awning. Only one of these permitted signs may be a ground sign.\nThe combined total area of all signs shall not exceed an area of one\nfoot times the width of the storefront of the building and shall not\nbe larger than 16 square feet in the C-1, C-2, C-3 and E-1 Zoning\nDistricts."
																						}
																					]
																				},
																				{
																					"number": "(b) ",
																					"content": [
																						{
																							"text": "Permitted signs may identify the person, establishment\nor the product and/or service available on the premises which contains\nthe sign. All signs shall be an accessory use and permitted only as\nprovided for in this section."
																						}
																					]
																				},
																				{
																					"number": "(c) ",
																					"content": [
																						{
																							"text": "Any sign erected or authorized by the Village,\ntown, county, state or other governmental authority, including all\nsigns pertaining to traffic regulations, parking regulations, fire\nzones and petroleum price signs which are subject to the rules and\nregulations of the New York State Vehicle and Traffic Law shall be\nexempt from the provisions of this section, except where maximum size,\nlettering, color, exact on-site location are not specifically determined\nby the law permitting the sign."
																						}
																					]
																				},
																				{
																					"number": "(d) ",
																					"content": [
																						{
																							"text": "A residential condominium, cooperative, apartment\nhouse or two-family dwelling shall be entitled to one directory sign."
																						}
																					]
																				}
																			]
																		}
																	]
																},
																{
																	"number": "(2) ",
																	"content": [
																		{
																			"text": "Address sign: a sign containing either the name of the occupants and/or the street address. The sign may not exceed one square foot in area; may be attached to the building or on a post not more than four feet high and set within the property boundaries. No permit is required for residential use nor is any fee required for the street address number required by Chapter 155 of the Code."
																		}
																	]
																},
																{
																	"number": "(3) ",
																	"content": [
																		{
																			"text": "Announcement sign: a temporary sign of a commercial\nor noncommercial nature not to exceed two weeks. No more than one\nannouncement sign about the same activity shall be permitted. Such\nsign shall not be larger than 18 inches by 24 inches and may not be\nplaced on the window or outside the building. No permit is required."
																		}
																	]
																},
																{
																	"number": "(4) ",
																	"content": [
																		{
																			"text": "Awning sign: a sign painted on an awning attached\nto a building."
																		},
																		{
																			"content": [
																				{
																					"number": "(a) ",
																					"content": [
																						{
																							"text": "The awning shall be made of fire-retardant material.\nNo vinyl or plastic."
																						}
																					]
																				},
																				{
																					"number": "(b) ",
																					"content": [
																						{
																							"text": "On the bottom edge of the front of the awning,\none row of letters, not higher than six inches covering not more than\neight feet in width, or 50% of the awning width, whichever is less."
																						}
																					]
																				},
																				{
																					"number": "(c) ",
																					"content": [
																						{
																							"text": "No description of products or services, addresses\nor telephone numbers are permitted."
																						}
																					]
																				},
																				{
																					"number": "(d) ",
																					"content": [
																						{
																							"text": "Awning lettering and graphics shall be debited\nagainst the total permitted combined sign area."
																						}
																					]
																				},
																				{
																					"number": "(e) ",
																					"content": [
																						{
																							"text": "The minimum height between the sidewalk or ground\nlevel and the bottom of the awning shall be seven feet."
																						}
																					]
																				},
																				{
																					"number": "(f) ",
																					"content": [
																						{
																							"text": "Awnings may not be backlit."
																						}
																					]
																				}
																			]
																		}
																	]
																},
																{
																	"number": "(5) ",
																	"content": [
																		{
																			"text": "Commercial establishments limited to a second floor.\nSuch businesses shall be entitled to one nameplate at the ground floor\naccess, not exceeding two square feet in area and one of the following\nsigns, the area of which shall be deducted from the total permitted\ncombined sign area of the commercial structure on which it is located:"
																		},
																		{
																			"content": [
																				{
																					"number": "(a) ",
																					"content": [
																						{
																							"text": "Not more than one window sign in second floor,\nor"
																						}
																					]
																				},
																				{
																					"number": "(b) ",
																					"content": [
																						{
																							"text": "One wall sign affixed to the second floor exterior\nof the building or structure which faces a public thoroughfare, nonilluminated\nand not exceeding an area of one foot times the width of the premises\nactually utilized by the business establishment on that floor."
																						}
																					]
																				}
																			]
																		}
																	]
																},
																{
																	"number": "(6) ",
																	"content": [
																		{
																			"text": "Construction sign: a temporary sign at a construction\nsite on which construction is actually taking place identifying the\ncontractor, subcontractor and/or architect with only name and phone\nnumber."
																		},
																		{
																			"content": [
																				{
																					"number": "(a) ",
																					"content": [
																						{
																							"text": "When a construction site has a building permit\ndisplayed in full view, two construction signs shall be allowed. Such\nsigns may only contain the name and telephone number of the contractors,\nsubcontractors or architects."
																						}
																					]
																				},
																				{
																					"number": "(b) ",
																					"content": [
																						{
																							"text": "The sign area for each sign shall not exceed\nfour square feet. The height of each sign shall not exceed four feet\nabove finished grade or, if there is no finished grade, the sign shall\nbe no higher than four feet above the grade of the street on which\nthe property is located. The sign shall be placed parallel to the\nstreet and be set back at least 20 feet from the property line."
																						}
																					]
																				},
																				{
																					"number": "(c) ",
																					"content": [
																						{
																							"text": "No permit is needed for a construction sign.\nHowever, the Building Inspector shall have the right to remove any\nillegal construction sign with or without notice."
																						}
																					]
																				},
																				{
																					"number": "(d) ",
																					"content": [
																						{
																							"text": "Construction signs shall be removed within five\ndays of the date of the following:"
																						},
																						{
																							"content": [
																								{
																									"number": "[1] ",
																									"content": [
																										{
																											"text": "Expiration of the building permit."
																										}
																									]
																								},
																								{
																									"number": "[2] ",
																									"content": [
																										{
																											"text": "The last day the contractor, subcontractor or\narchitect completes the work for which the contractor, subcontractor\nor architect was employed."
																										}
																									]
																								},
																								{
																									"number": "[3] ",
																									"content": [
																										{
																											"text": "The certificate of occupancy/compliance has\nbeen issued."
																										}
																									]
																								}
																							]
																						}
																					]
																				}
																			]
																		}
																	]
																},
																{
																	"number": "(7) ",
																	"content": [
																		{
																			"text": "Directory sign: a sign containing the name of a business\nestablishment located within a complex or group of commercial establishments\nwhich is obscured from the main thoroughfare or the names of the residents\nof a condominium, cooperative, apartment house or two-family dwelling."
																		},
																		{
																			"content": [
																				{
																					"number": "(a) ",
																					"content": [
																						{
																							"text": "Where a business establishment within a complex\nor group of commercial establishments is obscured from ready exposure\nto a main thoroughfare, one directory ground sign or one directory\nwall sign may be permitted for such complex."
																						}
																					]
																				},
																				{
																					"number": "(b) ",
																					"content": [
																						{
																							"text": "Any business listed on a directory sign shall\nbe entitled to only one other sign, and the sign area shall be debited\nfrom the permitted combined sign area."
																						}
																					]
																				},
																				{
																					"number": "(c) ",
																					"content": [
																						{
																							"text": "Directory ground sign. The maximum area shall\nbe four square feet. The sign may be double faced and only one side\nused to compute the sign area. If the distance between the faces at\nany point on the faces exceeds 12 inches, both faces shall be used\nto compute the area. The maximum height shall be no more than six\nfeet measured vertically from the average finished grade at the base\nof the sign, not from any planter. The setback from a property line\nshall be at least five feet."
																						}
																					]
																				},
																				{
																					"number": "(d) ",
																					"content": [
																						{
																							"text": "Directory wall sign. The maximum area shall\nbe two square feet; four square feet for two or more businesses."
																						}
																					]
																				}
																			]
																		}
																	]
																},
																{
																	"number": "(8) ",
																	"content": [
																		{
																			"text": "Ground sign: a freestanding sign attached to a structure\nintended and designed to support the sign and which is embedded in\nthe ground."
																		},
																		{
																			"content": [
																				{
																					"number": "(a) ",
																					"content": [
																						{
																							"text": "Set back from building. A ground sign shall\nbe permitted only if the building it serves to identify is set back\nmore than 40 feet from the street line and if the sign is located\nat least 10 feet from the building and set back at least 15 feet from\nthe property line."
																						}
																					]
																				},
																				{
																					"number": "(b) ",
																					"content": [
																						{
																							"text": "Size of lettering. Ground signs in the C-1,\nC-2, C-3 and E-1 Zoning Districts shall not exceed 10 inches in height;\nin all other zoning districts, 12 inches in height."
																						}
																					]
																				},
																				{
																					"number": "(c) ",
																					"content": [
																						{
																							"text": "Area. The maximum area shall not exceed eight\nsquare feet in the C-1, C-2, C-3 and E-1 Zoning Districts. Any ground\nsign may be double-faced and only one face shall be used in computing\nsign area unless the distance between the faces, at any point on the\nfaces, exceeds 12 inches, in which event, both faces shall be used\nto determine the sign area."
																						}
																					]
																				},
																				{
																					"number": "(d) ",
																					"content": [
																						{
																							"text": "Height shall be measured vertically from the average finished grade at the base of the sign. Planters shall not be used to circumvent the intent of this section. The maximum height shall not exceed six feet. The height of signs placed on corner lots shall be regulated by § 155-53 of the Village Code."
																						}
																					]
																				}
																			]
																		}
																	]
																},
																{
																	"number": "(9) ",
																	"content": [
																		{
																			"text": "Hanging sign: a sign projecting from a wall."
																		},
																		{
																			"content": [
																				{
																					"number": "(a) ",
																					"content": [
																						{
																							"text": "Any business whose main entrance is not located\non a through street may have one hanging sign, not to exceed a maximum\nof four square feet."
																						}
																					]
																				},
																				{
																					"number": "(b) ",
																					"content": [
																						{
																							"text": "Such hanging sign shall not project from the\nstructure more than three feet and shall be secured to the structure\nby a metal bracket."
																						}
																					]
																				},
																				{
																					"number": "(c) ",
																					"content": [
																						{
																							"text": "The minimum height between the sidewalk or ground\nlevel and the bottom of the sign shall be seven feet."
																						}
																					]
																				},
																				{
																					"number": "(d) ",
																					"content": [
																						{
																							"text": "Any business using a hanging sign shall be entitled\nto only one additional sign, and the square footage of the hanging\nsign shall be debited against the total permitted combined sign area\nfor the building."
																						}
																					]
																				}
																			]
																		}
																	]
																},
																{
																	"number": "(10) ",
																	"content": [
																		{
																			"text": "Home occupation sign: a sign which identifies\nonly the name and/or occupation or profession of one conducting a\npermitted home occupation or profession in a dwelling. Such sign shall\nnot exceed one square foot in area and shall be set back according\nto either the ground sign or wall sign specifications."
																		}
																	]
																},
																{
																	"number": "(11) ",
																	"content": [
																		{
																			"text": "Information sign: a sign which contains information\nintended exclusively as a public service and of a noncommercial nature,\nsuch as the location of facilities designed for public convenience\nand accommodation, including but not limited to \"rest room,\" \"entrance,\"\n\"exit,\" \"open\" or \"closed\" Such signs shall be one square foot or\nless in area and contain no commercial copy. No permit is required."
																		}
																	]
																},
																{
																	"number": "(12) ",
																	"content": [
																		{
																			"text": "Landmark sign: an older sign of artistic or\nhistoric merit, uniqueness or extraordinary significance to the Village\nas identified by the Board of Trustees."
																		}
																	]
																},
																{
																	"number": "(13) ",
																	"content": [
																		{
																			"text": "Real estate broker/agent or owner \"For Sale\"\nand \"For Rent” signs: on-premise signs advertising the property\nbeing sold or rented."
																		},
																		{
																			"content": [
																				{
																					"number": "(a) ",
																					"content": [
																						{
																							"text": "One \"For Sale\" or \"For Rent\" sign is permitted\nper lot or parcel of land facing a public street or right-of-way."
																						}
																					]
																				},
																				{
																					"number": "(b) ",
																					"content": [
																						{
																							"text": "The sign area shall be 12 inches high by 18\ninches wide. Such signs may only contain the name and telephone number\nof a real estate agency/brokerage or owner and the words \"For Sale\"\nand/or \"For Rent.\""
																						}
																					]
																				},
																				{
																					"number": "(c) ",
																					"content": [
																						{
																							"text": "The sign shall be of single post-and-arm construction.\nThe arm shall not exceed 19 inches in length. The post shall not exceed\nfive feet in length."
																						}
																					]
																				},
																				{
																					"number": "(d) ",
																					"content": [
																						{
																							"text": "The maximum sign height shall not exceed four\nfeet above finished grade or four feet above the grade of the street\non which the property is located. The sign shall be set back a minimum\nof 25 feet from the property line and a minimum of 10 feet from the\nbuilding. The sign shall only be placed parallel to the street."
																						}
																					]
																				},
																				{
																					"number": "(e) ",
																					"content": [
																						{
																							"text": "If the \"For Sale\" and \"For Rent\" sign is placed\non the property by the real estate broker/agent, a written sign consent\npermitting such sign executed by the property owner shall be filed\nwith the Building Inspector prior to the placement of the sign on\nthe property."
																						}
																					]
																				},
																				{
																					"number": "(f) ",
																					"content": [
																						{
																							"text": "The property owner may revoke the consent at\nany time by filing written revocation with the Building Inspector."
																						}
																					]
																				},
																				{
																					"number": "(g) ",
																					"content": [
																						{
																							"text": "If the \"For Sale\" and/or \"For Rent” has\nbeen placed upon the property by the real estate agency/brokerage,\nthe real estate agency/brokerage shall remove the sign within five\ndays of the following:"
																						},
																						{
																							"content": [
																								{
																									"number": "[1] ",
																									"content": [
																										{
																											"text": "The termination date of the consent or the revocation\ndate of the consent."
																										}
																									]
																								},
																								{
																									"number": "[2] ",
																									"content": [
																										{
																											"text": "The transfer of title to the property due to\na sale."
																										}
																									]
																								},
																								{
																									"number": "[3] ",
																									"content": [
																										{
																											"text": "The execution of a rental lease."
																										}
																									]
																								},
																								{
																									"number": "[4] ",
																									"content": [
																										{
																											"text": "The removal of the property from the market\nfor rental, sale, or both."
																										}
																									]
																								}
																							]
																						}
																					]
																				},
																				{
																					"number": "(h) ",
																					"content": [
																						{
																							"text": "If the \"For Sale\" and/or \"For Rent” has\nbeen placed upon the property by the owner, the owner shall remove\nthe sign within five days of the following:"
																						},
																						{
																							"content": [
																								{
																									"number": "[1] ",
																									"content": [
																										{
																											"text": "The transfer of title to the property due to\na sale."
																										}
																									]
																								},
																								{
																									"number": "[2] ",
																									"content": [
																										{
																											"text": "The execution of a rental lease."
																										}
																									]
																								},
																								{
																									"number": "[3] ",
																									"content": [
																										{
																											"text": "The removal of the property from the market\nfor rental, sale, or both."
																										}
																									]
																								}
																							]
																						}
																					]
																				},
																				{
																					"number": "(i) ",
																					"content": [
																						{
																							"text": "\"Sold\" or \"In Contract\" real estate signs are\nprohibited in all districts. No owner or real estate agency/brokerage\n\"For Sale\" or \"For Rent\" signs shall be placed on any part of a lot\nfacing the water, golf course or public open space."
																						}
																					]
																				}
																			]
																		}
																	]
																},
																{
																	"number": "(14) ",
																	"content": [
																		{
																			"text": "Wall sign: a sign which is painted on, incorporated\ninto or affixed parallel to the exterior surface of a building."
																		},
																		{
																			"content": [
																				{
																					"number": "(a) ",
																					"content": [
																						{
																							"text": "Wall signs shall be set in at least one foot\nfrom each end of the front wall of the establishment and extend not\nmore than six inches from the surface of that building."
																						}
																					]
																				},
																				{
																					"number": "(b) ",
																					"content": [
																						{
																							"text": "Size of lettering of wall signs in C-1, C-2,\nC-3 and E-1 Zoning Districts shall not exceed 10 inches in height;\nin all other zoning districts, the size of the lettering shall not\nexceed 12 inches in height."
																						}
																					]
																				}
																			]
																		}
																	]
																},
																{
																	"number": "(15) ",
																	"content": [
																		{
																			"text": "Window sign: any sign which is painted or mounted\nonto a window pane or which is hung within 12 inches of the window\nwith the purpose or effect of identifying the premises from the sidewalk\nor street."
																		},
																		{
																			"content": [
																				{
																					"number": "(a) ",
																					"content": [
																						{
																							"text": "Area: a window sign shall not exceed eight inches\ntimes the width of the window to which it is attached and shall not\nexceed more than 25% of the window area, or 10% of the glass area\nof any required exit door."
																						}
																					]
																				},
																				{
																					"number": "(b) ",
																					"content": [
																						{
																							"text": "Size of lettering height shall be no more than\n10 inches high and must be painted on or attached directly and permanently"
																						}
																					]
																				},
																				{
																					"number": "(c) ",
																					"content": [
																						{
																							"text": "Non-temporary signs hung inside windows shall\nbe made of clear materials such as Plexiglas with lettering painted\non them."
																						}
																					]
																				},
																				{
																					"number": "(d) ",
																					"content": [
																						{
																							"text": "Window signs indicating hours of operation,\nbusiness affiliations, emergency information and the like (excluding\nproduct or service information) are permitted, provided that the aggregate\narea of all such signs for a single business does not exceed one square\nfoot per entrance and that bright or fluorescent colors not be used."
																						}
																					]
																				}
																			]
																		}
																	]
																}
															]
														}
													]
												},
												{
													"number": "D. ",
													"content": [
														{
															"text": "Prohibited signs defined. Any sign not specifically\npermitted is prohibited and shall be removed within the time specified\nby the Building Inspector. Prohibited signs shall include but not\nbe limited to:"
														},
														{
															"content": [
																{
																	"number": "(1) ",
																	"content": [
																		{
																			"text": "Illegal signs: signs which have been constructed,\nerected, installed, placed in use and/or maintained which do not conform\nto the provisions of this section."
																		}
																	]
																},
																{
																	"number": "(2) ",
																	"content": [
																		{
																			"text": "Any sign designated, constructed or located in such\na manner so that it is not physically attached to a building or set\ninto the ground in accordance with the Building Code and/or is not\nin compliance with the provisions of this section."
																		}
																	]
																},
																{
																	"number": "(3) ",
																	"content": [
																		{
																			"text": "Any sign of a commercial nature located on a parcel\nof property used for residential purposes in any residential district,\nexcept a permitted home occupation sign."
																		}
																	]
																},
																{
																	"number": "(4) ",
																	"content": [
																		{
																			"text": "Revolving, moving, sound-producing or animated signs,\nincluding signs which have the capability of motion in whole or in\npart, including pinwheels, pennants, balloons and banners. Signs which\ndisplay temperature and/or time exclusively are permitted."
																		}
																	]
																},
																{
																	"number": "(5) ",
																	"content": [
																		{
																			"text": "Signs utilizing reflective and/or fluorescent paint\nor reflective and/or fluorescent materials."
																		}
																	]
																},
																{
																	"number": "(6) ",
																	"content": [
																		{
																			"text": "The outlining by direct illumination, including neon\nlighting, of and affixed to all or any part of the exterior of a building\nor structure, including but not limited to a gable, roof, side, wall,\nwindow, corner or sign, or affixed to the interior part of a window,\ndoor, entrance or exit, except for any lighting typically representative\nof the festive atmosphere limited to a given holiday period, but under\nno circumstances more than 45 days during a calendar year."
																		}
																	]
																},
																{
																	"number": "(7) ",
																	"content": [
																		{
																			"text": "Signs placed so that they or any part of them project\nabove the eave line of the pitched roof of any building, or the roofline\non a gable end, or the top parapet line of the flat roof of any building."
																		}
																	]
																},
																{
																	"number": "(8) ",
																	"content": [
																		{
																			"text": "Any sign painted, erected, affixed or maintained on\na light or utility pole, trash container, stone, tree or other natural\nobject or on the face of another sign."
																		}
																	]
																},
																{
																	"number": "(9) ",
																	"content": [
																		{
																			"text": "Signs which cover architectural details, such as,\nbut not limited to, arches, sills, moldings, cornices and transom\nwindows."
																		}
																	]
																},
																{
																	"number": "(10) ",
																	"content": [
																		{
																			"text": "Signs made of paper, cardboard, cloth or similar\ntemporary materials affixed to the glass of windows or doors, except\nfor signs announcing a charitable or nonprofit event."
																		}
																	]
																},
																{
																	"number": "(11) ",
																	"content": [
																		{
																			"text": "Billboards: signs which direct attention to\na business, commercial activity, commodity, service or entertainment\nattraction offered elsewhere than upon the same lot where such signs\nare displayed or if such activity is only incidentally on such lot."
																		}
																	]
																},
																{
																	"number": "(12) ",
																	"content": [
																		{
																			"text": "Flashing signs: illuminated signs on which the\nartificial source of light is not maintained stationary or constant\nin intensity or color at all times."
																		}
																	]
																},
																{
																	"number": "(13) ",
																	"content": [
																		{
																			"text": "Illuminated signs on vending machines or equipment."
																		}
																	]
																},
																{
																	"number": "(14) ",
																	"content": [
																		{
																			"text": "Internally illuminated signs: signs where the\nsource of the illumination is inside the sign and light emanates through\nthe message of the sign, rather than being reflected off the surface\nof the sign from an external source."
																		}
																	]
																},
																{
																	"number": "(15) ",
																	"content": [
																		{
																			"text": "Mobile signs: signs that are capable of being\nmoved by any means without any structural alterations, including signs\non a trailer if said trailer is located in a stationary position on\na lot for more than four days and the trailer is in open view of any\nroad or public right-of-way."
																		}
																	]
																},
																{
																	"number": "(16) ",
																	"content": [
																		{
																			"text": "Murals: abstract or pictorial representation,\nincluding but not limited to trompe l'oeil and fresco, that is displayed,\npainted on or affixed to a building, structure, wall or fence."
																		}
																	]
																},
																{
																	"number": "(17) ",
																	"content": [
																		{
																			"text": "Neon signs: signs consisting of tubular arrangement\ncontaining a rarefied gas which, when permeated by electric charge,\ncauses the production of light. Exterior neon signs and interior neon\nsigns containing any letter, word, model, banner, pennant insignia,\ndevice, trade flag or graphic representation which are affixed to\na window, door, exterior wall or are located within five feet of a\nwindow, door, exterior wall or other opening to the exterior."
																		}
																	]
																},
																{
																	"number": "(18) ",
																	"content": [
																		{
																			"text": "Pylon or pole signs: signs attached to a single\npole or pylon that is set into the ground."
																		}
																	]
																},
																{
																	"number": "(19) ",
																	"content": [
																		{
																			"text": "Sandwich signs: freestanding signs consisting\nof two signs attached to each other at the top."
																		}
																	]
																},
																{
																	"number": "(20) ",
																	"content": [
																		{
																			"text": "Triple-faced or triangular faced signs."
																		}
																	]
																},
																{
																	"number": "(21) ",
																	"content": [
																		{
																			"text": "Tubular signs: signs consisting all or in part\nof a tubular arrangement directly lit by lighting which is a structural\npart thereof."
																		}
																	]
																}
															]
														}
													]
												},
												{
													"number": "E. ",
													"content": [
														{
															"text": "General standards."
														},
														{
															"content": [
																{
																	"number": "(1) ",
																	"content": [
																		{
																			"text": "Design guidelines."
																		},
																		{
																			"content": [
																				{
																					"number": "(a) ",
																					"content": [
																						{
																							"text": "Color. In selecting the principal colors for\na sign, colors which are in harmony with the general tone of the building\nshould be chosen. The use of muted and earth-tone colors with a matte\nfinish are strongly encouraged."
																						}
																					]
																				},
																				{
																					"number": "(b) ",
																					"content": [
																						{
																							"text": "Materials. Sign materials should be consistent\nwith and complement the original construction materials and architectural\nstyle of the building on which they are to be displayed. Signs shall\nbe made of wood or metal."
																						}
																					]
																				},
																				{
																					"number": "(c) ",
																					"content": [
																						{
																							"text": "Lettering. Lettering styles should complement\nthe style and period of the building on which they appear."
																						}
																					]
																				}
																			]
																		}
																	]
																},
																{
																	"number": "(2) ",
																	"content": [
																		{
																			"text": "Sign illumination. Illumination of signs shall be\naccomplished by means of shielded, direct, external, low-intensity\nlight sources and in such a manner that no glare shall extend beyond\nthe property lines or disturb the vision of passing motorists or constitute\na hazard to traffic."
																		}
																	]
																},
																{
																	"number": "(3) ",
																	"content": [
																		{
																			"text": "Maintenance. All signs and the lots on which they\nare placed shall be maintained in such a manner that said signs are\nvisually unobstructed and plainly legible. Illegible and/or improperly\nmaintained signs, such as, but not limited to, signs that are unsound\nstructurally, unsafe or hazardous to the public, shall be deemed abandoned,\nshall become prohibited and shall be removed, if necessary, by the\nBuilding Inspector and at the owner's expense."
																		}
																	]
																},
																{
																	"number": "(4) ",
																	"content": [
																		{
																			"text": "Nonconforming sign."
																		},
																		{
																			"content": [
																				{
																					"number": "(a) ",
																					"content": [
																						{
																							"text": "Legal nonconforming sign. A sign for which a\npermit was issued by the Village of Manorhaven in the 18 months prior\nto the enactment of this section. A legal nonconforming sign shall\nnot be reestablished if such sign has been discontinued or abandoned."
																						}
																					]
																				},
																				{
																					"number": "(b) ",
																					"content": [
																						{
																							"text": "Nonconforming sign. A sign for which a permit\nhas not been issued and which was constructed, installed and/or placed\nin use after September 11, 2001, which does not conform to the provisions\nhereof shall be a nonconforming sign. A nonconforming sign shall either\nbe changed to a conforming sign and a permit issued or shall be removed."
																						}
																					]
																				},
																				{
																					"number": "(c) ",
																					"content": [
																						{
																							"text": "Written notice of the nonconforming status of\na sign shall be sent by certified mail to the owner of record of the\nproperty on which the sign is located. The owner or tenant/occupant\nshall have the option, upon receipt of the notice, to either remove\nthe sign within 30 days of the date the notice was received or, within\n30 days of the date the notice was received, apply to the Zoning Board\nof Appeals for an extension of time to remove the sign. If an application\nis filed with the Zoning Board of Appeals for an extension of time\nto remove the sign, the applicant must establish that the original\nadjusted capital investment of the sign has not been fully amortized.\nAny extension by the Board of Appeals shall be for the period necessary\nfor the applicant to fully amortize the original adjusted capital\ninvestment. \"Original adjusted capital investment,\" as used herein,\nis defined as the original cost of the sign, including installation\ncosts less all depreciation previously taken for tax purposes. The\noriginal adjusted capital investment shall be amortized at the rate\nof $2,000 per year, commencing five years from the date the sign was\noriginally installed."
																						}
																					]
																				}
																			]
																		}
																	]
																}
															]
														}
													]
												},
												{
													"number": "F. ",
													"content": [
														{
															"text": "Administration."
														},
														{
															"content": [
																{
																	"number": "(1) ",
																	"content": [
																		{
																			"text": "Sign permits."
																		},
																		{
																			"content": [
																				{
																					"number": "(a) ",
																					"content": [
																						{
																							"text": "No sign shall be erected or displayed or any\nlawfully existing sign moved, altered, redesigned or enlarged until\nan application has been filed for each sign, an application fee paid\nto the Village Clerk for each sign and until a permit has been issued\nby the Building Inspector. Applications shall be on forms prescribed\nby the Building Inspector."
																						}
																					]
																				},
																				{
																					"number": "(b) ",
																					"content": [
																						{
																							"text": "Whenever a new building shall be erected or\na new business shall be established in a location on which any sign\ntheretofore has been placed, any sign permit previously issued for\nsaid sign shall be deemed revoked, and a new application for said\nsign shall be made to the Building Inspector."
																						}
																					]
																				},
																				{
																					"number": "(c) ",
																					"content": [
																						{
																							"text": "At a minimum, all applications shall include\na plan, in duplicate, showing a scale drawing of proposed sign, specifying\ndimensions, materials, illumination if any, letter sizes, colors,\nsupport systems and location of the proposed sign on the building\nor land, along with photographs of the building and land. Upon approval,\none copy will be returned to the applicant. If the applicant is not\nthe owner of the property, there must be written authorization and\nplan approval by the owner."
																						}
																					]
																				},
																				{
																					"number": "(d) ",
																					"content": [
																						{
																							"text": "All signs require Architectural Review Board\napproval before a permit is issued, except address signs, announcement\nsigns or information signs and \"For Sale\" or \"For Lease\" and construction\nsigns if they comply with the provisions hereof. Where there is an\napplication for a sign in a complex of two or more businesses, the\nArchitectural Review Board may request a sign plan for the whole complex."
																						}
																					]
																				},
																				{
																					"number": "(e) ",
																					"content": [
																						{
																							"text": "Real estate brokers shall apply yearly for a\nsign permit for all of said real estate brokers' signs which comply\nwith the provisions of this section. The permit shall be effective\nfrom May 1 to April 30 of each year."
																						}
																					]
																				},
																				{
																					"number": "(f) ",
																					"content": [
																						{
																							"text": "Real estate \"For Sale\" or \"For Lease\" signs\nplaced on the property by the owner shall require a permit and shall\ncomply with all of the provisions of this section."
																						}
																					]
																				},
																				{
																					"number": "(g) ",
																					"content": [
																						{
																							"text": "Permits shall be issued only if the Building\nInspector determines the sign complies or will comply with all applicable\nprovisions of this section, including method of attachment and adequate\nmaterials, and there is Architectural Review Board approval."
																						}
																					]
																				}
																			]
																		}
																	]
																},
																{
																	"number": "(2) ",
																	"content": [
																		{
																			"text": "Sign application fees. A schedule of fees for such\npermits may be established and amended from time to time by the Board\nof Trustees."
																		}
																	]
																}
															]
														}
													]
												},
												{
													"number": "G. ",
													"content": [
														{
															"text": "Enforcement."
														},
														{
															"content": [
																{
																	"number": "(1) ",
																	"content": [
																		{
																			"text": "The Building Inspector or Code Enforcement Officer\nis hereby designated to enforce this section."
																		}
																	]
																},
																{
																	"number": "(2) ",
																	"content": [
																		{
																			"text": "Concurrent jurisdiction of Building Inspector. Any\npower or authority of the Building Inspector hereunder shall be also\nbe subject to exercise by the Code Enforcement Officer; the approval\nof either shall be sufficient and the act of either shall be equivalent\nto the act of the other."
																		}
																	]
																},
																{
																	"number": "(3) ",
																	"content": [
																		{
																			"text": "Inspection. Every attached, ground, window or awning\nsign, upon installation, shall be subject to inspection by the Building\nInspector."
																		}
																	]
																},
																{
																	"number": "(4) ",
																	"content": [
																		{
																			"text": "Signs located on public property or rights-of-way\nmay be peremptorily removed by the Building Department, Highway Department\nor Police Department."
																		}
																	]
																},
																{
																	"number": "(5) ",
																	"content": [
																		{
																			"text": "Any sign which has been ordered removed by the Building\nInspector or is abandoned or discontinued shall be removed by the\nperson, firm or corporation responsible for the sign within 10 days\nof written notice to remove."
																		}
																	]
																},
																{
																	"number": "(6) ",
																	"content": [
																		{
																			"text": "Upon failure to comply with such notice, the Board\nof Trustees may cause such sign to be removed at the property owner's\nexpense."
																		}
																	]
																},
																{
																	"number": "(7) ",
																	"content": [
																		{
																			"text": "Real estate \"For Sale\" or \"For Rent”signs which\ndo not have a permit or have not had a letter of owner authorization\nor if the permit or letter of authorization has been revoked or expired,\n\"Sold\" or \"In Contract\" real estate signs and illegal construction\nsigns shall be removed by any Village Enforcement Officer immediately\nwithout notice."
																		}
																	]
																},
																{
																	"number": "(8) ",
																	"content": [
																		{
																			"text": "Any sign prohibited by Subsection D hereof or any temporary, announcement or political sign that is in violation of the provisions of this section and which are not permanently affixed to the ground, building or structure shall be removed by any Village Enforcement Officer immediately without notice."
																		}
																	]
																}
															]
														}
													]
												},
												{
													"number": "H. ",
													"content": [
														{
															"text": "Severability. If any section, subsection, phrase,\nsentence or other portion of this section is for any reason held invalid\nor unconstitutional by any court of competent jurisdiction, such portion\nshall be deemed a separate, distinct and independent provision, and\nsuch holding shall not affect the validity of remaining portions hereof."
														}
													]
												},
												{
													"number": "I. ",
													"content": [
														{
															"text": "Interpretation and application. In their interpretation\nand application, the provisions of this section shall be held to minimum\nrequirements. It is not intended to interfere with or abrogate or\nannul any other Village regulations or ordinances. Whenever the requirements\nof this section are at variance with the requirements of any other\nlawfully adopted regulation, rule or ordinance, the most restrictive\nor those which impose the highest standards shall govern."
														}
													]
												}
											]
										}
									]
								},
								{
									"paragraph": "§ 155-54",
									"title": "Garages.",
									"content": [
										{
											"text": "A garage erected as accessory to a story-and-one-half\nbuilding should not be higher than 75% of the height of such main\nbuilding, and, if erected as accessory to a two-story main building,\nit shall not be higher than 60% of the height of such main building.\nThe minimum interior dimension of such garage shall be eight feet\nby 18 feet."
										}
									]
								},
								{
									"paragraph": "§ 155-55",
									"title": "Air structures.",
									"content": [
										{
											"text": "Buildings supported by air and enclosed or encapsulated\nwith any inflatable or supportable skin, with or without cables, are\nnot permitted."
										}
									]
								},
								{
									"paragraph": "§ 155-56",
									"title": "Prefabricated or preengineered structures.",
									"content": [
										{
											"content": [
												{
													"number": "A. ",
													"content": [
														{
															"text": "Buildings of preengineered or prefabricated metal\nskins shall be prohibited in any commercial or industrial district."
														}
													]
												},
												{
													"number": "B. ",
													"content": [
														{
															"text": "Buildings of premanufactured use or prior trailers\nor tractor trailers shall be prohibited in any commercial or industrial\ndistrict."
														}
													]
												}
											]
										}
									]
								}
							]
						}
					]
				}
			]
		}
	]
}