{
	"url": "http://ecode360.com/6966594",
	"paras": [
	    {
			"paragraph": "ยง 155-16",
			"title": "R-4 Zone.",
			"content": [
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "Multiple-dwelling units shall conform to the following\nregulations:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "All multiple dwellings that exist shall be permitted, and any reconstruction or alteration due necessary because of artificial or natural damages shall be permitted in accordance with the regulations of Subsection B of this section."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "New multiple dwellings shall be permitted only in the R-4 Zoning District, provided the units conform to the regulations in Subsection B of this section and the additional parking requirements of Subsection A(4) herein."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "This regulation prohibits multiple dwellings in any\nother zone of the Village."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "If an existing multiple dwelling is reconstructed\nor is altered after the adoption of this chapter, on-site parking\nof two spaces per dwelling unit shall be provided."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "All multiple dwellings shall conform to the following\nregulations:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "No apartment house shall be more than two stories\nin height with a maximum height of 28 feet to the highest point, as\nmeasured from the established grade of the street adjoining the property."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "The minimum lot area for an apartment house shall\nbe 1,500 square feet per family and shall not contain more than 20\napartments."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "The building area shall not exceed 35% of the lot\narea."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "Off-street parking facilities sufficient to accommodate\none automobile per tenant shall be provided, which may consist of\nan accessory garage building or a combination of garage buildings\nand outdoor parking space. At least 50% of such parking facilities\nshall be garage space."
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "Transient parking space shall also be provided at\nthe rate of one car space for each five tenants; such area devoted\nto this use shall be considered as not occupied by construction in\ndetermining percentages of occupancy of lot area. A parking building\nshall not exceed 15 feet in height, nor shall it exceed more than\none floor."
												}
											]
										},
										{
											"number": "(6) ",
											"content": [
												{
													"text": "All areas available for off-street parking and access\ndriveways shall be surfaced in accordance with the following specifications:\nnot less than two inches of broken stone after compaction and one\ninch of bituminous material after compaction."
												}
											]
										},
										{
											"number": "(7) ",
											"content": [
												{
													"text": "The entire parking space area shall be screened from\noutside view by landscaping property borders, except entrances and\nexits."
												}
											]
										},
										{
											"number": "(8) ",
											"content": [
												{
													"text": "Each dwelling unit shall contain not less than 600\nsquare feet per family."
												}
											]
										},
										{
											"number": "(9) ",
											"content": [
												{
													"text": "There shall be a rear yard the depth of which shall\nbe not less than 20 feet, and on lots abutting a residence district,\na minimum side and/or rear yard of 25 feet abutting said district\nwill be required."
												}
											]
										},
										{
											"number": "(10) ",
											"content": [
												{
													"text": "The front yard setback shall be not less than\n20 feet, and there shall be side yard setbacks of not less than six\nfeet on each side."
												}
											]
										},
										{
											"number": "(11) ",
											"content": [
												{
													"text": "On a corner lot, a front yard shall be required\non each street, which shall be not less than 20 feet from each street."
												}
											]
										},
										{
											"number": "(12) ",
											"content": [
												{
													"text": "Where residential buildings are grouped on the\nsame lot or plot, the unobstructed open spaces between the exterior\nwalls of such buildings shall be not less than 30 feet."
												}
											]
										}
									]
								}
							]
						}
					]
				}
			]
		}
	]
}	