{
	"url": "http://ecode360.com/6966594",
	"paras": [
	    {
			"paragraph": "ยง 155-14",
			"title": "Residential District (R-2).",
			"content": [
				{
					"text": "R-2 residential one-family detached or two-family\nattached dwelling units shall conform to the following regulations."
				},
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "The minimum lot area shall be 4,000 square feet. Lots\nmay not be subdivided or assembled without complying with minimum\nlot areas. Lots, regardless of size, may not have more than one two-family\ndwelling unit."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "The minimum lot width shall be 40 feet."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "The minimum lot depth shall be 100 feet."
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "On an interior lot, the minimum front yard setback\nshall be 20 feet or the same as the average front yard setback of\nthe existing buildings within 200 feet on each side of the lot and\nwithin the same block front and district, whichever shall be greater.\nOn a corner lot a front yard setback shall be required on each street\nfrontage as follows: The front yard setback on the narrower street\nfrontage shall be a minimum of 20 feet or the same as the average\nfront yard setback of the existing buildings within 200 feet on each\nside of the lot and within the same block front and district, whichever\nis greater, and the front yard setback on the other street frontage\nshall be a minimum of 10 feet, and if the street frontages are equal,\neach street frontage shall have a minimum front yard setback of 20\nfeet or the same as the average front yard setback of the existing\nbuildings within 200 feet on each side of the lot and within the same\nblock front and district, whichever is greater."
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "On an interior lot, the minimum side yard setback\nshall be six feet, with a minimum aggregate of 14 feet. A corner lot\nshall have a minimum side yard setback of six feet on the side adjoining\nthe interior lot opposite the front yard having a greater street frontage.\nThe two yards fronting on streets shall be considered front yards,\nand the remaining yard shall be considered the rear yard."
								}
							]
						},
						{
							"number": "F. ",
							"content": [
								{
									"text": "The minimum rear yard setback shall be 20 feet if\nfront yard parking is provided or 35 feet if rear or side yard parking\nis provided."
								}
							]
						},
						{
							"number": "G. ",
							"content": [
								{
									"text": "No building shall exceed two stories or 26 feet in\nheight, measured from the established street grade."
								}
							]
						},
						{
							"number": "H. ",
							"content": [
								{
									"text": "The minimum floor area for each dwelling unit shall\nbe 750 square feet."
								}
							]
						},
						{
							"number": "I. ",
							"content": [
								{
									"text": "In a two-family dwelling located on a lot less than\n5,000 square feet in area, at least one of the dwelling units shall\nnot have more than two bedrooms.[Amended 2-15-2001 by L.L. No. 1-2001]"
								}
							]
						},
						{
							"number": "J. ",
							"content": [
								{
									"text": "The maximum lot building coverage for a one-family\ndwelling shall be 28%. The maximum lot building coverage for a two-family\ndwelling shall be 25%, provided, however, that with respect to conversion\nof an existing one-family dwelling to a two-family dwelling, where\nthe building lot coverage is 28% or less, the one-family dwelling\nmay be so converted on condition that the building lot coverage not\nbe increased as the result of said conversion, except to the extent\nthat additional on-site parking is required. Building coverage shall\ninclude the principal building, including attached or detached porches\nand decks extending more than two feet above average finished grade\nand attached or detached garages, and all other accessory uses. Moreover,\naccessory uses other than attached porches and decks extending more\nthan two feet above average finished grade shall occupy no more than\n40% of the rear yard area and no more than 40% of the side yard area.\nIn the event that a preexisting, nonconforming dwelling under this\nsubsection is destroyed by fire, flood and/or other like disaster,\nsuch dwelling may be reconstructed to the extent of the nonconformity\nherein, with respect to lot building coverage only.[Amended 9-27-2000 by L.L. No. 6-2000; 2-15-2001 by L.L. No. 1-2001]"
								}
							]
						},
						{
							"number": "K. ",
							"content": [
								{
									"text": "The total of building lot coverage and the area occupied\nby structures, terraces, paved yard areas, paved driveways and any\nother impermeable surface shall not exceed 50% of the area of the\nlot.[Added 2-15-2001 by L.L. No. 1-2001[1]]"
								},
								{
									"footnote": "[1]\nEditor's Note: This local law repealed former\nSubsection K, which described when a one-family dwelling may not be\nconverted to a two-family dwelling.\n"
								}
							]
						},
						{
							"number": "L. ",
							"content": [
								{
									"text": "Each single-family dwelling unit shall have at least\ntwo on-site parking spaces for occupant use, and each two-family dwelling\nunit shall have at least three on-site parking spaces for occupant\nuse."
								}
							]
						},
						{
							"number": "M. ",
							"content": [
								{
									"text": "No structure or accessory use may be located in the\nfront yard."
								}
							]
						},
						{
							"number": "N. ",
							"content": [
								{
									"text": "No structure or accessory use, other than a detached\ngarage, as permitted, and the parking of vehicles (but not commercial\nvehicles), may be located in a required side yard setback. A detached\ngarage must have a minimum of a two-foot side yard setback and a minimum\ntwo-foot rear yard setback."
								}
							]
						},
						{
							"number": "O. ",
							"content": [
								{
									"text": "Permitted accessory uses shall be limited to play\nequipment, private auto garages, storage of boats, garden sheds, ground\nplayhouses, tool sheds, fences or walls (under four feet) and aboveground\ndecks extending no higher than two feet above average finished grade.[Amended 2-15-2001 by L.L. No. 1-2001]"
								}
							]
						},
						{
							"number": "P. ",
							"content": [
								{
									"text": "Accessory uses, in accordance with Article VIII, with a special use permit from the Board of Zoning and Appeals, shall be limited to:"
								},
								{
									"content": [
										{
											"number": "(1) ",
											"content": [
												{
													"text": "Fences and walls above four feet."
												}
											]
										},
										{
											"number": "(2) ",
											"content": [
												{
													"text": "Aboveground/in-ground pools."
												}
											]
										},
										{
											"number": "(3) ",
											"content": [
												{
													"text": "Satellite antennas measuring more than 36 inches in diameter at any point. Satellite dishes of less diameter shall be permitted in accordance with ยง 155-48."
												}
											]
										},
										{
											"number": "(4) ",
											"content": [
												{
													"text": "Radio antennas."
												}
											]
										},
										{
											"number": "(5) ",
											"content": [
												{
													"text": "Cabanas."
												}
											]
										},
										{
											"number": "(6) ",
											"content": [
												{
													"text": "Basketball, tennis or other courts, with or without\nfencing."
												}
											]
										},
										{
											"number": "(7) ",
											"content": [
												{
													"text": "Tree playhouses."
												}
											]
										},
										{
											"number": "(8) ",
											"content": [
												{
													"text": "Vehicle storage and parking."
												}
											]
										},
										{
											"number": "(9) ",
											"content": [
												{
													"text": "Boat storage."
												}
											]
										}
									]
								}
							]
						},
						{
							"number": "Q. ",
							"content": [
								{
									"text": "The grade of all terrain around hillside structures\nshall be of a pitch and contain such surfaces and subsurface drainage\nstructure that would prohibit erosion of the slope."
								}
							]
						},
						{
							"number": "R. ",
							"content": [
								{
									"text": "The grade of all terrain around hillside structures\nshall be covered with landscaping and other ground covers to prevent\nerosion of the slope."
								}
							]
						},
						{
							"number": "S. ",
							"content": [
								{
									"text": "The site of all hillside structures shall not be excavated\nor filled beyond what is necessary for normal construction of a house."
								}
							]
						},
						{
							"number": "T. ",
							"content": [
								{
									"text": "In addition to all other requirements contained in this chapter and Chapter 38 of this Code, a building permit application must be accompanied by certification from a professional engineer as to the adequacy of the load-bearing capacity for the proposed structure."
								}
							]
						},
						{
							"number": "U. ",
							"content": [
								{
									"text": "In addition to all other requirements contained in this chapter and Chapter 38 of this Code, all structures shall be constructed under the supervision of a professional engineer."
								}
							]
						}
					]
				}
			]
		}
	]
}	