{
	"url": "http://ecode360.com/6966594",
	"paras": [
	    {
			"paragraph": "ยง 155-15",
			"title": "Residential District (R-3).",
			"content": [
				{
					"text": "R-3 residential cluster development shall conform\nto the following regulations:"
				},
				{
					"content": [
						{
							"number": "A. ",
							"content": [
								{
									"text": "The maximum density shall be one dwelling unit per\n5,000 square feet of gross acreage."
								}
							]
						},
						{
							"number": "B. ",
							"content": [
								{
									"text": "The minimum area of the site shall be one acre."
								}
							]
						},
						{
							"number": "C. ",
							"content": [
								{
									"text": "The minimum distance units shall be placed is 20 feet\nfrom the public roads or other state, county, town or Village properties."
								}
							]
						},
						{
							"number": "D. ",
							"content": [
								{
									"text": "The maximum allowable total composite building coverage\nfor all housing units and other structures shall be 35%."
								}
							]
						},
						{
							"number": "E. ",
							"content": [
								{
									"text": "The maximum building height shall not exceed 26 feet\nand two stories in height, as measured from the established street\ngrade adjoining the property."
								}
							]
						},
						{
							"number": "F. ",
							"content": [
								{
									"text": "The minimum distance that all structures shall be\nset back from all property lines is 50 feet when they abut adjacent\nresidential, commercial or industrial districts."
								}
							]
						},
						{
							"number": "G. ",
							"content": [
								{
									"text": "Each dwelling unit shall have at least two on-site\nparking spaces, excluding common or club parking, and at least one\nof such parking spaces shall be enclosed."
								}
							]
						},
						{
							"number": "H. ",
							"content": [
								{
									"text": "No structures or accessory uses shall be permitted\nin the front yard."
								}
							]
						},
						{
							"number": "I. ",
							"content": [
								{
									"text": "The dwelling units shall be no less than 900 square\nfeet, nor shall they contain more than two bedrooms."
								}
							]
						},
						{
							"number": "J. ",
							"content": [
								{
									"text": "Each dwelling unit shall have public or common parking\nspace for visitor's use at one space per five units if there is no\nclubhouse and two spaces per five units if there is a clubhouse."
								}
							]
						},
						{
							"number": "K. ",
							"content": [
								{
									"text": "Deed restrictions, in a form approved by the Village,\nshall be recorded as to the use and operation of open space."
								}
							]
						},
						{
							"number": "L. ",
							"content": [
								{
									"text": "Accessory uses shall be limited to those permitted\nin R-1 and R-2 Districts."
								}
							]
						},
						{
							"number": "M. ",
							"content": [
								{
									"text": "Existing structures may be incorporated into the overall\ndesign, provided that they comply with the regulations in this chapter\nfor new structures."
								}
							]
						},
						{
							"number": "N. ",
							"content": [
								{
									"text": "Every dwelling unit shall have pedestrian access to\nthe waterfront, street, court, walkway or equivalent, designed for\npublic use and resident use."
								}
							]
						},
						{
							"number": "O. ",
							"content": [
								{
									"text": "No building or structure shall contain more than six\ndwelling units with exterior unit access or 10 dwelling units with\ninterior unit access."
								}
							]
						},
						{
							"number": "P. ",
							"content": [
								{
									"text": "The front yard setback of each building shall be not\nless than 20 feet from the interior road on which the lot fronts."
								}
							]
						},
						{
							"number": "Q. ",
							"content": [
								{
									"text": "The minimum distance between buildings shall be 40\nfeet."
								}
							]
						},
						{
							"number": "R. ",
							"content": [
								{
									"text": "The height of the average grade of the habitable areas\nshall conform to the grades required in the applicable state laws\nby the National Flood Insurance Program."
								}
							]
						}
					]
				}
			]
		}
	]
}	